#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladeImageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AccoladeImageWidget.AccoladeImageWidget_C
// 0x0100 (0x0330 - 0x0230)
class UAccoladeImageWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Socket_VisualState;                                // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Socket;                                            // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Upgrade;                                           // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_WingsLeft;                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_WingsRight;                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AnimatedCorona;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FXParticles;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HaloCorona;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_largeglow;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left_Wing1;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left_Wing2;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left_Wing3;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PulseRingImage;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right_Wing1;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right_Wing2;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right_Wing3;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spike_LeftBottom;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spike_LeftTop;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spike_RightBottom;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spike_RightTop;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_MedalIcon;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Medal;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Spikes;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIEmitter_C*                           UIEmitter;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MedalLevel;                                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowSocketed;                                      // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631A[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SocketSmash;                                       // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             OnSocketSound;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnUpgradeSound;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowUIParticles;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SocketSmash__DelegateSignature();
	void ExecuteUbergraph_AccoladeImageWidget(int32 EntryPoint);
	void Make_Small();
	void EventSetSocketed();
	void EventSocket(bool bAlreadySocketed);
	void TriggerParticles();
	void MedalInit();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent_0();
	void SequenceEvent__ENTRYPOINTAccoladeImageWidget_0();
	void SequenceEvent__ENTRYPOINTAccoladeImageWidget_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AccoladeImageWidget_C">();
	}
	static class UAccoladeImageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccoladeImageWidget_C>();
	}
};
static_assert(alignof(UAccoladeImageWidget_C) == 0x000008, "Wrong alignment on UAccoladeImageWidget_C");
static_assert(sizeof(UAccoladeImageWidget_C) == 0x000330, "Wrong size on UAccoladeImageWidget_C");
static_assert(offsetof(UAccoladeImageWidget_C, UberGraphFrame) == 0x000230, "Member 'UAccoladeImageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Socket_VisualState) == 0x000238, "Member 'UAccoladeImageWidget_C::Socket_VisualState' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Socket) == 0x000240, "Member 'UAccoladeImageWidget_C::Socket' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Upgrade) == 0x000248, "Member 'UAccoladeImageWidget_C::Upgrade' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Intro) == 0x000250, "Member 'UAccoladeImageWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, CommonBorder_WingsLeft) == 0x000258, "Member 'UAccoladeImageWidget_C::CommonBorder_WingsLeft' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, CommonBorder_WingsRight) == 0x000260, "Member 'UAccoladeImageWidget_C::CommonBorder_WingsRight' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_AnimatedCorona) == 0x000268, "Member 'UAccoladeImageWidget_C::Image_AnimatedCorona' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_FXParticles) == 0x000270, "Member 'UAccoladeImageWidget_C::Image_FXParticles' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_HaloCorona) == 0x000278, "Member 'UAccoladeImageWidget_C::Image_HaloCorona' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_largeglow) == 0x000280, "Member 'UAccoladeImageWidget_C::Image_largeglow' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Left_Wing1) == 0x000288, "Member 'UAccoladeImageWidget_C::Image_Left_Wing1' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Left_Wing2) == 0x000290, "Member 'UAccoladeImageWidget_C::Image_Left_Wing2' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Left_Wing3) == 0x000298, "Member 'UAccoladeImageWidget_C::Image_Left_Wing3' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_PulseRingImage) == 0x0002A0, "Member 'UAccoladeImageWidget_C::Image_PulseRingImage' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Right_Wing1) == 0x0002A8, "Member 'UAccoladeImageWidget_C::Image_Right_Wing1' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Right_Wing2) == 0x0002B0, "Member 'UAccoladeImageWidget_C::Image_Right_Wing2' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_Right_Wing3) == 0x0002B8, "Member 'UAccoladeImageWidget_C::Image_Right_Wing3' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_spike_LeftBottom) == 0x0002C0, "Member 'UAccoladeImageWidget_C::Image_spike_LeftBottom' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_spike_LeftTop) == 0x0002C8, "Member 'UAccoladeImageWidget_C::Image_spike_LeftTop' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_spike_RightBottom) == 0x0002D0, "Member 'UAccoladeImageWidget_C::Image_spike_RightBottom' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Image_spike_RightTop) == 0x0002D8, "Member 'UAccoladeImageWidget_C::Image_spike_RightTop' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, LazyImage_MedalIcon) == 0x0002E0, "Member 'UAccoladeImageWidget_C::LazyImage_MedalIcon' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Overlay_Medal) == 0x0002E8, "Member 'UAccoladeImageWidget_C::Overlay_Medal' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, Overlay_Spikes) == 0x0002F0, "Member 'UAccoladeImageWidget_C::Overlay_Spikes' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, UIEmitter) == 0x0002F8, "Member 'UAccoladeImageWidget_C::UIEmitter' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, MedalLevel) == 0x000300, "Member 'UAccoladeImageWidget_C::MedalLevel' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, ShowSocketed) == 0x000304, "Member 'UAccoladeImageWidget_C::ShowSocketed' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, SocketSmash) == 0x000308, "Member 'UAccoladeImageWidget_C::SocketSmash' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, OnSocketSound) == 0x000318, "Member 'UAccoladeImageWidget_C::OnSocketSound' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, OnUpgradeSound) == 0x000320, "Member 'UAccoladeImageWidget_C::OnUpgradeSound' has a wrong offset!");
static_assert(offsetof(UAccoladeImageWidget_C, ShowUIParticles) == 0x000328, "Member 'UAccoladeImageWidget_C::ShowUIParticles' has a wrong offset!");

}

