#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AffiliateKeyModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AffiliateKeyModal.AffiliateKeyModal_C
// 0x00C8 (0x0528 - 0x0460)
class UAffiliateKeyModal_C final : public UFortAffilateModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessAnim;                                       // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shake;                                             // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton_Mobile;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConnectionError;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    EditTextActionWidget;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryError;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorPart2;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LaunchWebsite;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 McpWaitingSpinner;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_737F[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FoundItem;                                         // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ConnectionTimeout;                                 // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7380[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPopupClosed;                                     // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSkipAutoPopulate;                                 // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_7381[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnPopupClosed__DelegateSignature();
	void OnSuccess__DelegateSignature();
	void ExecuteUbergraph_AffiliateKeyModal(int32 EntryPoint);
	void WidgetAnimationEvt_SuccessAnim_K2Node_WidgetAnimationEvent_1();
	void BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnCheckComplete(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked);
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void OnSet(bool bSuccess);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetMobileButtons();
	void SetupAffiliateField(const class FString& AffilateName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AffiliateKeyModal_C">();
	}
	static class UAffiliateKeyModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAffiliateKeyModal_C>();
	}
};
static_assert(alignof(UAffiliateKeyModal_C) == 0x000008, "Wrong alignment on UAffiliateKeyModal_C");
static_assert(sizeof(UAffiliateKeyModal_C) == 0x000528, "Wrong size on UAffiliateKeyModal_C");
static_assert(offsetof(UAffiliateKeyModal_C, UberGraphFrame) == 0x000460, "Member 'UAffiliateKeyModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, SuccessAnim) == 0x000468, "Member 'UAffiliateKeyModal_C::SuccessAnim' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Shake) == 0x000470, "Member 'UAffiliateKeyModal_C::Shake' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Check) == 0x000478, "Member 'UAffiliateKeyModal_C::Check' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton) == 0x000480, "Member 'UAffiliateKeyModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton_Mobile) == 0x000488, "Member 'UAffiliateKeyModal_C::CloseButton_Mobile' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_0) == 0x000490, "Member 'UAffiliateKeyModal_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_2) == 0x000498, "Member 'UAffiliateKeyModal_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionError) == 0x0004A0, "Member 'UAffiliateKeyModal_C::ConnectionError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Description) == 0x0004A8, "Member 'UAffiliateKeyModal_C::Description' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EditTextActionWidget) == 0x0004B0, "Member 'UAffiliateKeyModal_C::EditTextActionWidget' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EntryError) == 0x0004B8, "Member 'UAffiliateKeyModal_C::EntryError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ErrorPart2) == 0x0004C0, "Member 'UAffiliateKeyModal_C::ErrorPart2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, LaunchWebsite) == 0x0004C8, "Member 'UAffiliateKeyModal_C::LaunchWebsite' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Lightbox) == 0x0004D0, "Member 'UAffiliateKeyModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, McpWaitingSpinner) == 0x0004D8, "Member 'UAffiliateKeyModal_C::McpWaitingSpinner' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Found) == 0x0004E0, "Member 'UAffiliateKeyModal_C::Found' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, FoundItem) == 0x0004E8, "Member 'UAffiliateKeyModal_C::FoundItem' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionTimeout) == 0x0004F8, "Member 'UAffiliateKeyModal_C::ConnectionTimeout' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnPopupClosed) == 0x000500, "Member 'UAffiliateKeyModal_C::OnPopupClosed' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, bSkipAutoPopulate) == 0x000510, "Member 'UAffiliateKeyModal_C::bSkipAutoPopulate' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnSuccess) == 0x000518, "Member 'UAffiliateKeyModal_C::OnSuccess' has a wrong offset!");

}

