#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlterationWidgetButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AlterationWidgetButton.AlterationWidgetButton_C
// 0x00E0 (0x0C58 - 0x0B78)
class UAlterationWidgetButton_C final : public UFortAlterationButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PanelLoad;                                         // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TriangelUpgrade;                                   // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAlterationWidget_C*                    AlterationWidget;                                  // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash;                                             // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine;                                             // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TriangleUpgrade;                                   // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIncludeName;                                      // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIncludeShortDescription;                          // 0x0BB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIncludeDescription;                               // 0x0BB2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x0BB3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUseLargeFormatName;                               // 0x0BB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_719C[0x3];                                     // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Locked_Description_Style;                          // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Locked_Text_Style;                                 // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldShowRarity;                                  // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_719D[0x7];                                     // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Triangles_Upgrade;                                 // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    RarityData;                                        // 0x0BD8(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Setup_Triangles();
	void Update_Colors();
	void IntroStart();
	void IntroReset();
	void TriggerModificationAnimation();
	void OnSetup();
	void Construct();
	void ExecuteUbergraph_AlterationWidgetButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlterationWidgetButton_C">();
	}
	static class UAlterationWidgetButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlterationWidgetButton_C>();
	}
};
static_assert(alignof(UAlterationWidgetButton_C) == 0x000008, "Wrong alignment on UAlterationWidgetButton_C");
static_assert(sizeof(UAlterationWidgetButton_C) == 0x000C58, "Wrong size on UAlterationWidgetButton_C");
static_assert(offsetof(UAlterationWidgetButton_C, UberGraphFrame) == 0x000B78, "Member 'UAlterationWidgetButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, PanelLoad) == 0x000B80, "Member 'UAlterationWidgetButton_C::PanelLoad' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, TriangelUpgrade) == 0x000B88, "Member 'UAlterationWidgetButton_C::TriangelUpgrade' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, AlterationWidget) == 0x000B90, "Member 'UAlterationWidgetButton_C::AlterationWidget' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, Flash) == 0x000B98, "Member 'UAlterationWidgetButton_C::Flash' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, Shine) == 0x000BA0, "Member 'UAlterationWidgetButton_C::Shine' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, TriangleUpgrade) == 0x000BA8, "Member 'UAlterationWidgetButton_C::TriangleUpgrade' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, bIncludeName) == 0x000BB0, "Member 'UAlterationWidgetButton_C::bIncludeName' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, bIncludeShortDescription) == 0x000BB1, "Member 'UAlterationWidgetButton_C::bIncludeShortDescription' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, bIncludeDescription) == 0x000BB2, "Member 'UAlterationWidgetButton_C::bIncludeDescription' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, IconSize) == 0x000BB3, "Member 'UAlterationWidgetButton_C::IconSize' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, bUseLargeFormatName) == 0x000BB4, "Member 'UAlterationWidgetButton_C::bUseLargeFormatName' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, Locked_Description_Style) == 0x000BB8, "Member 'UAlterationWidgetButton_C::Locked_Description_Style' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, Locked_Text_Style) == 0x000BC0, "Member 'UAlterationWidgetButton_C::Locked_Text_Style' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, ShouldShowRarity) == 0x000BC8, "Member 'UAlterationWidgetButton_C::ShouldShowRarity' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, Triangles_Upgrade) == 0x000BD0, "Member 'UAlterationWidgetButton_C::Triangles_Upgrade' has a wrong offset!");
static_assert(offsetof(UAlterationWidgetButton_C, RarityData) == 0x000BD8, "Member 'UAlterationWidgetButton_C::RarityData' has a wrong offset!");

}

