#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_StopMontagePlayInPlace

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_StopMontagePlayInPlace.AnimNotifyState_StopMontagePlayInPlace_C.Received_NotifyTick
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5879[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick) == 0x000008, "Wrong alignment on AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick");
static_assert(sizeof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick) == 0x000050, "Wrong size on AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, Animation) == 0x000008, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, K2Node_DynamicCast_AsAnim_Montage) == 0x000018, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint) == 0x000030, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x00003C, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, CallFunc_VSize_ReturnValue) == 0x000048, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00004C, "Member 'AnimNotifyState_StopMontagePlayInPlace_C_Received_NotifyTick::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

