#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_DBNOCarry_OverrideHandIK

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_DBNOCarry_OverrideHandIK.AnimNotifyState_DBNOCarry_OverrideHandIK_C.Received_NotifyBegin
// 0x0040 (0x0040 - 0x0000)
struct AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7688[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7689[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetDBNOHoistee_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortCustomGender                             CallFunc_GetCharacterGender_ReturnValue;           // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin");
static_assert(sizeof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin) == 0x000040, "Wrong size on AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint) == 0x000020, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_GetDBNOHoistee_ReturnValue) == 0x000030, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_GetDBNOHoistee_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00003A, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_GetCharacterBodyType_ReturnValue) == 0x00003B, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_GetCharacterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00003C, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00003D, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_GetCharacterGender_ReturnValue) == 0x00003E, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_GetCharacterGender_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00003F, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");

// Function AnimNotifyState_DBNOCarry_OverrideHandIK.AnimNotifyState_DBNOCarry_OverrideHandIK_C.Received_NotifyEnd
// 0x0030 (0x0030 - 0x0000)
struct AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_768A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd");
static_assert(sizeof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd) == 0x000030, "Wrong size on AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint) == 0x000020, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AnimNotifyState_DBNOCarry_OverrideHandIK_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

