#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_FN_Bud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_FN_Bud.AnimBP_FN_Bud_C.ExecuteUbergraph_AnimBP_FN_Bud
// 0x0080 (0x0080 - 0x0000)
struct AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8712[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8713[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8714[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn_Bud_C*                      K2Node_DynamicCast_AsFort_AIPawn_Bud;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8715[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDirectionActorToActor_ReturnValue;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud) == 0x000008, "Wrong alignment on AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud");
static_assert(sizeof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud) == 0x000080, "Wrong size on AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, EntryPoint) == 0x000000, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Montage_IsPlaying_ReturnValue) == 0x000004, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000006, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000007, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x00001C, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, K2Node_Event_DeltaTimeX) == 0x000020, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x000024, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, K2Node_DynamicCast_AsFort_AIPawn_Bud) == 0x000038, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::K2Node_DynamicCast_AsFort_AIPawn_Bud' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Not_PreBool_ReturnValue_1) == 0x000041, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_GetDirectionActorToActor_ReturnValue) == 0x000044, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_GetDirectionActorToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_GetBaseAimRotation_ReturnValue) == 0x000050, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x00005C, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_FClamp_ReturnValue) == 0x000064, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Roll_1) == 0x000070, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Pitch_1) == 0x000074, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud, CallFunc_BreakRotator_Yaw_1) == 0x000078, "Member 'AnimBP_FN_Bud_C_ExecuteUbergraph_AnimBP_FN_Bud::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");

// Function AnimBP_FN_Bud.AnimBP_FN_Bud_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_FN_Bud_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_FN_Bud_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_FN_Bud_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_FN_Bud_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_FN_Bud_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_FN_Bud_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_FN_Bud_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_FN_Bud.AnimBP_FN_Bud_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_FN_Bud_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_FN_Bud_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_FN_Bud_C_AnimGraph");
static_assert(sizeof(AnimBP_FN_Bud_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_FN_Bud_C_AnimGraph");
static_assert(offsetof(AnimBP_FN_Bud_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'AnimBP_FN_Bud_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

