#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_BuildingProp_FactionSwap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_BuildingProp_FactionSwap.Apollo_BuildingProp_FactionSwap_C
// 0x0028 (0x0BE8 - 0x0BC0)
class AApollo_BuildingProp_FactionSwap_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthena_FactionSelection_AlterEgo_C*    Athena_FactionSelection_AlterEgo;                  // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OwnedFaction;                                      // 0x0BD0(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_Ego;                                      // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_Alter;                                    // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_BuildingProp_FactionSwap(int32 EntryPoint);
	void BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature(const struct FGameplayTag& FactionTagOut);
	void UserConstructionScript();
	void OnRep_OwnedFaction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_BuildingProp_FactionSwap_C">();
	}
	static class AApollo_BuildingProp_FactionSwap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_BuildingProp_FactionSwap_C>();
	}
};
static_assert(alignof(AApollo_BuildingProp_FactionSwap_C) == 0x000008, "Wrong alignment on AApollo_BuildingProp_FactionSwap_C");
static_assert(sizeof(AApollo_BuildingProp_FactionSwap_C) == 0x000BE8, "Wrong size on AApollo_BuildingProp_FactionSwap_C");
static_assert(offsetof(AApollo_BuildingProp_FactionSwap_C, UberGraphFrame) == 0x000BC0, "Member 'AApollo_BuildingProp_FactionSwap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_BuildingProp_FactionSwap_C, Athena_FactionSelection_AlterEgo) == 0x000BC8, "Member 'AApollo_BuildingProp_FactionSwap_C::Athena_FactionSelection_AlterEgo' has a wrong offset!");
static_assert(offsetof(AApollo_BuildingProp_FactionSwap_C, OwnedFaction) == 0x000BD0, "Member 'AApollo_BuildingProp_FactionSwap_C::OwnedFaction' has a wrong offset!");
static_assert(offsetof(AApollo_BuildingProp_FactionSwap_C, Material_Ego) == 0x000BD8, "Member 'AApollo_BuildingProp_FactionSwap_C::Material_Ego' has a wrong offset!");
static_assert(offsetof(AApollo_BuildingProp_FactionSwap_C, Material_Alter) == 0x000BE0, "Member 'AApollo_BuildingProp_FactionSwap_C::Material_Alter' has a wrong offset!");

}

