#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_BuildingProp_FactionSwap

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Apollo_BuildingProp_FactionSwap.Apollo_BuildingProp_FactionSwap_C.ExecuteUbergraph_Apollo_BuildingProp_FactionSwap
// 0x000C (0x000C - 0x0000)
struct Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_FactionTagOut;          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap) == 0x000004, "Wrong alignment on Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap");
static_assert(sizeof(Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap) == 0x00000C, "Wrong size on Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap");
static_assert(offsetof(Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap, EntryPoint) == 0x000000, "Member 'Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap, K2Node_ComponentBoundEvent_FactionTagOut) == 0x000004, "Member 'Apollo_BuildingProp_FactionSwap_C_ExecuteUbergraph_Apollo_BuildingProp_FactionSwap::K2Node_ComponentBoundEvent_FactionTagOut' has a wrong offset!");

// Function Apollo_BuildingProp_FactionSwap.Apollo_BuildingProp_FactionSwap_C.BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature final
{
public:
	struct FGameplayTag                           FactionTagOut;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature) == 0x000004, "Wrong alignment on Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature");
static_assert(sizeof(Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature) == 0x000008, "Wrong size on Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature");
static_assert(offsetof(Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature, FactionTagOut) == 0x000000, "Member 'Apollo_BuildingProp_FactionSwap_C_BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature::FactionTagOut' has a wrong offset!");

// Function Apollo_BuildingProp_FactionSwap.Apollo_BuildingProp_FactionSwap_C.OnRep_OwnedFaction
// 0x0001 (0x0001 - 0x0000)
struct Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction final
{
public:
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction) == 0x000001, "Wrong alignment on Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction");
static_assert(sizeof(Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction) == 0x000001, "Wrong size on Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction");
static_assert(offsetof(Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000000, "Member 'Apollo_BuildingProp_FactionSwap_C_OnRep_OwnedFaction::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

}

