#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Yacht_Interior_Wall_Light

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Yacht_Interior_Wall_Light.Apollo_Yacht_Interior_Wall_Light_C.ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light
// 0x0090 (0x0090 - 0x0000)
struct Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63CE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63CF[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D0[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63D1[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63D2[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light) == 0x000008, "Wrong alignment on Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light");
static_assert(sizeof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light) == 0x000090, "Wrong size on Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, EntryPoint) == 0x000000, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_DamagedActor) == 0x000008, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_Damage) == 0x000010, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_InstigatedBy) == 0x000018, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_DamageCauser) == 0x000020, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_HitLocation) == 0x000028, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_FHitComponent) == 0x000038, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_BoneName) == 0x000040, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CustomEvent_Momentum) == 0x000048, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, Temp_int_Array_Index_Variable) == 0x000054, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Array_Get_Item) == 0x000078, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'Apollo_Yacht_Interior_Wall_Light_C_ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Apollo_Yacht_Interior_Wall_Light.Apollo_Yacht_Interior_Wall_Light_C.DestroyedWall
// 0x0050 (0x0050 - 0x0000)
struct Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall) == 0x000008, "Wrong alignment on Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall");
static_assert(sizeof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall) == 0x000050, "Wrong size on Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, DamagedActor) == 0x000000, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::DamagedActor' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, Damage) == 0x000008, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, InstigatedBy) == 0x000010, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, DamageCauser) == 0x000018, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, HitLocation) == 0x000020, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::HitLocation' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, FHitComponent) == 0x000030, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::FHitComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, BoneName) == 0x000038, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::BoneName' has a wrong offset!");
static_assert(offsetof(Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall, Momentum) == 0x000040, "Member 'Apollo_Yacht_Interior_Wall_Light_C_DestroyedWall::Momentum' has a wrong offset!");

}

