#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Misfit_TeddyBear_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Misfit_TeddyBear_01.Apollo_Misfit_TeddyBear_01_C.ExecuteUbergraph_Apollo_Misfit_TeddyBear_01
// 0x00F8 (0x00F8 - 0x0000)
struct Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6430[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0018(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0044(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00E0(0x0018)()
};
static_assert(alignof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01) == 0x000008, "Wrong alignment on Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01");
static_assert(sizeof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01) == 0x0000F8, "Wrong size on Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, EntryPoint) == 0x000000, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_Damage) == 0x000010, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_DamageTags) == 0x000018, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_Momentum) == 0x000038, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_HitInfo) == 0x000044, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_InstigatedBy) == 0x0000D0, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_DamageCauser) == 0x0000D8, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01, K2Node_Event_EffectContext) == 0x0000E0, "Member 'Apollo_Misfit_TeddyBear_01_C_ExecuteUbergraph_Apollo_Misfit_TeddyBear_01::K2Node_Event_EffectContext' has a wrong offset!");

// Function Apollo_Misfit_TeddyBear_01.Apollo_Misfit_TeddyBear_01_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct Apollo_Misfit_TeddyBear_01_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6431[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer) == 0x000008, "Wrong alignment on Apollo_Misfit_TeddyBear_01_C_OnDeathServer");
static_assert(sizeof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer) == 0x0000E8, "Wrong size on Apollo_Misfit_TeddyBear_01_C_OnDeathServer");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, Damage) == 0x000000, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, Momentum) == 0x000028, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, HitInfo) == 0x000034, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Misfit_TeddyBear_01_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'Apollo_Misfit_TeddyBear_01_C_OnDeathServer::EffectContext' has a wrong offset!");

}

