#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_PowerPlant_Transformer_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_PowerPlant_Transformer_01.Apollo_PowerPlant_Transformer_01_C
// 0x0030 (0x0BF0 - 0x0BC0)
class AApollo_PowerPlant_Transformer_01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Transformer_Large_Buzz_Cue;                        // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Electric_ON_Hit;                            // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Shock;                                      // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Electricity_On;                             // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Fire;                                          // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Apollo_PowerPlant_Transformer_01(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_PowerPlant_Transformer_01_C">();
	}
	static class AApollo_PowerPlant_Transformer_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_PowerPlant_Transformer_01_C>();
	}
};
static_assert(alignof(AApollo_PowerPlant_Transformer_01_C) == 0x000008, "Wrong alignment on AApollo_PowerPlant_Transformer_01_C");
static_assert(sizeof(AApollo_PowerPlant_Transformer_01_C) == 0x000BF0, "Wrong size on AApollo_PowerPlant_Transformer_01_C");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, UberGraphFrame) == 0x000BC0, "Member 'AApollo_PowerPlant_Transformer_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Transformer_Large_Buzz_Cue) == 0x000BC8, "Member 'AApollo_PowerPlant_Transformer_01_C::Transformer_Large_Buzz_Cue' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Electric_ON_Hit) == 0x000BD0, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Electric_ON_Hit' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Shock) == 0x000BD8, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Shock' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Effect_Electricity_On) == 0x000BE0, "Member 'AApollo_PowerPlant_Transformer_01_C::Effect_Electricity_On' has a wrong offset!");
static_assert(offsetof(AApollo_PowerPlant_Transformer_01_C, Can_Fire) == 0x000BE8, "Member 'AApollo_PowerPlant_Transformer_01_C::Can_Fire' has a wrong offset!");

}

