#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_BR_BoundaryActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_BR_BoundaryActor.Apollo_BR_BoundaryActor_C
// 0x0050 (0x0670 - 0x0620)
class AApollo_BR_BoundaryActor_C final : public ABuildingActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AKillZVolume*>                   KillZList;                                         // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class ABlockingVolume*>                BlockingVolumeList;                                // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class AFlyingVehicleBoundarySpline_C*         FlyBoundrySpline;                                  // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CONST_CreativePlaylistNames;                       // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   CurrentPlaylistName;                               // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_BR_BoundaryActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BindPlaylistHasChanged();
	void PlaylistHasLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void IfCreativeClearBlockingAndBoundary();
	void OnWorldReady();
	bool IsInCreativePlaylist();
	void TurnOffBlockingKillAndBoundaries();
	void GetFortAthenaGameState(class AFortGameStateAthena** AsFort_Game_State_Athena);
	void PlaylistChangedTryTurnOffBoundaries();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_BR_BoundaryActor_C">();
	}
	static class AApollo_BR_BoundaryActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_BR_BoundaryActor_C>();
	}
};
static_assert(alignof(AApollo_BR_BoundaryActor_C) == 0x000008, "Wrong alignment on AApollo_BR_BoundaryActor_C");
static_assert(sizeof(AApollo_BR_BoundaryActor_C) == 0x000670, "Wrong size on AApollo_BR_BoundaryActor_C");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, UberGraphFrame) == 0x000620, "Member 'AApollo_BR_BoundaryActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, DefaultSceneRoot) == 0x000628, "Member 'AApollo_BR_BoundaryActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, KillZList) == 0x000630, "Member 'AApollo_BR_BoundaryActor_C::KillZList' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, BlockingVolumeList) == 0x000640, "Member 'AApollo_BR_BoundaryActor_C::BlockingVolumeList' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, FlyBoundrySpline) == 0x000650, "Member 'AApollo_BR_BoundaryActor_C::FlyBoundrySpline' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, CONST_CreativePlaylistNames) == 0x000658, "Member 'AApollo_BR_BoundaryActor_C::CONST_CreativePlaylistNames' has a wrong offset!");
static_assert(offsetof(AApollo_BR_BoundaryActor_C, CurrentPlaylistName) == 0x000668, "Member 'AApollo_BR_BoundaryActor_C::CurrentPlaylistName' has a wrong offset!");

}

