#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_GhostProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Apollo_GhostProjectile.Apollo_GhostProjectile_C.ExecuteUbergraph_Apollo_GhostProjectile
// 0x0068 (0x0068 - 0x0000)
struct Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83F2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileHomingData                  K2Node_MakeStruct_ProjectileHomingData;            // 0x000C(0x003C)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile) == 0x000004, "Wrong alignment on Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile");
static_assert(sizeof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile) == 0x000068, "Wrong size on Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, EntryPoint) == 0x000000, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, K2Node_MakeStruct_ProjectileHomingData) == 0x00000C, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::K2Node_MakeStruct_ProjectileHomingData' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000060, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000064, "Member 'Apollo_GhostProjectile_C_ExecuteUbergraph_Apollo_GhostProjectile::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");

}

