#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Ghost_Spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Ghost_Spawner.Apollo_Ghost_Spawner_C.ExecuteUbergraph_Apollo_Ghost_Spawner
// 0x01D0 (0x01D0 - 0x0000)
struct Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC5[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4DC6[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC7[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC9[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4DCA[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCB[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCC[0x2];                                     // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCD[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_DropChance_DropResult;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCE[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCF[0x8];                                     // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AApollo_GhostProjectile_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner) == 0x000010, "Wrong alignment on Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner");
static_assert(sizeof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner) == 0x0001D0, "Wrong size on Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, EntryPoint) == 0x000000, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, Temp_bool_Has_Been_Initd_Variable) == 0x000029, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, Temp_bool_Has_Been_Initd_Variable_1) == 0x00002A, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, Temp_int_Variable) == 0x00002C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000038, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_OtherActor) == 0x000040, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_OtherComp) == 0x000048, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000050, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000E8, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, Temp_bool_IsClosed_Variable_1) == 0x0000F1, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F4, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000105, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000108, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000118, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_BreakVector_X) == 0x000120, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_BreakVector_Y) == 0x000124, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_BreakVector_Z) == 0x000128, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_SwitchEnum_CmpSuccess) == 0x000130, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, K2Node_CreateDelegate_OutputDelegate_2) == 0x000134, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_DropChance_DropResult) == 0x000144, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_DropChance_DropResult' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000148, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000150, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000154, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000158, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00015C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x00016C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000170, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000178, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_MakeRotator_ReturnValue) == 0x00017C, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C0, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'Apollo_Ghost_Spawner_C_ExecuteUbergraph_Apollo_Ghost_Spawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function Apollo_Ghost_Spawner.Apollo_Ghost_Spawner_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Apollo_Ghost_Spawner_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

