#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Agency_CourtYard_Brazier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Curie_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C
// 0x0098 (0x0C58 - 0x0BC0)
class AApollo_Agency_CourtYard_Brazier_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Fire_Audio_Loop;                                   // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Athena_Agency_Brazier;                          // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FCurieInteractHandle> InteractHandleMap;                                 // 0x0BE0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FScalableFloat                         CollisionHotFixRow;                                // 0x0C30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         NewVar_0;                                          // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier(int32 EntryPoint);
	void CheckInitialOverlappingActors();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnReady_F5469E374238874B69D6919C541411F7(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void UserConstructionScript();

	void ShouldPlayNativeCurieFX(EFortCurieNativeFXType FXType, struct FFortNativeCurieFXResponse* OutResponse) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Agency_CourtYard_Brazier_C">();
	}
	static class AApollo_Agency_CourtYard_Brazier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Agency_CourtYard_Brazier_C>();
	}
};
static_assert(alignof(AApollo_Agency_CourtYard_Brazier_C) == 0x000008, "Wrong alignment on AApollo_Agency_CourtYard_Brazier_C");
static_assert(sizeof(AApollo_Agency_CourtYard_Brazier_C) == 0x000C58, "Wrong size on AApollo_Agency_CourtYard_Brazier_C");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, UberGraphFrame) == 0x000BC0, "Member 'AApollo_Agency_CourtYard_Brazier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, Sphere) == 0x000BC8, "Member 'AApollo_Agency_CourtYard_Brazier_C::Sphere' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, Fire_Audio_Loop) == 0x000BD0, "Member 'AApollo_Agency_CourtYard_Brazier_C::Fire_Audio_Loop' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, NS_Athena_Agency_Brazier) == 0x000BD8, "Member 'AApollo_Agency_CourtYard_Brazier_C::NS_Athena_Agency_Brazier' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, InteractHandleMap) == 0x000BE0, "Member 'AApollo_Agency_CourtYard_Brazier_C::InteractHandleMap' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, CollisionHotFixRow) == 0x000C30, "Member 'AApollo_Agency_CourtYard_Brazier_C::CollisionHotFixRow' has a wrong offset!");
static_assert(offsetof(AApollo_Agency_CourtYard_Brazier_C, NewVar_0) == 0x000C50, "Member 'AApollo_Agency_CourtYard_Brazier_C::NewVar_0' has a wrong offset!");

}

