#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Agency_CourtYard_Brazier

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Curie_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier
// 0x0368 (0x0368 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0028(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0054(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00F0(0x0018)()
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E1[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0128(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_83E2[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E3[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E4[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x01D8(0x0020)()
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue;     // 0x0214(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value;                           // 0x0218(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E5[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0228(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0230(0x0020)(ConstParm)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue;       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E6[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurieActive_ReturnValue_1;              // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E7[0x2];                                     // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0268(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E8[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value_1;                         // 0x0288(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue_1;     // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E9[0x2];                                     // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83EA[0x3];                                     // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83EB[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83EC[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x02A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83ED[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x02D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83EE[0x2];                                     // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue_1;   // 0x0364(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier) == 0x000368, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, EntryPoint) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_IsCurieActive_ReturnValue) == 0x000004, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000018, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_HasAuthority_ReturnValue) == 0x000021, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_HasAuthority_ReturnValue_1) == 0x000023, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_Damage) == 0x000024, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_DamageTags) == 0x000028, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_Momentum) == 0x000048, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_HitInfo) == 0x000054, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_InstigatedBy) == 0x0000E0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_DamageCauser) == 0x0000E8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_Event_EffectContext) == 0x0000F0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000108, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000110, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000118, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000120, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_bFromSweep) == 0x000124, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_SweepResult) == 0x000128, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_object_Variable) == 0x0001B8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Contains_ReturnValue) == 0x0001C0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_object_Variable_1) == 0x0001C8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Not_PreBool_ReturnValue) == 0x0001D0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_struct_Variable) == 0x0001D8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001F8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherActor) == 0x000200, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherComp) == 0x000208, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000210, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_ExecuteBeginFireInteract_ReturnValue) == 0x000214, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_ExecuteBeginFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Find_Value) == 0x000218, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Find_ReturnValue) == 0x00021C, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_CustomEvent_GameState) == 0x000220, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_CustomEvent_Playlist) == 0x000228, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_CustomEvent_PlaylistContextTags) == 0x000230, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_ExecuteEndFireInteract_ReturnValue) == 0x000250, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_ExecuteEndFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, K2Node_CreateDelegate_OutputDelegate) == 0x000254, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Remove_ReturnValue) == 0x000264, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_IsCurieActive_ReturnValue_1) == 0x000265, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_IsCurieActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Keys_Keys) == 0x000268, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Array_Get_Item) == 0x000278, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Array_Length_ReturnValue) == 0x000280, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_HasAuthority_ReturnValue_2) == 0x000284, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Find_Value_1) == 0x000288, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Find_ReturnValue_1) == 0x00028C, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_ExecuteEndFireInteract_ReturnValue_1) == 0x00028D, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_ExecuteEndFireInteract_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_GetValueAtLevel_ReturnValue) == 0x000290, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000294, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, Temp_int_Loop_Counter_Variable_1) == 0x000298, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Less_IntInt_ReturnValue) == 0x00029C, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002A0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0002A8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Array_Get_Item_1) == 0x0002B8, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Array_Length_ReturnValue_1) == 0x0002C0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C4, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002D0, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_MakeHitResult_ReturnValue) == 0x0002D4, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Map_Contains_ReturnValue_1) == 0x000360, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Map_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_Not_PreBool_ReturnValue_1) == 0x000361, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier, CallFunc_ExecuteBeginFireInteract_ReturnValue_1) == 0x000364, "Member 'Apollo_Agency_CourtYard_Brazier_C_ExecuteUbergraph_Apollo_Agency_CourtYard_Brazier::CallFunc_ExecuteBeginFireInteract_ReturnValue_1' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83EF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Apollo_Agency_CourtYard_Brazier_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83F0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.OnReady_F5469E374238874B69D6919C541411F7
// 0x0030 (0x0030 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7) == 0x000030, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7, GameState) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7::GameState' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7, Playlist) == 0x000008, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7::Playlist' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7, PlaylistContextTags) == 0x000010, "Member 'Apollo_Agency_CourtYard_Brazier_C_OnReady_F5469E374238874B69D6919C541411F7::PlaylistContextTags' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript final
{
public:
	struct FScalableFloat                         NewLocalVar_0;                                     // 0x0000(0x0020)(Edit, BlueprintVisible)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript) == 0x000008, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript) == 0x000020, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");

// Function Apollo_Agency_CourtYard_Brazier.Apollo_Agency_CourtYard_Brazier_C.ShouldPlayNativeCurieFX
// 0x001C (0x001C - 0x0000)
struct Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX final
{
public:
	EFortCurieNativeFXType                        FXType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83F1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortNativeCurieFXResponse             OutResponse;                                       // 0x0004(0x000C)(Parm, OutParm, NoDestructor)
	struct FFortNativeCurieFXResponse             K2Node_MakeStruct_FortNativeCurieFXResponse;       // 0x0010(0x000C)(NoDestructor)
};
static_assert(alignof(Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX) == 0x000004, "Wrong alignment on Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX");
static_assert(sizeof(Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX) == 0x00001C, "Wrong size on Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX, FXType) == 0x000000, "Member 'Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX::FXType' has a wrong offset!");
static_assert(offsetof(Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX, OutResponse) == 0x000004, "Member 'Apollo_Agency_CourtYard_Brazier_C_ShouldPlayNativeCurieFX::OutResponse' has a wrong offset!");
