#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Waterbody_Ocean_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortWaterBodyBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Waterbody_Ocean_Parent.Apollo_Waterbody_Ocean_Parent_C
// 0x0050 (0x0FA0 - 0x0F50)
class AApollo_Waterbody_Ocean_Parent_C final : public AFortWaterBodyBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Apollo_Waterbody_Ocean_Parent_C;    // 0x0F48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortSplineWaterAudioComponent*         FortSplineWaterAudio;                              // 0x0F50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x0F58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Ocean_Cell_Size;                                   // 0x0F60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cells_X;                                           // 0x0F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cells_Y;                                           // 0x0F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E91[0x4];                                     // 0x0F6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               OceanMID;                                          // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Beach_Mask_Offset;                                 // 0x0F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Beach_Mask_Sharpness;                              // 0x0F7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Center_Offset;                                     // 0x0F80(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E92[0x4];                                     // 0x0F8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSplineWaterAudioZone>          InsideAudioExclusionZones;                         // 0x0F90(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_Waterbody_Ocean_Parent(int32 EntryPoint);
	void OnWaterBodyFinishedUpdating();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Spawn_Water_Mesh_Grid();
	void Update_Water_Texture_Info();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Waterbody_Ocean_Parent_C">();
	}
	static class AApollo_Waterbody_Ocean_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Waterbody_Ocean_Parent_C>();
	}
};
static_assert(alignof(AApollo_Waterbody_Ocean_Parent_C) == 0x000010, "Wrong alignment on AApollo_Waterbody_Ocean_Parent_C");
static_assert(sizeof(AApollo_Waterbody_Ocean_Parent_C) == 0x000FA0, "Wrong size on AApollo_Waterbody_Ocean_Parent_C");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, UberGraphFrame_Apollo_Waterbody_Ocean_Parent_C) == 0x000F48, "Member 'AApollo_Waterbody_Ocean_Parent_C::UberGraphFrame_Apollo_Waterbody_Ocean_Parent_C' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, FortSplineWaterAudio) == 0x000F50, "Member 'AApollo_Waterbody_Ocean_Parent_C::FortSplineWaterAudio' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, HierarchicalInstancedStaticMesh) == 0x000F58, "Member 'AApollo_Waterbody_Ocean_Parent_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Ocean_Cell_Size) == 0x000F60, "Member 'AApollo_Waterbody_Ocean_Parent_C::Ocean_Cell_Size' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Cells_X) == 0x000F64, "Member 'AApollo_Waterbody_Ocean_Parent_C::Cells_X' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Cells_Y) == 0x000F68, "Member 'AApollo_Waterbody_Ocean_Parent_C::Cells_Y' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, OceanMID) == 0x000F70, "Member 'AApollo_Waterbody_Ocean_Parent_C::OceanMID' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Beach_Mask_Offset) == 0x000F78, "Member 'AApollo_Waterbody_Ocean_Parent_C::Beach_Mask_Offset' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Beach_Mask_Sharpness) == 0x000F7C, "Member 'AApollo_Waterbody_Ocean_Parent_C::Beach_Mask_Sharpness' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, Center_Offset) == 0x000F80, "Member 'AApollo_Waterbody_Ocean_Parent_C::Center_Offset' has a wrong offset!");
static_assert(offsetof(AApollo_Waterbody_Ocean_Parent_C, InsideAudioExclusionZones) == 0x000F90, "Member 'AApollo_Waterbody_Ocean_Parent_C::InsideAudioExclusionZones' has a wrong offset!");

}

