#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_WaterSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.ExecuteUbergraph_Apollo_WaterSetup
// 0x0348 (0x0348 - 0x0000)
struct Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGameStateBase* GameState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4804[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4805[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4806[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_InitialCalendarSyncCompleted* CallFunc_InitialCalendarSyncCompleted_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4807[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_WaterLevel;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Step;                                 // 0x0120(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4808[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4809[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue_1;              // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_480A[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue_2;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_480B[0x5];                                     // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_GameStateReady*        CallFunc_GameStateReadyAsync_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_480C[0x6];                                     // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_480D[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AParent_Tree_Apollo_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x01E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_480E[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_480F[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         Temp_object_Variable;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive_1; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess_1;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4810[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue_1;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AParent_Tree_Apollo_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0248(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AParent_Tree_Apollo_C*                  CallFunc_Array_Get_Item;                           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4811[0x3];                                     // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_MapTexture;                     // 0x0268(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_DiscoveryTexture;               // 0x0290(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_6;           // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarMultiEventWatcher* CallFunc_WatchCalendarEvents_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_7;           // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4812[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AParent_Tree_Apollo_C*                  CallFunc_Array_Get_Item_1;                         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningNoMCP_ReturnValue;               // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4813[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_CustomEvent_GameState;                      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarEventSet_ReturnValue;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4814[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_8;           // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup");
static_assert(sizeof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup) == 0x000348, "Wrong size on Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, EntryPoint) == 0x000000, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_EventName_2) == 0x000018, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000028, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000030, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000038, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_EventName_1) == 0x000050, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000060, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000068, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000070, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_EventName) == 0x000088, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeUntilEnd) == 0x000098, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSinceBegin) == 0x0000A0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_TimeSpanRatio) == 0x0000A8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_float_Variable) == 0x0000BC, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_struct_Variable) == 0x0000C0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_struct_Variable_1) == 0x0000C8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_string_Variable) == 0x0000D0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_InitialCalendarSyncCompleted_ReturnValue) == 0x0000F0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_InitialCalendarSyncCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_WaterLevel) == 0x0000FC, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_WaterLevel' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue) == 0x000100, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_Event_Step) == 0x000120, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_Event_Step' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000128, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000138, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000148, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_HasAuthority_ReturnValue) == 0x000158, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000160, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_InEditorOrPIE_ReturnValue) == 0x000170, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_BooleanAND_ReturnValue) == 0x000172, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_InEditorOrPIE_ReturnValue_1) == 0x000173, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_InEditorOrPIE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_BooleanAND_ReturnValue_1) == 0x000174, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_bool_Has_Been_Initd_Variable) == 0x000175, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_int_Loop_Counter_Variable) == 0x000178, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Add_IntInt_ReturnValue) == 0x00017C, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_InEditorOrPIE_ReturnValue_2) == 0x000180, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_InEditorOrPIE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_BooleanAND_ReturnValue_2) == 0x000181, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_bool_IsClosed_Variable) == 0x000182, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_GameStateReadyAsync_ReturnValue) == 0x000188, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_GameStateReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000190, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001A0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsValid_ReturnValue_2) == 0x0001B0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_LoadLevelInstance_bOutSuccess) == 0x0001B1, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_LoadLevelInstance_ReturnValue) == 0x0001B8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_int_Array_Index_Variable) == 0x0001C0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_4) == 0x0001C8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001D8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001E8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Array_Length_ReturnValue) == 0x0001F8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_int_Loop_Counter_Variable_1) == 0x0001FC, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000204, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_HasAuthority_ReturnValue_1) == 0x000208, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive) == 0x00020C, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000210, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_object_Variable) == 0x000220, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000228, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive_1) == 0x000238, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_CheckCalendarWaterLevel_CurrentWaterLevelActive_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_LoadLevelInstance_bOutSuccess_1) == 0x00023C, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_LoadLevelInstance_bOutSuccess_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_LoadLevelInstance_ReturnValue_1) == 0x000240, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_LoadLevelInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000248, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Array_Get_Item) == 0x000258, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Array_Length_ReturnValue_1) == 0x000260, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000264, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_MapTexture) == 0x000268, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_MapTexture' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_DiscoveryTexture) == 0x000290, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_DiscoveryTexture' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_6) == 0x0002B8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0002C8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_WatchCalendarEvents_ReturnValue) == 0x0002D8, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_WatchCalendarEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_7) == 0x0002E0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0002F0, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, Temp_int_Array_Index_Variable_1) == 0x000304, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Array_Get_Item_1) == 0x000308, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsRunningNoMCP_ReturnValue) == 0x000310, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsRunningNoMCP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, K2Node_CustomEvent_GameState) == 0x000318, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_IsCalendarEventSet_ReturnValue) == 0x000320, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_IsCalendarEventSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Conv_IntToString_ReturnValue_8) == 0x000328, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Conv_IntToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000338, "Member 'Apollo_WaterSetup_C_ExecuteUbergraph_Apollo_WaterSetup::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.UpdateMinimapData
// 0x0050 (0x0050 - 0x0000)
struct Apollo_WaterSetup_C_UpdateMinimapData final
{
public:
	TSoftObjectPtr<class UTexture2D>              MapTexture;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              DiscoveryTexture;                                  // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_UpdateMinimapData) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_UpdateMinimapData");
static_assert(sizeof(Apollo_WaterSetup_C_UpdateMinimapData) == 0x000050, "Wrong size on Apollo_WaterSetup_C_UpdateMinimapData");
static_assert(offsetof(Apollo_WaterSetup_C_UpdateMinimapData, MapTexture) == 0x000000, "Member 'Apollo_WaterSetup_C_UpdateMinimapData::MapTexture' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UpdateMinimapData, DiscoveryTexture) == 0x000028, "Member 'Apollo_WaterSetup_C_UpdateMinimapData::DiscoveryTexture' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnSetOceanFloodHeight
// 0x0004 (0x0004 - 0x0000)
struct Apollo_WaterSetup_C_OnSetOceanFloodHeight final
{
public:
	int32                                         Step;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnSetOceanFloodHeight) == 0x000004, "Wrong alignment on Apollo_WaterSetup_C_OnSetOceanFloodHeight");
static_assert(sizeof(Apollo_WaterSetup_C_OnSetOceanFloodHeight) == 0x000004, "Wrong size on Apollo_WaterSetup_C_OnSetOceanFloodHeight");
static_assert(offsetof(Apollo_WaterSetup_C_OnSetOceanFloodHeight, Step) == 0x000000, "Member 'Apollo_WaterSetup_C_OnSetOceanFloodHeight::Step' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.SetWaterLevel
// 0x0004 (0x0004 - 0x0000)
struct Apollo_WaterSetup_C_SetWaterLevel final
{
public:
	int32                                         WaterLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_SetWaterLevel) == 0x000004, "Wrong alignment on Apollo_WaterSetup_C_SetWaterLevel");
static_assert(sizeof(Apollo_WaterSetup_C_SetWaterLevel) == 0x000004, "Wrong size on Apollo_WaterSetup_C_SetWaterLevel");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterLevel, WaterLevel) == 0x000000, "Member 'Apollo_WaterSetup_C_SetWaterLevel::WaterLevel' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnEventActive_545A7BC8413AB9899A920CA9C241BF09
// 0x0028 (0x0028 - 0x0000)
struct Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09");
static_assert(sizeof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09) == 0x000028, "Wrong size on Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09, EventName) == 0x000000, "Member 'Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09::EventName' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09, TimeUntilEnd) == 0x000010, "Member 'Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09, TimeSinceBegin) == 0x000018, "Member 'Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09, TimespanRatio) == 0x000020, "Member 'Apollo_WaterSetup_C_OnEventActive_545A7BC8413AB9899A920CA9C241BF09::TimespanRatio' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09
// 0x0028 (0x0028 - 0x0000)
struct Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09");
static_assert(sizeof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09) == 0x000028, "Wrong size on Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09, EventName) == 0x000000, "Member 'Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09::EventName' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09, TimeUntilEnd) == 0x000010, "Member 'Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09, TimeSinceBegin) == 0x000018, "Member 'Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09, TimespanRatio) == 0x000020, "Member 'Apollo_WaterSetup_C_OnEventUpdated_545A7BC8413AB9899A920CA9C241BF09::TimespanRatio' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnEventEnded_545A7BC8413AB9899A920CA9C241BF09
// 0x0028 (0x0028 - 0x0000)
struct Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09");
static_assert(sizeof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09) == 0x000028, "Wrong size on Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09, EventName) == 0x000000, "Member 'Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09::EventName' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09, TimeUntilEnd) == 0x000010, "Member 'Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09, TimeSinceBegin) == 0x000018, "Member 'Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09, TimespanRatio) == 0x000020, "Member 'Apollo_WaterSetup_C_OnEventEnded_545A7BC8413AB9899A920CA9C241BF09::TimespanRatio' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnReady_B1D24E6B42030098E1ED2B9A6B77D571
// 0x0008 (0x0008 - 0x0000)
struct Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571 final
{
public:
	class AGameStateBase*                         GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571");
static_assert(sizeof(Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571) == 0x000008, "Wrong size on Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571");
static_assert(offsetof(Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571, GameState) == 0x000000, "Member 'Apollo_WaterSetup_C_OnReady_B1D24E6B42030098E1ED2B9A6B77D571::GameState' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct Apollo_WaterSetup_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4815[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4816[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4817[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_UserConstructionScript) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_UserConstructionScript");
static_assert(sizeof(Apollo_WaterSetup_C_UserConstructionScript) == 0x000038, "Wrong size on Apollo_WaterSetup_C_UserConstructionScript");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'Apollo_WaterSetup_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_InEditorOrPIE_ReturnValue) == 0x000001, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, K2Node_Select_Default) == 0x000010, "Member 'Apollo_WaterSetup_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_Conv_FloatToString_ReturnValue) == 0x000018, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'Apollo_WaterSetup_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.OnRep_CurrentWaterLevel
// 0x0020 (0x0020 - 0x0000)
struct Apollo_WaterSetup_C_OnRep_CurrentWaterLevel final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_OnRep_CurrentWaterLevel) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_OnRep_CurrentWaterLevel");
static_assert(sizeof(Apollo_WaterSetup_C_OnRep_CurrentWaterLevel) == 0x000020, "Wrong size on Apollo_WaterSetup_C_OnRep_CurrentWaterLevel");
static_assert(offsetof(Apollo_WaterSetup_C_OnRep_CurrentWaterLevel, CallFunc_Conv_IntToString_ReturnValue) == 0x000000, "Member 'Apollo_WaterSetup_C_OnRep_CurrentWaterLevel::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_OnRep_CurrentWaterLevel, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'Apollo_WaterSetup_C_OnRep_CurrentWaterLevel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.SetWaterFloodLevel
// 0x0088 (0x0088 - 0x0000)
struct Apollo_WaterSetup_C_SetWaterFloodLevel final
{
public:
	int32                                         WaterLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0028(0x0028)(HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_1;                         // 0x0058(0x0028)(HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_WaterSetup_C_SetWaterFloodLevel) == 0x000008, "Wrong alignment on Apollo_WaterSetup_C_SetWaterFloodLevel");
static_assert(sizeof(Apollo_WaterSetup_C_SetWaterFloodLevel) == 0x000088, "Wrong size on Apollo_WaterSetup_C_SetWaterFloodLevel");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, WaterLevel) == 0x000000, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::WaterLevel' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Array_Get_Item) == 0x000028, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_GetOceanTotalHeight_ReturnValue) == 0x000080, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_GetOceanTotalHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_C_SetWaterFloodLevel, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000084, "Member 'Apollo_WaterSetup_C_SetWaterFloodLevel::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function Apollo_WaterSetup.Apollo_WaterSetup_C.AdjustWaterFoundations
// 0x0001 (0x0001 - 0x0000)
struct Apollo_WaterSetup_C_AdjustWaterFoundations final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apollo_WaterSetup_C_AdjustWaterFoundations) == 0x000001, "Wrong alignment on Apollo_WaterSetup_C_AdjustWaterFoundations");
