#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Waterbody_Waterfall_Transition_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent
// 0x0160 (0x0160 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D46[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D47[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D48[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D49[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4A[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_1;                            // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset_2;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4B[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_1;                // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue; // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4C[0x1];                                     // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4D[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset_3;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4E[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         K2Node_Select_Default;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue_2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1; // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4F[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_2;                           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D50[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         K2Node_Select_Default_3;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue_3;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent) == 0x000160, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, EntryPoint) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_object_Variable) == 0x000008, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_AsFXSystem_Asset) == 0x000020, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_AsFXSystem_Asset' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_bool_Variable) == 0x000029, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CustomEvent_Loaded_1) == 0x000030, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_object_Variable_1) == 0x000038, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_AsFXSystem_Asset_1) == 0x000040, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_AsFXSystem_Asset_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000050, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_bool_Variable_1) == 0x000058, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_struct_Variable) == 0x00005C, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000068, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_bool_Variable_2) == 0x000070, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_struct_Variable_1) == 0x000074, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_object_Variable_2) == 0x000088, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_AsFXSystem_Asset_2) == 0x000090, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_AsFXSystem_Asset_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsAssetNull_ReturnValue) == 0x0000AC, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsAssetNull_ReturnValue_1) == 0x0000AD, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsAssetNull_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue) == 0x0000AE, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D0, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CustomEvent_Loaded_2) == 0x0000E0, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_object_Variable_3) == 0x0000E8, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_AsFXSystem_Asset_3) == 0x0000F0, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_AsFXSystem_Asset_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_Select_Default) == 0x000100, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000108, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_Select_Default_1) == 0x000114, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x000120, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsAssetNull_ReturnValue_2) == 0x000128, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsAssetNull_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1) == 0x000129, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_Select_Default_2) == 0x00012C, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_CustomEvent_Loaded_3) == 0x000138, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, Temp_bool_Variable_3) == 0x000140, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, K2Node_Select_Default_3) == 0x000148, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_SpawnFXSystemAttached_ReturnValue_1) == 0x000150, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_SpawnFXSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent, CallFunc_IsAssetNull_ReturnValue_3) == 0x000158, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_ExecuteUbergraph_Apollo_Waterbody_Waterfall_Transition_Parent::CallFunc_IsAssetNull_ReturnValue_3' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09) == 0x000008, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09, Loaded) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3AB3A9A3A09::Loaded' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.OnLoaded_9FE809154B223C99D4F819AC7006D6B4
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4) == 0x000008, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4, Loaded) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819AC7006D6B4::Loaded' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.OnLoaded_9FE809154B223C99D4F819ACEE7823E3
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3) == 0x000008, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3, Loaded) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_9FE809154B223C99D4F819ACEE7823E3::Loaded' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E
// 0x0008 (0x0008 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E) == 0x000008, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E, Loaded) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_OnLoaded_F0E84E4149FDF7FB4B67B3ABA4E4CF5E::Loaded' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.UserConstructionScript
// 0x009C (0x009C - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript) == 0x000004, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript) == 0x00009C, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function Apollo_Waterbody_Waterfall_Transition_Parent.Apollo_Waterbody_Waterfall_Transition_Parent_C.initWaterMID
// 0x0058 (0x0058 - 0x0000)
struct Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D51[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALandscapeWaterInfo_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetWaterMeshComponents_ReturnValue;       // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class ALandscapeWaterInfo_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D52[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID) == 0x000008, "Wrong alignment on Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID");
static_assert(sizeof(Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID) == 0x000058, "Wrong size on Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Apollo_Waterbody_Waterfall_Transition_Parent_C_InitWaterMID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
