#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_BigBush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_BigBush.Apollo_BigBush_C
// 0x0038 (0x0BF8 - 0x0BC0)
class AApollo_BigBush_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       OverlapSphere;                                     // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Hay_Destruction_CornField;                       // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_CornField_GC;                                   // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldWobble;                                      // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E89[0x3];                                     // 0x0BE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerVelocity;                                    // 0x0BE4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Apollo_BigBush(int32 EntryPoint);
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void MaterialWobble(class AActor* Player);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_BigBush_C">();
	}
	static class AApollo_BigBush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_BigBush_C>();
	}
};
static_assert(alignof(AApollo_BigBush_C) == 0x000008, "Wrong alignment on AApollo_BigBush_C");
static_assert(sizeof(AApollo_BigBush_C) == 0x000BF8, "Wrong size on AApollo_BigBush_C");
static_assert(offsetof(AApollo_BigBush_C, UberGraphFrame) == 0x000BC0, "Member 'AApollo_BigBush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, OverlapSphere) == 0x000BC8, "Member 'AApollo_BigBush_C::OverlapSphere' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, P_Hay_Destruction_CornField) == 0x000BD0, "Member 'AApollo_BigBush_C::P_Hay_Destruction_CornField' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, GE_CornField_GC) == 0x000BD8, "Member 'AApollo_BigBush_C::GE_CornField_GC' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, ShouldWobble) == 0x000BE0, "Member 'AApollo_BigBush_C::ShouldWobble' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, PlayerVelocity) == 0x000BE4, "Member 'AApollo_BigBush_C::PlayerVelocity' has a wrong offset!");
static_assert(offsetof(AApollo_BigBush_C, Mid) == 0x000BF0, "Member 'AApollo_BigBush_C::Mid' has a wrong offset!");

}

