#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_WaterSetup_Foundations

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Apollo_WaterSetup_Foundations.Apollo_WaterSetup_Foundations_C.ExecuteUbergraph_Apollo_WaterSetup_Foundations
// 0x03E8 (0x03E8 - 0x0000)
struct Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77F7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_WaterLevel;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation; // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77F8[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77F9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_1;       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_1; // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGridLocationOnSpline_Location;         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut;    // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_2;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_2; // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_3;       // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_3; // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FA[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FB[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioSplineLevel_LevelName;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSplinePointFromWaterLevel_Splinepoint; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSplinePointFromWaterLevel_FinishedPath; // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FC[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetGridLocationOnSpline_Location_1;       // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSplinePointFromWaterLevel_Splinepoint_1; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSplinePointFromWaterLevel_FinishedPath_1; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FD[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut_1;  // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGridLocationOnSpline_Location_2;       // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut_2;  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FE[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSplinePointFromWaterLevel_Splinepoint_2; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSplinePointFromWaterLevel_FinishedPath_2; // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FF[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetGridLocationOnSpline_Location_3;       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut_3;  // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSplinePointFromWaterLevel_Splinepoint_3; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSplinePointFromWaterLevel_FinishedPath_3; // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7800[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetGridLocationOnSpline_Location_4;       // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut_4;  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7801[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7802[0x1];                                     // 0x01FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetLocationZToWaterHeight_LocationOut_5;  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7803[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7804[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_6;           // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7805[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_1;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7806[0x2];                                     // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_4;       // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_4; // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7807[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_2;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_5;       // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_5; // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_6;       // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_6; // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7808[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_7;       // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_7; // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7809[0x2];                                     // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_780A[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_3;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_780B[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_4;                         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioSplineLevel_LevelName_1;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue_1;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWorldAssetPackageFName_ReturnValue;    // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_7;           // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_780C[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_780D[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_5;                         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_780E[0x2];                                     // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_6;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_780F[0x1];                                     // 0x0327(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7810[0x2];                                     // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetGridRotationOnSpline_Rotation;         // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGridRotationOnSpline_Z__Yaw_;          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7811[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_2;    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_8;       // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_8; // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7812[0x2];                                     // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_7;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_9;       // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_9; // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingFoundation*                    CallFunc_Array_Get_Item_8;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationForLevel_New_Location_10;      // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLocationForLevel_New_Foundation_Rotation_10; // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7813[0x3];                                     // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations) == 0x000008, "Wrong alignment on Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations");
static_assert(sizeof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations) == 0x0003E8, "Wrong size on Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, EntryPoint) == 0x000000, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::EntryPoint' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, K2Node_CustomEvent_WaterLevel) == 0x000008, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::K2Node_CustomEvent_WaterLevel' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Location) == 0x00001C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Location' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Foundation_Rotation) == 0x000028, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Foundation_Rotation' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable) == 0x000034, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x00003C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_2) == 0x000058, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_2) == 0x000068, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_3) == 0x00006C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_3) == 0x000070, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_3) == 0x000074, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_4) == 0x000078, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_4) == 0x00007C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_4) == 0x000080, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_5) == 0x000084, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_5) == 0x000088, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00008C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Location_1) == 0x000090, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Location_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Foundation_Rotation_1) == 0x00009C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Foundation_Rotation_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000AC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetGridLocationOnSpline_Location) == 0x0000B0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetGridLocationOnSpline_Location' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut) == 0x0000BC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Location_2) == 0x0000C8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Location_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Foundation_Rotation_2) == 0x0000D4, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Foundation_Rotation_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Location_3) == 0x0000E0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Location_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetLocationForLevel_New_Foundation_Rotation_3) == 0x0000EC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetLocationForLevel_New_Foundation_Rotation_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x0000FC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x00010C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_5) == 0x000118, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x00011C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Conv_IntToString_ReturnValue) == 0x000128, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetAudioSplineLevel_LevelName) == 0x000138, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetAudioSplineLevel_LevelName' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Concat_StrStr_ReturnValue) == 0x000140, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetStreamingLevel_ReturnValue) == 0x000150, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_Splinepoint) == 0x000158, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_Splinepoint' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_FinishedPath) == 0x00015C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_FinishedPath' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetGridLocationOnSpline_Location_1) == 0x000160, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetGridLocationOnSpline_Location_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_Splinepoint_1) == 0x00016C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_Splinepoint_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_FinishedPath_1) == 0x000170, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_FinishedPath_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut_1) == 0x000174, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetGridLocationOnSpline_Location_2) == 0x000180, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetGridLocationOnSpline_Location_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut_2) == 0x00018C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000198, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_Splinepoint_2) == 0x00019C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_Splinepoint_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_FinishedPath_2) == 0x0001A0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_FinishedPath_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SelectRotator_ReturnValue) == 0x0001A4, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetGridLocationOnSpline_Location_3) == 0x0001B0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetGridLocationOnSpline_Location_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut_3) == 0x0001BC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_Splinepoint_3) == 0x0001C8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_Splinepoint_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetSplinePointFromWaterLevel_FinishedPath_3) == 0x0001CC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetSplinePointFromWaterLevel_FinishedPath_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GetGridLocationOnSpline_Location_4) == 0x0001D0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GetGridLocationOnSpline_Location_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut_4) == 0x0001DC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001E8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Loop_Counter_Variable_6) == 0x0001EC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, Temp_int_Array_Index_Variable_6) == 0x0001F0, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Add_IntInt_ReturnValue_6) == 0x0001F4, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001F8, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0001F9, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0001FA, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_SetLocationZToWaterHeight_LocationOut_5) == 0x0001FC, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_SetLocationZToWaterHeight_LocationOut_5' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Less_IntInt_ReturnValue_1) == 0x000208, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Less_IntInt_ReturnValue_2) == 0x000209, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00020A, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00020B, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00020C, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_Array_Get_Item) == 0x000218, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000220, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x000221, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x000222, "Member 'Apollo_WaterSetup_Foundations_C_ExecuteUbergraph_Apollo_WaterSetup_Foundations::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
