#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_Yacht_Interior_Wall_Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_Yacht_Interior_Wall_Light.Apollo_Yacht_Interior_Wall_Light_C
// 0x0028 (0x0BE8 - 0x0BC0)
class AApollo_Yacht_Interior_Wall_Light_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingActor*>                 Light_Attachment_Actors;                           // 0x0BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	bool                                          KillLight;                                         // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Apollo_Yacht_Interior_Wall_Light(int32 EntryPoint);
	void DestroyedWall(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_Yacht_Interior_Wall_Light_C">();
	}
	static class AApollo_Yacht_Interior_Wall_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_Yacht_Interior_Wall_Light_C>();
	}
};
static_assert(alignof(AApollo_Yacht_Interior_Wall_Light_C) == 0x000008, "Wrong alignment on AApollo_Yacht_Interior_Wall_Light_C");
static_assert(sizeof(AApollo_Yacht_Interior_Wall_Light_C) == 0x000BE8, "Wrong size on AApollo_Yacht_Interior_Wall_Light_C");
static_assert(offsetof(AApollo_Yacht_Interior_Wall_Light_C, UberGraphFrame) == 0x000BC0, "Member 'AApollo_Yacht_Interior_Wall_Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AApollo_Yacht_Interior_Wall_Light_C, PointLight) == 0x000BC8, "Member 'AApollo_Yacht_Interior_Wall_Light_C::PointLight' has a wrong offset!");
static_assert(offsetof(AApollo_Yacht_Interior_Wall_Light_C, Light_Attachment_Actors) == 0x000BD0, "Member 'AApollo_Yacht_Interior_Wall_Light_C::Light_Attachment_Actors' has a wrong offset!");
static_assert(offsetof(AApollo_Yacht_Interior_Wall_Light_C, KillLight) == 0x000BE0, "Member 'AApollo_Yacht_Interior_Wall_Light_C::KillLight' has a wrong offset!");

}

