#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArenaLeaderboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArenaLeaderboard.ArenaLeaderboard_C
// 0x0038 (0x0408 - 0x03D0)
class UArenaLeaderboard_C final : public UFortPersistentLeaderboardScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur_PosterLayer_1;                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntryDetails_C*        Details_EntryDisplay;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PosterFade_2;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EventName;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Initialize_Children_For_Event(const class FString& Event_Id, const class FString& Event_Window_Id);
	void OnLeaderboardEntrySelected(const class UFortEventLeaderboardEntryData* EntryData);
	void OnInitialized();
	void ShowMyStats(class UCommonButton* Button);
	void SetupForEvent(const class FString& EventId, const class FString& EventWindowId);
	void OnColorize(const struct FFortTournamentDisplayInfo& ColorInfo);
	void BP_OnDeactivated();
	void Item_DoubleMinusClicked(class UObject* Item);
	void Construct();
	void ExecuteUbergraph_ArenaLeaderboard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArenaLeaderboard_C">();
	}
	static class UArenaLeaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArenaLeaderboard_C>();
	}
};
static_assert(alignof(UArenaLeaderboard_C) == 0x000008, "Wrong alignment on UArenaLeaderboard_C");
static_assert(sizeof(UArenaLeaderboard_C) == 0x000408, "Wrong size on UArenaLeaderboard_C");
static_assert(offsetof(UArenaLeaderboard_C, UberGraphFrame) == 0x0003D0, "Member 'UArenaLeaderboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, BackgroundBlur_PosterLayer_1) == 0x0003D8, "Member 'UArenaLeaderboard_C::BackgroundBlur_PosterLayer_1' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, Details_EntryDisplay) == 0x0003E0, "Member 'UArenaLeaderboard_C::Details_EntryDisplay' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, Image_BG) == 0x0003E8, "Member 'UArenaLeaderboard_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, Image_PosterFade_2) == 0x0003F0, "Member 'UArenaLeaderboard_C::Image_PosterFade_2' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, SafeZone_0) == 0x0003F8, "Member 'UArenaLeaderboard_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UArenaLeaderboard_C, Text_EventName) == 0x000400, "Member 'UArenaLeaderboard_C::Text_EventName' has a wrong offset!");

}

