#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpecialEventChallengesWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaSpecialEventChallengesWidget.AthenaSpecialEventChallengesWidget_C.FinishOutro
// 0x0001 (0x0001 - 0x0000)
struct AthenaSpecialEventChallengesWidget_C_FinishOutro final
{
public:
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpecialEventChallengesWidget_C_FinishOutro) == 0x000001, "Wrong alignment on AthenaSpecialEventChallengesWidget_C_FinishOutro");
static_assert(sizeof(AthenaSpecialEventChallengesWidget_C_FinishOutro) == 0x000001, "Wrong size on AthenaSpecialEventChallengesWidget_C_FinishOutro");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_FinishOutro, CallFunc_PlayAnimationByName_ReturnValue) == 0x000000, "Member 'AthenaSpecialEventChallengesWidget_C_FinishOutro::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

// Function AthenaSpecialEventChallengesWidget.AthenaSpecialEventChallengesWidget_C.HasChallengesToDisplay
// 0x000C (0x000C - 0x0000)
struct AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay final
{
public:
	bool                                          bHasChallenges;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FC6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEntries_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay) == 0x000004, "Wrong alignment on AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay");
static_assert(sizeof(AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay) == 0x00000C, "Wrong size on AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay, bHasChallenges) == 0x000000, "Member 'AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay::bHasChallenges' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay, CallFunc_GetNumEntries_ReturnValue) == 0x000004, "Member 'AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay::CallFunc_GetNumEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSpecialEventChallengesWidget_C_HasChallengesToDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSpecialEventChallengesWidget.AthenaSpecialEventChallengesWidget_C.StartIntro
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaSpecialEventChallengesWidget_C_StartIntro final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC7[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          CallFunc_HasChallengesToDisplay_bHasChallenges;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FC8[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0048(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC9[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCA[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSpecialEventChallengeEntry_C*    K2Node_DynamicCast_AsAthena_Special_Event_Challenge_Entry; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCB[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCC[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
};
static_assert(alignof(AthenaSpecialEventChallengesWidget_C_StartIntro) == 0x000008, "Wrong alignment on AthenaSpecialEventChallengesWidget_C_StartIntro");
static_assert(sizeof(AthenaSpecialEventChallengesWidget_C_StartIntro) == 0x0000A0, "Wrong size on AthenaSpecialEventChallengesWidget_C_StartIntro");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, Temp_text_Variable) == 0x000000, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, Temp_text_Variable_1) == 0x000028, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_HasChallengesToDisplay_bHasChallenges) == 0x000040, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_HasChallengesToDisplay_bHasChallenges' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_PlayAnimationByName_ReturnValue) == 0x000041, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, Temp_bool_Variable) == 0x000042, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_GetAllEntries_ReturnValue) == 0x000048, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Array_Get_Item) == 0x000060, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, K2Node_DynamicCast_AsAthena_Special_Event_Challenge_Entry) == 0x000070, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::K2Node_DynamicCast_AsAthena_Special_Event_Challenge_Entry' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000085, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_StartIntro, K2Node_Select_Default) == 0x000088, "Member 'AthenaSpecialEventChallengesWidget_C_StartIntro::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSpecialEventChallengesWidget.AthenaSpecialEventChallengesWidget_C.ExecuteUbergraph_AthenaSpecialEventChallengesWidget
// 0x0004 (0x0004 - 0x0000)
struct AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget) == 0x000004, "Wrong alignment on AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget");
static_assert(sizeof(AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget) == 0x000004, "Wrong size on AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget");
static_assert(offsetof(AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget, EntryPoint) == 0x000000, "Member 'AthenaSpecialEventChallengesWidget_C_ExecuteUbergraph_AthenaSpecialEventChallengesWidget::EntryPoint' has a wrong offset!");

}

