#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDFeedbackLineNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDFeedbackLineNew.AthenaHUDFeedbackLineNew_C
// 0x0018 (0x02C0 - 0x02A8)
class UAthenaHUDFeedbackLineNew_C final : public UAthenaHUDFeedbackLine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DangerPulse;                                       // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Glow;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Event_DangerPulse(bool Enable, float AnimSpeed);
	void ExecuteUbergraph_AthenaHUDFeedbackLineNew(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDFeedbackLineNew_C">();
	}
	static class UAthenaHUDFeedbackLineNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDFeedbackLineNew_C>();
	}
};
static_assert(alignof(UAthenaHUDFeedbackLineNew_C) == 0x000008, "Wrong alignment on UAthenaHUDFeedbackLineNew_C");
static_assert(sizeof(UAthenaHUDFeedbackLineNew_C) == 0x0002C0, "Wrong size on UAthenaHUDFeedbackLineNew_C");
static_assert(offsetof(UAthenaHUDFeedbackLineNew_C, UberGraphFrame) == 0x0002A8, "Member 'UAthenaHUDFeedbackLineNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDFeedbackLineNew_C, DangerPulse) == 0x0002B0, "Member 'UAthenaHUDFeedbackLineNew_C::DangerPulse' has a wrong offset!");
static_assert(offsetof(UAthenaHUDFeedbackLineNew_C, Overlay_Glow) == 0x0002B8, "Member 'UAthenaHUDFeedbackLineNew_C::Overlay_Glow' has a wrong offset!");

}

