#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickBarSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuickBarSlot.AthenaQuickBarSlot_C.OnTouchStarted
// 0x02E8 (0x02E8 - 0x0000)
struct AthenaQuickBarSlot_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsTouchInputPlatform_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBA[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PointerEvent_GetPointerIndex_ReturnValue; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0168(0x00B8)()
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	bool                                          CallFunc_TakeItemSelectionInputFromHUD_bIsUsing;   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickBarSlot_C_OnTouchStarted) == 0x000008, "Wrong alignment on AthenaQuickBarSlot_C_OnTouchStarted");
static_assert(sizeof(AthenaQuickBarSlot_C_OnTouchStarted) == 0x0002E8, "Wrong size on AthenaQuickBarSlot_C_OnTouchStarted");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, MyGeometry) == 0x000000, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, InTouchEvent) == 0x000038, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::InTouchEvent' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, ReturnValue) == 0x0000A8, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_IsTouchInputPlatform_ReturnValue) == 0x000160, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_IsTouchInputPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_PointerEvent_GetPointerIndex_ReturnValue) == 0x000164, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_PointerEvent_GetPointerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_Unhandled_ReturnValue) == 0x000168, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_GetContext_ReturnValue) == 0x000220, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_OnTouchStarted, CallFunc_TakeItemSelectionInputFromHUD_bIsUsing) == 0x0002E0, "Member 'AthenaQuickBarSlot_C_OnTouchStarted::CallFunc_TakeItemSelectionInputFromHUD_bIsUsing' has a wrong offset!");

// Function AthenaQuickBarSlot.AthenaQuickBarSlot_C.Handle OnQuickbarContentsChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EBB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ChangedSlots;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged) == 0x000008, "Wrong alignment on AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged");
static_assert(sizeof(AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged) == 0x000018, "Wrong size on AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged");
static_assert(offsetof(AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged, QuickbarIndex) == 0x000000, "Member 'AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged, ChangedSlots) == 0x000008, "Member 'AthenaQuickBarSlot_C_Handle_OnQuickbarContentsChanged::ChangedSlots' has a wrong offset!");

// Function AthenaQuickBarSlot.AthenaQuickBarSlot_C.ExecuteUbergraph_AthenaQuickBarSlot
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuickBars                                K2Node_CustomEvent_QuickbarIndex;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EBC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_ChangedSlots;                   // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void(EFortQuickBars QuickbarIndex, TArray<int32>& ChangedSlots)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot) == 0x000008, "Wrong alignment on AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot");
static_assert(sizeof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot) == 0x000030, "Wrong size on AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot");
static_assert(offsetof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot, EntryPoint) == 0x000000, "Member 'AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot, K2Node_CustomEvent_QuickbarIndex) == 0x000004, "Member 'AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot::K2Node_CustomEvent_QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot, K2Node_CustomEvent_ChangedSlots) == 0x000008, "Member 'AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot::K2Node_CustomEvent_ChangedSlots' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'AthenaQuickBarSlot_C_ExecuteUbergraph_AthenaQuickBarSlot::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

