#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTabsScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTabsScreen.AthenaTabsScreen_C
// 0x0018 (0x0318 - 0x0300)
class UAthenaTabsScreen_C final : public UFortAthenaTabsScreenBase
{
public:
	class UItemShopScreen_C*                      ItemShopScreen;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneContent;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpatialFrontend_C*                     SpatialUIHost;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTabsScreen_C">();
	}
	static class UAthenaTabsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTabsScreen_C>();
	}
};
static_assert(alignof(UAthenaTabsScreen_C) == 0x000008, "Wrong alignment on UAthenaTabsScreen_C");
static_assert(sizeof(UAthenaTabsScreen_C) == 0x000318, "Wrong size on UAthenaTabsScreen_C");
static_assert(offsetof(UAthenaTabsScreen_C, ItemShopScreen) == 0x000300, "Member 'UAthenaTabsScreen_C::ItemShopScreen' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SafeZoneContent) == 0x000308, "Member 'UAthenaTabsScreen_C::SafeZoneContent' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SpatialUIHost) == 0x000310, "Member 'UAthenaTabsScreen_C::SpatialUIHost' has a wrong offset!");

}

