#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDFeedbackLineNew

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDFeedbackLineNew.AthenaHUDFeedbackLineNew_C.Event_DangerPulse
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDFeedbackLineNew_C_Event_DangerPulse final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6326[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimSpeed;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDFeedbackLineNew_C_Event_DangerPulse) == 0x000004, "Wrong alignment on AthenaHUDFeedbackLineNew_C_Event_DangerPulse");
static_assert(sizeof(AthenaHUDFeedbackLineNew_C_Event_DangerPulse) == 0x000008, "Wrong size on AthenaHUDFeedbackLineNew_C_Event_DangerPulse");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_Event_DangerPulse, Enable) == 0x000000, "Member 'AthenaHUDFeedbackLineNew_C_Event_DangerPulse::Enable' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_Event_DangerPulse, AnimSpeed) == 0x000004, "Member 'AthenaHUDFeedbackLineNew_C_Event_DangerPulse::AnimSpeed' has a wrong offset!");

// Function AthenaHUDFeedbackLineNew.AthenaHUDFeedbackLineNew_C.ExecuteUbergraph_AthenaHUDFeedbackLineNew
// 0x0020 (0x0020 - 0x0000)
struct AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6327[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_AnimSpeed;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6328[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew) == 0x000008, "Wrong alignment on AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew");
static_assert(sizeof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew) == 0x000020, "Wrong size on AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, EntryPoint) == 0x000000, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, Temp_bool_Variable) == 0x000004, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, Temp_byte_Variable) == 0x000005, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, K2Node_CustomEvent_Enable) == 0x000006, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, K2Node_CustomEvent_AnimSpeed) == 0x000008, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::K2Node_CustomEvent_AnimSpeed' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, Temp_byte_Variable_1) == 0x000018, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew, K2Node_Select_Default) == 0x000019, "Member 'AthenaHUDFeedbackLineNew_C_ExecuteUbergraph_AthenaHUDFeedbackLineNew::K2Node_Select_Default' has a wrong offset!");

}

