#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHoagieReticle

#include "Basic.hpp"

#include "HoagieRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.ExecuteUbergraph_AthenaHoagieReticle
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EHoagieBoostState State)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHoagieBoostState                             K2Node_CustomEvent_State;                          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A75[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBoostCooldown_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A76[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxDistanceWithoutFallDamage_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAltitude_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle) == 0x000008, "Wrong alignment on AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle");
static_assert(sizeof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle) == 0x0000B0, "Wrong size on AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, EntryPoint) == 0x000000, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, K2Node_Event_MyGeometry) == 0x000014, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, K2Node_CustomEvent_State) == 0x000051, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetBoostCooldown_ReturnValue) == 0x000054, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetBoostCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_IsBoosting_self_CastInput) == 0x000058, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_IsBoosting_self_CastInput' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_IsBoosting_ReturnValue) == 0x000068, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_IsBoosting_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000069, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000070, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000078, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetPlayerPawn_ReturnValue) == 0x000080, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetMaxDistanceWithoutFallDamage_ReturnValue) == 0x000088, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetMaxDistanceWithoutFallDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetMaxAltitude_ReturnValue) == 0x00008C, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetMaxAltitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A0, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'AthenaHoagieReticle_C_ExecuteUbergraph_AthenaHoagieReticle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.HandleBoostStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaHoagieReticle_C_HandleBoostStateChanged final
{
public:
	EHoagieBoostState                             State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_HandleBoostStateChanged) == 0x000001, "Wrong alignment on AthenaHoagieReticle_C_HandleBoostStateChanged");
static_assert(sizeof(AthenaHoagieReticle_C_HandleBoostStateChanged) == 0x000001, "Wrong size on AthenaHoagieReticle_C_HandleBoostStateChanged");
static_assert(offsetof(AthenaHoagieReticle_C_HandleBoostStateChanged, State) == 0x000000, "Member 'AthenaHoagieReticle_C_HandleBoostStateChanged::State' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.Tick
// 0x003C (0x003C - 0x0000)
struct AthenaHoagieReticle_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_Tick) == 0x000004, "Wrong alignment on AthenaHoagieReticle_C_Tick");
static_assert(sizeof(AthenaHoagieReticle_C_Tick) == 0x00003C, "Wrong size on AthenaHoagieReticle_C_Tick");
static_assert(offsetof(AthenaHoagieReticle_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaHoagieReticle_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_Tick, InDeltaTime) == 0x000038, "Member 'AthenaHoagieReticle_C_Tick::InDeltaTime' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.UpdatePitchRoll
// 0x0034 (0x0034 - 0x0000)
struct AthenaHoagieReticle_C_UpdatePitchRoll final
{
public:
	float                                         Dt;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_UpdatePitchRoll) == 0x000004, "Wrong alignment on AthenaHoagieReticle_C_UpdatePitchRoll");
static_assert(sizeof(AthenaHoagieReticle_C_UpdatePitchRoll) == 0x000034, "Wrong size on AthenaHoagieReticle_C_UpdatePitchRoll");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, Dt) == 0x000000, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::Dt' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000020, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_FInterpTo_ReturnValue) == 0x00002C, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdatePitchRoll, CallFunc_FInterpTo_ReturnValue_1) == 0x000030, "Member 'AthenaHoagieReticle_C_UpdatePitchRoll::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.UpdateAltitude
// 0x0024 (0x0024 - 0x0000)
struct AthenaHoagieReticle_C_UpdateAltitude final
{
public:
	float                                         MaxDistanceToGround;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToGround;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAltitude_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToGround_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_UpdateAltitude) == 0x000004, "Wrong alignment on AthenaHoagieReticle_C_UpdateAltitude");
static_assert(sizeof(AthenaHoagieReticle_C_UpdateAltitude) == 0x000024, "Wrong size on AthenaHoagieReticle_C_UpdateAltitude");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, MaxDistanceToGround) == 0x000000, "Member 'AthenaHoagieReticle_C_UpdateAltitude::MaxDistanceToGround' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, DistanceToGround) == 0x000004, "Member 'AthenaHoagieReticle_C_UpdateAltitude::DistanceToGround' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_GetAltitude_ReturnValue) == 0x00000C, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_GetAltitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000014, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateAltitude, CallFunc_GetDistanceToGround_ReturnValue) == 0x000020, "Member 'AthenaHoagieReticle_C_UpdateAltitude::CallFunc_GetDistanceToGround_ReturnValue' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.UpdateBoostState
// 0x0070 (0x0070 - 0x0000)
struct AthenaHoagieReticle_C_UpdateBoostState final
{
public:
	EHoagieBoostState                             State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHoagieBoostState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A77[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A78[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_UpdateBoostState) == 0x000008, "Wrong alignment on AthenaHoagieReticle_C_UpdateBoostState");
static_assert(sizeof(AthenaHoagieReticle_C_UpdateBoostState) == 0x000070, "Wrong size on AthenaHoagieReticle_C_UpdateBoostState");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, State) == 0x000000, "Member 'AthenaHoagieReticle_C_UpdateBoostState::State' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_byte_Variable) == 0x000001, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_struct_Variable) == 0x000004, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_struct_Variable_1) == 0x000014, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_struct_Variable_2) == 0x000024, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_struct_Variable_3) == 0x000034, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, Temp_struct_Variable_4) == 0x000044, "Member 'AthenaHoagieReticle_C_UpdateBoostState::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, K2Node_Select_Default) == 0x000054, "Member 'AthenaHoagieReticle_C_UpdateBoostState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'AthenaHoagieReticle_C_UpdateBoostState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.UpdateBoostValue
// 0x0040 (0x0040 - 0x0000)
struct AthenaHoagieReticle_C_UpdateBoostValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A79[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoostTimeLeft_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoostDuration_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A7A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBoostTimeLeft_ReturnValue_1;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A7B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBoostCooldown_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxBoostCooldown_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHoagieReticle_C_UpdateBoostValue) == 0x000008, "Wrong alignment on AthenaHoagieReticle_C_UpdateBoostValue");
static_assert(sizeof(AthenaHoagieReticle_C_UpdateBoostValue) == 0x000040, "Wrong size on AthenaHoagieReticle_C_UpdateBoostValue");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, Temp_bool_Variable) == 0x000000, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetBoostTimeLeft_ReturnValue) == 0x000010, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetBoostTimeLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetBoostDuration_ReturnValue) == 0x000014, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetBoostDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetBoostTimeLeft_ReturnValue_1) == 0x000020, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetBoostTimeLeft_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetBoostCooldown_ReturnValue) == 0x000028, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetBoostCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_GetMaxBoostCooldown_ReturnValue) == 0x00002C, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_GetMaxBoostCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000030, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateBoostValue, K2Node_Select_Default) == 0x000038, "Member 'AthenaHoagieReticle_C_UpdateBoostValue::K2Node_Select_Default' has a wrong offset!");

// Function AthenaHoagieReticle.AthenaHoagieReticle_C.UpdateCriticalHealth
// 0x0018 (0x0018 - 0x0000)
struct AthenaHoagieReticle_C_UpdateCriticalHealth final
{
public:
	bool                                          NewLocalVar_0;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A7C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsCriticalHealth_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHoagieReticle_C_UpdateCriticalHealth) == 0x000008, "Wrong alignment on AthenaHoagieReticle_C_UpdateCriticalHealth");
static_assert(sizeof(AthenaHoagieReticle_C_UpdateCriticalHealth) == 0x000018, "Wrong size on AthenaHoagieReticle_C_UpdateCriticalHealth");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateCriticalHealth, NewLocalVar_0) == 0x000000, "Member 'AthenaHoagieReticle_C_UpdateCriticalHealth::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(AthenaHoagieReticle_C_UpdateCriticalHealth, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'AthenaHoagieReticle_C_UpdateCriticalHealth::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
