#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDSituationalFeedback

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaHUDSituationalFeedback.AthenaHUDSituationalFeedback_C.ExecuteUbergraph_AthenaHUDSituationalFeedback
// 0x0028 (0x0028 - 0x0000)
struct AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BB3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDFeedbackLine_C*               CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BB4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback) == 0x000008, "Wrong alignment on AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback");
static_assert(sizeof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback) == 0x000028, "Wrong size on AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, EntryPoint) == 0x000000, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, Temp_int_Variable) == 0x00001C, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'AthenaHUDSituationalFeedback_C_ExecuteUbergraph_AthenaHUDSituationalFeedback::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

