#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapNavigableIconStackOfChallenges

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.SetAnywhereState
// 0x0058 (0x0058 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState final
{
public:
	bool                                          bIsAnytimeChallenge;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState) == 0x000008, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState) == 0x000058, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState, bIsAnytimeChallenge) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState::bIsAnytimeChallenge' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'AthenaMapNavigableIconStackOfChallenges_C_SetAnywhereState::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.SetMaterialState
// 0x0003 (0x0003 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState final
{
public:
	bool                                          Complete;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Locked;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasIconOverride;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState) == 0x000003, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState, Complete) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState::Complete' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState, Locked) == 0x000001, "Member 'AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState::Locked' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState, HasIconOverride) == 0x000002, "Member 'AthenaMapNavigableIconStackOfChallenges_C_SetMaterialState::HasIconOverride' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnChallengeSet
// 0x000C (0x000C - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet final
{
public:
	bool                                          bIsComplete;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLocked;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHasIconOverride;                                  // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9C[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Progress;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldShowBang;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet) == 0x000004, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet) == 0x00000C, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet, bIsComplete) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet::bIsComplete' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet, bIsLocked) == 0x000001, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet::bIsLocked' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet, bHasIconOverride) == 0x000002, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet::bHasIconOverride' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet, Progress) == 0x000004, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet::Progress' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet, bShouldShowBang) == 0x000008, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeSet::bShouldShowBang' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnSetIsInGame
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame final
{
public:
	bool                                          bIsInGame;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame, bIsInGame) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnSetIsInGame::bIsInGame' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnSetHasLocation
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation final
{
public:
	bool                                          bHasLocation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation, bHasLocation) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnSetHasLocation::bHasLocation' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnChangedStackData
// 0x0008 (0x0008 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData final
{
public:
	int32                                         NewStackCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NonCompletedCount;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData) == 0x000004, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData) == 0x000008, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData, NewStackCount) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData::NewStackCount' has a wrong offset!");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData, NonCompletedCount) == 0x000004, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChangedStackData::NonCompletedCount' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnChallengeIconOverriden
// 0x0008 (0x0008 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden final
{
public:
	const class UTexture2D*                       Icon;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden) == 0x000008, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden) == 0x000008, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden, Icon) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChallengeIconOverriden::Icon' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnSelected
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnSelected final
{
public:
	bool                                          bUserInteraction;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnSelected) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnSelected");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnSelected) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnSelected");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnSelected, bUserInteraction) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnSelected::bUserInteraction' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnUnselected
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnUnselected final
{
public:
	bool                                          bUserInteraction;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnUnselected) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnUnselected");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnUnselected) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnUnselected");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnUnselected, bUserInteraction) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnUnselected::bUserInteraction' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnHovered
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnHovered final
{
public:
	bool                                          bUserInteraction;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnHovered) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnHovered");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnHovered) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnHovered");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnHovered, bUserInteraction) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnHovered::bUserInteraction' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnUnhovered
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered final
{
public:
	bool                                          bUserInteraction;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered, bUserInteraction) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnUnhovered::bUserInteraction' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.OnChangeBangVisibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility) == 0x000001, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility) == 0x000001, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility, bShouldShow) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_OnChangeBangVisibility::bShouldShow' has a wrong offset!");

// Function AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C.ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges
// 0x0138 (0x0138 - 0x0000)
struct AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsComplete;                          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocked;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHasIconOverride;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9D[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Progress;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldShowBang;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsInGame;                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9E[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectStackedDataIndex_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9F[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	float                                         Temp_float_Variable;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA0[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA1[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCycleAutomatically_ReturnValue;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA2[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasLocation;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA3[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewStackCount;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NonCompletedCount;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA4[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0088(0x0018)()
	const class UTexture2D*                       K2Node_Event_Icon;                                 // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUserInteraction_3;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldCycleAutomatically_ReturnValue_1;   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA5[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIconHovered_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bUserInteraction_2;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA6[0x1];                                     // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUserInteraction_1;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIconSelected_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bUserInteraction;                     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIconSelected_ReturnValue_1;             // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIconSelected_ReturnValue_2;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIconSelected_ReturnValue_3;             // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA7[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA8[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldShow;                          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges) == 0x000008, "Wrong alignment on AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges");
static_assert(sizeof(AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges) == 0x000138, "Wrong size on AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges");
static_assert(offsetof(AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges, EntryPoint) == 0x000000, "Member 'AthenaMapNavigableIconStackOfChallenges_C_ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges::EntryPoint' has a wrong offset!");
