#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpecialEventStartedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaSpecialEventStartedOverlay.AthenaSpecialEventStartedOverlay_C.ClearActiveContent
// 0x0010 (0x0010 - 0x0000)
struct AthenaSpecialEventStartedOverlay_C_ClearActiveContent final
{
public:
	TScriptInterface<class IFortPrioritizedWidget> CallFunc_SetHasActiveContent_self_CastInput;       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpecialEventStartedOverlay_C_ClearActiveContent) == 0x000008, "Wrong alignment on AthenaSpecialEventStartedOverlay_C_ClearActiveContent");
static_assert(sizeof(AthenaSpecialEventStartedOverlay_C_ClearActiveContent) == 0x000010, "Wrong size on AthenaSpecialEventStartedOverlay_C_ClearActiveContent");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ClearActiveContent, CallFunc_SetHasActiveContent_self_CastInput) == 0x000000, "Member 'AthenaSpecialEventStartedOverlay_C_ClearActiveContent::CallFunc_SetHasActiveContent_self_CastInput' has a wrong offset!");

// Function AthenaSpecialEventStartedOverlay.AthenaSpecialEventStartedOverlay_C.ExecuteUbergraph_AthenaSpecialEventStartedOverlay
// 0x0038 (0x0038 - 0x0000)
struct AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetOutroDelay_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCE[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay) == 0x000008, "Wrong alignment on AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay");
static_assert(sizeof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay) == 0x000038, "Wrong size on AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, EntryPoint) == 0x000000, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, CallFunc_GetOutroDelay_ReturnValue) == 0x000020, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::CallFunc_GetOutroDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay, CallFunc_PlayAnimationByName_ReturnValue) == 0x000030, "Member 'AthenaSpecialEventStartedOverlay_C_ExecuteUbergraph_AthenaSpecialEventStartedOverlay::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

}

