#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDMenu.AthenaHUDMenu_C.ExecuteUbergraph_AthenaHUDMenu
// 0x000C (0x000C - 0x0000)
struct AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu) == 0x000004, "Wrong alignment on AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu");
static_assert(sizeof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu) == 0x00000C, "Wrong size on AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, EntryPoint) == 0x000000, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, Temp_bool_Variable) == 0x000004, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, Temp_byte_Variable) == 0x000005, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_IsMobileGame_ReturnValue) == 0x000007, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_IsMobileGame_ReturnValue_1) == 0x000008, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, K2Node_Select_Default) == 0x000009, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::K2Node_Select_Default' has a wrong offset!");

}

