#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SilkyVeteran

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_SilkyVeteran.Athena_Prop_SilkyVeteran_C
// 0x0050 (0x0800 - 0x07B0)
class AAthena_Prop_SilkyVeteran_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientAudio;                                      // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Haze;                                              // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VatSides;                                          // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SurfaceTop;                                        // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SlurpNoCollision;                                  // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Floor;                                             // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Pawn;                                              // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EnvSlurpTag;                                       // 0x07F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_SilkyVeteran(int32 EntryPoint);
	void OnComponentEndOverlap_Event_0(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnComponentBeginOverlap_Event_0(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void OnReady_C33DB4B84AD0B0C23DD199B90B7875EF(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_SilkyVeteran_C">();
	}
	static class AAthena_Prop_SilkyVeteran_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_SilkyVeteran_C>();
	}
};
static_assert(alignof(AAthena_Prop_SilkyVeteran_C) == 0x000008, "Wrong alignment on AAthena_Prop_SilkyVeteran_C");
static_assert(sizeof(AAthena_Prop_SilkyVeteran_C) == 0x000800, "Wrong size on AAthena_Prop_SilkyVeteran_C");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, UberGraphFrame) == 0x0007B0, "Member 'AAthena_Prop_SilkyVeteran_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, AmbientAudio) == 0x0007B8, "Member 'AAthena_Prop_SilkyVeteran_C::AmbientAudio' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, Haze) == 0x0007C0, "Member 'AAthena_Prop_SilkyVeteran_C::Haze' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, VatSides) == 0x0007C8, "Member 'AAthena_Prop_SilkyVeteran_C::VatSides' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, SurfaceTop) == 0x0007D0, "Member 'AAthena_Prop_SilkyVeteran_C::SurfaceTop' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, SlurpNoCollision) == 0x0007D8, "Member 'AAthena_Prop_SilkyVeteran_C::SlurpNoCollision' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, Floor) == 0x0007E0, "Member 'AAthena_Prop_SilkyVeteran_C::Floor' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, Base) == 0x0007E8, "Member 'AAthena_Prop_SilkyVeteran_C::Base' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, Pawn) == 0x0007F0, "Member 'AAthena_Prop_SilkyVeteran_C::Pawn' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_C, EnvSlurpTag) == 0x0007F8, "Member 'AAthena_Prop_SilkyVeteran_C::EnvSlurpTag' has a wrong offset!");

}

