#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SilkyTrombone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Athena_Prop_BurstReaction_Exploding_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_SilkyTrombone.Athena_Prop_SilkyTrombone_C
// 0x0088 (0x0E30 - 0x0DA8)
class AAthena_Prop_SilkyTrombone_C : public AAthena_Prop_BurstReaction_Exploding_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_SilkyTrombone_C;        // 0x0DA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientAudio;                                      // 0x0DB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Idle_Decal;                                        // 0x0DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_SilkyTrombone_Idle;                              // 0x0DC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Radius;                                  // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8698[0x4];                                     // 0x0DCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      Overlap_Object_Types;                              // 0x0DD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 GE_HealingEffect;                                  // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TowerHalfHeight;                                   // 0x0DE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeight;                                 // 0x0DEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Death_Decal_Size;                                  // 0x0DF0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Random_Stream;                                     // 0x0DFC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_8699[0x4];                                     // 0x0E04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LandscapeExtinguishRadius;                         // 0x0E10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869A[0x4];                                     // 0x0E14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            WaterInstigator;                                   // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0E20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869B[0x7];                                     // 0x0E21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ExplosionVFX;                                      // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_SilkyTrombone(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void ApplyWaterIfCurieEnabled(class AActor* Param_Instigator, class AActor* Target);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_SilkyTrombone_C">();
	}
	static class AAthena_Prop_SilkyTrombone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_SilkyTrombone_C>();
	}
};
static_assert(alignof(AAthena_Prop_SilkyTrombone_C) == 0x000008, "Wrong alignment on AAthena_Prop_SilkyTrombone_C");
static_assert(sizeof(AAthena_Prop_SilkyTrombone_C) == 0x000E30, "Wrong size on AAthena_Prop_SilkyTrombone_C");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, UberGraphFrame_Athena_Prop_SilkyTrombone_C) == 0x000DA8, "Member 'AAthena_Prop_SilkyTrombone_C::UberGraphFrame_Athena_Prop_SilkyTrombone_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, AmbientAudio) == 0x000DB0, "Member 'AAthena_Prop_SilkyTrombone_C::AmbientAudio' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Idle_Decal) == 0x000DB8, "Member 'AAthena_Prop_SilkyTrombone_C::Idle_Decal' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, P_SilkyTrombone_Idle) == 0x000DC0, "Member 'AAthena_Prop_SilkyTrombone_C::P_SilkyTrombone_Idle' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Explosion_Radius) == 0x000DC8, "Member 'AAthena_Prop_SilkyTrombone_C::Explosion_Radius' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Overlap_Object_Types) == 0x000DD0, "Member 'AAthena_Prop_SilkyTrombone_C::Overlap_Object_Types' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, GE_HealingEffect) == 0x000DE0, "Member 'AAthena_Prop_SilkyTrombone_C::GE_HealingEffect' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, TowerHalfHeight) == 0x000DE8, "Member 'AAthena_Prop_SilkyTrombone_C::TowerHalfHeight' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, CapsuleHalfHeight) == 0x000DEC, "Member 'AAthena_Prop_SilkyTrombone_C::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Death_Decal_Size) == 0x000DF0, "Member 'AAthena_Prop_SilkyTrombone_C::Death_Decal_Size' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Random_Stream) == 0x000DFC, "Member 'AAthena_Prop_SilkyTrombone_C::Random_Stream' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, HitActor) == 0x000E08, "Member 'AAthena_Prop_SilkyTrombone_C::HitActor' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, LandscapeExtinguishRadius) == 0x000E10, "Member 'AAthena_Prop_SilkyTrombone_C::LandscapeExtinguishRadius' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, WaterInstigator) == 0x000E18, "Member 'AAthena_Prop_SilkyTrombone_C::WaterInstigator' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, Debug) == 0x000E20, "Member 'AAthena_Prop_SilkyTrombone_C::Debug' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyTrombone_C, ExplosionVFX) == 0x000E28, "Member 'AAthena_Prop_SilkyTrombone_C::ExplosionVFX' has a wrong offset!");

}

