#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_WildWest_WallClock_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function Athena_Prop_WildWest_WallClock_01.Athena_Prop_WildWest_WallClock_01_C.GetMinHand
// 0x0008 (0x0008 - 0x0000)
struct Athena_Prop_WildWest_WallClock_01_C_GetMinHand final
{
public:
	class UStaticMeshComponent*                   Hand;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_WildWest_WallClock_01_C_GetMinHand) == 0x000008, "Wrong alignment on Athena_Prop_WildWest_WallClock_01_C_GetMinHand");
static_assert(sizeof(Athena_Prop_WildWest_WallClock_01_C_GetMinHand) == 0x000008, "Wrong size on Athena_Prop_WildWest_WallClock_01_C_GetMinHand");
static_assert(offsetof(Athena_Prop_WildWest_WallClock_01_C_GetMinHand, Hand) == 0x000000, "Member 'Athena_Prop_WildWest_WallClock_01_C_GetMinHand::Hand' has a wrong offset!");

// Function Athena_Prop_WildWest_WallClock_01.Athena_Prop_WildWest_WallClock_01_C.GetHourHand
// 0x0008 (0x0008 - 0x0000)
struct Athena_Prop_WildWest_WallClock_01_C_GetHourHand final
{
public:
	class UStaticMeshComponent*                   Hand;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_WildWest_WallClock_01_C_GetHourHand) == 0x000008, "Wrong alignment on Athena_Prop_WildWest_WallClock_01_C_GetHourHand");
static_assert(sizeof(Athena_Prop_WildWest_WallClock_01_C_GetHourHand) == 0x000008, "Wrong size on Athena_Prop_WildWest_WallClock_01_C_GetHourHand");
static_assert(offsetof(Athena_Prop_WildWest_WallClock_01_C_GetHourHand, Hand) == 0x000000, "Member 'Athena_Prop_WildWest_WallClock_01_C_GetHourHand::Hand' has a wrong offset!");

}

