#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_P1_Retrieve

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "BGA_BaseQuestObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C
// 0x0098 (0x0868 - 0x07D0)
class AAthenaQuestActor_SW_P1_Retrieve_C final : public ABGA_BaseQuestObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuestActor_SW_P1_Retrieve_C;  // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConsolidatedQuestComponent*            ConsolidatedQuest1;                                // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Idle_Looping_Niagara_FX;                           // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConsolidatedQuestComponent*            ConsolidatedQuest;                                 // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Hidden_LoopingSound_Cue;                           // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                ForceFeedback;                                     // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PlayerNearTrigger;                                 // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Quest_SWShip_Engine;                             // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ScaleDownTime_39DE22DF4A5AD5020E96EDB00BF743AE; // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_39DE22DF4A5AD5020E96EDB00BF743AE; // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FC[0x3];                                     // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TestVisuals;                                       // 0x0820(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63FD[0x7];                                     // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaGameMessageData                 MessageData;                                       // 0x0828(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve(int32 EntryPoint);
	void CompleteInteraction(class AFortPlayerController* PC);
	void BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature(class AFortPlayerController* PlayerController);
	void DispalyMessage(class AFortPlayerController* PC);
	void BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Test();
	void HandleQuestComponentSuccessEvent(class AFortPlayerController* Player);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void RemoveAll(bool* ShouldRemoveActor);

	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_SW_P1_Retrieve_C">();
	}
	static class AAthenaQuestActor_SW_P1_Retrieve_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_SW_P1_Retrieve_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_SW_P1_Retrieve_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_SW_P1_Retrieve_C");
static_assert(sizeof(AAthenaQuestActor_SW_P1_Retrieve_C) == 0x000868, "Wrong size on AAthenaQuestActor_SW_P1_Retrieve_C");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, UberGraphFrame_AthenaQuestActor_SW_P1_Retrieve_C) == 0x0007D0, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::UberGraphFrame_AthenaQuestActor_SW_P1_Retrieve_C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, ConsolidatedQuest1) == 0x0007D8, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::ConsolidatedQuest1' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, Idle_Looping_Niagara_FX) == 0x0007E0, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::Idle_Looping_Niagara_FX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, ConsolidatedQuest) == 0x0007E8, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::ConsolidatedQuest' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, Hidden_LoopingSound_Cue) == 0x0007F0, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::Hidden_LoopingSound_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, ForceFeedback) == 0x0007F8, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::ForceFeedback' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, PlayerNearTrigger) == 0x000800, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::PlayerNearTrigger' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, S_Quest_SWShip_Engine) == 0x000808, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::S_Quest_SWShip_Engine' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, Timeline_0_ScaleDownTime_39DE22DF4A5AD5020E96EDB00BF743AE) == 0x000810, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::Timeline_0_ScaleDownTime_39DE22DF4A5AD5020E96EDB00BF743AE' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, Timeline_0__Direction_39DE22DF4A5AD5020E96EDB00BF743AE) == 0x000814, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::Timeline_0__Direction_39DE22DF4A5AD5020E96EDB00BF743AE' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, Timeline_0) == 0x000818, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, TestVisuals) == 0x000820, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::TestVisuals' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P1_Retrieve_C, MessageData) == 0x000828, "Member 'AAthenaQuestActor_SW_P1_Retrieve_C::MessageData' has a wrong offset!");

}

