#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastSquadStatusTG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastSquadStatusTG.AthenaBroadcastSquadStatusTG_C
// 0x0030 (0x02F8 - 0x02C8)
class UAthenaBroadcastSquadStatusTG_C final : public UAthenaBroadcastSquadStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBroadcastTeamTag_C*              AthenaBroadcastTeamTag;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaBroadcastPlayerStatusTG_C*       FollowedPlayerStatus;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   SquadMateList;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           StatusVB;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPipModeEnabled;                                   // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaBroadcastSquadStatusTG(int32 EntryPoint);
	void UpdateFromMinigameTeamId(const class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnMinigameTeamIdChanged(const class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnPipModeChanged(bool Param_bPipModeEnabled);
	void PreConstruct(bool IsDesignTime);
	void OnFollowedPlayerChanged();
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
	void RebuildSquad();
	void UpdateTeamTagVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastSquadStatusTG_C">();
	}
	static class UAthenaBroadcastSquadStatusTG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastSquadStatusTG_C>();
	}
};
static_assert(alignof(UAthenaBroadcastSquadStatusTG_C) == 0x000008, "Wrong alignment on UAthenaBroadcastSquadStatusTG_C");
static_assert(sizeof(UAthenaBroadcastSquadStatusTG_C) == 0x0002F8, "Wrong size on UAthenaBroadcastSquadStatusTG_C");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, UberGraphFrame) == 0x0002C8, "Member 'UAthenaBroadcastSquadStatusTG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, AthenaBroadcastTeamTag) == 0x0002D0, "Member 'UAthenaBroadcastSquadStatusTG_C::AthenaBroadcastTeamTag' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, FollowedPlayerStatus) == 0x0002D8, "Member 'UAthenaBroadcastSquadStatusTG_C::FollowedPlayerStatus' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, SquadMateList) == 0x0002E0, "Member 'UAthenaBroadcastSquadStatusTG_C::SquadMateList' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, StatusVB) == 0x0002E8, "Member 'UAthenaBroadcastSquadStatusTG_C::StatusVB' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastSquadStatusTG_C, bPipModeEnabled) == 0x0002F0, "Member 'UAthenaBroadcastSquadStatusTG_C::bPipModeEnabled' has a wrong offset!");

}

