#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDrop_Llama

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C
// 0x00A8 (0x0968 - 0x08C0)
class AAthenaSupplyDrop_Llama_C final : public AFortAthenaSupplyDrop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Treasure_pinata_loop_Cue;                          // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LlamaStaticMesh;                                   // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxCollision;                                      // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              MyInteractingPawn;                                 // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTableName;                                     // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LootSpawnOffset;                                   // 0x08F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAC[0x4];                                     // 0x0904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        LlamaLootFX;                                       // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FXSocketName;                                      // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Looted;                                      // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Destroyed;                                   // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Ambient;                                     // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Looted;                                            // 0x0930(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_5EAD[0x7];                                     // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  ControllerWhoOpenedLlama;                          // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x0950(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAE[0x3];                                     // 0x0951(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Initial_Fall_Delay;                                // 0x0954(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FinalDestination;                                  // 0x0958(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         SoundIndicatorUpdateInterval;                      // 0x0964(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSupplyDrop_Llama(int32 EntryPoint);
	void Show_audio_indicator();
	void ReceiveBeginPlay();
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void Multicast_ApplyGravityForFall();
	void OnLandingLocationChanged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void SpawnLoot();
	void Setup_Bind_To_Building_Actor(class UObject* Object);
	void OnRep_Looted();
	void PlayLootedFX();
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnRep_FinalDestination();
	void Analytics(const TArray<struct FFortItemEntry>& ItemsToSpawn);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	void GetLootSpawnLocation(struct FVector* LootSpawnLocation) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSupplyDrop_Llama_C">();
	}
	static class AAthenaSupplyDrop_Llama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaSupplyDrop_Llama_C>();
	}
};
static_assert(alignof(AAthenaSupplyDrop_Llama_C) == 0x000008, "Wrong alignment on AAthenaSupplyDrop_Llama_C");
static_assert(sizeof(AAthenaSupplyDrop_Llama_C) == 0x000968, "Wrong size on AAthenaSupplyDrop_Llama_C");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, UberGraphFrame) == 0x0008C0, "Member 'AAthenaSupplyDrop_Llama_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Treasure_pinata_loop_Cue) == 0x0008C8, "Member 'AAthenaSupplyDrop_Llama_C::Treasure_pinata_loop_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, LlamaStaticMesh) == 0x0008D0, "Member 'AAthenaSupplyDrop_Llama_C::LlamaStaticMesh' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, BoxCollision) == 0x0008D8, "Member 'AAthenaSupplyDrop_Llama_C::BoxCollision' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, ProjectileMovement) == 0x0008E0, "Member 'AAthenaSupplyDrop_Llama_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, MyInteractingPawn) == 0x0008E8, "Member 'AAthenaSupplyDrop_Llama_C::MyInteractingPawn' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, LootTableName) == 0x0008F0, "Member 'AAthenaSupplyDrop_Llama_C::LootTableName' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, LootSpawnOffset) == 0x0008F8, "Member 'AAthenaSupplyDrop_Llama_C::LootSpawnOffset' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, LlamaLootFX) == 0x000908, "Member 'AAthenaSupplyDrop_Llama_C::LlamaLootFX' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, FXSocketName) == 0x000910, "Member 'AAthenaSupplyDrop_Llama_C::FXSocketName' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Sound_Looted) == 0x000918, "Member 'AAthenaSupplyDrop_Llama_C::Sound_Looted' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Sound_Destroyed) == 0x000920, "Member 'AAthenaSupplyDrop_Llama_C::Sound_Destroyed' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Sound_Ambient) == 0x000928, "Member 'AAthenaSupplyDrop_Llama_C::Sound_Ambient' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Looted) == 0x000930, "Member 'AAthenaSupplyDrop_Llama_C::Looted' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, ControllerWhoOpenedLlama) == 0x000938, "Member 'AAthenaSupplyDrop_Llama_C::ControllerWhoOpenedLlama' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, ObjBackendName) == 0x000940, "Member 'AAthenaSupplyDrop_Llama_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, QuestItem) == 0x000948, "Member 'AAthenaSupplyDrop_Llama_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, CreativeMode) == 0x000950, "Member 'AAthenaSupplyDrop_Llama_C::CreativeMode' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, Initial_Fall_Delay) == 0x000954, "Member 'AAthenaSupplyDrop_Llama_C::Initial_Fall_Delay' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, FinalDestination) == 0x000958, "Member 'AAthenaSupplyDrop_Llama_C::FinalDestination' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_Llama_C, SoundIndicatorUpdateInterval) == 0x000964, "Member 'AAthenaSupplyDrop_Llama_C::SoundIndicatorUpdateInterval' has a wrong offset!");

}

