#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCurieStatusWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaCurieStatusWidget.AthenaCurieStatusWidget_C.DebugString
// 0x0090 (0x0090 - 0x0000)
struct AthenaCurieStatusWidget_C_DebugString final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Add;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BFC[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasState_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BFD[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasState_ReturnValue_1;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BFE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Bool_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Bool_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCurieStatusWidget_C_DebugString) == 0x000008, "Wrong alignment on AthenaCurieStatusWidget_C_DebugString");
static_assert(sizeof(AthenaCurieStatusWidget_C_DebugString) == 0x000090, "Wrong size on AthenaCurieStatusWidget_C_DebugString");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, GameplayTag) == 0x000000, "Member 'AthenaCurieStatusWidget_C_DebugString::GameplayTag' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, Add) == 0x000008, "Member 'AthenaCurieStatusWidget_C_DebugString::Add' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, Temp_bool_Variable) == 0x000009, "Member 'AthenaCurieStatusWidget_C_DebugString::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000010, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, Temp_string_Variable) == 0x000020, "Member 'AthenaCurieStatusWidget_C_DebugString::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, Temp_string_Variable_1) == 0x000030, "Member 'AthenaCurieStatusWidget_C_DebugString::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_HasState_ReturnValue) == 0x000040, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_HasState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, K2Node_Select_Default) == 0x000048, "Member 'AthenaCurieStatusWidget_C_DebugString::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_HasState_ReturnValue_1) == 0x000058, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_HasState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_BuildString_Bool_ReturnValue) == 0x000060, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_BuildString_Bool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_BuildString_Bool_ReturnValue_1) == 0x000070, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_BuildString_Bool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_DebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'AthenaCurieStatusWidget_C_DebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function AthenaCurieStatusWidget.AthenaCurieStatusWidget_C.OnCurieStateAdded
// 0x0008 (0x0008 - 0x0000)
struct AthenaCurieStatusWidget_C_OnCurieStateAdded final
{
public:
	struct FGameplayTag                           AddedState;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCurieStatusWidget_C_OnCurieStateAdded) == 0x000004, "Wrong alignment on AthenaCurieStatusWidget_C_OnCurieStateAdded");
static_assert(sizeof(AthenaCurieStatusWidget_C_OnCurieStateAdded) == 0x000008, "Wrong size on AthenaCurieStatusWidget_C_OnCurieStateAdded");
static_assert(offsetof(AthenaCurieStatusWidget_C_OnCurieStateAdded, AddedState) == 0x000000, "Member 'AthenaCurieStatusWidget_C_OnCurieStateAdded::AddedState' has a wrong offset!");

// Function AthenaCurieStatusWidget.AthenaCurieStatusWidget_C.OnCurieStateRemoved
// 0x0008 (0x0008 - 0x0000)
struct AthenaCurieStatusWidget_C_OnCurieStateRemoved final
{
public:
	struct FGameplayTag                           RemovedState;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCurieStatusWidget_C_OnCurieStateRemoved) == 0x000004, "Wrong alignment on AthenaCurieStatusWidget_C_OnCurieStateRemoved");
static_assert(sizeof(AthenaCurieStatusWidget_C_OnCurieStateRemoved) == 0x000008, "Wrong size on AthenaCurieStatusWidget_C_OnCurieStateRemoved");
static_assert(offsetof(AthenaCurieStatusWidget_C_OnCurieStateRemoved, RemovedState) == 0x000000, "Member 'AthenaCurieStatusWidget_C_OnCurieStateRemoved::RemovedState' has a wrong offset!");

// Function AthenaCurieStatusWidget.AthenaCurieStatusWidget_C.ExecuteUbergraph_AthenaCurieStatusWidget
// 0x0060 (0x0060 - 0x0000)
struct AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasState_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BFF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_AddedState;                           // 0x0008(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_RemovedState;                         // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_3;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue_1;  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C00[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C01[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasState_ReturnValue_1;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C02[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget) == 0x000008, "Wrong alignment on AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget");
static_assert(sizeof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget) == 0x000060, "Wrong size on AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, EntryPoint) == 0x000000, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_HasState_ReturnValue) == 0x000004, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_HasState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, K2Node_Event_AddedState) == 0x000008, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::K2Node_Event_AddedState' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, K2Node_Event_RemovedState) == 0x000010, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::K2Node_Event_RemovedState' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_MatchesTag_ReturnValue) == 0x000018, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_MatchesTag_ReturnValue_1) == 0x000019, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_MatchesTag_ReturnValue_2) == 0x00001A, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_MatchesTag_ReturnValue_3) == 0x00001B, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_MatchesTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x00001C, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, Temp_byte_Variable) == 0x00001D, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_IsAnimationPlayingForward_ReturnValue_1) == 0x00001E, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_IsAnimationPlayingForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_BooleanOR_ReturnValue) == 0x00001F, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, Temp_byte_Variable_1) == 0x000020, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, Temp_bool_Variable) == 0x000040, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000048, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_HasState_ReturnValue_1) == 0x000050, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_HasState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, K2Node_Select_Default) == 0x000051, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000058, "Member 'AthenaCurieStatusWidget_C_ExecuteUbergraph_AthenaCurieStatusWidget::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");

}

