#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding_GasTank

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_BurstReaction_Exploding_GasTank.Athena_Prop_BurstReaction_Exploding_GasTank_C.ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank
// 0x0020 (0x0020 - 0x0000)
struct Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8696[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8697[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank) == 0x000004, "Wrong alignment on Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank");
static_assert(sizeof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank) == 0x000020, "Wrong size on Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, EntryPoint) == 0x000000, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, K2Node_Event_HitLocation) == 0x000004, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, K2Node_MultiGate_FirstRun) == 0x000010, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, K2Node_MultiGate_Data) == 0x000014, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, K2Node_MultiGate_ScratchBool) == 0x000018, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank, K2Node_MultiGate_ScratchIndex) == 0x00001C, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank::K2Node_MultiGate_ScratchIndex' has a wrong offset!");

// Function Athena_Prop_BurstReaction_Exploding_GasTank.Athena_Prop_BurstReaction_Exploding_GasTank_C.FireEffect
// 0x000C (0x000C - 0x0000)
struct Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect) == 0x000004, "Wrong alignment on Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect");
static_assert(sizeof(Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect) == 0x00000C, "Wrong size on Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect, HitLocation) == 0x000000, "Member 'Athena_Prop_BurstReaction_Exploding_GasTank_C_FireEffect::HitLocation' has a wrong offset!");

}

