#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEquippedItemReticleWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.UpdateGaugeValue
// 0x0050 (0x0050 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_UpdateGaugeValue final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalRemainingAmmo_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBulletsPerClip_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B8[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52B9[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverheated_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BA[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOverheatingMaxValue_ReturnValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentOverheatValue_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      CallFunc_GetOverheatState_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesWeaponOverheat_ReturnValue;           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BB[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BC[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_UpdateGaugeValue");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue) == 0x000050, "Wrong size on AthenaEquippedItemReticleWidget_C_UpdateGaugeValue");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, Weapon) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::Weapon' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetLocalRemainingAmmo_ReturnValue) == 0x00000C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetLocalRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetBulletsPerClip_ReturnValue) == 0x000010, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetBulletsPerClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_Multiply_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, K2Node_DynamicCast_AsFort_Weapon_Ranged) == 0x000028, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::K2Node_DynamicCast_AsFort_Weapon_Ranged' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_IsOverheated_ReturnValue) == 0x000031, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_IsOverheated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetOverheatingMaxValue_ReturnValue) == 0x000034, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetOverheatingMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetCurrentOverheatValue_ReturnValue) == 0x000038, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetCurrentOverheatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_GetOverheatState_ReturnValue) == 0x00003C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_GetOverheatState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, CallFunc_DoesWeaponOverheat_ReturnValue) == 0x00003D, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::CallFunc_DoesWeaponOverheat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, Temp_float_Variable) == 0x000040, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, Temp_bool_Variable) == 0x000044, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateGaugeValue, K2Node_Select_Default) == 0x000048, "Member 'AthenaEquippedItemReticleWidget_C_UpdateGaugeValue::K2Node_Select_Default' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.UpdateOverheatValue
// 0x005C (0x005C - 0x0000)
struct AthenaEquippedItemReticleWidget_C_UpdateOverheatValue final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInCooldown;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52BD[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52BE[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52BF[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue) == 0x000004, "Wrong alignment on AthenaEquippedItemReticleWidget_C_UpdateOverheatValue");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue) == 0x00005C, "Wrong size on AthenaEquippedItemReticleWidget_C_UpdateOverheatValue");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Current) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Current' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Max) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Max' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, State) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::State' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, IsInCooldown) == 0x000009, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::IsInCooldown' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Temp_bool_Variable) == 0x00000A, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Temp_byte_Variable) == 0x000014, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Temp_byte_Variable_1) == 0x000028, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, K2Node_Select_Default) == 0x000029, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Temp_struct_Variable) == 0x00002C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, Temp_struct_Variable_1) == 0x00003C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateOverheatValue, K2Node_Select_Default_1) == 0x00004C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateOverheatValue::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.UpdateAmmoCount
// 0x0088 (0x0088 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_UpdateAmmoCount final
{
public:
	int32                                         MagazineAmmoCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurplusAmmoCount;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRemaining;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C1[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C2[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C3[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C4[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount) == 0x000004, "Wrong alignment on AthenaEquippedItemReticleWidget_C_UpdateAmmoCount");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount) == 0x000088, "Wrong size on AthenaEquippedItemReticleWidget_C_UpdateAmmoCount");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, MagazineAmmoCount) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::MagazineAmmoCount' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, SurplusAmmoCount) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::SurplusAmmoCount' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, TotalRemaining) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::TotalRemaining' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_struct_Variable) == 0x00000C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_struct_Variable_1) == 0x000024, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_bool_Variable) == 0x000034, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_struct_Variable_2) == 0x000038, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_bool_Variable_1) == 0x000048, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_float_Variable) == 0x00004C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_float_Variable_1) == 0x000050, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, K2Node_Select_Default) == 0x000054, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, Temp_bool_Variable_2) == 0x000058, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000059, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00005A, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, K2Node_Select_Default_1) == 0x00005C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00006C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, CallFunc_Less_FloatFloat_ReturnValue) == 0x000074, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateAmmoCount, K2Node_Select_Default_2) == 0x000078, "Member 'AthenaEquippedItemReticleWidget_C_UpdateAmmoCount::K2Node_Select_Default_2' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.UpdateWidgetColor
// 0x0060 (0x0060 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_UpdateWidgetColor final
{
public:
	bool                                          HasAmmo;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_UpdateWidgetColor");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor) == 0x000060, "Wrong size on AthenaEquippedItemReticleWidget_C_UpdateWidgetColor");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, HasAmmo) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::HasAmmo' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, Temp_float_Variable) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, Temp_float_Variable_1) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, Temp_bool_Variable) == 0x00000C, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, Temp_struct_Variable) == 0x000010, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, Temp_bool_Variable_1) == 0x000020, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, K2Node_Select_Default) == 0x000024, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, K2Node_Select_Default_1) == 0x000034, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_UpdateWidgetColor, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'AthenaEquippedItemReticleWidget_C_UpdateWidgetColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged final
{
public:
	EEquippedWeaponDisplay                        Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged) == 0x000001, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged) == 0x000001, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged, Mode) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponModeChanged::Mode' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleHasBulletsPerClipChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged final
{
public:
	bool                                          bHasBulletsPerClip;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged) == 0x000001, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged) == 0x000001, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged, bHasBulletsPerClip) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleHasBulletsPerClipChanged::bHasBulletsPerClip' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleHasAmmoChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged final
{
public:
	bool                                          bHasAmmo;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged) == 0x000001, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged) == 0x000001, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged, bHasAmmo) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleHasAmmoChanged::bHasAmmo' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleAmmoCountChanged
// 0x000C (0x000C - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged final
{
public:
	int32                                         MagazineAmmoCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurplusAmmoCount;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRemaining;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged) == 0x000004, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged) == 0x00000C, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged, MagazineAmmoCount) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged::MagazineAmmoCount' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged, SurplusAmmoCount) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged::SurplusAmmoCount' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged, TotalRemaining) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleAmmoCountChanged::TotalRemaining' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponOverheatValueChanged
// 0x000C (0x000C - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged final
{
public:
	float                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInCooldown;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged) == 0x000004, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged) == 0x00000C, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged, CurrentValue) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged::CurrentValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged, MaxValue) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged::MaxValue' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged, State) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged::State' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged, bIsInCooldown) == 0x000009, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponOverheatValueChanged::bIsInCooldown' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponTargetingChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged final
{
public:
	bool                                          bIsTargeting;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged) == 0x000001, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged) == 0x000001, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged, bIsTargeting) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponTargetingChanged::bIsTargeting' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponReloadCancelled
// 0x0008 (0x0008 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled) == 0x000008, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled, Weapon) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadCancelled::Weapon' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponReloadStarted
// 0x0008 (0x0008 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted final
{
public:
	float                                         ReloadTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponReloadType                         ReloadType;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted) == 0x000004, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted) == 0x000008, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted, ReloadTime) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted::ReloadTime' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted, ReloadType) == 0x000004, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponReloadStarted::ReloadType' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleResourceTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged final
{
public:
	const class UFortResourceItemDefinition*      Item;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceCount;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged) == 0x000010, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged, Item) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged::Item' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged, ResourceCount) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleResourceTypeChanged::ResourceCount' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.BP_HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped) == 0x000010, "Wrong size on AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped, NewWeapon) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped::NewWeapon' has a wrong offset!");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped, PrevWeapon) == 0x000008, "Member 'AthenaEquippedItemReticleWidget_C_BP_HandleWeaponEquipped::PrevWeapon' has a wrong offset!");

// Function AthenaEquippedItemReticleWidget.AthenaEquippedItemReticleWidget_C.ExecuteUbergraph_AthenaEquippedItemReticleWidget
// 0x0140 (0x0140 - 0x0000)
struct AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquippedWeaponDisplay                        Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C8[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52C9[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_2;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CA[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52CB[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquippedWeaponDisplay                        K2Node_Event_Mode;                                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasBulletsPerClip;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHasAmmo;                             // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CC[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CD[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MagazineAmmoCount;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SurplusAmmoCount;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalRemaining;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxValue;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponOverheatState                      K2Node_Event_State;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInCooldown;                        // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsTargeting;                         // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52CE[0x1];                                     // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_Event_Weapon;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ReloadTime;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponReloadType                         K2Node_Event_ReloadType;                           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52CF[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortResourceItemDefinition*      K2Node_Event_Item;                                 // 0x00C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ResourceCount;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_Event_NewWeapon;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_Event_PrevWeapon;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D0[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WeaponDataIsValid_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDisplayAmmoCounter_ReturnValue;     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D1[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D2[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetReticleCornerAngles_ReturnValue;       // 0x0110(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D3[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLowAmmoPercentage_ReturnValue;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget) == 0x000008, "Wrong alignment on AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget");
static_assert(sizeof(AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget) == 0x000140, "Wrong size on AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget");
static_assert(offsetof(AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget, EntryPoint) == 0x000000, "Member 'AthenaEquippedItemReticleWidget_C_ExecuteUbergraph_AthenaEquippedItemReticleWidget::EntryPoint' has a wrong offset!");
