#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPackResource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaPackResource.AthenaPackResource_C.ResourceCountNeedsUpdate
// 0x0018 (0x0018 - 0x0000)
struct AthenaPackResource_C_ResourceCountNeedsUpdate final
{
public:
	bool                                          NeedsUpdate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPackResource_C_ResourceCountNeedsUpdate) == 0x000008, "Wrong alignment on AthenaPackResource_C_ResourceCountNeedsUpdate");
static_assert(sizeof(AthenaPackResource_C_ResourceCountNeedsUpdate) == 0x000018, "Wrong size on AthenaPackResource_C_ResourceCountNeedsUpdate");
static_assert(offsetof(AthenaPackResource_C_ResourceCountNeedsUpdate, NeedsUpdate) == 0x000000, "Member 'AthenaPackResource_C_ResourceCountNeedsUpdate::NeedsUpdate' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_ResourceCountNeedsUpdate, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaPackResource_C_ResourceCountNeedsUpdate::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_ResourceCountNeedsUpdate, CallFunc_GetResourceCount_ReturnValue) == 0x000010, "Member 'AthenaPackResource_C_ResourceCountNeedsUpdate::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_ResourceCountNeedsUpdate, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'AthenaPackResource_C_ResourceCountNeedsUpdate::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.OnTouchEnded
// 0x03A8 (0x03A8 - 0x0000)
struct AthenaPackResource_C_OnTouchEnded final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB2[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0168(0x00B8)()
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue;         // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB3[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F0(0x00B8)()
};
static_assert(alignof(AthenaPackResource_C_OnTouchEnded) == 0x000008, "Wrong alignment on AthenaPackResource_C_OnTouchEnded");
static_assert(sizeof(AthenaPackResource_C_OnTouchEnded) == 0x0003A8, "Wrong size on AthenaPackResource_C_OnTouchEnded");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, MyGeometry) == 0x000000, "Member 'AthenaPackResource_C_OnTouchEnded::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, InTouchEvent) == 0x000038, "Member 'AthenaPackResource_C_OnTouchEnded::InTouchEvent' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, ReturnValue) == 0x0000A8, "Member 'AthenaPackResource_C_OnTouchEnded::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, Temp_bool_Variable) == 0x000160, "Member 'AthenaPackResource_C_OnTouchEnded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_Unhandled_ReturnValue) == 0x000168, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_Now_ReturnValue) == 0x000220, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0002E0, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_GetTotalMilliseconds_ReturnValue) == 0x0002E8, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_GetTotalMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002EC, "Member 'AthenaPackResource_C_OnTouchEnded::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchEnded, K2Node_Select_Default) == 0x0002F0, "Member 'AthenaPackResource_C_OnTouchEnded::K2Node_Select_Default' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.OnTouchMoved
// 0x03A8 (0x03A8 - 0x0000)
struct AthenaPackResource_C_OnTouchMoved final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB4[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0168(0x00B8)()
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue;         // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB5[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F0(0x00B8)()
};
static_assert(alignof(AthenaPackResource_C_OnTouchMoved) == 0x000008, "Wrong alignment on AthenaPackResource_C_OnTouchMoved");
static_assert(sizeof(AthenaPackResource_C_OnTouchMoved) == 0x0003A8, "Wrong size on AthenaPackResource_C_OnTouchMoved");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, MyGeometry) == 0x000000, "Member 'AthenaPackResource_C_OnTouchMoved::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, InTouchEvent) == 0x000038, "Member 'AthenaPackResource_C_OnTouchMoved::InTouchEvent' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, ReturnValue) == 0x0000A8, "Member 'AthenaPackResource_C_OnTouchMoved::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, Temp_bool_Variable) == 0x000160, "Member 'AthenaPackResource_C_OnTouchMoved::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_Unhandled_ReturnValue) == 0x000168, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_Now_ReturnValue) == 0x000220, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0002E0, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_GetTotalMilliseconds_ReturnValue) == 0x0002E8, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_GetTotalMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002EC, "Member 'AthenaPackResource_C_OnTouchMoved::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchMoved, K2Node_Select_Default) == 0x0002F0, "Member 'AthenaPackResource_C_OnTouchMoved::K2Node_Select_Default' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.UpdateMaxStyle
// 0x0060 (0x0060 - 0x0000)
struct AthenaPackResource_C_UpdateMaxStyle final
{
public:
	struct FSlateColor                            SlateColor;                                        // 0x0000(0x0028)(Parm, OutParm)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB6[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResourceItemMaxStackSize_ReturnValue;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB8[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPackResource_C_UpdateMaxStyle) == 0x000008, "Wrong alignment on AthenaPackResource_C_UpdateMaxStyle");
static_assert(sizeof(AthenaPackResource_C_UpdateMaxStyle) == 0x000060, "Wrong size on AthenaPackResource_C_UpdateMaxStyle");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, SlateColor) == 0x000000, "Member 'AthenaPackResource_C_UpdateMaxStyle::SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_struct_Variable) == 0x000028, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_struct_Variable_1) == 0x000030, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_bool_Variable) == 0x000038, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_byte_Variable) == 0x000039, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_byte_Variable_1) == 0x00003A, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'AthenaPackResource_C_UpdateMaxStyle::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, Temp_bool_Variable_1) == 0x000048, "Member 'AthenaPackResource_C_UpdateMaxStyle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, CallFunc_GetResourceItemMaxStackSize_ReturnValue) == 0x00004C, "Member 'AthenaPackResource_C_UpdateMaxStyle::CallFunc_GetResourceItemMaxStackSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'AthenaPackResource_C_UpdateMaxStyle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, K2Node_Select_Default) == 0x000051, "Member 'AthenaPackResource_C_UpdateMaxStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateMaxStyle, K2Node_Select_Default_1) == 0x000054, "Member 'AthenaPackResource_C_UpdateMaxStyle::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.RefreshLargerCountLayout
// 0x0050 (0x0050 - 0x0000)
struct AthenaPackResource_C_RefreshLargerCountLayout final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_UpdateMaxStyle_SlateColor;                // 0x0008(0x0028)()
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetShorthandItemStackCount_ReturnValue;   // 0x0038(0x0018)()
};
static_assert(alignof(AthenaPackResource_C_RefreshLargerCountLayout) == 0x000008, "Wrong alignment on AthenaPackResource_C_RefreshLargerCountLayout");
static_assert(sizeof(AthenaPackResource_C_RefreshLargerCountLayout) == 0x000050, "Wrong size on AthenaPackResource_C_RefreshLargerCountLayout");
static_assert(offsetof(AthenaPackResource_C_RefreshLargerCountLayout, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'AthenaPackResource_C_RefreshLargerCountLayout::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_RefreshLargerCountLayout, CallFunc_UpdateMaxStyle_SlateColor) == 0x000008, "Member 'AthenaPackResource_C_RefreshLargerCountLayout::CallFunc_UpdateMaxStyle_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_RefreshLargerCountLayout, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaPackResource_C_RefreshLargerCountLayout::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_RefreshLargerCountLayout, CallFunc_GetShorthandItemStackCount_ReturnValue) == 0x000038, "Member 'AthenaPackResource_C_RefreshLargerCountLayout::CallFunc_GetShorthandItemStackCount_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.RefreshSmallerCountLayout
// 0x0028 (0x0028 - 0x0000)
struct AthenaPackResource_C_RefreshSmallerCountLayout final
{
public:
	struct FSlateColor                            CallFunc_UpdateMaxStyle_SlateColor;                // 0x0000(0x0028)()
};
static_assert(alignof(AthenaPackResource_C_RefreshSmallerCountLayout) == 0x000008, "Wrong alignment on AthenaPackResource_C_RefreshSmallerCountLayout");
static_assert(sizeof(AthenaPackResource_C_RefreshSmallerCountLayout) == 0x000028, "Wrong size on AthenaPackResource_C_RefreshSmallerCountLayout");
static_assert(offsetof(AthenaPackResource_C_RefreshSmallerCountLayout, CallFunc_UpdateMaxStyle_SlateColor) == 0x000000, "Member 'AthenaPackResource_C_RefreshSmallerCountLayout::CallFunc_UpdateMaxStyle_SlateColor' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.Change Material
// 0x0008 (0x0008 - 0x0000)
struct AthenaPackResource_C_Change_Material final
{
public:
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPackResource_C_Change_Material) == 0x000008, "Wrong alignment on AthenaPackResource_C_Change_Material");
static_assert(sizeof(AthenaPackResource_C_Change_Material) == 0x000008, "Wrong size on AthenaPackResource_C_Change_Material");
static_assert(offsetof(AthenaPackResource_C_Change_Material, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaPackResource_C_Change_Material::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.OnTouchStarted
// 0x0220 (0x0220 - 0x0000)
struct AthenaPackResource_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(AthenaPackResource_C_OnTouchStarted) == 0x000008, "Wrong alignment on AthenaPackResource_C_OnTouchStarted");
static_assert(sizeof(AthenaPackResource_C_OnTouchStarted) == 0x000220, "Wrong size on AthenaPackResource_C_OnTouchStarted");
static_assert(offsetof(AthenaPackResource_C_OnTouchStarted, MyGeometry) == 0x000000, "Member 'AthenaPackResource_C_OnTouchStarted::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchStarted, InTouchEvent) == 0x000038, "Member 'AthenaPackResource_C_OnTouchStarted::InTouchEvent' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchStarted, ReturnValue) == 0x0000A8, "Member 'AthenaPackResource_C_OnTouchStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchStarted, CallFunc_Now_ReturnValue) == 0x000160, "Member 'AthenaPackResource_C_OnTouchStarted::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_OnTouchStarted, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'AthenaPackResource_C_OnTouchStarted::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.Set ResourceStyle
// 0x0168 (0x0168 - 0x0000)
struct AthenaPackResource_C_Set_ResourceStyle final
{
public:
	bool                                          UseLargeIcon;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBB[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromResource_Brush;              // 0x0048(0x0088)()
	bool                                          CallFunc_MakeBrushFromResource_IsValid;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBC[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromResource_Brush_1;            // 0x00D8(0x0088)()
	bool                                          CallFunc_MakeBrushFromResource_IsValid_1;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPackResource_C_Set_ResourceStyle) == 0x000008, "Wrong alignment on AthenaPackResource_C_Set_ResourceStyle");
static_assert(sizeof(AthenaPackResource_C_Set_ResourceStyle) == 0x000168, "Wrong size on AthenaPackResource_C_Set_ResourceStyle");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, UseLargeIcon) == 0x000000, "Member 'AthenaPackResource_C_Set_ResourceStyle::UseLargeIcon' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'AthenaPackResource_C_Set_ResourceStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000020, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, K2Node_MakeStruct_Margin_1) == 0x000034, "Member 'AthenaPackResource_C_Set_ResourceStyle::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_MakeBrushFromResource_Brush) == 0x000048, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_MakeBrushFromResource_Brush' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_MakeBrushFromResource_IsValid) == 0x0000D0, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_MakeBrushFromResource_IsValid' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_MakeBrushFromResource_Brush_1) == 0x0000D8, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_MakeBrushFromResource_Brush_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_Set_ResourceStyle, CallFunc_MakeBrushFromResource_IsValid_1) == 0x000160, "Member 'AthenaPackResource_C_Set_ResourceStyle::CallFunc_MakeBrushFromResource_IsValid_1' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.TryUpdateCount
// 0x0050 (0x0050 - 0x0000)
struct AthenaPackResource_C_TryUpdateCount final
{
public:
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBD[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldHaveInfiniteResources_ReturnValue;  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBE[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue_1;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPackResource_C_TryUpdateCount) == 0x000008, "Wrong alignment on AthenaPackResource_C_TryUpdateCount");
static_assert(sizeof(AthenaPackResource_C_TryUpdateCount) == 0x000050, "Wrong size on AthenaPackResource_C_TryUpdateCount");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000000, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, K2Node_DynamicCast_AsFort_Pawn) == 0x000008, "Member 'AthenaPackResource_C_TryUpdateCount::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaPackResource_C_TryUpdateCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, K2Node_DynamicCast_AsAthena_Game_State) == 0x000020, "Member 'AthenaPackResource_C_TryUpdateCount::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'AthenaPackResource_C_TryUpdateCount::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_ShouldHaveInfiniteResources_ReturnValue) == 0x000029, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_ShouldHaveInfiniteResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetContext_ReturnValue_1) == 0x000038, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetResourceCount_ReturnValue) == 0x000040, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_GetResourceCount_ReturnValue_1) == 0x000044, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_GetResourceCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateCount, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'AthenaPackResource_C_TryUpdateCount::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.TryUpdateBackground
// 0x0088 (0x0088 - 0x0000)
struct AthenaPackResource_C_TryUpdateBackground final
{
public:
	bool                                          Local_IsResourceActive;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBF[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC0[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC1[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortResourceItemDefinition*            CallFunc_GetCurrentResourceItemDefinition_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC2[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_2;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC3[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortResourceItemDefinition*            CallFunc_GetResourceItemDefinition_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPackResource_C_TryUpdateBackground) == 0x000008, "Wrong alignment on AthenaPackResource_C_TryUpdateBackground");
static_assert(sizeof(AthenaPackResource_C_TryUpdateBackground) == 0x000088, "Wrong size on AthenaPackResource_C_TryUpdateBackground");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Local_IsResourceActive) == 0x000000, "Member 'AthenaPackResource_C_TryUpdateBackground::Local_IsResourceActive' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_bool_Variable) == 0x000001, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_struct_Variable) == 0x000004, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_struct_Variable_1) == 0x00000C, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_bool_Variable_1) == 0x000014, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_class_Variable) == 0x000018, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_class_Variable_1) == 0x000020, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_bool_Variable_2) == 0x000030, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_GetCurrentResourceItemDefinition_ReturnValue) == 0x000038, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_GetCurrentResourceItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_class_Variable_2) == 0x000040, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, Temp_class_Variable_3) == 0x000048, "Member 'AthenaPackResource_C_TryUpdateBackground::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_IsMobileGame_ReturnValue) == 0x000050, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, K2Node_Select_Default) == 0x000058, "Member 'AthenaPackResource_C_TryUpdateBackground::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, K2Node_Select_Default_1) == 0x000060, "Member 'AthenaPackResource_C_TryUpdateBackground::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, K2Node_Select_Default_2) == 0x000068, "Member 'AthenaPackResource_C_TryUpdateBackground::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000070, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_GetResourceItemDefinition_ReturnValue) == 0x000078, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_GetResourceItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_TryUpdateBackground, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'AthenaPackResource_C_TryUpdateBackground::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.UpdateType
// 0x0098 (0x0098 - 0x0000)
struct AthenaPackResource_C_UpdateType final
{
public:
	EFortResourceType                             Param_ResourceType;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromResource_Brush;              // 0x0008(0x0088)()
	bool                                          CallFunc_MakeBrushFromResource_IsValid;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPackResource_C_UpdateType) == 0x000008, "Wrong alignment on AthenaPackResource_C_UpdateType");
static_assert(sizeof(AthenaPackResource_C_UpdateType) == 0x000098, "Wrong size on AthenaPackResource_C_UpdateType");
static_assert(offsetof(AthenaPackResource_C_UpdateType, Param_ResourceType) == 0x000000, "Member 'AthenaPackResource_C_UpdateType::Param_ResourceType' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateType, CallFunc_MakeBrushFromResource_Brush) == 0x000008, "Member 'AthenaPackResource_C_UpdateType::CallFunc_MakeBrushFromResource_Brush' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_UpdateType, CallFunc_MakeBrushFromResource_IsValid) == 0x000090, "Member 'AthenaPackResource_C_UpdateType::CallFunc_MakeBrushFromResource_IsValid' has a wrong offset!");

// Function AthenaPackResource.AthenaPackResource_C.ExecuteUbergraph_AthenaPackResource
// 0x0020 (0x0020 - 0x0000)
struct AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6DC5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource) == 0x000008, "Wrong alignment on AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource");
static_assert(sizeof(AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource) == 0x000020, "Wrong size on AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource");
static_assert(offsetof(AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource, EntryPoint) == 0x000000, "Member 'AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaPackResource_C_ExecuteUbergraph_AthenaPackResource::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
