#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Enemy_Player_SneakySnowman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Enemy_Player_SneakySnowman.Athena_Enemy_Player_SneakySnowman_C
// 0x0070 (0x0C30 - 0x0BC0)
class AAthena_Enemy_Player_SneakySnowman_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_SneakySnowman;                                  // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Effects;                                           // 0x0BD0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71BC[0x3];                                     // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EnemySnowmanHolster;                               // 0x0BD4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71BD[0x4];                                     // 0x0BDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDamage;                                       // 0x0BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71BE[0x4];                                     // 0x0BEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHealth;                                         // 0x0BF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SnowmanDuration;                                   // 0x0C10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Enemy_Player_SneakySnowman(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Enemy_Player_SneakySnowman_C">();
	}
	static class AAthena_Enemy_Player_SneakySnowman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Enemy_Player_SneakySnowman_C>();
	}
};
static_assert(alignof(AAthena_Enemy_Player_SneakySnowman_C) == 0x000008, "Wrong alignment on AAthena_Enemy_Player_SneakySnowman_C");
static_assert(sizeof(AAthena_Enemy_Player_SneakySnowman_C) == 0x000C30, "Wrong size on AAthena_Enemy_Player_SneakySnowman_C");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, UberGraphFrame) == 0x000BC0, "Member 'AAthena_Enemy_Player_SneakySnowman_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, SM_SneakySnowman) == 0x000BC8, "Member 'AAthena_Enemy_Player_SneakySnowman_C::SM_SneakySnowman' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, Effects) == 0x000BD0, "Member 'AAthena_Enemy_Player_SneakySnowman_C::Effects' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, EnemySnowmanHolster) == 0x000BD4, "Member 'AAthena_Enemy_Player_SneakySnowman_C::EnemySnowmanHolster' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, PlayerPawn) == 0x000BE0, "Member 'AAthena_Enemy_Player_SneakySnowman_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, TotalDamage) == 0x000BE8, "Member 'AAthena_Enemy_Player_SneakySnowman_C::TotalDamage' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, MaxHealth) == 0x000BF0, "Member 'AAthena_Enemy_Player_SneakySnowman_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, SnowmanDuration) == 0x000C10, "Member 'AAthena_Enemy_Player_SneakySnowman_C::SnowmanDuration' has a wrong offset!");

}

