#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_ShipReturn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn
// 0x0480 (0x0480 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_638B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0010(0x0020)(ConstParm)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_638C[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_638D[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_638E[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x00C0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_638F[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_PlayerWhoTriggeredObject;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6390[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_HasQuest_PlayerHasQuest;           // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6391[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0188(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_1;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6392[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      Temp_object_Variable;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6393[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_2; // 0x01C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_2;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShouldShowLocally_ShouldShowLocally; // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6394[0x1];                                     // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      K2Node_CustomEvent_OwningQuestManager;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFoundAllQuestsOnProfile;       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6395[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6396[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6397[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_3;                         // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6398[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6399[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639A[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue;           // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639B[0x2];                                     // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_639C[0xC];                                     // 0x02E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_4;                         // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639D[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_1;      // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639E[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0360(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0390(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639F[0x3];                                     // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A0[0x3];                                     // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A1[0x3];                                     // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_3; // 0x0438(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_5;                         // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_2;            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItemDefinition*>       K2Node_MakeArray_Array;                            // 0x0458(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentQuestsReady*    CallFunc_CurrentQuestsReadyAsync_ReturnValue;      // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn) == 0x000010, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn) == 0x000480, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_PlaylistName) == 0x000004, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_PlaylistContextTags) == 0x000010, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000030, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetGameState_ReturnValue) == 0x000040, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000050, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetQuestManager_ReturnValue) == 0x000060, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_OverlappedComponent) == 0x0000A0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_OtherActor) == 0x0000A8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_OtherComp) == 0x0000B0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_OtherBodyIndex) == 0x0000B8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_bFromSweep) == 0x0000BC, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_SweepResult) == 0x0000C0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000150, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_PlayerWhoTriggeredObject) == 0x000158, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_PlayerWhoTriggeredObject' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000160, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetQuestManager_ReturnValue_1) == 0x000170, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000178, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000180, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000181, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_IsValid_ReturnValue) == 0x000182, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Athena_HasQuest_PlayerHasQuest) == 0x000183, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Athena_HasQuest_PlayerHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_IsValid_ReturnValue_1) == 0x000184, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000188, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item_1) == 0x000198, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001A0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001A8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_HasAuthority_ReturnValue) == 0x0001B0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_object_Variable) == 0x0001B8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_bool_Variable) == 0x0001C0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetLocalFortPlayerControllers_ReturnValue_2) == 0x0001C8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetLocalFortPlayerControllers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item_2) == 0x0001D8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved) == 0x0001E0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired) == 0x0001E4, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned) == 0x0001E8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Greater_IntInt_ReturnValue) == 0x0001E9, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_CheckShouldShowLocally_ShouldShowLocally) == 0x0001EA, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_CheckShouldShowLocally_ShouldShowLocally' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_int_Array_Index_Variable) == 0x0001EC, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_OwningQuestManager) == 0x0001F0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_OwningQuestManager' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CustomEvent_bFoundAllQuestsOnProfile) == 0x0001F8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CustomEvent_bFoundAllQuestsOnProfile' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001FC, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000210, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000218, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item_3) == 0x000220, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Location) == 0x000254, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Rotation) == 0x000260, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Scale) == 0x00026C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Less_IntInt_ReturnValue) == 0x000278, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x000280, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_HasAuthority_ReturnValue_1) == 0x000288, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Length_ReturnValue_1) == 0x00028C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Add_VectorVector_ReturnValue) == 0x000290, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00029C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002A8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x0002B8, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetCurrentDayPhase_ReturnValue) == 0x0002C0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetCurrentDayPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_SwitchEnum_CmpSuccess) == 0x0002C1, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002C4, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_int_Array_Index_Variable_1) == 0x0002D0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002D4, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item_4) == 0x0002F0, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Location_1) == 0x000320, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Rotation_1) == 0x00032C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_BreakTransform_Scale_1) == 0x000338, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_SpawnFXSystemAttached_ReturnValue_1) == 0x000348, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_SpawnFXSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_VLerp_ReturnValue) == 0x000350, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_struct_Variable) == 0x000360, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000390, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00041C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_AddComponent_ReturnValue) == 0x000420, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_HasAuthority_ReturnValue_2) == 0x000428, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, Temp_int_Loop_Counter_Variable_1) == 0x00042C, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Less_IntInt_ReturnValue_1) == 0x000430, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Add_IntInt_ReturnValue_1) == 0x000434, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetLocalFortPlayerControllers_ReturnValue_3) == 0x000438, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetLocalFortPlayerControllers_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_Array_Get_Item_5) == 0x000448, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_GetQuestManager_ReturnValue_2) == 0x000450, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_GetQuestManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, K2Node_MakeArray_Array) == 0x000458, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_CurrentQuestsReadyAsync_ReturnValue) == 0x000468, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_CurrentQuestsReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn, CallFunc_IsValid_ReturnValue_2) == 0x000470, "Member 'AthenaQuestActor_SW_ShipReturn_C_ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.ObjectiveSuccessfullyCompleted
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted final
{
public:
	class AActor*                                 PlayerWhoTriggeredObject;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted) == 0x000008, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted, PlayerWhoTriggeredObject) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_ObjectiveSuccessfullyCompleted::PlayerWhoTriggeredObject' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded) == 0x000028, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'AthenaQuestActor_SW_ShipReturn_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.TouchedQuestActor
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor) == 0x0000B0, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, OverlappedComponent) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, OtherActor) == 0x000008, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, OtherComp) == 0x000010, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, OtherBodyIndex) == 0x000018, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, bFromSweep) == 0x00001C, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor, SweepResult) == 0x000020, "Member 'AthenaQuestActor_SW_ShipReturn_C_TouchedQuestActor::SweepResult' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD final
{
public:
	class UFortQuestManager*                      OwningQuestManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFoundAllQuestsOnProfile;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD) == 0x000010, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD, OwningQuestManager) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD::OwningQuestManager' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD, bFoundAllQuestsOnProfile) == 0x000008, "Member 'AthenaQuestActor_SW_ShipReturn_C_OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD::bFoundAllQuestsOnProfile' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript) == 0x000008, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C.CheckShouldShowLocally
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally final
{
public:
	bool                                          ShouldShowLocally;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally");
static_assert(sizeof(AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally) == 0x000030, "Wrong size on AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally");
static_assert(offsetof(AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally, ShouldShowLocally) == 0x000000, "Member 'AthenaQuestActor_SW_ShipReturn_C_CheckShouldShowLocally::ShouldShowLocally' has a wrong offset!");
