#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationSlotButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.HandleWidthChanged
// 0x0070 (0x0070 - 0x0000)
struct AthenaCustomizationSlotButton_C_HandleWidthChanged final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWidthExceedsThreshold;                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41C3[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41C4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0020(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_HandleWidthChanged) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_HandleWidthChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_HandleWidthChanged) == 0x000070, "Wrong size on AthenaCustomizationSlotButton_C_HandleWidthChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, Width) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::Width' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, bWidthExceedsThreshold) == 0x000004, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::bWidthExceedsThreshold' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, Temp_bool_Variable) == 0x000005, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, Temp_int_Variable) == 0x000008, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, Temp_int_Variable_1) == 0x00000C, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, K2Node_Select_Default) == 0x000014, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleWidthChanged, K2Node_MakeStruct_SlateFontInfo) == 0x000020, "Member 'AthenaCustomizationSlotButton_C_HandleWidthChanged::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.GetSlotDebugName
// 0x0050 (0x0050 - 0x0000)
struct AthenaCustomizationSlotButton_C_GetSlotDebugName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_GetSlotDebugName) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_GetSlotDebugName");
static_assert(sizeof(AthenaCustomizationSlotButton_C_GetSlotDebugName) == 0x000050, "Wrong size on AthenaCustomizationSlotButton_C_GetSlotDebugName");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, ReturnValue) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.HandleActiveStateChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationSlotButton_C_HandleActiveStateChanged final
{
public:
	bool                                          CosmeticAvailable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlotFilled_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged) == 0x000001, "Wrong alignment on AthenaCustomizationSlotButton_C_HandleActiveStateChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged) == 0x000008, "Wrong size on AthenaCustomizationSlotButton_C_HandleActiveStateChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CosmeticAvailable) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Active) == 0x000001, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Active' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_byte_Variable) == 0x000002, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_byte_Variable_1) == 0x000003, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_bool_Variable) == 0x000004, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CallFunc_IsSlotFilled_ReturnValue) == 0x000005, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CallFunc_IsSlotFilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, K2Node_Select_Default) == 0x000007, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.OnCustomizationSlotActiveStateChanged
// 0x0002 (0x0002 - 0x0000)
struct AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged final
{
public:
	bool                                          bInAttachableCosmeticAvailable;                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInActive;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged) == 0x000001, "Wrong alignment on AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged) == 0x000002, "Wrong size on AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged, bInAttachableCosmeticAvailable) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged::bInAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged, bInActive) == 0x000001, "Member 'AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged::bInActive' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.OnCardImageAndWidthChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged final
{
public:
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged) == 0x000030, "Wrong size on AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged, Image) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged::Image' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged, Width) == 0x000028, "Member 'AthenaCustomizationSlotButton_C_OnCardImageAndWidthChanged::Width' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.ExecuteUbergraph_AthenaCustomizationSlotButton
// 0x0048 (0x0048 - 0x0000)
struct AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutActive; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41C5[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_Image;                                // 0x0008(0x0028)(ConstParm, HasGetValueTypeHash)
	float                                         K2Node_Event_Width;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInAttachableCosmeticAvailable;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInActive;                            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton");
static_assert(sizeof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton) == 0x000048, "Wrong size on AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, EntryPoint) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable) == 0x000004, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, CallFunc_GetCustomizationSlotActiveState_bOutActive) == 0x000005, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::CallFunc_GetCustomizationSlotActiveState_bOutActive' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_Image) == 0x000008, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_Image' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_Width) == 0x000030, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_Width' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_bInAttachableCosmeticAvailable) == 0x000040, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_bInAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_bInActive) == 0x000041, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_bInActive' has a wrong offset!");

}

