#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding_GasTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Athena_Prop_BurstReaction_Exploding_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_BurstReaction_Exploding_GasTank.Athena_Prop_BurstReaction_Exploding_GasTank_C
// 0x0028 (0x0DD0 - 0x0DA8)
class AAthena_Prop_BurstReaction_Exploding_GasTank_C final : public AAthena_Prop_BurstReaction_Exploding_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C; // 0x0DA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_InternalFire2;                                   // 0x0DB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Fire1;                                           // 0x0DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_InternalFire;                                    // 0x0DC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Fire;                                            // 0x0DC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding_GasTank(int32 EntryPoint);
	void FireEffect(const struct FVector& HitLocation);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_BurstReaction_Exploding_GasTank_C">();
	}
	static class AAthena_Prop_BurstReaction_Exploding_GasTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_BurstReaction_Exploding_GasTank_C>();
	}
};
static_assert(alignof(AAthena_Prop_BurstReaction_Exploding_GasTank_C) == 0x000008, "Wrong alignment on AAthena_Prop_BurstReaction_Exploding_GasTank_C");
static_assert(sizeof(AAthena_Prop_BurstReaction_Exploding_GasTank_C) == 0x000DD0, "Wrong size on AAthena_Prop_BurstReaction_Exploding_GasTank_C");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C) == 0x000DA8, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::UberGraphFrame_Athena_Prop_BurstReaction_Exploding_GasTank_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_InternalFire2) == 0x000DB0, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_InternalFire2' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_Fire1) == 0x000DB8, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_Fire1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_InternalFire) == 0x000DC0, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_InternalFire' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_GasTank_C, P_Fire) == 0x000DC8, "Member 'AAthena_Prop_BurstReaction_Exploding_GasTank_C::P_Fire' has a wrong offset!");

}

