#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDTile.AthenaMOTDTile_C
// 0x0088 (0x0C48 - 0x0BC0)
class UAthenaMOTDTile_C final : public UFortAthenaMOTDTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Details;                                    // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_PipDisplay;                                 // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ClickCatcher;                                // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LoadSwitcher;                                      // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowImageOnly;                                    // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA5[0x3];                                     // 0x0C31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewPipCount;                                   // 0x0C34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoveredChanged;                                  // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateDisplay();
	void ShowImageOnly();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_AthenaMOTDTile(int32 EntryPoint);
	void OnHoveredChanged__DelegateSignature(bool NewIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDTile_C">();
	}
	static class UAthenaMOTDTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDTile_C>();
	}
};
static_assert(alignof(UAthenaMOTDTile_C) == 0x000008, "Wrong alignment on UAthenaMOTDTile_C");
static_assert(sizeof(UAthenaMOTDTile_C) == 0x000C48, "Wrong size on UAthenaMOTDTile_C");
static_assert(offsetof(UAthenaMOTDTile_C, UberGraphFrame) == 0x000BC0, "Member 'UAthenaMOTDTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHovered) == 0x000BC8, "Member 'UAthenaMOTDTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Intro) == 0x000BD0, "Member 'UAthenaMOTDTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_Details) == 0x000BD8, "Member 'UAthenaMOTDTile_C::Border_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_PipDisplay) == 0x000BE0, "Member 'UAthenaMOTDTile_C::Border_PipDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, CommonLoadGuard_0) == 0x000BE8, "Member 'UAthenaMOTDTile_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Fill) == 0x000BF0, "Member 'UAthenaMOTDTile_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_196) == 0x000BF8, "Member 'UAthenaMOTDTile_C::Image_196' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_ClickCatcher) == 0x000C00, "Member 'UAthenaMOTDTile_C::Image_ClickCatcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImage) == 0x000C08, "Member 'UAthenaMOTDTile_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImageOvr) == 0x000C10, "Member 'UAthenaMOTDTile_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadSwitcher) == 0x000C18, "Member 'UAthenaMOTDTile_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, NewsItemScale) == 0x000C20, "Member 'UAthenaMOTDTile_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, SizeBox_Tile) == 0x000C28, "Member 'UAthenaMOTDTile_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, bShowImageOnly) == 0x000C30, "Member 'UAthenaMOTDTile_C::bShowImageOnly' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, PreviewPipCount) == 0x000C34, "Member 'UAthenaMOTDTile_C::PreviewPipCount' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHoveredChanged) == 0x000C38, "Member 'UAthenaMOTDTile_C::OnHoveredChanged' has a wrong offset!");

}

