#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapNavigableIconSingleChallenge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMapNavigableIconSingleChallenge.AthenaMapNavigableIconSingleChallenge_C
// 0x0068 (0x0338 - 0x02D0)
class UAthenaMapNavigableIconSingleChallenge_C final : public UAthenaMapNavigableIconSingleChallenge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelectAnimMinusFromHover;                        // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlareMinusLoop;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnStartAnim;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectAnim;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack_Count;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Bang;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Complete;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Flare;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ShadowFor3dMap;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_13;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               DefaultIcon;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetMaterialState(bool Complete, bool Locked, bool HasIconOverride);
	void OnChallengeSet(bool bIsComplete, bool bIsLocked, bool bHasIconOverride, float Progress, bool bShouldShowBang);
	void OnChallengeReset();
	void OnSetHasLocation(bool bHasLocation);
	void OnBeginIntroAnimation();
	void OnSetIsInGame(bool bIsInGame);
	void OnChallengeIconOverriden(const class UTexture2D* Icon);
	void OnSelected(bool bUserInteraction);
	void OnUnselected(bool bUserInteraction);
	void OnHovered(bool bUserInteraction);
	void OnUnhovered(bool bUserInteraction);
	void OnChangeBangVisibility(bool bShouldShow);
	void Construct();
	void Play_Start_Animation();
	void ExecuteUbergraph_AthenaMapNavigableIconSingleChallenge(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMapNavigableIconSingleChallenge_C">();
	}
	static class UAthenaMapNavigableIconSingleChallenge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapNavigableIconSingleChallenge_C>();
	}
};
static_assert(alignof(UAthenaMapNavigableIconSingleChallenge_C) == 0x000008, "Wrong alignment on UAthenaMapNavigableIconSingleChallenge_C");
static_assert(sizeof(UAthenaMapNavigableIconSingleChallenge_C) == 0x000338, "Wrong size on UAthenaMapNavigableIconSingleChallenge_C");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, UberGraphFrame) == 0x0002D0, "Member 'UAthenaMapNavigableIconSingleChallenge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, OnSelectAnimMinusFromHover) == 0x0002D8, "Member 'UAthenaMapNavigableIconSingleChallenge_C::OnSelectAnimMinusFromHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, OnHover) == 0x0002E0, "Member 'UAthenaMapNavigableIconSingleChallenge_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, FlareMinusLoop) == 0x0002E8, "Member 'UAthenaMapNavigableIconSingleChallenge_C::FlareMinusLoop' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, OnStartAnim) == 0x0002F0, "Member 'UAthenaMapNavigableIconSingleChallenge_C::OnStartAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, OnSelectAnim) == 0x0002F8, "Member 'UAthenaMapNavigableIconSingleChallenge_C::OnSelectAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, CommonText_Stack_Count) == 0x000300, "Member 'UAthenaMapNavigableIconSingleChallenge_C::CommonText_Stack_Count' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, Image_Bang) == 0x000308, "Member 'UAthenaMapNavigableIconSingleChallenge_C::Image_Bang' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, Image_Complete) == 0x000310, "Member 'UAthenaMapNavigableIconSingleChallenge_C::Image_Complete' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, Image_Flare) == 0x000318, "Member 'UAthenaMapNavigableIconSingleChallenge_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, Image_ShadowFor3dMap) == 0x000320, "Member 'UAthenaMapNavigableIconSingleChallenge_C::Image_ShadowFor3dMap' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, SizeBox_13) == 0x000328, "Member 'UAthenaMapNavigableIconSingleChallenge_C::SizeBox_13' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconSingleChallenge_C, DefaultIcon) == 0x000330, "Member 'UAthenaMapNavigableIconSingleChallenge_C::DefaultIcon' has a wrong offset!");

}

