#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_CB3_QuestB

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.ExecuteUbergraph_AthenaQuestActor_CB3_QuestB
// 0x03F0 (0x03F0 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_857C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_857D[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0060(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_857E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_857F[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_ComponentBoundEvent_PlayerController_1;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue;  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_1; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8580[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00C8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0168(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue_1;          // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0238(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x02C4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PC_1;                           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8581[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue_1;         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PC;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8582[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x0380(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8583[0x4];                                     // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8584[0x6];                                     // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_PlayerController;               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8585[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_ComponentBoundEvent_PlayerController;       // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8586[0x6];                                     // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB) == 0x0003F0, "Wrong size on AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000004, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000028, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, Temp_int_Array_Index_Variable) == 0x000050, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_Event_InteractingPawn) == 0x000058, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_Event_InteractionBeingAttempted) == 0x000060, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000068, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x000070, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue) == 0x000074, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000078, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000081, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_ComponentBoundEvent_PlayerController_1) == 0x000088, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_ComponentBoundEvent_PlayerController_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SetCompHiddenControllerOnly_ReturnValue) == 0x000090, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SetCompHiddenControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SetCompHiddenControllerOnly_ReturnValue_1) == 0x000091, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SetCompHiddenControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000094, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_X) == 0x0000A0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Lerp_ReturnValue) == 0x0000AC, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000BC, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000C8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000154, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000160, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000168, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, Temp_int_Loop_Counter_Variable) == 0x0001F4, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Add_IntInt_ReturnValue) == 0x0001F8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0001FC, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_X_1) == 0x000208, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_Y_1) == 0x00020C, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_BreakVector_Z_1) == 0x000210, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Lerp_ReturnValue_1) == 0x000214, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_MakeVector_ReturnValue_1) == 0x000218, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000224, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SpawnFXAtLocation_ReturnValue_1) == 0x000230, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SpawnFXAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000238, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_K2_SetWorldLocation_SweepHitResult_3) == 0x0002C4, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_K2_SetWorldLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetGameStateAthena_ReturnValue) == 0x000350, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_CustomEvent_PC_1) == 0x000358, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_CustomEvent_PC_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_IsValid_ReturnValue) == 0x000360, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetGameStateAthena_ReturnValue_1) == 0x000368, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetGameStateAthena_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_CustomEvent_PC) == 0x000370, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_CustomEvent_PC' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_IsValid_ReturnValue_1) == 0x000378, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x000380, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Array_Get_Item) == 0x000390, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Array_Length_ReturnValue) == 0x000398, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0003A0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_Less_IntInt_ReturnValue) == 0x0003A8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_OnSameTeam_ReturnValue) == 0x0003A9, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_CustomEvent_PlayerController) == 0x0003B0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x0003B8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_DynamicCast_bSuccess_1) == 0x0003C0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, K2Node_ComponentBoundEvent_PlayerController) == 0x0003C8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::K2Node_ComponentBoundEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_GetQuestManager_ReturnValue) == 0x0003D0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0003D8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0003D9, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x0003E0, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x0003E8, "Member 'AthenaQuestActor_CB3_QuestB_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestB::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature, PlayerController) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature::PlayerController' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.CompleteInteraction
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_CompleteInteraction final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_CompleteInteraction) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_CompleteInteraction");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_CompleteInteraction) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestB_C_CompleteInteraction");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_CompleteInteraction, PlayerController) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_CompleteInteraction::PlayerController' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.DisplayMessage_Launch
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch, PC) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_DisplayMessage_Launch::PC' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.DisplayMessage_NeedMetal
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal, PC) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_DisplayMessage_NeedMetal::PC' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature, PlayerController) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature::PlayerController' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.BlueprintCanInteract
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8587[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_HasQuest_PlayerHasQuest;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8588[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract) == 0x000030, "Wrong size on AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, CallFunc_Athena_HasQuest_PlayerHasQuest) == 0x000018, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::CallFunc_Athena_HasQuest_PlayerHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000020, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000028, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8589[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString");
static_assert(sizeof(AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestB_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
