#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_Bush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_Player_Bush.Athena_Player_Bush_C.ExecuteUbergraph_Athena_Player_Bush
// 0x0208 (0x0208 - 0x0000)
struct Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0018(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0044(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621E[0x2];                                     // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621F[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0108(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0134(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01D0(0x0018)()
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6220[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_CheckInstIsOwner_Owner;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6221[0x2];                                     // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush) == 0x000008, "Wrong alignment on Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush");
static_assert(sizeof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush) == 0x000208, "Wrong size on Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, EntryPoint) == 0x000000, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_Damage) == 0x000010, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_DamageTags) == 0x000018, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_Momentum) == 0x000038, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_HitInfo) == 0x000044, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_InstigatedBy) == 0x0000D0, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_DamageCauser) == 0x0000D8, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_EffectContext) == 0x0000E0, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_GetActorTeam_ReturnValue) == 0x0000F9, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000FC, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000100, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_Damage_1) == 0x000104, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_DamageTags_1) == 0x000108, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_Momentum_1) == 0x000128, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_HitInfo_1) == 0x000134, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_InstigatedBy_1) == 0x0001C0, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_DamageCauser_1) == 0x0001C8, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, K2Node_Event_EffectContext_1) == 0x0001D0, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_OnSameTeam_ReturnValue) == 0x0001E8, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_CheckInstIsOwner_Owner) == 0x0001F0, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_CheckInstIsOwner_Owner' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_Not_PreBool_ReturnValue) == 0x0001F8, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001F9, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001FC, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_BooleanOR_ReturnValue) == 0x000200, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush, CallFunc_BooleanOR_ReturnValue_1) == 0x000201, "Member 'Athena_Player_Bush_C_ExecuteUbergraph_Athena_Player_Bush::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function Athena_Player_Bush.Athena_Player_Bush_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct Athena_Player_Bush_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6222[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Player_Bush_C_OnDeathServer) == 0x000008, "Wrong alignment on Athena_Player_Bush_C_OnDeathServer");
static_assert(sizeof(Athena_Player_Bush_C_OnDeathServer) == 0x0000E8, "Wrong size on Athena_Player_Bush_C_OnDeathServer");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, Damage) == 0x000000, "Member 'Athena_Player_Bush_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Athena_Player_Bush_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, Momentum) == 0x000028, "Member 'Athena_Player_Bush_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, HitInfo) == 0x000034, "Member 'Athena_Player_Bush_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'Athena_Player_Bush_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'Athena_Player_Bush_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'Athena_Player_Bush_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function Athena_Player_Bush.Athena_Player_Bush_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct Athena_Player_Bush_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6223[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Player_Bush_C_OnDamageServer) == 0x000008, "Wrong alignment on Athena_Player_Bush_C_OnDamageServer");
static_assert(sizeof(Athena_Player_Bush_C_OnDamageServer) == 0x0000E8, "Wrong size on Athena_Player_Bush_C_OnDamageServer");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, Damage) == 0x000000, "Member 'Athena_Player_Bush_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, DamageTags) == 0x000008, "Member 'Athena_Player_Bush_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, Momentum) == 0x000028, "Member 'Athena_Player_Bush_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, HitInfo) == 0x000034, "Member 'Athena_Player_Bush_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'Athena_Player_Bush_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'Athena_Player_Bush_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'Athena_Player_Bush_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function Athena_Player_Bush.Athena_Player_Bush_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Athena_Player_Bush_C_UserConstructionScript final
{
public:
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Player_Bush_C_UserConstructionScript) == 0x000008, "Wrong alignment on Athena_Player_Bush_C_UserConstructionScript");
static_assert(sizeof(Athena_Player_Bush_C_UserConstructionScript) == 0x000010, "Wrong size on Athena_Player_Bush_C_UserConstructionScript");
static_assert(offsetof(Athena_Player_Bush_C_UserConstructionScript, CallFunc_GetInstigator_ReturnValue) == 0x000000, "Member 'Athena_Player_Bush_C_UserConstructionScript::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_UserConstructionScript, CallFunc_GetActorTeam_ReturnValue) == 0x000008, "Member 'Athena_Player_Bush_C_UserConstructionScript::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

// Function Athena_Player_Bush.Athena_Player_Bush_C.CheckInstIsOwner
// 0x0040 (0x0040 - 0x0000)
struct Athena_Player_Bush_C_CheckInstIsOwner final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6224[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6225[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Player_Bush_C_CheckInstIsOwner) == 0x000008, "Wrong alignment on Athena_Player_Bush_C_CheckInstIsOwner");
static_assert(sizeof(Athena_Player_Bush_C_CheckInstIsOwner) == 0x000040, "Wrong size on Athena_Player_Bush_C_CheckInstIsOwner");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, DamageCauser) == 0x000000, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, Param_Owner) == 0x000008, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::Param_Owner' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, Temp_bool_Variable) == 0x000010, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, K2Node_DynamicCast_AsFort_Weapon) == 0x000020, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::K2Node_DynamicCast_AsFort_Weapon' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Player_Bush_C_CheckInstIsOwner, K2Node_Select_Default) == 0x000038, "Member 'Athena_Player_Bush_C_CheckInstIsOwner::K2Node_Select_Default' has a wrong offset!");

}

