#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_Donut_UnicornFloaty

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8496[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_Event_FortPlayerController;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestObjectiveInfo*                K2Node_Event_ObjectiveInfo;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_Event_PCOverrideForVisualTesting;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty) == 0x000030, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, K2Node_Event_FortPlayerController) == 0x000008, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::K2Node_Event_FortPlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, K2Node_Event_ObjectiveInfo) == 0x000010, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::K2Node_Event_ObjectiveInfo' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, K2Node_Event_PCOverrideForVisualTesting) == 0x000018, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::K2Node_Event_PCOverrideForVisualTesting' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000020, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty, CallFunc_SetCompHiddenControllerOnly_ReturnValue) == 0x000028, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_ExecuteUbergraph_AthenaQuestActor_Donut_UnicornFloaty::CallFunc_SetCompHiddenControllerOnly_ReturnValue' has a wrong offset!");

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.OnObjectiveCompleteForPlayer
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer final
{
public:
	class UFortQuestObjectiveInfo*                ObjectiveInfo;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  PCOverrideForVisualTesting;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer) == 0x000010, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer, ObjectiveInfo) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer::ObjectiveInfo' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer, PCOverrideForVisualTesting) == 0x000008, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_OnObjectiveCompleteForPlayer::PCOverrideForVisualTesting' has a wrong offset!");

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.OnQuestEnabledForPlayer
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer final
{
public:
	class AFortPlayerController*                  FortPlayerController;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer) == 0x000008, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer, FortPlayerController) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_OnQuestEnabledForPlayer::FortPlayerController' has a wrong offset!");

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.SetAdditionalQuestsRequiredOnProfile
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile final
{
public:
	TArray<class UFortQuestItemDefinition*>       Param_QuestsRequiredOnProfile;                     // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile) == 0x000010, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile, Param_QuestsRequiredOnProfile) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetAdditionalQuestsRequiredOnProfile::Param_QuestsRequiredOnProfile' has a wrong offset!");

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.SetPrimitiveGroupsToHide
// 0x0050 (0x0050 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide final
{
public:
	TArray<class UPrimitiveComponent*>            Param_PrimitivesToHideByDefault;                   // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            Param_PrimitivesToShowIfQuestComplete;             // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            Param_PrimitivesToShowIfQuestInProgress;           // 0x0020(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide) == 0x000050, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide, Param_PrimitivesToHideByDefault) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide::Param_PrimitivesToHideByDefault' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide, Param_PrimitivesToShowIfQuestComplete) == 0x000010, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide::Param_PrimitivesToShowIfQuestComplete' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide, Param_PrimitivesToShowIfQuestInProgress) == 0x000020, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide::Param_PrimitivesToShowIfQuestInProgress' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide, K2Node_MakeArray_Array) == 0x000030, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide, K2Node_MakeArray_Array_1) == 0x000040, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_SetPrimitiveGroupsToHide::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function AthenaQuestActor_Donut_UnicornFloaty.AthenaQuestActor_Donut_UnicornFloaty_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8497[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString");
static_assert(sizeof(AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'AthenaQuestActor_Donut_UnicornFloaty_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

}

