#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_P3_Install

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BGA_BaseQuestObject_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_SW_P3_Install.AthenaQuestActor_SW_P3_Install_C
// 0x0048 (0x0818 - 0x07D0)
class AAthenaQuestActor_SW_P3_Install_C final : public ABGA_BaseQuestObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuestActor_SW_P3_Install_C;   // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Quest_SWShip_Open_SidePanel1;                    // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Quest_SWShip_Open_SidePanel;                     // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_0_Location_Offset_2_9AFA245543E39FCDA0857EB46E7A6492; // 0x07F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Scale_9AFA245543E39FCDA0857EB46E7A6492; // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9AFA245543E39FCDA0857EB46E7A6492; // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D5E[0x7];                                     // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TestVisuals;                                       // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaQuestActor_SW_P3_Install(int32 EntryPoint);
	void CompleteInteraction(class AFortPlayerController* PC);
	void Test();
	void HandleQuestComponentSuccessEvent(class AFortPlayerController* Player);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_SW_P3_Install_C">();
	}
	static class AAthenaQuestActor_SW_P3_Install_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_SW_P3_Install_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_SW_P3_Install_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_SW_P3_Install_C");
static_assert(sizeof(AAthenaQuestActor_SW_P3_Install_C) == 0x000818, "Wrong size on AAthenaQuestActor_SW_P3_Install_C");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, UberGraphFrame_AthenaQuestActor_SW_P3_Install_C) == 0x0007D0, "Member 'AAthenaQuestActor_SW_P3_Install_C::UberGraphFrame_AthenaQuestActor_SW_P3_Install_C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, Sphere) == 0x0007D8, "Member 'AAthenaQuestActor_SW_P3_Install_C::Sphere' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, S_Quest_SWShip_Open_SidePanel1) == 0x0007E0, "Member 'AAthenaQuestActor_SW_P3_Install_C::S_Quest_SWShip_Open_SidePanel1' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, S_Quest_SWShip_Open_SidePanel) == 0x0007E8, "Member 'AAthenaQuestActor_SW_P3_Install_C::S_Quest_SWShip_Open_SidePanel' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, Timeline_0_Location_Offset_2_9AFA245543E39FCDA0857EB46E7A6492) == 0x0007F0, "Member 'AAthenaQuestActor_SW_P3_Install_C::Timeline_0_Location_Offset_2_9AFA245543E39FCDA0857EB46E7A6492' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, Timeline_0_Scale_9AFA245543E39FCDA0857EB46E7A6492) == 0x0007FC, "Member 'AAthenaQuestActor_SW_P3_Install_C::Timeline_0_Scale_9AFA245543E39FCDA0857EB46E7A6492' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, Timeline_0__Direction_9AFA245543E39FCDA0857EB46E7A6492) == 0x000800, "Member 'AAthenaQuestActor_SW_P3_Install_C::Timeline_0__Direction_9AFA245543E39FCDA0857EB46E7A6492' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, Timeline_0) == 0x000808, "Member 'AAthenaQuestActor_SW_P3_Install_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P3_Install_C, TestVisuals) == 0x000810, "Member 'AAthenaQuestActor_SW_P3_Install_C::TestVisuals' has a wrong offset!");

}

