#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatsPartial

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.ExecuteUbergraph_AthenaMatchStatsPartial
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial) == 0x000004, "Wrong alignment on AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial");
static_assert(sizeof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial) == 0x000004, "Wrong size on AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial");
static_assert(offsetof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial, EntryPoint) == 0x000000, "Member 'AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial::EntryPoint' has a wrong offset!");

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.SetMatchReport
// 0x0088 (0x0088 - 0x0000)
struct AthenaMatchStatsPartial_C_SetMatchReport final
{
public:
	class UAthenaPlayerMatchReport*               Report;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E28[0x2];                                      // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_E29[0x4];                                      // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2A[0x3];                                      // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMatchStatsPartial_C_SetMatchReport) == 0x000008, "Wrong alignment on AthenaMatchStatsPartial_C_SetMatchReport");
static_assert(sizeof(AthenaMatchStatsPartial_C_SetMatchReport) == 0x000088, "Wrong size on AthenaMatchStatsPartial_C_SetMatchReport");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, Report) == 0x000000, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::Report' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000058, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate_4) == 0x000064, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate_5) == 0x000074, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.OnStatsAvailable
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchStatsPartial_C_OnStatsAvailable final
{
public:
	class UAthenaProfileStatContext*              CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMatchStatView*                   CallFunc_CreateCurrentMatchStatView_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchStatsPartial_C_OnStatsAvailable) == 0x000008, "Wrong alignment on AthenaMatchStatsPartial_C_OnStatsAvailable");
static_assert(sizeof(AthenaMatchStatsPartial_C_OnStatsAvailable) == 0x000018, "Wrong size on AthenaMatchStatsPartial_C_OnStatsAvailable");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnStatsAvailable, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaMatchStatsPartial_C_OnStatsAvailable::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnStatsAvailable, CallFunc_CreateCurrentMatchStatView_ReturnValue) == 0x000008, "Member 'AthenaMatchStatsPartial_C_OnStatsAvailable::CallFunc_CreateCurrentMatchStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnStatsAvailable, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AthenaMatchStatsPartial_C_OnStatsAvailable::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.OnTeamStatsAvailable
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaMatchStatsPartial_C_OnTeamStatsAvailable final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable) == 0x000008, "Wrong alignment on AthenaMatchStatsPartial_C_OnTeamStatsAvailable");
static_assert(sizeof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable) == 0x0000A8, "Wrong size on AthenaMatchStatsPartial_C_OnTeamStatsAvailable");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeStruct_FormatArgumentData_1) == 0x000040, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeArray_Array) == 0x000080, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, CallFunc_Format_ReturnValue) == 0x000090, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::CallFunc_Format_ReturnValue' has a wrong offset!");

}

