#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaContextualChallengesWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaContextualChallengesWidget_BP.AthenaContextualChallengesWidget_BP_C
// 0x0048 (0x0388 - 0x0340)
class UAthenaContextualChallengesWidget_BP_C final : public UAthenaContextualChallengesWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleAnimations;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ExpirationTimer;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   OriginalHeaderText;                                // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   IntroAnim;                                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IntroAnimReverse;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearActiveContent();
	void HasChallengesToDisplay(bool* bHasChallenges);
	void FinishOutro();
	void StartIntro();
	void StartOutroDelay();
	void BP_WidgetIsFinished();
	void BP_OnWidgetActivated();
	void Construct();
	void OnNewContextualHeader(const class FText& NewText);
	void OnResetOutroDelay();
	void ExecuteUbergraph_AthenaContextualChallengesWidget_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaContextualChallengesWidget_BP_C">();
	}
	static class UAthenaContextualChallengesWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaContextualChallengesWidget_BP_C>();
	}
};
static_assert(alignof(UAthenaContextualChallengesWidget_BP_C) == 0x000008, "Wrong alignment on UAthenaContextualChallengesWidget_BP_C");
static_assert(sizeof(UAthenaContextualChallengesWidget_BP_C) == 0x000388, "Wrong size on UAthenaContextualChallengesWidget_BP_C");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, UberGraphFrame) == 0x000340, "Member 'UAthenaContextualChallengesWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, Intro) == 0x000348, "Member 'UAthenaContextualChallengesWidget_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, SimpleAnimations) == 0x000350, "Member 'UAthenaContextualChallengesWidget_BP_C::SimpleAnimations' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, ExpirationTimer) == 0x000358, "Member 'UAthenaContextualChallengesWidget_BP_C::ExpirationTimer' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, OriginalHeaderText) == 0x000360, "Member 'UAthenaContextualChallengesWidget_BP_C::OriginalHeaderText' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, IntroAnim) == 0x000378, "Member 'UAthenaContextualChallengesWidget_BP_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengesWidget_BP_C, IntroAnimReverse) == 0x000380, "Member 'UAthenaContextualChallengesWidget_BP_C::IntroAnimReverse' has a wrong offset!");

}

