#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAquisitionStyleScreen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.ViewVaultItemWithBackpack
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack final
{
public:
	class UFortItemDefinition*                    Param_ItemToRepresent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      StrongItemsToRepresent;                            // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73E3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCharacterItemDefinition*         K2Node_DynamicCast_AsAthena_Character_Item_Definition; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E4[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCharacterItemDefinition*         K2Node_DynamicCast_AsAthena_Character_Item_Definition_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E5[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      CallFunc_GetGrantedItems_Items;                    // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E6[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E7[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack) == 0x0000A0, "Wrong size on AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, Param_ItemToRepresent) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::Param_ItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, StrongItemToRepresent) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::StrongItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, StrongItemsToRepresent) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::StrongItemsToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, Temp_int_Array_Index_Variable) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_GetContext_ReturnValue_1) == 0x000038, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, K2Node_DynamicCast_AsAthena_Character_Item_Definition) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::K2Node_DynamicCast_AsAthena_Character_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, K2Node_DynamicCast_AsAthena_Character_Item_Definition_1) == 0x000050, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::K2Node_DynamicCast_AsAthena_Character_Item_Definition_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_GetOfferInfo_ReturnValue) == 0x000060, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_GetGrantedItems_Items) == 0x000068, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_GetGrantedItems_Items' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Array_Get_Item) == 0x000078, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000088, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000094, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Array_AddUnique_ReturnValue) == 0x000098, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00009C, "Member 'AthenaDirectAquisitionStyleScreen_C_ViewVaultItemWithBackpack::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.SetupCharacterItem
// 0x0070 (0x0070 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73E8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      CallFunc_GetGrantedItems_Items;                    // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FFortItemQuantityPair                  CallFunc_GetGrantedItemQuantityPair_ItemQuantity;  // 0x0028(0x0014)(NoDestructor)
	bool                                          CallFunc_GetGrantedItemQuantityPair_ReturnValue;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E9[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73EA[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionFromItemQuantityPair_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73EB[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCharacterItemDefinition*         K2Node_DynamicCast_AsAthena_Character_Item_Definition; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73EC[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem) == 0x000070, "Wrong size on AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_GetGrantedItems_Items) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_GetGrantedItems_Items' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_GetGrantedItemQuantityPair_ItemQuantity) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_GetGrantedItemQuantityPair_ItemQuantity' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_GetGrantedItemQuantityPair_ReturnValue) == 0x00003C, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_GetGrantedItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_GetItemDefinitionFromItemQuantityPair_ReturnValue) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_GetItemDefinitionFromItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, K2Node_DynamicCast_AsAthena_Character_Item_Definition) == 0x000058, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::K2Node_DynamicCast_AsAthena_Character_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000068, "Member 'AthenaDirectAquisitionStyleScreen_C_SetupCharacterItem::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.GetOfferGrantedItemDef
// 0x0020 (0x0020 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef final
{
public:
	class UFortAccountItemDefinition*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73ED[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetGrantedItemDefinition_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef) == 0x000020, "Wrong size on AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, ReturnValue) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_GetGrantedItemDefinition_ReturnValue) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_GetGrantedItemDefinition_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.RebuildStylesFromOffer
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer final
{
public:
	class UAthenaCosmeticItemDefinition*          CosmeticDef;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetOfferGrantedItemDef_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMcpVariantChannelInfo>         CallFunc_GetDefaultVariantChannels_OutDefaultVariantData; // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer) == 0x000030, "Wrong size on AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CosmeticDef) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CosmeticDef' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_GetOfferGrantedItemDef_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_GetOfferGrantedItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_GetDefaultVariantChannels_OutDefaultVariantData) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_GetDefaultVariantChannels_OutDefaultVariantData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_TextIsEmpty_ReturnValue) == 0x00002A, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.SwitchToNextItemInOffer
// 0x0014 (0x0014 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer) == 0x000004, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer) == 0x000014, "Wrong size on AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, Direction) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::Direction' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.ScanOfferForVariants
// 0x0050 (0x0050 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73EE[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73EF[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73F0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetGrantedItemDefinition_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGrantedItems_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73F1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasModifiableVariants_ReturnValue;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants) == 0x000050, "Wrong size on AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_int_Variable) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_byte_Variable) == 0x00000C, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_byte_Variable_1) == 0x00000D, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_bool_Variable) == 0x000014, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_Select_Default) == 0x00001C, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetOfferInfo_ReturnValue) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetGrantedItemDefinition_ReturnValue) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetGrantedItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetNumGrantedItems_ReturnValue) == 0x000030, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetNumGrantedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000038, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_HasModifiableVariants_ReturnValue) == 0x00004A, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_HasModifiableVariants_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.UpdateFromVariant
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant final
{
public:
	struct FGameplayTag                           VariantChannelTag;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VariantTag;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             GrantedItemDef;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetOfferGrantedItemDef_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F4[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F5[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBackpackItemDefinition*          K2Node_DynamicCast_AsAthena_Backpack_Item_Definition; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F6[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant) == 0x000060, "Wrong size on AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, VariantChannelTag) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::VariantChannelTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, VariantTag) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, IsOwned) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::IsOwned' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, GrantedItemDef) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::GrantedItemDef' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, CallFunc_GetOfferGrantedItemDef_ReturnValue) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::CallFunc_GetOfferGrantedItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1) == 0x000038, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_AsAthena_Backpack_Item_Definition) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_AsAthena_Backpack_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, CallFunc_GetContext_ReturnValue) == 0x000058, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_HandleBack final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_HandleBack) == 0x000001, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_HandleBack");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_HandleBack) == 0x000001, "Wrong size on AthenaDirectAquisitionStyleScreen_C_HandleBack");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_HandleBack, bPassThrough) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_HandleBack::bPassThrough' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.OnVariantChanged
// 0x0014 (0x0014 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_OnVariantChanged final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VariantTag;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged) == 0x000004, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_OnVariantChanged");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged) == 0x000014, "Wrong size on AthenaDirectAquisitionStyleScreen_C_OnVariantChanged");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, VariantChannel) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::VariantChannel' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, VariantTag) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, IsOwned) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::IsOwned' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.ExecuteUbergraph_AthenaDirectAquisitionStyleScreen
// 0x0058 (0x0058 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73F7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_bPassThrough;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_VariantChannel;                       // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_VariantTag;                           // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsOwned;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F9[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0038(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen) == 0x000058, "Wrong size on AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen, EntryPoint) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen::EntryPoint' has a wrong offset!");
