#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarSecondary

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "QuickbarBase_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarSecondary.AthenaQuickbarSecondary_C
// 0x0068 (0x0338 - 0x02D0)
class UAthenaQuickbarSecondary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarSecondary_C;          // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Camera_Mode_Content;              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Separator;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Switch_Action;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindSwitchBinding;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       QuickbarSecondaryInvalidationBox;                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF1;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF2;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF3;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF4;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF5;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Building;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentBuildingSlot;                               // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UFortQuickBarSlotBase* GetSpecificSlot(int32 SlotNumber);
	void SetQuickBarNativeMode(bool bNativeMode);
	void HandleShowHideRail();
	void HandleKeyBindsChange();
	void Show_Secondary_Quickbar_Rail(bool Show);
	void Maximize();
	void Minimize();
	void HandleKeybindsChanged();
	void HandleInputMethodChanged_Bind(ECommonInputType InputType);
	void Destruct();
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Param_Slot);
	void Construct();
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex, const TArray<int32>& ChangedSlots);
	void ExecuteUbergraph_AthenaQuickbarSecondary(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarSecondary_C">();
	}
	static class UAthenaQuickbarSecondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarSecondary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarSecondary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarSecondary_C");
static_assert(sizeof(UAthenaQuickbarSecondary_C) == 0x000338, "Wrong size on UAthenaQuickbarSecondary_C");
static_assert(offsetof(UAthenaQuickbarSecondary_C, UberGraphFrame_AthenaQuickbarSecondary_C) == 0x0002D0, "Member 'UAthenaQuickbarSecondary_C::UberGraphFrame_AthenaQuickbarSecondary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Horizontal_Box__Camera_Mode_Content) == 0x0002D8, "Member 'UAthenaQuickbarSecondary_C::_Horizontal_Box__Camera_Mode_Content' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Separator) == 0x0002E0, "Member 'UAthenaQuickbarSecondary_C::_Image__Separator' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Switch_Action) == 0x0002E8, "Member 'UAthenaQuickbarSecondary_C::_Image__Switch_Action' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, KeybindSwitchBinding) == 0x0002F0, "Member 'UAthenaQuickbarSecondary_C::KeybindSwitchBinding' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSecondaryInvalidationBox) == 0x0002F8, "Member 'UAthenaQuickbarSecondary_C::QuickbarSecondaryInvalidationBox' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF1) == 0x000300, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF2) == 0x000308, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF3) == 0x000310, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF4) == 0x000318, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF5) == 0x000320, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, SizeBox_Building) == 0x000328, "Member 'UAthenaQuickbarSecondary_C::SizeBox_Building' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, CurrentBuildingSlot) == 0x000330, "Member 'UAthenaQuickbarSecondary_C::CurrentBuildingSlot' has a wrong offset!");

}

