#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferDetailsWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.SetupAffiliate
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetCurrentSubGame_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7571[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7572[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7573[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAffiliateName_ReturnValue;             // 0x0028(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7574[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate) == 0x000060, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, Temp_byte_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, Temp_byte_Variable_1) == 0x000001, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, Temp_bool_Variable) == 0x000002, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_GetCurrentSubGame_ReturnValue) == 0x000003, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_GetCurrentSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_GetAffiliateName_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_GetAffiliateName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_Len_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate, K2Node_Select_Default) == 0x00005D, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupAffiliate::K2Node_Select_Default' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.HandleButtonsIntroFinished
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleButtonsIntroFinished::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.ShowSwipeButtons
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowSwipeButtons::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.ShowDetailsFrame
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowDetailsFrame::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.Create2FAWidget
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget final
{
public:
	class UEnableMultiFactorAuthModalBP_C*        Instance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnableMultiFactorAuthModalBP_C*        CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget, Instance) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget::Instance' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_Create2FAWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.CreateGiftingScreenWidget
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget final
{
public:
	class UGiftingScreen_C*                       Instance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGiftingScreen_C*                       CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget, Instance) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget::Instance' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateGiftingScreenWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.CreateDirectAcquisitionStyleScreenWidget
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget final
{
public:
	class UAthenaDirectAquisitionStyleScreen_C*   Instance;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAquisitionStyleScreen_C*   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget, Instance) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget::Instance' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_CreateDirectAcquisitionStyleScreenWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.GetWidgetForFramingViewedItem
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7575[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem, Temp_bool_Variable) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem, K2Node_Select_Default) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetWidgetForFramingViewedItem::K2Node_Select_Default' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.HandleRewardItemGenerated
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated final
{
public:
	class UUserWidget*                            RewardItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaStoreReward_C*                   StoreReward;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaStoreReward_C*                   K2Node_DynamicCast_AsAthena_Store_Reward;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7576[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUserObjectListEntry>  CallFunc_GetListItemObject_UserObjectListEntry_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    K2Node_DynamicCast_AsFort_Item_Definition;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7577[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemQuantityPair                  CallFunc_FindItemQuantityPair_OutItemQuantity;     // 0x0044(0x0014)(NoDestructor)
	bool                                          CallFunc_FindItemQuantityPair_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated) == 0x000060, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, RewardItem) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, StoreReward) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::StoreReward' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, K2Node_DynamicCast_AsAthena_Store_Reward) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::K2Node_DynamicCast_AsAthena_Store_Reward' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, CallFunc_GetListItemObject_UserObjectListEntry_CastInput) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::CallFunc_GetListItemObject_UserObjectListEntry_CastInput' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, CallFunc_GetListItemObject_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, K2Node_DynamicCast_AsFort_Item_Definition) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::K2Node_DynamicCast_AsFort_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, CallFunc_FindItemQuantityPair_OutItemQuantity) == 0x000044, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::CallFunc_FindItemQuantityPair_OutItemQuantity' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated, CallFunc_FindItemQuantityPair_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleRewardItemGenerated::CallFunc_FindItemQuantityPair_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.SetupRewardItem
// 0x0058 (0x0058 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem final
{
public:
	class UAthenaStoreReward_C*                   RewardItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemQuantityPair>          SortedItemQuantity;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          PreviewPlaceholder;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7578[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemQuantityPair                  ItemQuantity;                                      // 0x0024(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UAthenaStoreReward_C*                   StoreRewardWidget;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemDefOwned_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7579[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             CallFunc_GetCardSize_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem) == 0x000058, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, RewardItem) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::RewardItem' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, ItemDefinition) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::ItemDefinition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, SortedItemQuantity) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::SortedItemQuantity' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, PreviewPlaceholder) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::PreviewPlaceholder' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, ItemQuantity) == 0x000024, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::ItemQuantity' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, StoreRewardWidget) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::StoreRewardWidget' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, Temp_bool_Variable) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, Temp_byte_Variable) == 0x000041, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, Temp_byte_Variable_1) == 0x000042, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000043, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, K2Node_Select_Default) == 0x000044, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, CallFunc_IsItemDefOwned_ReturnValue) == 0x000045, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::CallFunc_IsItemDefOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem, CallFunc_GetCardSize_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupRewardItem::CallFunc_GetCardSize_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.HandleUndoAction
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction, PassThrough) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleUndoAction::PassThrough' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.ShopVariantPreviewInfoUpdated
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_757A[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUnlockableVariantPreviewInfo          CallFunc_GetSeasonTabVariantPreviewInfo_ReturnValue; // 0x0010(0x0028)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_757B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated) == 0x0000E8, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, Temp_bool_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, Temp_byte_Variable) == 0x000001, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, CallFunc_GetSeasonTabVariantPreviewInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::CallFunc_GetSeasonTabVariantPreviewInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, K2Node_MakeArray_Array) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, K2Node_Select_Default) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShopVariantPreviewInfoUpdated::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.SetupPurchaseButtonForQuantity
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UFortLlamaStoreOfferInfo*               K2Node_DynamicCast_AsFort_Llama_Store_Offer_Info;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_757C[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	bool                                          CallFunc_IsPrerollOffer_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_757D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00D8(0x0018)()
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity) == 0x0000F0, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, CallFunc_GetOfferInfo_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_MakeArray_Array) == 0x000048, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_DynamicCast_AsFort_Llama_Store_Offer_Info) == 0x000058, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_DynamicCast_AsFort_Llama_Store_Offer_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, CallFunc_Format_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, CallFunc_IsPrerollOffer_ReturnValue) == 0x000080, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::CallFunc_IsPrerollOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity, CallFunc_Format_ReturnValue_1) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_SetupPurchaseButtonForQuantity::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.GetNumBattlepassStars
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_757E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemQuantity_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars, ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars, CallFunc_GetItemQuantity_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetNumBattlepassStars::CallFunc_GetItemQuantity_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.GetHasBattlepassStars
// 0x0020 (0x0020 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_757F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemOfferCount_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMetaAsBool_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars) == 0x000020, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_GetItemOfferCount_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_GetItemOfferCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_GetMetaAsBool_ReturnValue) == 0x00001C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_GetMetaAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetHasBattlepassStars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.ShowHideGiftingButton
// 0x0028 (0x0028 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7580[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVotingOffer_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOfferPurchaseError                           CallFunc_CanGiftOffer_Result;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7581[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiftingDisabled_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton) == 0x000028, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, Temp_byte_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_IsVotingOffer_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_IsVotingOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, Temp_byte_Variable_1) == 0x000011, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, Temp_bool_Variable) == 0x000012, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_CanGiftOffer_Result) == 0x000013, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_CanGiftOffer_Result' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, K2Node_Select_Default) == 0x000016, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_IsGiftingDisabled_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_IsGiftingDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ShowHideGiftingButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.GetOwnedIndex
// 0x0028 (0x0028 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7582[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantityRemaining_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7583[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex) == 0x000028, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex, ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex, Temp_bool_Variable) == 0x000004, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex, Temp_int_Variable) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex, Temp_int_Variable_1) == 0x00000C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_GetOwnedIndex::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
