#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorMapPlayerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorMapPlayerList.AthenaSpectatorMapPlayerList_C
// 0x0070 (0x0418 - 0x03A8)
class UAthenaSpectatorMapPlayerList_C final : public UAthenaSpectatorMapPlayerListBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_EventScore;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortByEliminationsDescending;                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortByEventScoreDescending;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortByPlayerNameDescending;                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortBySquadIdDescending;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SortByStateDescending;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SquadIdBox;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           SortArrowActiveColor;                              // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SortArrowInactiveColor;                            // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         SortArrows;                                        // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSpectatorMapPlayerList(int32 EntryPoint);
	void BP_HandleSquadIdVisibilityChanged(bool bSquadIdsVisible);
	void OnInitialized();
	void BP_HandleCurrentSortMethodChanged(ESpectatorPlayerListSortMethod NewSortMethod);
	void BP_HandlePlayerEventScoreChanged(int32 EventScore);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorMapPlayerList_C">();
	}
	static class UAthenaSpectatorMapPlayerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorMapPlayerList_C>();
	}
};
static_assert(alignof(UAthenaSpectatorMapPlayerList_C) == 0x000008, "Wrong alignment on UAthenaSpectatorMapPlayerList_C");
static_assert(sizeof(UAthenaSpectatorMapPlayerList_C) == 0x000418, "Wrong size on UAthenaSpectatorMapPlayerList_C");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, UberGraphFrame) == 0x0003A8, "Member 'UAthenaSpectatorMapPlayerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SizeBox_EventScore) == 0x0003B0, "Member 'UAthenaSpectatorMapPlayerList_C::SizeBox_EventScore' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortByEliminationsDescending) == 0x0003B8, "Member 'UAthenaSpectatorMapPlayerList_C::SortByEliminationsDescending' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortByEventScoreDescending) == 0x0003C0, "Member 'UAthenaSpectatorMapPlayerList_C::SortByEventScoreDescending' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortByPlayerNameDescending) == 0x0003C8, "Member 'UAthenaSpectatorMapPlayerList_C::SortByPlayerNameDescending' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortBySquadIdDescending) == 0x0003D0, "Member 'UAthenaSpectatorMapPlayerList_C::SortBySquadIdDescending' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortByStateDescending) == 0x0003D8, "Member 'UAthenaSpectatorMapPlayerList_C::SortByStateDescending' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SquadIdBox) == 0x0003E0, "Member 'UAthenaSpectatorMapPlayerList_C::SquadIdBox' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortArrowActiveColor) == 0x0003E8, "Member 'UAthenaSpectatorMapPlayerList_C::SortArrowActiveColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortArrowInactiveColor) == 0x0003F8, "Member 'UAthenaSpectatorMapPlayerList_C::SortArrowInactiveColor' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerList_C, SortArrows) == 0x000408, "Member 'UAthenaSpectatorMapPlayerList_C::SortArrows' has a wrong offset!");

}

