#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_Locate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C
// 0x00D0 (0x02F0 - 0x0220)
class AAthenaQuestActor_SW_Locate_C final : public AFortStaticReplicatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Athena_QuestItem_PickupSuccess;                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Athena_CollectHiddenStarReward_Cue;                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      TouchCapsule;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81F8[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ObjectiveStat;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          RequiresConditionToComplete;                       // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLocallyValid;                                    // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81F9[0x6];                                     // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GenericSuccessSound;                               // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        GenericSuccessFX;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeGenericSuccessSoundAndFX;               // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerObjectiveCount;                              // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerThatTriggeredObject;                         // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaSKPushVehicle*               ShoppingCartThatTriggered;                         // 0x0298(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bTestQuest;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81FA[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TagToCheck;                                        // 0x02A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestShared;                                    // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlaySuccessFX;                                     // 0x02AD(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          TestVisuals;                                       // 0x02AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81FB[0x1];                                     // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaGameMessageData                 MessageData;                                       // 0x02B0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaQuestActor_SW_Locate(int32 EntryPoint);
	void FoundEvent(class AFortPlayerController* PC);
	void DisplayMessage(class AFortPlayerController* PC);
	void TouchedActorInCreativeMode();
	void TellChildOfSuccess();
	void HideQuestActor();
	void ObjectiveSuccessfullyCompleted(class AActor* PlayerWhoTriggeredObject);
	void QuestInitializedAndValid();
	void QuestSuccessfullyUpdated();
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void TouchedQuestActor(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void OnRep_ShoppingCartThatTriggered();
	void CheckShouldShowLocally(bool* ShouldShowLocally);
	void OnRep_PlaySuccessFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_SW_Locate_C">();
	}
	static class AAthenaQuestActor_SW_Locate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_SW_Locate_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_SW_Locate_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_SW_Locate_C");
static_assert(sizeof(AAthenaQuestActor_SW_Locate_C) == 0x0002F0, "Wrong size on AAthenaQuestActor_SW_Locate_C");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, UberGraphFrame) == 0x000220, "Member 'AAthenaQuestActor_SW_Locate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, P_Athena_QuestItem_PickupSuccess) == 0x000228, "Member 'AAthenaQuestActor_SW_Locate_C::P_Athena_QuestItem_PickupSuccess' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, Athena_CollectHiddenStarReward_Cue) == 0x000230, "Member 'AAthenaQuestActor_SW_Locate_C::Athena_CollectHiddenStarReward_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, TouchCapsule) == 0x000238, "Member 'AAthenaQuestActor_SW_Locate_C::TouchCapsule' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, DefaultSceneRoot) == 0x000240, "Member 'AAthenaQuestActor_SW_Locate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, QuestItem) == 0x000248, "Member 'AAthenaQuestActor_SW_Locate_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, ObjBackendName) == 0x000250, "Member 'AAthenaQuestActor_SW_Locate_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, CreativeMode) == 0x000258, "Member 'AAthenaQuestActor_SW_Locate_C::CreativeMode' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, ObjectiveStat) == 0x000260, "Member 'AAthenaQuestActor_SW_Locate_C::ObjectiveStat' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, RequiresConditionToComplete) == 0x000270, "Member 'AAthenaQuestActor_SW_Locate_C::RequiresConditionToComplete' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, IsLocallyValid) == 0x000271, "Member 'AAthenaQuestActor_SW_Locate_C::IsLocallyValid' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, GenericSuccessSound) == 0x000278, "Member 'AAthenaQuestActor_SW_Locate_C::GenericSuccessSound' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, GenericSuccessFX) == 0x000280, "Member 'AAthenaQuestActor_SW_Locate_C::GenericSuccessFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, DelayBeforeGenericSuccessSoundAndFX) == 0x000288, "Member 'AAthenaQuestActor_SW_Locate_C::DelayBeforeGenericSuccessSoundAndFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, PlayerObjectiveCount) == 0x00028C, "Member 'AAthenaQuestActor_SW_Locate_C::PlayerObjectiveCount' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, PlayerThatTriggeredObject) == 0x000290, "Member 'AAthenaQuestActor_SW_Locate_C::PlayerThatTriggeredObject' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, ShoppingCartThatTriggered) == 0x000298, "Member 'AAthenaQuestActor_SW_Locate_C::ShoppingCartThatTriggered' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, bTestQuest) == 0x0002A0, "Member 'AAthenaQuestActor_SW_Locate_C::bTestQuest' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, TagToCheck) == 0x0002A4, "Member 'AAthenaQuestActor_SW_Locate_C::TagToCheck' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, bIsQuestShared) == 0x0002AC, "Member 'AAthenaQuestActor_SW_Locate_C::bIsQuestShared' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, PlaySuccessFX) == 0x0002AD, "Member 'AAthenaQuestActor_SW_Locate_C::PlaySuccessFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, TestVisuals) == 0x0002AE, "Member 'AAthenaQuestActor_SW_Locate_C::TestVisuals' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_Locate_C, MessageData) == 0x0002B0, "Member 'AAthenaQuestActor_SW_Locate_C::MessageData' has a wrong offset!");

}

