#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInteractionIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInteractionIndicator.AthenaInteractionIndicator_C
// 0x0140 (0x0410 - 0x02D0)
class UAthenaInteractionIndicator_C final : public UFortActorIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBasicInteractionWidget_C*              BasicInteractionWidget;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_SubDescription;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaHUDMinusPickupItemWidget_C*      HUDMinusPickupItemWidget;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackpack;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Interaction;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InteractionKeybindBox;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          InteractionKeybindColor;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SecondInteractionBox;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       SecondInteractionKeybind;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SecondInteractionKeybindColor;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxInteractionFailure;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubDescriptionAlertImage;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubTextBox;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionFailure;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSecondInteraction;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSubDescription;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextUnderKeybindText;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Wumba;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Wumba_Sidegrade;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WumbaCost;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WumbaCost_SideGrade;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          WumbaError;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          WumbaError_SideGrade;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WumbaErrorText;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WumbaErrorText_SideGrade;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCostWidget_C*                      WumbaResources;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCostWidget_C*                      WumbaResources_SideGrade;                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WumbaUpgradeFrom;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WumbaUpgradeFrom_SideGrade;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WumbaUpgradeTo;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WumbaUpgradeTo_SideGrade;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortInteractContextInfo*               CurrentInteraction;                                // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Touch_Start_Time;                                  // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Tap_Time;                                      // 0x03E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Tap_Distance;                                  // 0x03E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Touch_Start_Position;                              // 0x03EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A5B[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InteractErrorText;                                 // 0x03F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaInteractionIndicator(int32 EntryPoint);
	void SetInteractionFailure(class AFortPickup* Pickup);
	void OnInputMethodChanged_Event_0(ECommonInputType bNewInputType);
	void Destruct();
	void Construct();
	void HandleInteractionChanged(class UFortInteractContextInfo* Param_Interaction);
	void ShowPickupWidget(class AFortPickup* Pickup);
	void ShowBasicInteractionWidget();
	void UpdateKeybinds();
	void IsInteractionWidgetSuppressed(bool* IsSuppressed);
	void UpdateWidgetVisibility();
	void ShowWumba(class AB_Athena_Wumba_C*& WUMBA_Ref);
	void SetRarityForWumbaItems(class UFortItemDefinition* Item, class UBorder* Border, bool* Success);
	void ShowSecondInteractionWidget();
	void AttemptSetItemToRepresent(class UFortItemWidget_NUI* Widget, const class UFortItem* ItemToRepresent);
	void HandleKeybindsChanged();
	void UpdateForCurrentInput();
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void GetVisibleVisibility(ESlateVisibility* Param_Visibility);
	void ShouldShowCreativeModeName(bool* Show, class FText* CreativeNameText);
	void IsSimpleInteractionWidgetVisible(bool* Visible);
	void InteractionFailureText(class AFortPickup* Pickup);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInteractionIndicator_C">();
	}
	static class UAthenaInteractionIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInteractionIndicator_C>();
	}
};
static_assert(alignof(UAthenaInteractionIndicator_C) == 0x000008, "Wrong alignment on UAthenaInteractionIndicator_C");
static_assert(sizeof(UAthenaInteractionIndicator_C) == 0x000410, "Wrong size on UAthenaInteractionIndicator_C");
static_assert(offsetof(UAthenaInteractionIndicator_C, UberGraphFrame) == 0x0002D0, "Member 'UAthenaInteractionIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, BasicInteractionWidget) == 0x0002D8, "Member 'UAthenaInteractionIndicator_C::BasicInteractionWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Border_SubDescription) == 0x0002E0, "Member 'UAthenaInteractionIndicator_C::Border_SubDescription' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, HUDMinusPickupItemWidget) == 0x0002E8, "Member 'UAthenaInteractionIndicator_C::HUDMinusPickupItemWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, ImageBackpack) == 0x0002F0, "Member 'UAthenaInteractionIndicator_C::ImageBackpack' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Interaction) == 0x0002F8, "Member 'UAthenaInteractionIndicator_C::Interaction' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, InteractionKeybindBox) == 0x000300, "Member 'UAthenaInteractionIndicator_C::InteractionKeybindBox' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, InteractionKeybindColor) == 0x000308, "Member 'UAthenaInteractionIndicator_C::InteractionKeybindColor' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, KeybindWidget) == 0x000310, "Member 'UAthenaInteractionIndicator_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SecondInteractionBox) == 0x000318, "Member 'UAthenaInteractionIndicator_C::SecondInteractionBox' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SecondInteractionKeybind) == 0x000320, "Member 'UAthenaInteractionIndicator_C::SecondInteractionKeybind' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SecondInteractionKeybindColor) == 0x000328, "Member 'UAthenaInteractionIndicator_C::SecondInteractionKeybindColor' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SizeBoxInteractionFailure) == 0x000330, "Member 'UAthenaInteractionIndicator_C::SizeBoxInteractionFailure' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SubDescriptionAlertImage) == 0x000338, "Member 'UAthenaInteractionIndicator_C::SubDescriptionAlertImage' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, SubTextBox) == 0x000340, "Member 'UAthenaInteractionIndicator_C::SubTextBox' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, TextInteractionFailure) == 0x000348, "Member 'UAthenaInteractionIndicator_C::TextInteractionFailure' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, TextSecondInteraction) == 0x000350, "Member 'UAthenaInteractionIndicator_C::TextSecondInteraction' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, TextSubDescription) == 0x000358, "Member 'UAthenaInteractionIndicator_C::TextSubDescription' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, TextUnderKeybindText) == 0x000360, "Member 'UAthenaInteractionIndicator_C::TextUnderKeybindText' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Wumba) == 0x000368, "Member 'UAthenaInteractionIndicator_C::Wumba' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Wumba_Sidegrade) == 0x000370, "Member 'UAthenaInteractionIndicator_C::Wumba_Sidegrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaCost) == 0x000378, "Member 'UAthenaInteractionIndicator_C::WumbaCost' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaCost_SideGrade) == 0x000380, "Member 'UAthenaInteractionIndicator_C::WumbaCost_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaError) == 0x000388, "Member 'UAthenaInteractionIndicator_C::WumbaError' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaError_SideGrade) == 0x000390, "Member 'UAthenaInteractionIndicator_C::WumbaError_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaErrorText) == 0x000398, "Member 'UAthenaInteractionIndicator_C::WumbaErrorText' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaErrorText_SideGrade) == 0x0003A0, "Member 'UAthenaInteractionIndicator_C::WumbaErrorText_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaResources) == 0x0003A8, "Member 'UAthenaInteractionIndicator_C::WumbaResources' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaResources_SideGrade) == 0x0003B0, "Member 'UAthenaInteractionIndicator_C::WumbaResources_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaUpgradeFrom) == 0x0003B8, "Member 'UAthenaInteractionIndicator_C::WumbaUpgradeFrom' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaUpgradeFrom_SideGrade) == 0x0003C0, "Member 'UAthenaInteractionIndicator_C::WumbaUpgradeFrom_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaUpgradeTo) == 0x0003C8, "Member 'UAthenaInteractionIndicator_C::WumbaUpgradeTo' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, WumbaUpgradeTo_SideGrade) == 0x0003D0, "Member 'UAthenaInteractionIndicator_C::WumbaUpgradeTo_SideGrade' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, CurrentInteraction) == 0x0003D8, "Member 'UAthenaInteractionIndicator_C::CurrentInteraction' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Touch_Start_Time) == 0x0003E0, "Member 'UAthenaInteractionIndicator_C::Touch_Start_Time' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Max_Tap_Time) == 0x0003E4, "Member 'UAthenaInteractionIndicator_C::Max_Tap_Time' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Max_Tap_Distance) == 0x0003E8, "Member 'UAthenaInteractionIndicator_C::Max_Tap_Distance' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, Touch_Start_Position) == 0x0003EC, "Member 'UAthenaInteractionIndicator_C::Touch_Start_Position' has a wrong offset!");
static_assert(offsetof(UAthenaInteractionIndicator_C, InteractErrorText) == 0x0003F8, "Member 'UAthenaInteractionIndicator_C::InteractErrorText' has a wrong offset!");

}

