#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBannerSelectModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBannerSelectModal.AthenaBannerSelectModal_C
// 0x0038 (0x0480 - 0x0448)
class UAthenaBannerSelectModal_C final : public UFortBannerSelectModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderTouch;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LocalPlayerBannerEditor_C*          BP_LocalPlayerBannerEditor;                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Banner;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseAction;                                       // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	struct FEventReply On_BorderTouch_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Setup_Input_Action_Handlers();
	void HandleCloseAction(bool* PassThrough);
	void Construct();
	void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature(class FName IconId, class FName ColorId);
	void BP_OnDeactivated();
	void BP_OnActivated();
	void Close();
	void ExecuteUbergraph_AthenaBannerSelectModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBannerSelectModal_C">();
	}
	static class UAthenaBannerSelectModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBannerSelectModal_C>();
	}
};
static_assert(alignof(UAthenaBannerSelectModal_C) == 0x000008, "Wrong alignment on UAthenaBannerSelectModal_C");
static_assert(sizeof(UAthenaBannerSelectModal_C) == 0x000480, "Wrong size on UAthenaBannerSelectModal_C");
static_assert(offsetof(UAthenaBannerSelectModal_C, UberGraphFrame) == 0x000448, "Member 'UAthenaBannerSelectModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBannerSelectModal_C, BorderTouch) == 0x000450, "Member 'UAthenaBannerSelectModal_C::BorderTouch' has a wrong offset!");
static_assert(offsetof(UAthenaBannerSelectModal_C, BP_LocalPlayerBannerEditor) == 0x000458, "Member 'UAthenaBannerSelectModal_C::BP_LocalPlayerBannerEditor' has a wrong offset!");
static_assert(offsetof(UAthenaBannerSelectModal_C, Lightbox) == 0x000460, "Member 'UAthenaBannerSelectModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaBannerSelectModal_C, ScaleBox_Banner) == 0x000468, "Member 'UAthenaBannerSelectModal_C::ScaleBox_Banner' has a wrong offset!");
static_assert(offsetof(UAthenaBannerSelectModal_C, CloseAction) == 0x000470, "Member 'UAthenaBannerSelectModal_C::CloseAction' has a wrong offset!");

}

