#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHitPointBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHitPointBar.AthenaHitPointBar_C
// 0x00B8 (0x0320 - 0x0268)
class UAthenaHitPointBar_C final : public UAthenaPlayerHitPointBarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ValueImpact;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BarShake_2;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BarShake_1;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BarShake;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BarSizeBox;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Max;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentValue;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_MaxValue;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BarBG;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CastShadow;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxValue;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarDelta;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           ProgressBarFill;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TextArea;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DBNOStateCache;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7113[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           HealthIcon;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           ShieldIcon;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           VehicleHealthIcon;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldColor;                                       // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideShieldOnEmpty;                                 // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetSize(bool UseLargeSize);
	void UpdateDBNOState(bool bIsDBNO);
	void Update_Delta_Bar();
	void Initialize_Bar();
	void Update_Fill_Bar();
	void UpdateCurrentValue();
	void UpdateMaxValue();
	void PreConstruct(bool IsDesignTime);
	void OnMaxValueChanged(float Value);
	void OnValueChangedWithReason(float Value, EFortHitPointModificationReason Reason);
	void OnDBNOStateChanged(bool IsDBNO);
	void OnDeltaChanged();
	void ExecuteUbergraph_AthenaHitPointBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHitPointBar_C">();
	}
	static class UAthenaHitPointBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHitPointBar_C>();
	}
};
static_assert(alignof(UAthenaHitPointBar_C) == 0x000008, "Wrong alignment on UAthenaHitPointBar_C");
static_assert(sizeof(UAthenaHitPointBar_C) == 0x000320, "Wrong size on UAthenaHitPointBar_C");
static_assert(offsetof(UAthenaHitPointBar_C, UberGraphFrame) == 0x000268, "Member 'UAthenaHitPointBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ValueImpact) == 0x000270, "Member 'UAthenaHitPointBar_C::ValueImpact' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, BarShake_2) == 0x000278, "Member 'UAthenaHitPointBar_C::BarShake_2' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, BarShake_1) == 0x000280, "Member 'UAthenaHitPointBar_C::BarShake_1' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, BarShake) == 0x000288, "Member 'UAthenaHitPointBar_C::BarShake' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, BarSizeBox) == 0x000290, "Member 'UAthenaHitPointBar_C::BarSizeBox' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, CommonBorder_Max) == 0x000298, "Member 'UAthenaHitPointBar_C::CommonBorder_Max' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, CurrentValue) == 0x0002A0, "Member 'UAthenaHitPointBar_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, HorizontalBox_MaxValue) == 0x0002A8, "Member 'UAthenaHitPointBar_C::HorizontalBox_MaxValue' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Icon) == 0x0002B0, "Member 'UAthenaHitPointBar_C::Icon' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Image_BarBG) == 0x0002B8, "Member 'UAthenaHitPointBar_C::Image_BarBG' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, Image_CastShadow) == 0x0002C0, "Member 'UAthenaHitPointBar_C::Image_CastShadow' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, MaxValue) == 0x0002C8, "Member 'UAthenaHitPointBar_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ProgressBarDelta) == 0x0002D0, "Member 'UAthenaHitPointBar_C::ProgressBarDelta' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ProgressBarFill) == 0x0002D8, "Member 'UAthenaHitPointBar_C::ProgressBarFill' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, TextArea) == 0x0002E0, "Member 'UAthenaHitPointBar_C::TextArea' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, DBNOStateCache) == 0x0002E8, "Member 'UAthenaHitPointBar_C::DBNOStateCache' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, HealthIcon) == 0x0002F0, "Member 'UAthenaHitPointBar_C::HealthIcon' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ShieldIcon) == 0x0002F8, "Member 'UAthenaHitPointBar_C::ShieldIcon' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, VehicleHealthIcon) == 0x000300, "Member 'UAthenaHitPointBar_C::VehicleHealthIcon' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, ShieldColor) == 0x000308, "Member 'UAthenaHitPointBar_C::ShieldColor' has a wrong offset!");
static_assert(offsetof(UAthenaHitPointBar_C, HideShieldOnEmpty) == 0x000318, "Member 'UAthenaHitPointBar_C::HideShieldOnEmpty' has a wrong offset!");

}

