#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickBarEditorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickBarEditorWidget.AthenaQuickbarEditorWidget_C
// 0x0040 (0x02C8 - 0x0288)
class UAthenaQuickbarEditorWidget_C final : public UAthenaQuickbarEditorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaInventoryEquipSlot_C*            EquipSlot1;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaInventoryEquipSlot_C*            EquipSlot2;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaInventoryEquipSlot_C*            EquipSlot3;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaInventoryEquipSlot_C*            EquipSlot4;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaInventoryEquipSlot_C*            EquipSlot5;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaInventoryEquipSlot_C*>    EquipSlots;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaQuickbarEditorWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarEditorWidget_C">();
	}
	static class UAthenaQuickbarEditorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarEditorWidget_C>();
	}
};
static_assert(alignof(UAthenaQuickbarEditorWidget_C) == 0x000008, "Wrong alignment on UAthenaQuickbarEditorWidget_C");
static_assert(sizeof(UAthenaQuickbarEditorWidget_C) == 0x0002C8, "Wrong size on UAthenaQuickbarEditorWidget_C");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, UberGraphFrame) == 0x000288, "Member 'UAthenaQuickbarEditorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlot1) == 0x000290, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlot2) == 0x000298, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlot3) == 0x0002A0, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlot4) == 0x0002A8, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlot5) == 0x0002B0, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarEditorWidget_C, EquipSlots) == 0x0002B8, "Member 'UAthenaQuickbarEditorWidget_C::EquipSlots' has a wrong offset!");

}

