#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarPrimary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.GetSpecificSlot
// 0x0020 (0x0020 - 0x0000)
struct AthenaQuickbarPrimary_C_GetSpecificSlot final
{
public:
	int32                                         SlotNumber;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F76[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuickBarSlotBase*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuickBarSlotBase*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_GetSpecificSlot) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_GetSpecificSlot");
static_assert(sizeof(AthenaQuickbarPrimary_C_GetSpecificSlot) == 0x000020, "Wrong size on AthenaQuickbarPrimary_C_GetSpecificSlot");
static_assert(offsetof(AthenaQuickbarPrimary_C_GetSpecificSlot, SlotNumber) == 0x000000, "Member 'AthenaQuickbarPrimary_C_GetSpecificSlot::SlotNumber' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_GetSpecificSlot, ReturnValue) == 0x000008, "Member 'AthenaQuickbarPrimary_C_GetSpecificSlot::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_GetSpecificSlot, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaQuickbarPrimary_C_GetSpecificSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_GetSpecificSlot, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaQuickbarPrimary_C_GetSpecificSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.RefreshPickupPreview
// 0x0158 (0x0158 - 0x0000)
struct AthenaQuickbarPrimary_C_RefreshPickupPreview final
{
public:
	struct FGameplayTag                           Param_QuickbarTag;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 PickupPreviewWidth;                                // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 PckupPreviewTranslation;                           // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F77[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetNumberOfSlotsTaken_ReturnValue;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F78[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PreviewItemPickUp_OutSlotIndex;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                            CallFunc_PreviewItemPickUp_OutItemsToPush;         // 0x0070(0x0050)()
	TArray<int32>                                 CallFunc_PreviewItemPickUp_OutItemsToDrop;         // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_PreviewItemPickUp_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F79[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7A[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x00E4(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7B[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7C[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x013C(0x001C)(NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_RefreshPickupPreview) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_RefreshPickupPreview");
static_assert(sizeof(AthenaQuickbarPrimary_C_RefreshPickupPreview) == 0x000158, "Wrong size on AthenaQuickbarPrimary_C_RefreshPickupPreview");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, Param_QuickbarTag) == 0x000000, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::Param_QuickbarTag' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, PickupPreviewWidth) == 0x000008, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::PickupPreviewWidth' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, PckupPreviewTranslation) == 0x000018, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::PckupPreviewTranslation' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BreakVector2D_X) == 0x000028, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, K2Node_MakeArray_Array) == 0x000030, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, K2Node_MakeArray_Array_1) == 0x000048, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_GetNumberOfSlotsTaken_ReturnValue) == 0x000059, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_GetNumberOfSlotsTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_GetContext_ReturnValue) == 0x000060, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000068, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_PreviewItemPickUp_OutSlotIndex) == 0x00006C, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_PreviewItemPickUp_OutSlotIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_PreviewItemPickUp_OutItemsToPush) == 0x000070, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_PreviewItemPickUp_OutItemsToPush' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_PreviewItemPickUp_OutItemsToDrop) == 0x0000C0, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_PreviewItemPickUp_OutItemsToDrop' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_PreviewItemPickUp_ReturnValue) == 0x0000D0, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_PreviewItemPickUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D4, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_GetChildAt_ReturnValue) == 0x0000D8, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000E0, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_GetCachedGeometry_ReturnValue) == 0x0000E4, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BooleanAND_ReturnValue) == 0x00011C, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_GetLocalTopLeft_ReturnValue) == 0x000120, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_GetLocalTopLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BooleanAND_ReturnValue_1) == 0x000128, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BreakVector2D_X_1) == 0x00012C, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_BreakVector2D_Y_1) == 0x000130, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, CallFunc_MakeVector2D_ReturnValue) == 0x000134, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_RefreshPickupPreview, K2Node_MakeStruct_WidgetTransform) == 0x00013C, "Member 'AthenaQuickbarPrimary_C_RefreshPickupPreview::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.HandleInteractionChanged
// 0x0060 (0x0060 - 0x0000)
struct AthenaQuickbarPrimary_C_HandleInteractionChanged final
{
public:
	class UFortInteractContextInfo*               Context_Info;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 PickupPreviewWidth;                                // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 PickupPreviewOffsets;                              // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_HandleInteractionChanged) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_HandleInteractionChanged");
static_assert(sizeof(AthenaQuickbarPrimary_C_HandleInteractionChanged) == 0x000060, "Wrong size on AthenaQuickbarPrimary_C_HandleInteractionChanged");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, Context_Info) == 0x000000, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::Context_Info' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, PickupPreviewWidth) == 0x000008, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::PickupPreviewWidth' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, PickupPreviewOffsets) == 0x000018, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::PickupPreviewOffsets' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, K2Node_MakeArray_Array) == 0x000028, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, K2Node_MakeArray_Array_1) == 0x000040, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, K2Node_DynamicCast_AsFort_Pickup) == 0x000050, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInteractionChanged, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AthenaQuickbarPrimary_C_HandleInteractionChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.SetQuickBarNativeMode
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickbarPrimary_C_SetQuickBarNativeMode final
{
public:
	bool                                          bNativeMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_SetQuickBarNativeMode) == 0x000001, "Wrong alignment on AthenaQuickbarPrimary_C_SetQuickBarNativeMode");
static_assert(sizeof(AthenaQuickbarPrimary_C_SetQuickBarNativeMode) == 0x000001, "Wrong size on AthenaQuickbarPrimary_C_SetQuickBarNativeMode");
static_assert(offsetof(AthenaQuickbarPrimary_C_SetQuickBarNativeMode, bNativeMode) == 0x000000, "Member 'AthenaQuickbarPrimary_C_SetQuickBarNativeMode::bNativeMode' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.HandleShowHideWeaponRail
// 0x0018 (0x0018 - 0x0000)
struct AthenaQuickbarPrimary_C_HandleShowHideWeaponRail final
{
public:
	bool                                          CallFunc_HasOneNonHarvestWeapon_HasNonHarvestWeapon; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_HandleShowHideWeaponRail");
static_assert(sizeof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail) == 0x000018, "Wrong size on AthenaQuickbarPrimary_C_HandleShowHideWeaponRail");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail, CallFunc_HasOneNonHarvestWeapon_HasNonHarvestWeapon) == 0x000000, "Member 'AthenaQuickbarPrimary_C_HandleShowHideWeaponRail::CallFunc_HasOneNonHarvestWeapon_HasNonHarvestWeapon' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaQuickbarPrimary_C_HandleShowHideWeaponRail::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaQuickbarPrimary_C_HandleShowHideWeaponRail::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleShowHideWeaponRail, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'AthenaQuickbarPrimary_C_HandleShowHideWeaponRail::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.HasOneNonHarvestWeapon
// 0x0020 (0x0020 - 0x0000)
struct AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon final
{
public:
	bool                                          HasNonHarvestWeapon;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F80[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuickBarSlotBase*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon");
static_assert(sizeof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon) == 0x000020, "Wrong size on AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, HasNonHarvestWeapon) == 0x000000, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::HasNonHarvestWeapon' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, Temp_int_Variable) == 0x000004, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaQuickbarPrimary_C_HasOneNonHarvestWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.Show Primary Quickbar Rail
// 0x0005 (0x0005 - 0x0000)
struct AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail) == 0x000001, "Wrong alignment on AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail");
static_assert(sizeof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail) == 0x000005, "Wrong size on AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail");
static_assert(offsetof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail, Show) == 0x000000, "Member 'AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail::Show' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail, Temp_bool_Variable) == 0x000001, "Member 'AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail, Temp_byte_Variable) == 0x000002, "Member 'AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail, Temp_byte_Variable_1) == 0x000003, "Member 'AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail, K2Node_Select_Default) == 0x000004, "Member 'AthenaQuickbarPrimary_C_Show_Primary_Quickbar_Rail::K2Node_Select_Default' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.OnReady_ECD8F67D499AA47681F88E9746363B9F
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F");
static_assert(sizeof(AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F) == 0x000030, "Wrong size on AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F, GameState) == 0x000000, "Member 'AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F::GameState' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F, Playlist) == 0x000008, "Member 'AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F::Playlist' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F, PlaylistContextTags) == 0x000010, "Member 'AthenaQuickbarPrimary_C_OnReady_ECD8F67D499AA47681F88E9746363B9F::PlaylistContextTags' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.HandleInputMethodChanged_Bind
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind) == 0x000001, "Wrong alignment on AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind");
static_assert(sizeof(AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind) == 0x000001, "Wrong size on AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind");
static_assert(offsetof(AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind, InputType) == 0x000000, "Member 'AthenaQuickbarPrimary_C_HandleInputMethodChanged_Bind::InputType' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.OnQuickBarSlotFocusChanged_Bind
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F81[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Slot;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind) == 0x000004, "Wrong alignment on AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind");
static_assert(sizeof(AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind) == 0x000008, "Wrong size on AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind, QuickbarIndex) == 0x000000, "Member 'AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind, Param_Slot) == 0x000004, "Member 'AthenaQuickbarPrimary_C_OnQuickBarSlotFocusChanged_Bind::Param_Slot' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.OnQuickbarContentsChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaQuickbarPrimary_C_OnQuickbarContentsChanged final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F82[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ChangedSlots;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarPrimary_C_OnQuickbarContentsChanged) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_OnQuickbarContentsChanged");
static_assert(sizeof(AthenaQuickbarPrimary_C_OnQuickbarContentsChanged) == 0x000018, "Wrong size on AthenaQuickbarPrimary_C_OnQuickbarContentsChanged");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnQuickbarContentsChanged, QuickbarIndex) == 0x000000, "Member 'AthenaQuickbarPrimary_C_OnQuickbarContentsChanged::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_OnQuickbarContentsChanged, ChangedSlots) == 0x000008, "Member 'AthenaQuickbarPrimary_C_OnQuickbarContentsChanged::ChangedSlots' has a wrong offset!");

// Function AthenaQuickbarPrimary.AthenaQuickbarPrimary_C.ExecuteUbergraph_AthenaQuickbarPrimary
// 0x0140 (0x0140 - 0x0000)
struct AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F83[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0020(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_InputType;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F84[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0058(0x0020)(ConstParm)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	EFortQuickBars                                K2Node_CustomEvent_QuickbarIndex;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F85[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Slot;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F86[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortQuickBars QuickbarIndex, int32 Slot)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F87[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	EFortQuickBars                                K2Node_Event_QuickbarIndex;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F88[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Event_ChangedSlots;                         // 0x00D0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UFortQuickBarSlotBase*>          K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortInteractContextInfo* ContextInfo)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuickBars                                CallFunc_GetQuickbarFocus_OutQuickBar;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F89[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuickbarFocus_OutSlot;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuickbarFocus_OutSecondarySlot;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuickbarFocus_OutPreviousFocusedSlot;  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F8A[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_2;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary) == 0x000008, "Wrong alignment on AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary");
static_assert(sizeof(AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary) == 0x000140, "Wrong size on AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary");
static_assert(offsetof(AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary, EntryPoint) == 0x000000, "Member 'AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary, Temp_object_Variable) == 0x000008, "Member 'AthenaQuickbarPrimary_C_ExecuteUbergraph_AthenaQuickbarPrimary::Temp_object_Variable' has a wrong offset!");
