#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuest_BGA

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuest_BGA.AthenaQuest_BGA_C.ExecuteUbergraph_AthenaQuest_BGA
// 0x04A8 (0x04A8 - 0x0000)
struct AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_846A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_846B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_846C[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_846D[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00E8(0x0020)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_846E[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistTags;                   // 0x0150(0x0020)()
	bool                                          K2Node_CustomEvent_bIsCalendarEventEnabled;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFoundBlockedPlaylistTags;      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_846F[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8470[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0188(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8471[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_FortPlayerController_3;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               K2Node_CustomEvent_FortQuestItemDefinition;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsCompletedForSelf;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsAssisting;                   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HasQuest;                       // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8472[0x1];                                     // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8473[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8474[0x5];                                     // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToHideByDefault; // 0x01D8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestComplete; // 0x01E8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestInProgress; // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0208(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSplitScreen_ReturnValue;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8475[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      Temp_object_Variable;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetPlayerControllerBP_ReturnValue;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8476[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      K2Node_CustomEvent_OwningQuestManager;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFoundAllQuestsOnProfile;       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8477[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentQuestsReady*    CallFunc_CurrentQuestsReadyAsync_ReturnValue;      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8478[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8479[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_FortPlayerController_2;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_847A[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item_1;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortPlayerControllerOut; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortQuestItemDefinitionOut; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsCompletedForSelf; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsAssisting; // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bHasQuest; // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847B[0x1];                                     // 0x029B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847C[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_2;                         // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue;  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847D[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847E[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortQuestObjectiveInfo*          K2Node_CustomEvent_QuestObjective;                 // 0x02C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDisplayStatusUpdate;           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bDisplayAnnouncementUpdate;     // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847F[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_3;                         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_1; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8480[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8481[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetOwningQuest_ReturnValue;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8482[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0318(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0320(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8483[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8484[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_FortPlayerController_1;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8485[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestObjectiveInfo*                K2Node_CustomEvent_ObjectiveInfo_1;                // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PCOverrideForVisualTesting_1;   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8486[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_4;                         // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_2; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8487[0x6];                                     // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_FortPlayerController;           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_2;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortQuestObjectiveInfo* QuestObjective, bool bDisplayStatusUpdate, bool bDisplayAnnouncementUpdate)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortPlayerControllerOut_1; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortQuestItemDefinitionOut_1; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsCompletedForSelf_1; // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsAssisting_1; // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bHasQuest_1; // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8488[0x1];                                     // 0x03BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8489[0x2];                                     // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_3;            // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848A[0x2];                                     // 0x03CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_2;                            // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortPlayerControllerOut_2; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortQuestItemDefinitionOut_2; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsCompletedForSelf_2; // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsAssisting_2; // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayerCompletedQuestOrIsAssisting_bHasQuest_2; // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848B[0x2];                                     // 0x03EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortQuestObjectiveInfo* QuestObjective, bool bDisplayStatusUpdate, bool bDisplayAnnouncementUpdate)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0403(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848C[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_5;                         // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_848D[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0418(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848E[0x6];                                     // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToHideByDefault_1; // 0x0440(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestComplete_1; // 0x0450(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestInProgress_1; // 0x0460(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_2; // 0x0470(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_6;                         // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_3; // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848F[0x3];                                     // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestObjectiveInfo*                K2Node_CustomEvent_ObjectiveInfo;                  // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PCOverrideForVisualTesting;     // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA) == 0x000008, "Wrong alignment on AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA");
static_assert(sizeof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA) == 0x0004A8, "Wrong size on AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, EntryPoint) == 0x000000, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_EventName_1) == 0x000030, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000040, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000048, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000050, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_EventName) == 0x000068, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeUntilEnd) == 0x000078, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSinceBegin) == 0x000080, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_TimeSpanRatio) == 0x000088, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_float_Variable) == 0x00009C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_struct_Variable) == 0x0000A0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_struct_Variable_1) == 0x0000A8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_string_Variable) == 0x0000B0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable_1) == 0x0000CC, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_GameState) == 0x0000D8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_Playlist) == 0x0000E0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_PlaylistContextTags) == 0x0000E8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue_1) == 0x000108, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable_2) == 0x00010C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue_2) == 0x000120, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable_2) == 0x000124, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable_3) == 0x000128, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable_3) == 0x00012C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue_3) == 0x000130, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable_4) == 0x000134, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CreateDelegate_OutputDelegate_3) == 0x000138, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasAuthority_ReturnValue_1) == 0x000148, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_PlaylistTags) == 0x000150, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_PlaylistTags' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_bIsCalendarEventEnabled) == 0x000170, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_bIsCalendarEventEnabled' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_bFoundBlockedPlaylistTags) == 0x000171, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_bFoundBlockedPlaylistTags' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000178, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_IsValid_ReturnValue) == 0x000182, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000183, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000188, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Get_Item) == 0x000198, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_GetQuestManager_ReturnValue) == 0x0001A8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_FortPlayerController_3) == 0x0001B0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_FortPlayerController_3' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_FortQuestItemDefinition) == 0x0001B8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_FortQuestItemDefinition' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_bIsCompletedForSelf) == 0x0001C0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_bIsCompletedForSelf' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_bIsAssisting) == 0x0001C1, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_bIsAssisting' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_HasQuest) == 0x0001C2, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_HasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable_4) == 0x0001C4, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C9, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001CC, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001D0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_BooleanAND_ReturnValue_2) == 0x0001D1, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_BooleanOR_ReturnValue) == 0x0001D2, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_SetPrimitiveGroupsToHide_PrimitivesToHideByDefault) == 0x0001D8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_SetPrimitiveGroupsToHide_PrimitivesToHideByDefault' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestComplete) == 0x0001E8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestComplete' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestInProgress) == 0x0001F8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_SetPrimitiveGroupsToHide_PrimitivesToShowIfQuestInProgress' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000208, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Length_ReturnValue_1) == 0x000218, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_IsSplitScreen_ReturnValue) == 0x00021C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_IsSplitScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_object_Variable) == 0x000220, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_GetPlayerControllerBP_ReturnValue) == 0x000228, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_GetPlayerControllerBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_bool_Variable) == 0x000230, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_OwningQuestManager) == 0x000238, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_OwningQuestManager' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_bFoundAllQuestsOnProfile) == 0x000240, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_bFoundAllQuestsOnProfile' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_CurrentQuestsReadyAsync_ReturnValue) == 0x000248, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_CurrentQuestsReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_IsValid_ReturnValue_1) == 0x000250, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Loop_Counter_Variable_5) == 0x000254, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CreateDelegate_OutputDelegate_4) == 0x000258, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Less_IntInt_ReturnValue) == 0x000268, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Add_IntInt_ReturnValue_5) == 0x00026C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, K2Node_CustomEvent_FortPlayerController_2) == 0x000270, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::K2Node_CustomEvent_FortPlayerController_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, Temp_int_Array_Index_Variable_5) == 0x000278, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Get_Item_1) == 0x000280, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortPlayerControllerOut) == 0x000288, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortPlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortQuestItemDefinitionOut) == 0x000290, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasPlayerCompletedQuestOrIsAssisting_FortQuestItemDefinitionOut' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsCompletedForSelf) == 0x000298, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsCompletedForSelf' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsAssisting) == 0x000299, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasPlayerCompletedQuestOrIsAssisting_bIsAssisting' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_HasPlayerCompletedQuestOrIsAssisting_bHasQuest) == 0x00029A, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_HasPlayerCompletedQuestOrIsAssisting_bHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Length_ReturnValue_2) == 0x00029C, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002A0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Get_Item_2) == 0x0002A8, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_SetCompHiddenControllerOnly_ReturnValue) == 0x0002B0, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_SetCompHiddenControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA, CallFunc_Array_Length_ReturnValue_3) == 0x0002B4, "Member 'AthenaQuest_BGA_C_ExecuteUbergraph_AthenaQuest_BGA::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
