#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengePageEntry

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.GetSelectedAnimation
// 0x0020 (0x0020 - 0x0000)
struct AthenaChallengePageEntry_C_GetSelectedAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7103[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengePageEntry_C_GetSelectedAnimation) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_GetSelectedAnimation");
static_assert(sizeof(AthenaChallengePageEntry_C_GetSelectedAnimation) == 0x000020, "Wrong size on AthenaChallengePageEntry_C_GetSelectedAnimation");
static_assert(offsetof(AthenaChallengePageEntry_C_GetSelectedAnimation, ReturnValue) == 0x000000, "Member 'AthenaChallengePageEntry_C_GetSelectedAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetSelectedAnimation, Temp_bool_Variable) == 0x000008, "Member 'AthenaChallengePageEntry_C_GetSelectedAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetSelectedAnimation, Temp_bool_Variable_1) == 0x000009, "Member 'AthenaChallengePageEntry_C_GetSelectedAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetSelectedAnimation, K2Node_Select_Default) == 0x000010, "Member 'AthenaChallengePageEntry_C_GetSelectedAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetSelectedAnimation, K2Node_Select_Default_1) == 0x000018, "Member 'AthenaChallengePageEntry_C_GetSelectedAnimation::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.GetHoveredAnimation
// 0x0020 (0x0020 - 0x0000)
struct AthenaChallengePageEntry_C_GetHoveredAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7104[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengePageEntry_C_GetHoveredAnimation) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_GetHoveredAnimation");
static_assert(sizeof(AthenaChallengePageEntry_C_GetHoveredAnimation) == 0x000020, "Wrong size on AthenaChallengePageEntry_C_GetHoveredAnimation");
static_assert(offsetof(AthenaChallengePageEntry_C_GetHoveredAnimation, ReturnValue) == 0x000000, "Member 'AthenaChallengePageEntry_C_GetHoveredAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetHoveredAnimation, Temp_bool_Variable) == 0x000008, "Member 'AthenaChallengePageEntry_C_GetHoveredAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetHoveredAnimation, Temp_bool_Variable_1) == 0x000009, "Member 'AthenaChallengePageEntry_C_GetHoveredAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetHoveredAnimation, K2Node_Select_Default) == 0x000010, "Member 'AthenaChallengePageEntry_C_GetHoveredAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_GetHoveredAnimation, K2Node_Select_Default_1) == 0x000018, "Member 'AthenaChallengePageEntry_C_GetHoveredAnimation::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.IsUsingGamepad
// 0x0018 (0x0018 - 0x0000)
struct AthenaChallengePageEntry_C_IsUsingGamepad final
{
public:
	bool                                          Return_Value;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7105[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_IsUsingGamepad) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_IsUsingGamepad");
static_assert(sizeof(AthenaChallengePageEntry_C_IsUsingGamepad) == 0x000018, "Wrong size on AthenaChallengePageEntry_C_IsUsingGamepad");
static_assert(offsetof(AthenaChallengePageEntry_C_IsUsingGamepad, Return_Value) == 0x000000, "Member 'AthenaChallengePageEntry_C_IsUsingGamepad::Return_Value' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_IsUsingGamepad, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'AthenaChallengePageEntry_C_IsUsingGamepad::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_IsUsingGamepad, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaChallengePageEntry_C_IsUsingGamepad::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_IsUsingGamepad, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'AthenaChallengePageEntry_C_IsUsingGamepad::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnMouseButtonUp
// 0x0238 (0x0238 - 0x0000)
struct AthenaChallengePageEntry_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UWidgetAnimation*                       CallFunc_GetSelectedAnimation_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7106[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_OnMouseButtonUp");
static_assert(sizeof(AthenaChallengePageEntry_C_OnMouseButtonUp) == 0x000238, "Wrong size on AthenaChallengePageEntry_C_OnMouseButtonUp");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, CallFunc_GetSelectedAnimation_ReturnValue) == 0x000160, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::CallFunc_GetSelectedAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, CallFunc_IsUsingTouch_ReturnValue) == 0x000168, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, CallFunc_PlayAnimation_ReturnValue) == 0x000170, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonUp, CallFunc_BooleanAND_ReturnValue) == 0x000230, "Member 'AthenaChallengePageEntry_C_OnMouseButtonUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct AthenaChallengePageEntry_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7107[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(AthenaChallengePageEntry_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_OnMouseButtonDown");
static_assert(sizeof(AthenaChallengePageEntry_C_OnMouseButtonDown) == 0x000220, "Wrong size on AthenaChallengePageEntry_C_OnMouseButtonDown");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'AthenaChallengePageEntry_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'AthenaChallengePageEntry_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonDown, CallFunc_IsUsingTouch_ReturnValue) == 0x000160, "Member 'AthenaChallengePageEntry_C_OnMouseButtonDown::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'AthenaChallengePageEntry_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.SetDefault
// 0x0009 (0x0009 - 0x0000)
struct AthenaChallengePageEntry_C_SetDefault final
{
public:
	bool                                          PartyAssisted;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengePageEntry_C_SetDefault) == 0x000001, "Wrong alignment on AthenaChallengePageEntry_C_SetDefault");
static_assert(sizeof(AthenaChallengePageEntry_C_SetDefault) == 0x000009, "Wrong size on AthenaChallengePageEntry_C_SetDefault");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, PartyAssisted) == 0x000000, "Member 'AthenaChallengePageEntry_C_SetDefault::PartyAssisted' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_byte_Variable) == 0x000001, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_bool_Variable) == 0x000003, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_byte_Variable_2) == 0x000004, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_byte_Variable_3) == 0x000005, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, Temp_bool_Variable_1) == 0x000006, "Member 'AthenaChallengePageEntry_C_SetDefault::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, K2Node_Select_Default) == 0x000007, "Member 'AthenaChallengePageEntry_C_SetDefault::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_SetDefault, K2Node_Select_Default_1) == 0x000008, "Member 'AthenaChallengePageEntry_C_SetDefault::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct AthenaChallengePageEntry_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UWidgetAnimation*                       CallFunc_GetSelectedAnimation_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7108[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
};
static_assert(alignof(AthenaChallengePageEntry_C_OnFocusReceived) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_OnFocusReceived");
static_assert(sizeof(AthenaChallengePageEntry_C_OnFocusReceived) == 0x0001C8, "Wrong size on AthenaChallengePageEntry_C_OnFocusReceived");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, CallFunc_GetSelectedAnimation_ReturnValue) == 0x0000F8, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::CallFunc_GetSelectedAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, CallFunc_IsUsingTouch_ReturnValue) == 0x000100, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, CallFunc_PlayAnimation_ReturnValue) == 0x000108, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'AthenaChallengePageEntry_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.BP_OnIsInGameSet
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengePageEntry_C_BP_OnIsInGameSet final
{
public:
	bool                                          bIsInGame;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_BP_OnIsInGameSet) == 0x000001, "Wrong alignment on AthenaChallengePageEntry_C_BP_OnIsInGameSet");
static_assert(sizeof(AthenaChallengePageEntry_C_BP_OnIsInGameSet) == 0x000001, "Wrong size on AthenaChallengePageEntry_C_BP_OnIsInGameSet");
static_assert(offsetof(AthenaChallengePageEntry_C_BP_OnIsInGameSet, bIsInGame) == 0x000000, "Member 'AthenaChallengePageEntry_C_BP_OnIsInGameSet::bIsInGame' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.BP_OnIsLastEntrySet
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengePageEntry_C_BP_OnIsLastEntrySet final
{
public:
	bool                                          bIsLastEntry;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_BP_OnIsLastEntrySet) == 0x000001, "Wrong alignment on AthenaChallengePageEntry_C_BP_OnIsLastEntrySet");
static_assert(sizeof(AthenaChallengePageEntry_C_BP_OnIsLastEntrySet) == 0x000001, "Wrong size on AthenaChallengePageEntry_C_BP_OnIsLastEntrySet");
static_assert(offsetof(AthenaChallengePageEntry_C_BP_OnIsLastEntrySet, bIsLastEntry) == 0x000000, "Member 'AthenaChallengePageEntry_C_BP_OnIsLastEntrySet::bIsLastEntry' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengePageEntry_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_OnFocusLost) == 0x000004, "Wrong alignment on AthenaChallengePageEntry_C_OnFocusLost");
static_assert(sizeof(AthenaChallengePageEntry_C_OnFocusLost) == 0x000008, "Wrong size on AthenaChallengePageEntry_C_OnFocusLost");
static_assert(offsetof(AthenaChallengePageEntry_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaChallengePageEntry_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaChallengePageEntry_C_OnMouseEnter) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_OnMouseEnter");
static_assert(sizeof(AthenaChallengePageEntry_C_OnMouseEnter) == 0x0000A8, "Wrong size on AthenaChallengePageEntry_C_OnMouseEnter");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'AthenaChallengePageEntry_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct AthenaChallengePageEntry_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaChallengePageEntry_C_OnMouseLeave) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_OnMouseLeave");
static_assert(sizeof(AthenaChallengePageEntry_C_OnMouseLeave) == 0x000070, "Wrong size on AthenaChallengePageEntry_C_OnMouseLeave");
static_assert(offsetof(AthenaChallengePageEntry_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.OnSetState
// 0x0004 (0x0004 - 0x0000)
struct AthenaChallengePageEntry_C_OnSetState final
{
public:
	bool                                          bIsCompleted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLocked;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPartyAssisted;                                  // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_bIsGroupChallenge;                           // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengePageEntry_C_OnSetState) == 0x000001, "Wrong alignment on AthenaChallengePageEntry_C_OnSetState");
static_assert(sizeof(AthenaChallengePageEntry_C_OnSetState) == 0x000004, "Wrong size on AthenaChallengePageEntry_C_OnSetState");
static_assert(offsetof(AthenaChallengePageEntry_C_OnSetState, bIsCompleted) == 0x000000, "Member 'AthenaChallengePageEntry_C_OnSetState::bIsCompleted' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnSetState, bIsLocked) == 0x000001, "Member 'AthenaChallengePageEntry_C_OnSetState::bIsLocked' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnSetState, bIsPartyAssisted) == 0x000002, "Member 'AthenaChallengePageEntry_C_OnSetState::bIsPartyAssisted' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_OnSetState, Param_bIsGroupChallenge) == 0x000003, "Member 'AthenaChallengePageEntry_C_OnSetState::Param_bIsGroupChallenge' has a wrong offset!");

// Function AthenaChallengePageEntry.AthenaChallengePageEntry_C.ExecuteUbergraph_AthenaChallengePageEntry
// 0x0200 (0x0200 - 0x0000)
struct AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7109[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_710A[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsInGame;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_710B[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_710C[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_710D[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLastEntry;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_710E[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0074(0x0008)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_710F[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00B8(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0128(0x0070)(ConstParm)
	bool                                          K2Node_Event_bIsCompleted;                         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocked;                            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPartyAssisted;                     // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsGroupChallenge;                    // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7110[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Return_Value;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Return_Value_1;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7111[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetHoveredAnimation_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetHoveredAnimation_ReturnValue_1;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetSelectedAnimation_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetSelectedAnimation_ReturnValue_1;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7112[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry) == 0x000008, "Wrong alignment on AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry");
static_assert(sizeof(AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry) == 0x000200, "Wrong size on AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry");
static_assert(offsetof(AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry, EntryPoint) == 0x000000, "Member 'AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry, Temp_bool_Variable) == 0x000004, "Member 'AthenaChallengePageEntry_C_ExecuteUbergraph_AthenaChallengePageEntry::Temp_bool_Variable' has a wrong offset!");
