#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStormSurgeIconWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStormSurgeIconWidget.AthenaStormSurgeIconWidget_C
// 0x0038 (0x0268 - 0x0230)
class UAthenaStormSurgeIconWidget_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       IconDMG_Off;                                       // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconDMG_On;                                        // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StormIcon;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StormIconOff;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Anim_dmgOFF();
	void Anim_dmgON();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStormSurgeIconWidget_C">();
	}
	static class UAthenaStormSurgeIconWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStormSurgeIconWidget_C>();
	}
};
static_assert(alignof(UAthenaStormSurgeIconWidget_C) == 0x000008, "Wrong alignment on UAthenaStormSurgeIconWidget_C");
static_assert(sizeof(UAthenaStormSurgeIconWidget_C) == 0x000268, "Wrong size on UAthenaStormSurgeIconWidget_C");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, IconDMG_Off) == 0x000230, "Member 'UAthenaStormSurgeIconWidget_C::IconDMG_Off' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, IconDMG_On) == 0x000238, "Member 'UAthenaStormSurgeIconWidget_C::IconDMG_On' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, Glow) == 0x000240, "Member 'UAthenaStormSurgeIconWidget_C::Glow' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, Image_1) == 0x000248, "Member 'UAthenaStormSurgeIconWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, Image_2) == 0x000250, "Member 'UAthenaStormSurgeIconWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, StormIcon) == 0x000258, "Member 'UAthenaStormSurgeIconWidget_C::StormIcon' has a wrong offset!");
static_assert(offsetof(UAthenaStormSurgeIconWidget_C, StormIconOff) == 0x000260, "Member 'UAthenaStormSurgeIconWidget_C::StormIconOff' has a wrong offset!");

}

