#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPickupStream

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaPickupStream.AthenaPickupStream_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaPickupStream_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPickupStream_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaPickupStream_C_PreConstruct");
static_assert(sizeof(AthenaPickupStream_C_PreConstruct) == 0x000001, "Wrong size on AthenaPickupStream_C_PreConstruct");
static_assert(offsetof(AthenaPickupStream_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaPickupStream_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaPickupStream.AthenaPickupStream_C.RefreshPickupEntry
// 0x0038 (0x0038 - 0x0000)
struct AthenaPickupStream_C_RefreshPickupEntry final
{
public:
	class UUserWidget*                            EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupStream_C_RefreshPickupEntry) == 0x000008, "Wrong alignment on AthenaPickupStream_C_RefreshPickupEntry");
static_assert(sizeof(AthenaPickupStream_C_RefreshPickupEntry) == 0x000038, "Wrong size on AthenaPickupStream_C_RefreshPickupEntry");
static_assert(offsetof(AthenaPickupStream_C_RefreshPickupEntry, EntryWidget) == 0x000000, "Member 'AthenaPickupStream_C_RefreshPickupEntry::EntryWidget' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_RefreshPickupEntry, Icon) == 0x000008, "Member 'AthenaPickupStream_C_RefreshPickupEntry::Icon' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_RefreshPickupEntry, Count) == 0x000030, "Member 'AthenaPickupStream_C_RefreshPickupEntry::Count' has a wrong offset!");

// Function AthenaPickupStream.AthenaPickupStream_C.ExecuteUbergraph_AthenaPickupStream
// 0x0060 (0x0060 - 0x0000)
struct AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F71[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_EntryWidget;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_Icon;                                 // 0x0010(0x0028)(ConstParm, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F72[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPickupMessageItem_C*             K2Node_DynamicCast_AsAthena_Pickup_Message_Item;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F73[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           K2Node_DynamicCast_AsSize_Box_Slot;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream) == 0x000008, "Wrong alignment on AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream");
static_assert(sizeof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream) == 0x000060, "Wrong size on AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, EntryPoint) == 0x000000, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_Event_EntryWidget) == 0x000008, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_Event_EntryWidget' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_Event_Icon) == 0x000010, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_Event_Icon' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_Event_Count) == 0x000038, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_DynamicCast_AsAthena_Pickup_Message_Item) == 0x000040, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_DynamicCast_AsAthena_Pickup_Message_Item' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_Event_IsDesignTime) == 0x000049, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_DynamicCast_AsSize_Box_Slot) == 0x000050, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_DynamicCast_AsSize_Box_Slot' has a wrong offset!");
static_assert(offsetof(AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AthenaPickupStream_C_ExecuteUbergraph_AthenaPickupStream::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

