#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchPlayerGridPlayerWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AthenaEventMatchPlayerGridStatus_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEventMatchPlayerGridPlayerWidget.AthenaEventMatchPlayerGridPlayerWidget_C
// 0x05A8 (0x1128 - 0x0B80)
class UAthenaEventMatchPlayerGridPlayerWidget_C final : public UAthenaEventMatchPlayerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShieldDamagedAnim;                               // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHealthDamagedAnim;                               // 0x0B90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          ActiveBorder;                                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorKillsWidget_C*          AthenaSpectatorKillsWidget;                        // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BeingRevivedBorder;                                // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          DBNOBorder;                                        // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          EliminatedBorder;                                  // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorHitPointBar_C*          HealthBar;                                         // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          HealthDamagedBorder;                               // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              HitPointBarsScaleBox;                              // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              KillsScaleBox;                                     // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          LowHealthBorder;                                   // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              PlayerNameScaleBox;                                // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorHitPointBar_C*          ShieldBar;                                         // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ShieldDamagedBorder;                               // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DesignTime_GridSize;                               // 0x0C08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LowHealthPercent;                                  // 0x0C0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x0C10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LowHealthColor;                                    // 0x0C20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DBNOColor;                                         // 0x0C30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeingRevivedColor;                                 // 0x0C40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EliminatedColor;                                   // 0x0C50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HealthDamagedColor;                                // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ShieldDamagedColor;                                // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColorActive;                                   // 0x0C80(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            TextColorEliminated;                               // 0x0CA8(0x0028)(Edit, BlueprintVisible)
	EAthenaEventMatchPlayerGridStatus             PlayerStatus;                                      // 0x0CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DesignTime_ApplyHealthDamage;                      // 0x0CD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DesignTime_ApplyShieldDamage;                      // 0x0CD2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C7C[0x5];                                     // 0x0CD3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ActiveBrush;                                       // 0x0CD8(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            LowHealthBrush;                                    // 0x0D60(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            DBNOBrush;                                         // 0x0DE8(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            BeingRevivedBrush;                                 // 0x0E70(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            EliminatedBrush;                                   // 0x0EF8(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            HealthDamagedBrush;                                // 0x0F80(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            ShieldDamagedBrush;                                // 0x1008(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            ShadowBrush;                                       // 0x1090(0x0088)(Edit, BlueprintVisible)
	TArray<class UCommonBorder*>                  Backgrounds;                                       // 0x1118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaEventMatchPlayerGridPlayerWidget(int32 EntryPoint);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void PreConstruct(bool IsDesignTime);
	void OnDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void OnShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnPlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* InPlayerState);
	void OnBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
	void OnDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void OnShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void UpdateBackground();
	void UpdateStatus();
	void UpdateNameText();
	void OnGridSizeChanged(int32 InGridSize);
	void SetupBackgrounds();
	void UpdateHitPointBars();
	void UpdateKillsWidget();
	void IsAliveAndNotInAircraft(bool* bAliveAndNotInAircraft);
	void IsGamePreAircraft(bool* bIsGamePreAircraft);
	void StopDamageAnimations();
	void SetEliminationsVisibility(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEventMatchPlayerGridPlayerWidget_C">();
	}
	static class UAthenaEventMatchPlayerGridPlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventMatchPlayerGridPlayerWidget_C>();
	}
};
static_assert(alignof(UAthenaEventMatchPlayerGridPlayerWidget_C) == 0x000008, "Wrong alignment on UAthenaEventMatchPlayerGridPlayerWidget_C");
static_assert(sizeof(UAthenaEventMatchPlayerGridPlayerWidget_C) == 0x001128, "Wrong size on UAthenaEventMatchPlayerGridPlayerWidget_C");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, UberGraphFrame) == 0x000B80, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, OnShieldDamagedAnim) == 0x000B88, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::OnShieldDamagedAnim' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, OnHealthDamagedAnim) == 0x000B90, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::OnHealthDamagedAnim' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ActiveBorder) == 0x000B98, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ActiveBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, AthenaSpectatorKillsWidget) == 0x000BA0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::AthenaSpectatorKillsWidget' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, BeingRevivedBorder) == 0x000BA8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::BeingRevivedBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DBNOBorder) == 0x000BB0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DBNOBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, EliminatedBorder) == 0x000BB8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::EliminatedBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, HealthBar) == 0x000BC0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, HealthDamagedBorder) == 0x000BC8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::HealthDamagedBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, HitPointBarsScaleBox) == 0x000BD0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::HitPointBarsScaleBox' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, KillsScaleBox) == 0x000BD8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::KillsScaleBox' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, LowHealthBorder) == 0x000BE0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::LowHealthBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, PlayerName) == 0x000BE8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, PlayerNameScaleBox) == 0x000BF0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::PlayerNameScaleBox' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ShieldBar) == 0x000BF8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ShieldBar' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ShieldDamagedBorder) == 0x000C00, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ShieldDamagedBorder' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DesignTime_GridSize) == 0x000C08, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DesignTime_GridSize' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, LowHealthPercent) == 0x000C0C, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::LowHealthPercent' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ActiveColor) == 0x000C10, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ActiveColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, LowHealthColor) == 0x000C20, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::LowHealthColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DBNOColor) == 0x000C30, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DBNOColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, BeingRevivedColor) == 0x000C40, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::BeingRevivedColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, EliminatedColor) == 0x000C50, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::EliminatedColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, HealthDamagedColor) == 0x000C60, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::HealthDamagedColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ShieldDamagedColor) == 0x000C70, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ShieldDamagedColor' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, TextColorActive) == 0x000C80, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::TextColorActive' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, TextColorEliminated) == 0x000CA8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::TextColorEliminated' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, PlayerStatus) == 0x000CD0, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::PlayerStatus' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DesignTime_ApplyHealthDamage) == 0x000CD1, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DesignTime_ApplyHealthDamage' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DesignTime_ApplyShieldDamage) == 0x000CD2, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DesignTime_ApplyShieldDamage' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ActiveBrush) == 0x000CD8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ActiveBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, LowHealthBrush) == 0x000D60, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::LowHealthBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, DBNOBrush) == 0x000DE8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::DBNOBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, BeingRevivedBrush) == 0x000E70, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::BeingRevivedBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, EliminatedBrush) == 0x000EF8, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::EliminatedBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, HealthDamagedBrush) == 0x000F80, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::HealthDamagedBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ShieldDamagedBrush) == 0x001008, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ShieldDamagedBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, ShadowBrush) == 0x001090, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::ShadowBrush' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchPlayerGridPlayerWidget_C, Backgrounds) == 0x001118, "Member 'UAthenaEventMatchPlayerGridPlayerWidget_C::Backgrounds' has a wrong offset!");

}

