#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_Bush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_Bush.Athena_Player_Bush_C
// 0x0050 (0x0818 - 0x07C8)
class AAthena_Player_Bush_C final : public ABuildingGameplayActorBalloon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Bush;                                           // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Effects;                                           // 0x07E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621A[0x7];                                     // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDamage;                                       // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621B[0x4];                                     // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHealth;                                         // 0x07F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Player_Bush(int32 EntryPoint);
	void RemoveBush();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();
	void CheckInstIsOwner(class AActor* DamageCauser, class AActor** Param_Owner);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_Bush_C">();
	}
	static class AAthena_Player_Bush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_Bush_C>();
	}
};
static_assert(alignof(AAthena_Player_Bush_C) == 0x000008, "Wrong alignment on AAthena_Player_Bush_C");
static_assert(sizeof(AAthena_Player_Bush_C) == 0x000818, "Wrong size on AAthena_Player_Bush_C");
static_assert(offsetof(AAthena_Player_Bush_C, UberGraphFrame) == 0x0007C8, "Member 'AAthena_Player_Bush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, SM_Bush) == 0x0007D0, "Member 'AAthena_Player_Bush_C::SM_Bush' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, Scene) == 0x0007D8, "Member 'AAthena_Player_Bush_C::Scene' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, Effects) == 0x0007E0, "Member 'AAthena_Player_Bush_C::Effects' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, PlayerPawn) == 0x0007E8, "Member 'AAthena_Player_Bush_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, TotalDamage) == 0x0007F0, "Member 'AAthena_Player_Bush_C::TotalDamage' has a wrong offset!");
static_assert(offsetof(AAthena_Player_Bush_C, MaxHealth) == 0x0007F8, "Member 'AAthena_Player_Bush_C::MaxHealth' has a wrong offset!");

}

