#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDWidget.AthenaMOTDWidget_C
// 0x0078 (0x04A0 - 0x0428)
class UAthenaMOTDWidget_C final : public UFortAthenaMOTDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnNewSelect;                                       // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Left;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Right;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_NewsHeader;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextFloater;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             UpdateStyle;                                       // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void UpdateCustomColorStyle(bool bHasCustomColor, const struct FColor& CustomDarkColor, const struct FColor& CustomLightColor);
	void DialogResult_B7839D98483DEF9593D448BA28AE74F7(EFortDialogResult Result, class FName ResultName);
	void OnSelectedNews(const struct FAthenaNewsEntry& NewsEntry);
	void BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void StartSTWUpsell();
	void SetSpecialButtonText(const class FText& InText);
	void SetNormalButtonText(const class FText& InText);
	void PlayIntroAnimation();
	void ExecuteUbergraph_AthenaMOTDWidget(int32 EntryPoint);
	void UpdateStyle__DelegateSignature(EAthenaNewsStyle NewStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDWidget_C">();
	}
	static class UAthenaMOTDWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDWidget_C>();
	}
};
static_assert(alignof(UAthenaMOTDWidget_C) == 0x000008, "Wrong alignment on UAthenaMOTDWidget_C");
static_assert(sizeof(UAthenaMOTDWidget_C) == 0x0004A0, "Wrong size on UAthenaMOTDWidget_C");
static_assert(offsetof(UAthenaMOTDWidget_C, UberGraphFrame) == 0x000428, "Member 'UAthenaMOTDWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, NewAnimation) == 0x000430, "Member 'UAthenaMOTDWidget_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, IntroAnim) == 0x000438, "Member 'UAthenaMOTDWidget_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, OnNewSelect) == 0x000440, "Member 'UAthenaMOTDWidget_C::OnNewSelect' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CircleArrowButton_Left) == 0x000448, "Member 'UAthenaMOTDWidget_C::CircleArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CircleArrowButton_Right) == 0x000450, "Member 'UAthenaMOTDWidget_C::CircleArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CommonText_NewsHeader) == 0x000458, "Member 'UAthenaMOTDWidget_C::CommonText_NewsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, Image_156) == 0x000460, "Member 'UAthenaMOTDWidget_C::Image_156' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, Image_TextFloater) == 0x000468, "Member 'UAthenaMOTDWidget_C::Image_TextFloater' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_0) == 0x000470, "Member 'UAthenaMOTDWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_1) == 0x000478, "Member 'UAthenaMOTDWidget_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_2) == 0x000480, "Member 'UAthenaMOTDWidget_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_3) == 0x000488, "Member 'UAthenaMOTDWidget_C::SafeZone_3' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, UpdateStyle) == 0x000490, "Member 'UAthenaMOTDWidget_C::UpdateStyle' has a wrong offset!");

}

