#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpecialEventChallengeEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpecialEventChallengeEntry.AthenaSpecialEventChallengeEntry_C
// 0x0030 (0x0298 - 0x0268)
class UAthenaSpecialEventChallengeEntry_C final : public UAthenaSpecialEventChallengeEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_48;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CheckBox;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Timer;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UrgentAlert;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StyleLastElement(bool IsLast);
	void ExecuteUbergraph_AthenaSpecialEventChallengeEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpecialEventChallengeEntry_C">();
	}
	static class UAthenaSpecialEventChallengeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpecialEventChallengeEntry_C>();
	}
};
static_assert(alignof(UAthenaSpecialEventChallengeEntry_C) == 0x000008, "Wrong alignment on UAthenaSpecialEventChallengeEntry_C");
static_assert(sizeof(UAthenaSpecialEventChallengeEntry_C) == 0x000298, "Wrong size on UAthenaSpecialEventChallengeEntry_C");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, UberGraphFrame) == 0x000268, "Member 'UAthenaSpecialEventChallengeEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_48) == 0x000270, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_48' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_CheckBox) == 0x000278, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_CheckBox' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_Timer) == 0x000280, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_Timer' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Image_UrgentAlert) == 0x000288, "Member 'UAthenaSpecialEventChallengeEntry_C::Image_UrgentAlert' has a wrong offset!");
static_assert(offsetof(UAthenaSpecialEventChallengeEntry_C, Separator) == 0x000290, "Member 'UAthenaSpecialEventChallengeEntry_C::Separator' has a wrong offset!");

}

