#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_Plant_Shrub_03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_Plant_Shrub_03.Athena_Prop_Plant_Shrub_03_C.ExecuteUbergraph_Athena_Prop_Plant_Shrub_03
// 0x0060 (0x0060 - 0x0000)
struct Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85B9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85BA[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85BB[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03) == 0x000010, "Wrong alignment on Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03");
static_assert(sizeof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03) == 0x000060, "Wrong size on Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, EntryPoint) == 0x000000, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, CallFunc_Less_FloatFloat_ReturnValue) == 0x000050, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'Athena_Prop_Plant_Shrub_03_C_ExecuteUbergraph_Athena_Prop_Plant_Shrub_03::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

