#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_CB3_QuestA_install

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install
// 0x0120 (0x0120 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_858C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_Event_Player;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_1; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_858F[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8590[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8591[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8592[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue_1;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8593[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PC_1;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8594[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_PC;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8595[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x00C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8596[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8597[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8598[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_ComponentBoundEvent_PlayerController;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install) == 0x000120, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_Event_InteractingPawn) == 0x000018, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_Event_InteractionBeingAttempted) == 0x000020, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000028, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_Event_Player) == 0x000030, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SetCompHiddenControllerOnly_ReturnValue) == 0x000038, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SetCompHiddenControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SetCompHiddenControllerOnly_ReturnValue_1) == 0x000039, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SetCompHiddenControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000068, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SpawnFXAtLocation_ReturnValue_1) == 0x000080, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SpawnFXAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_VLerp_ReturnValue) == 0x000088, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_GetGameStateAthena_ReturnValue) == 0x000098, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_CustomEvent_PC_1) == 0x0000A0, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_CustomEvent_PC_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, Temp_bool_IsClosed_Variable) == 0x0000A9, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_CustomEvent_PC) == 0x0000B0, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_CustomEvent_PC' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x0000B8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x0000C8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_GetQuestManager_ReturnValue) == 0x0000D8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0000E8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0000E9, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0000F0, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_OnSameTeam_ReturnValue) == 0x0000F8, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, K2Node_ComponentBoundEvent_PlayerController) == 0x000108, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::K2Node_ComponentBoundEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000110, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000118, "Member 'AthenaQuestActor_CB3_QuestA_install_C_ExecuteUbergraph_AthenaQuestActor_CB3_QuestA_install::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature, PlayerController) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BndEvt__QuestComponent_K2Node_ComponentBoundEvent_0_SimpleQuestComponentDelegate__DelegateSignature::PlayerController' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.CompleteInteraction
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction, PC) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_CompleteInteraction::PC' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.DisplayMessage
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage, PC) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_DisplayMessage::PC' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.HandleQuestComponentSuccessEvent
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent final
{
public:
	class AFortPlayerController*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent) == 0x000008, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent, Player) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_HandleQuestComponentSuccessEvent::Player' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.BlueprintCanInteract
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8599[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_HasQuest_PlayerHasQuest;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_859A[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract) == 0x000038, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000018, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000020, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_Athena_HasQuest_PlayerHasQuest) == 0x000021, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_Athena_HasQuest_PlayerHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1) == 0x000028, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1) == 0x000030, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintCanInteract::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1' has a wrong offset!");

// Function AthenaQuestActor_CB3_QuestA_install.AthenaQuestActor_CB3_QuestA_install_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString");
static_assert(sizeof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_CB3_QuestA_install_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
