#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLocker_ItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C
// 0x0038 (0x02B0 - 0x0278)
class UAthenaLocker_ItemInfo_C final : public UAthenaLockerItemInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_ItemRarity;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_ItemType;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_RarityTint;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_34;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowDescription;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UpdateRarityWidgets(const struct FFortColorPalette& InColor, EFortRarity InRarity, class UFortItemSeriesDefinition* InSeries, bool HideRarity);
	void OnItemDefinitionSet(const class UFortItemDefinition* ItemDefinition);
	void OnNoItemSet();
	void ExecuteUbergraph_AthenaLocker_ItemInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLocker_ItemInfo_C">();
	}
	static class UAthenaLocker_ItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLocker_ItemInfo_C>();
	}
};
static_assert(alignof(UAthenaLocker_ItemInfo_C) == 0x000008, "Wrong alignment on UAthenaLocker_ItemInfo_C");
static_assert(sizeof(UAthenaLocker_ItemInfo_C) == 0x0002B0, "Wrong size on UAthenaLocker_ItemInfo_C");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, UberGraphFrame) == 0x000278, "Member 'UAthenaLocker_ItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, Border_ItemRarity) == 0x000280, "Member 'UAthenaLocker_ItemInfo_C::Border_ItemRarity' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, Border_ItemType) == 0x000288, "Member 'UAthenaLocker_ItemInfo_C::Border_ItemType' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, Border_RarityTint) == 0x000290, "Member 'UAthenaLocker_ItemInfo_C::Border_RarityTint' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, Image_93) == 0x000298, "Member 'UAthenaLocker_ItemInfo_C::Image_93' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, VerticalBox_34) == 0x0002A0, "Member 'UAthenaLocker_ItemInfo_C::VerticalBox_34' has a wrong offset!");
static_assert(offsetof(UAthenaLocker_ItemInfo_C, ShowDescription) == 0x0002A8, "Member 'UAthenaLocker_ItemInfo_C::ShowDescription' has a wrong offset!");

}

