#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPlayersLeftWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaPlayersLeftWidget.AthenaPlayersLeftWidget_C
// 0x0018 (0x02C8 - 0x02B0)
class UAthenaPlayersLeftWidget_C final : public UAthenaPlayersLeftBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 PlayersImage;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         PlayersLeftText;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetPlayersLeftText(const class FText& PlayersText);
	void ExecuteUbergraph_AthenaPlayersLeftWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaPlayersLeftWidget_C">();
	}
	static class UAthenaPlayersLeftWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPlayersLeftWidget_C>();
	}
};
static_assert(alignof(UAthenaPlayersLeftWidget_C) == 0x000008, "Wrong alignment on UAthenaPlayersLeftWidget_C");
static_assert(sizeof(UAthenaPlayersLeftWidget_C) == 0x0002C8, "Wrong size on UAthenaPlayersLeftWidget_C");
static_assert(offsetof(UAthenaPlayersLeftWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UAthenaPlayersLeftWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaPlayersLeftWidget_C, PlayersImage) == 0x0002B8, "Member 'UAthenaPlayersLeftWidget_C::PlayersImage' has a wrong offset!");
static_assert(offsetof(UAthenaPlayersLeftWidget_C, PlayersLeftText) == 0x0002C0, "Member 'UAthenaPlayersLeftWidget_C::PlayersLeftText' has a wrong offset!");

}

