#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorMapPlayerListRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorMapPlayerListRow.AthenaSpectatorMapPlayerListRow_C
// 0x0048 (0x0300 - 0x02B8)
class UAthenaSpectatorMapPlayerListRow_C final : public UAthenaSpectatorPlayerListEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           HitPointInfoVB;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ScoreboardStateBorder;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_EventScore;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SquadId;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IrrelevantStyle;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EliminatedStyle;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorMapPlayerListState                  DesignTime_State;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSpectatorMapPlayerListRow(int32 EntryPoint);
	void OnEventScoreChanged(int32 EventScore);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnSquadIdVisibilityChanged(bool bVisible);
	void OnIsInRelevancyChanged(bool bIsInRelevancy);
	void OnDisconnectedChanged(bool bIsDisconnected);
	void OnDeadStateChanged(bool bIsDead);
	void PreConstruct(bool IsDesignTime);
	void UpdateStyle(ESpectatorMapPlayerListState PlayerListState);

	void GetPlayerListState(ESpectatorMapPlayerListState* PlayerListState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorMapPlayerListRow_C">();
	}
	static class UAthenaSpectatorMapPlayerListRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorMapPlayerListRow_C>();
	}
};
static_assert(alignof(UAthenaSpectatorMapPlayerListRow_C) == 0x000008, "Wrong alignment on UAthenaSpectatorMapPlayerListRow_C");
static_assert(sizeof(UAthenaSpectatorMapPlayerListRow_C) == 0x000300, "Wrong size on UAthenaSpectatorMapPlayerListRow_C");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaSpectatorMapPlayerListRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, HitPointInfoVB) == 0x0002C0, "Member 'UAthenaSpectatorMapPlayerListRow_C::HitPointInfoVB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, ScoreboardStateBorder) == 0x0002C8, "Member 'UAthenaSpectatorMapPlayerListRow_C::ScoreboardStateBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, SizeBox_EventScore) == 0x0002D0, "Member 'UAthenaSpectatorMapPlayerListRow_C::SizeBox_EventScore' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, SizeBox_SquadId) == 0x0002D8, "Member 'UAthenaSpectatorMapPlayerListRow_C::SizeBox_SquadId' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, DefaultStyle) == 0x0002E0, "Member 'UAthenaSpectatorMapPlayerListRow_C::DefaultStyle' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, IrrelevantStyle) == 0x0002E8, "Member 'UAthenaSpectatorMapPlayerListRow_C::IrrelevantStyle' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, EliminatedStyle) == 0x0002F0, "Member 'UAthenaSpectatorMapPlayerListRow_C::EliminatedStyle' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorMapPlayerListRow_C, DesignTime_State) == 0x0002F8, "Member 'UAthenaSpectatorMapPlayerListRow_C::DesignTime_State' has a wrong offset!");

}

