#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCountdown

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCountdown.AthenaCountdown_C
// 0x0150 (0x0430 - 0x02E0)
class UAthenaCountdown_C final : public UAthenaCountdownWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FinalPhaseOutro;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalPhaseStart;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalCountdown;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalTick;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalTick;                                        // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CountdownVerticalBox;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Countdown;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WarningTextBoxFirstLine;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WarningTextBoxSecondLine;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CountdownLoopAudioEnabled;                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5552[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnTickLoop;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnTickNormal;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnTickFinal;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        TickLoopAudioComp;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveCountdownLoopVolume;                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveCountdownLoopPitch;                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTimeRemaining;                              // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpolatedTimeRemaining;                         // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalCountdownStartValue;                          // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5553[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnFinal10Countdown;                           // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinal60Countdown;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCountdownStarted;                                 // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5554[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnFinal10Countdown_Music;                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinal60Countdown_Music;                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFinalCountdownWarning_Music;                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Final_60_Countdown_Music_Instance;                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Final_60_Countdown_Music_Fadeout;                  // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5555[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x03B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              VerticalOffset;                                    // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FVector2D>   PlaylistOffsetMap;                                 // 0x03E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaCountdown(int32 EntryPoint);
	void OnCountdownStopped();
	void OnDisplayWarningMessage(const class FText& FirstLineText, const class FText& SecondLineText);
	void InitializeCountdown(int32 TimeRemaining, const class FText& DisplayText);
	void Set_Countdown_Loop_Audio_Enabled(bool Enabled);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnCountdownFinished();
	void OnCountdownUpdate(int32 TimeRemaining, const class FText& CountdownUpdateText);
	void Construct();
	void OnReady_ADBD201243C0508166DBDDB7356F9143(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void CheckTagsForWidgetOffset(TArray<struct FGameplayTag>& GameplayTags);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCountdown_C">();
	}
	static class UAthenaCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCountdown_C>();
	}
};
static_assert(alignof(UAthenaCountdown_C) == 0x000008, "Wrong alignment on UAthenaCountdown_C");
static_assert(sizeof(UAthenaCountdown_C) == 0x000430, "Wrong size on UAthenaCountdown_C");
static_assert(offsetof(UAthenaCountdown_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, FinalPhaseOutro) == 0x0002E8, "Member 'UAthenaCountdown_C::FinalPhaseOutro' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, FinalPhaseStart) == 0x0002F0, "Member 'UAthenaCountdown_C::FinalPhaseStart' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, FinalCountdown) == 0x0002F8, "Member 'UAthenaCountdown_C::FinalCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, FinalTick) == 0x000300, "Member 'UAthenaCountdown_C::FinalTick' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, NormalTick) == 0x000308, "Member 'UAthenaCountdown_C::NormalTick' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, CountdownVerticalBox) == 0x000310, "Member 'UAthenaCountdown_C::CountdownVerticalBox' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, TextBlock_Countdown) == 0x000318, "Member 'UAthenaCountdown_C::TextBlock_Countdown' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, WarningTextBoxFirstLine) == 0x000320, "Member 'UAthenaCountdown_C::WarningTextBoxFirstLine' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, WarningTextBoxSecondLine) == 0x000328, "Member 'UAthenaCountdown_C::WarningTextBoxSecondLine' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, CountdownLoopAudioEnabled) == 0x000330, "Member 'UAthenaCountdown_C::CountdownLoopAudioEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnTickLoop) == 0x000338, "Member 'UAthenaCountdown_C::SoundOnTickLoop' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnTickNormal) == 0x000340, "Member 'UAthenaCountdown_C::SoundOnTickNormal' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnTickFinal) == 0x000348, "Member 'UAthenaCountdown_C::SoundOnTickFinal' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, TickLoopAudioComp) == 0x000350, "Member 'UAthenaCountdown_C::TickLoopAudioComp' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, CurveCountdownLoopVolume) == 0x000358, "Member 'UAthenaCountdown_C::CurveCountdownLoopVolume' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, CurveCountdownLoopPitch) == 0x000360, "Member 'UAthenaCountdown_C::CurveCountdownLoopPitch' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, CurrentTimeRemaining) == 0x000368, "Member 'UAthenaCountdown_C::CurrentTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, InterpolatedTimeRemaining) == 0x00036C, "Member 'UAthenaCountdown_C::InterpolatedTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, FinalCountdownStartValue) == 0x000370, "Member 'UAthenaCountdown_C::FinalCountdownStartValue' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnFinal10Countdown) == 0x000378, "Member 'UAthenaCountdown_C::SoundOnFinal10Countdown' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnFinal60Countdown) == 0x000380, "Member 'UAthenaCountdown_C::SoundOnFinal60Countdown' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, bCountdownStarted) == 0x000388, "Member 'UAthenaCountdown_C::bCountdownStarted' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnFinal10Countdown_Music) == 0x000390, "Member 'UAthenaCountdown_C::SoundOnFinal10Countdown_Music' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnFinal60Countdown_Music) == 0x000398, "Member 'UAthenaCountdown_C::SoundOnFinal60Countdown_Music' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, SoundOnFinalCountdownWarning_Music) == 0x0003A0, "Member 'UAthenaCountdown_C::SoundOnFinalCountdownWarning_Music' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, Final_60_Countdown_Music_Instance) == 0x0003A8, "Member 'UAthenaCountdown_C::Final_60_Countdown_Music_Instance' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, Final_60_Countdown_Music_Fadeout) == 0x0003B0, "Member 'UAthenaCountdown_C::Final_60_Countdown_Music_Fadeout' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, RelevantPlaylistTags) == 0x0003B8, "Member 'UAthenaCountdown_C::RelevantPlaylistTags' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, VerticalOffset) == 0x0003D8, "Member 'UAthenaCountdown_C::VerticalOffset' has a wrong offset!");
static_assert(offsetof(UAthenaCountdown_C, PlaylistOffsetMap) == 0x0003E0, "Member 'UAthenaCountdown_C::PlaylistOffsetMap' has a wrong offset!");

}

