#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaContextualChallengeEntry_BP

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaContextualChallengeEntry_BP.AthenaContextualChallengeEntry_BP_C.StyleLastElement
// 0x0001 (0x0001 - 0x0000)
struct AthenaContextualChallengeEntry_BP_C_StyleLastElement final
{
public:
	bool                                          IsLast;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaContextualChallengeEntry_BP_C_StyleLastElement) == 0x000001, "Wrong alignment on AthenaContextualChallengeEntry_BP_C_StyleLastElement");
static_assert(sizeof(AthenaContextualChallengeEntry_BP_C_StyleLastElement) == 0x000001, "Wrong size on AthenaContextualChallengeEntry_BP_C_StyleLastElement");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_StyleLastElement, IsLast) == 0x000000, "Member 'AthenaContextualChallengeEntry_BP_C_StyleLastElement::IsLast' has a wrong offset!");

// Function AthenaContextualChallengeEntry_BP.AthenaContextualChallengeEntry_BP_C.ExecuteUbergraph_AthenaContextualChallengeEntry_BP
// 0x000C (0x000C - 0x0000)
struct AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isLast;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP) == 0x000004, "Wrong alignment on AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP");
static_assert(sizeof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP) == 0x00000C, "Wrong size on AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, EntryPoint) == 0x000000, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, Temp_bool_Variable) == 0x000004, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, Temp_byte_Variable) == 0x000005, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, K2Node_CustomEvent_isLast) == 0x000007, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::K2Node_CustomEvent_isLast' has a wrong offset!");
static_assert(offsetof(AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP, K2Node_Select_Default) == 0x000008, "Member 'AthenaContextualChallengeEntry_BP_C_ExecuteUbergraph_AthenaContextualChallengeEntry_BP::K2Node_Select_Default' has a wrong offset!");

}

