#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_FactionSelection_AlterEgo

#include "Basic.hpp"

#include "Enum_Athena_S12POI_Wars_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_FactionSelection_AlterEgo.Athena_FactionSelection_AlterEgo_C
// 0x00A0 (0x0150 - 0x00B0)
class UAthena_FactionSelection_AlterEgo_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           FactionTag;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFactionSelected;                                 // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<Enum_Athena_S12POI_Wars, struct FScalableFloat> MAP_FactionPOI;                                    // 0x00D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	Enum_Athena_S12POI_Wars                       POILocation;                                       // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76A3[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpyLTMPlaylist;                                    // 0x0124(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76A4[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  SpyLTMFactionTag;                                  // 0x0130(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnFactionSelected__DelegateSignature(const struct FGameplayTag& FactionTagOut);
	void ExecuteUbergraph_Athena_FactionSelection_AlterEgo(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnReady_5B56ACF64FBCDB3BB610B5B512C05696(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_Faction();
	bool CheckSpyLTMPlaylist();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_FactionSelection_AlterEgo_C">();
	}
	static class UAthena_FactionSelection_AlterEgo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_FactionSelection_AlterEgo_C>();
	}
};
static_assert(alignof(UAthena_FactionSelection_AlterEgo_C) == 0x000008, "Wrong alignment on UAthena_FactionSelection_AlterEgo_C");
static_assert(sizeof(UAthena_FactionSelection_AlterEgo_C) == 0x000150, "Wrong size on UAthena_FactionSelection_AlterEgo_C");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, UberGraphFrame) == 0x0000B0, "Member 'UAthena_FactionSelection_AlterEgo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, FactionTag) == 0x0000B8, "Member 'UAthena_FactionSelection_AlterEgo_C::FactionTag' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, OnFactionSelected) == 0x0000C0, "Member 'UAthena_FactionSelection_AlterEgo_C::OnFactionSelected' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, MAP_FactionPOI) == 0x0000D0, "Member 'UAthena_FactionSelection_AlterEgo_C::MAP_FactionPOI' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, POILocation) == 0x000120, "Member 'UAthena_FactionSelection_AlterEgo_C::POILocation' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, SpyLTMPlaylist) == 0x000124, "Member 'UAthena_FactionSelection_AlterEgo_C::SpyLTMPlaylist' has a wrong offset!");
static_assert(offsetof(UAthena_FactionSelection_AlterEgo_C, SpyLTMFactionTag) == 0x000130, "Member 'UAthena_FactionSelection_AlterEgo_C::SpyLTMFactionTag' has a wrong offset!");

}

