#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BP_TRV_dresser_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_BP_TRV_dresser_01.Athena_Prop_BP_TRV_dresser_01_C.ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01
// 0x00F8 (0x00F8 - 0x0000)
struct Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0034(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D0(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01) == 0x000008, "Wrong alignment on Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01");
static_assert(sizeof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01) == 0x0000F8, "Wrong size on Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, EntryPoint) == 0x000000, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_Damage) == 0x000004, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_DamageTags) == 0x000008, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_Momentum) == 0x000028, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_HitInfo) == 0x000034, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_InstigatedBy) == 0x0000C0, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_DamageCauser) == 0x0000C8, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, K2Node_Event_EffectContext) == 0x0000D0, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'Athena_Prop_BP_TRV_dresser_01_C_ExecuteUbergraph_Athena_Prop_BP_TRV_dresser_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Athena_Prop_BP_TRV_dresser_01.Athena_Prop_BP_TRV_dresser_01_C.OnDamagePlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects) == 0x000008, "Wrong alignment on Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects");
static_assert(sizeof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects) == 0x0000E8, "Wrong size on Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, DamageTags) == 0x000008, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, Momentum) == 0x000028, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, HitInfo) == 0x000034, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, InstigatedBy) == 0x0000C0, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, DamageCauser) == 0x0000C8, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects, EffectContext) == 0x0000D0, "Member 'Athena_Prop_BP_TRV_dresser_01_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

}

