#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryFortItemTileButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C
// 0x0020 (0x0BC8 - 0x0BA8)
class UAthenaInventoryFortItemTileButton_C final : public UAthenaInventoryFortItemTileButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DropTarget;                                        // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InputActionWrapper;                                // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemWidgetHolder;                                  // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaInventoryFortItemTileButton(int32 EntryPoint);
	void BP_OnSelected();
	void UpdateStyle();
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void UpdateInteractionWidgetVisibility();
	struct FEventReply On_ItemWidgetHolder_MouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryFortItemTileButton_C">();
	}
	static class UAthenaInventoryFortItemTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryFortItemTileButton_C>();
	}
};
static_assert(alignof(UAthenaInventoryFortItemTileButton_C) == 0x000008, "Wrong alignment on UAthenaInventoryFortItemTileButton_C");
static_assert(sizeof(UAthenaInventoryFortItemTileButton_C) == 0x000BC8, "Wrong size on UAthenaInventoryFortItemTileButton_C");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, UberGraphFrame) == 0x000BA8, "Member 'UAthenaInventoryFortItemTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, DropTarget) == 0x000BB0, "Member 'UAthenaInventoryFortItemTileButton_C::DropTarget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, InputActionWrapper) == 0x000BB8, "Member 'UAthenaInventoryFortItemTileButton_C::InputActionWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryFortItemTileButton_C, ItemWidgetHolder) == 0x000BC0, "Member 'UAthenaInventoryFortItemTileButton_C::ItemWidgetHolder' has a wrong offset!");

}

