#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSquadList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaSquadList.AthenaSquadList_C.Add Extentsion Widget
// 0x0020 (0x0020 - 0x0000)
struct AthenaSquadList_C_Add_Extentsion_Widget final
{
public:
	class UUserWidget*                            New_Widget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSquadList_C_Add_Extentsion_Widget) == 0x000008, "Wrong alignment on AthenaSquadList_C_Add_Extentsion_Widget");
static_assert(sizeof(AthenaSquadList_C_Add_Extentsion_Widget) == 0x000020, "Wrong size on AthenaSquadList_C_Add_Extentsion_Widget");
static_assert(offsetof(AthenaSquadList_C_Add_Extentsion_Widget, New_Widget) == 0x000000, "Member 'AthenaSquadList_C_Add_Extentsion_Widget::New_Widget' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_Add_Extentsion_Widget, K2Node_MakeStruct_Margin) == 0x000008, "Member 'AthenaSquadList_C_Add_Extentsion_Widget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_Add_Extentsion_Widget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'AthenaSquadList_C_Add_Extentsion_Widget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.HandleSquadMemberDisconnected
// 0x0008 (0x0008 - 0x0000)
struct AthenaSquadList_C_HandleSquadMemberDisconnected final
{
public:
	const class AFortPlayerStateAthena*           Player;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSquadList_C_HandleSquadMemberDisconnected) == 0x000008, "Wrong alignment on AthenaSquadList_C_HandleSquadMemberDisconnected");
static_assert(sizeof(AthenaSquadList_C_HandleSquadMemberDisconnected) == 0x000008, "Wrong size on AthenaSquadList_C_HandleSquadMemberDisconnected");
static_assert(offsetof(AthenaSquadList_C_HandleSquadMemberDisconnected, Player) == 0x000000, "Member 'AthenaSquadList_C_HandleSquadMemberDisconnected::Player' has a wrong offset!");

// Function AthenaSquadList.AthenaSquadList_C.ExecuteUbergraph_AthenaSquadList
// 0x0040 (0x0040 - 0x0000)
struct AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSquadConnectedCount_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62A6[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPlayerStateAthena*           K2Node_Event_Player;                               // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList) == 0x000008, "Wrong alignment on AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList");
static_assert(sizeof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList) == 0x000040, "Wrong size on AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, EntryPoint) == 0x000000, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_GetSquadConnectedCount_ReturnValue) == 0x000010, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_GetSquadConnectedCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, Temp_bool_Variable) == 0x000015, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_Event_Player) == 0x000018, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_Select_Default) == 0x000028, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_DynamicCast_AsPlayer_Controller) == 0x000030, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList, CallFunc_IsLocalController_ReturnValue) == 0x000039, "Member 'AthenaSquadList_C_ExecuteUbergraph_AthenaSquadList::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");

}

