#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaHUDMenu.AthenaHUDMenu_C
// 0x0018 (0x0320 - 0x0308)
class UAthenaHUDMenu_C final : public UAthenaHUDMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaServerShutdownWidget_C*          AthenaServerShutdownWidget;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClickCatcher;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaHUDMenu(int32 EntryPoint);
	void BP_OnPostGameEnded();
	void BP_OnPostGameStarted();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaHUDMenu_C">();
	}
	static class UAthenaHUDMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDMenu_C>();
	}
};
static_assert(alignof(UAthenaHUDMenu_C) == 0x000008, "Wrong alignment on UAthenaHUDMenu_C");
static_assert(sizeof(UAthenaHUDMenu_C) == 0x000320, "Wrong size on UAthenaHUDMenu_C");
static_assert(offsetof(UAthenaHUDMenu_C, UberGraphFrame) == 0x000308, "Member 'UAthenaHUDMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaHUDMenu_C, AthenaServerShutdownWidget) == 0x000310, "Member 'UAthenaHUDMenu_C::AthenaServerShutdownWidget' has a wrong offset!");
static_assert(offsetof(UAthenaHUDMenu_C, ClickCatcher) == 0x000318, "Member 'UAthenaHUDMenu_C::ClickCatcher' has a wrong offset!");

}

