#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapNavigableIconStackOfNoLocationChallenges

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMapNavigableIconStackOfNoLocationChallenges.AthenaMapNavigableIconStackOfNoLocationChallenges_C
// 0x0090 (0x0398 - 0x0308)
class UAthenaMapNavigableIconStackOfNoLocationChallenges_C final : public UAthenaMapNavigableIconStackOfNoLocationChallenges
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnStartSelected;                                   // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectAnimMinusFromHover;                        // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlareMinusLoop;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnStartAnim;                                       // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectedAnim;                                    // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack_Count;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CompletedCountText;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Bang;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Flare;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ShadowFor3dMap;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_2;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               DefaultIcon;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnforceHideCount;                                 // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetAnywhereState();
	void SetMaterialState(bool Completed, bool Lock, bool HasIconOverride);
	void OnChallengeSet(bool bIsComplete, bool bIsLocked, bool bHasIconOverride, float Progress, bool bShouldShowBang);
	void OnChallengeIconOverriden(const class UTexture2D* Icon);
	void OnChallengeReset();
	void OnBeginIntroAnimation();
	void OnSetHasLocation(bool bHasLocation);
	void OnChangedStackData(int32 NewStackCount, int32 NonCompletedCount);
	void OnSetIsInGame(bool bIsInGame);
	void OnHovered(bool bUserInteraction);
	void OnUnhovered(bool bUserInteraction);
	void OnSelected(bool bUserInteraction);
	void OnUnselected(bool bUserInteraction);
	void OnChangeBangVisibility(bool bShouldShow);
	void OnSetChallengesInfo(int32 ChallengesNum, int32 CountOfCompletedChallenges);
	void Construct();
	void ExecuteUbergraph_AthenaMapNavigableIconStackOfNoLocationChallenges(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMapNavigableIconStackOfNoLocationChallenges_C">();
	}
	static class UAthenaMapNavigableIconStackOfNoLocationChallenges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapNavigableIconStackOfNoLocationChallenges_C>();
	}
};
static_assert(alignof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C) == 0x000008, "Wrong alignment on UAthenaMapNavigableIconStackOfNoLocationChallenges_C");
static_assert(sizeof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C) == 0x000398, "Wrong size on UAthenaMapNavigableIconStackOfNoLocationChallenges_C");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, UberGraphFrame) == 0x000308, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, OnStartSelected) == 0x000310, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::OnStartSelected' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, OnSelectAnimMinusFromHover) == 0x000318, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::OnSelectAnimMinusFromHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, OnHover) == 0x000320, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, FlareMinusLoop) == 0x000328, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::FlareMinusLoop' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, OnStartAnim) == 0x000330, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::OnStartAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, OnSelectedAnim) == 0x000338, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::OnSelectedAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, Border_0) == 0x000340, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, CommonText_Stack) == 0x000348, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::CommonText_Stack' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, CommonText_Stack_Count) == 0x000350, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::CommonText_Stack_Count' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, CompletedCountText) == 0x000358, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::CompletedCountText' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, Image_Bang) == 0x000360, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::Image_Bang' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, Image_Flare) == 0x000368, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, Image_ShadowFor3dMap) == 0x000370, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::Image_ShadowFor3dMap' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, Overlay_1) == 0x000378, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, VerticalBox_2) == 0x000380, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::VerticalBox_2' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, DefaultIcon) == 0x000388, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::DefaultIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfNoLocationChallenges_C, bEnforceHideCount) == 0x000390, "Member 'UAthenaMapNavigableIconStackOfNoLocationChallenges_C::bEnforceHideCount' has a wrong offset!");

}

