#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarPrimary

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "QuickbarBase_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarPrimary.AthenaQuickbarPrimary_C
// 0x0088 (0x0358 - 0x02D0)
class UAthenaQuickbarPrimary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarPrimary_C;            // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ball;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SlotContainer;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PickupPreview;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot1;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot2;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot3;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot4;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot5;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot6;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_WeaponsRail;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentWeaponSlot;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F74[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CurrentPickupPreviewItem;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlaylistHidesQuickbar;                            // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F75[0x3];                                     // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           QuickbarTag;                                       // 0x034C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	class UFortQuickBarSlotBase* GetSpecificSlot(int32 SlotNumber);
	void RefreshPickupPreview();
	void HandleInteractionChanged(class UFortInteractContextInfo* Context_Info);
	void SetQuickBarNativeMode(bool bNativeMode);
	void HandleShowHideWeaponRail();
	void HasOneNonHarvestWeapon(bool* HasNonHarvestWeapon);
	void Show_Primary_Quickbar_Rail(bool Show);
	void OnReady_ECD8F67D499AA47681F88E9746363B9F(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void HandleKeybindsChanged();
	void HandleInputMethodChanged_Bind(ECommonInputType InputType);
	void Destruct();
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Param_Slot);
	void Maximize();
	void Minimize();
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex, const TArray<int32>& ChangedSlots);
	void Construct();
	void ExecuteUbergraph_AthenaQuickbarPrimary(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarPrimary_C">();
	}
	static class UAthenaQuickbarPrimary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarPrimary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarPrimary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarPrimary_C");
static_assert(sizeof(UAthenaQuickbarPrimary_C) == 0x000358, "Wrong size on UAthenaQuickbarPrimary_C");
static_assert(offsetof(UAthenaQuickbarPrimary_C, UberGraphFrame_AthenaQuickbarPrimary_C) == 0x0002D0, "Member 'UAthenaQuickbarPrimary_C::UberGraphFrame_AthenaQuickbarPrimary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Loop) == 0x0002D8, "Member 'UAthenaQuickbarPrimary_C::Loop' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, In) == 0x0002E0, "Member 'UAthenaQuickbarPrimary_C::In' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, Ball) == 0x0002E8, "Member 'UAthenaQuickbarPrimary_C::Ball' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, HorizontalBox_SlotContainer) == 0x0002F0, "Member 'UAthenaQuickbarPrimary_C::HorizontalBox_SlotContainer' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, PickupPreview) == 0x0002F8, "Member 'UAthenaQuickbarPrimary_C::PickupPreview' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot1) == 0x000300, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot2) == 0x000308, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot3) == 0x000310, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot4) == 0x000318, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot5) == 0x000320, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot6) == 0x000328, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, SizeBox_WeaponsRail) == 0x000330, "Member 'UAthenaQuickbarPrimary_C::SizeBox_WeaponsRail' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, CurrentWeaponSlot) == 0x000338, "Member 'UAthenaQuickbarPrimary_C::CurrentWeaponSlot' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, CurrentPickupPreviewItem) == 0x000340, "Member 'UAthenaQuickbarPrimary_C::CurrentPickupPreviewItem' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, bPlaylistHidesQuickbar) == 0x000348, "Member 'UAthenaQuickbarPrimary_C::bPlaylistHidesQuickbar' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarTag) == 0x00034C, "Member 'UAthenaQuickbarPrimary_C::QuickbarTag' has a wrong offset!");

}

