#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcasterMapSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcasterMapSettings.AthenaBroadcasterMapSettings_C
// 0x0080 (0x0360 - 0x02E0)
class UAthenaBroadcasterMapSettings_C final : public UFortBroadcasterMapSettings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       BusPathsRotator;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonBox;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             NameZoomVisibility;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       VehicleIconsRotator;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       WeaponTracersRotator;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UCommonButton*, class UClass*>     MapIconVisibility;                                 // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_AthenaBroadcasterMapSettings(int32 EntryPoint);
	void BP_HandleMapIconAdded(class UFortSpectateClickableMapIcon* MapIcon);
	void BP_OnActivated();
	void BndEvt__BusPathsRotator_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__PlayerIndicatorsRotator_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__VehicleIconsRotator_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__NameZoomVisibility_K2Node_ComponentBoundEvent_1_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__WeaponTracersRotator_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Options();
	void Map_Icon_Added(class UFortSpectateClickableMapIcon* Icon);
	void OnMapIconClicked(class UCommonButton* ButtonClicked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcasterMapSettings_C">();
	}
	static class UAthenaBroadcasterMapSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcasterMapSettings_C>();
	}
};
static_assert(alignof(UAthenaBroadcasterMapSettings_C) == 0x000008, "Wrong alignment on UAthenaBroadcasterMapSettings_C");
static_assert(sizeof(UAthenaBroadcasterMapSettings_C) == 0x000360, "Wrong size on UAthenaBroadcasterMapSettings_C");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaBroadcasterMapSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, BusPathsRotator) == 0x0002E8, "Member 'UAthenaBroadcasterMapSettings_C::BusPathsRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, ButtonBox) == 0x0002F0, "Member 'UAthenaBroadcasterMapSettings_C::ButtonBox' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, NameZoomVisibility) == 0x0002F8, "Member 'UAthenaBroadcasterMapSettings_C::NameZoomVisibility' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, VehicleIconsRotator) == 0x000300, "Member 'UAthenaBroadcasterMapSettings_C::VehicleIconsRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, WeaponTracersRotator) == 0x000308, "Member 'UAthenaBroadcasterMapSettings_C::WeaponTracersRotator' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcasterMapSettings_C, MapIconVisibility) == 0x000310, "Member 'UAthenaBroadcasterMapSettings_C::MapIconVisibility' has a wrong offset!");

}

