#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_CB3_QuestB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BGA_BaseQuestObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_CB3_QuestB.AthenaQuestActor_CB3_QuestB_C
// 0x0170 (0x0940 - 0x07D0)
class AAthenaQuestActor_CB3_QuestB_C final : public ABGA_BaseQuestObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuestActor_CB3_QuestB_C;      // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UForceFeedbackComponent*                ForceFeedback;                                     // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AA_Ship_Launch_Cue1;                               // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch4;                       // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch5;                       // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch3;                       // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TestVisualRocket;                                  // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AA_Ship_Launch_Cue;                                // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch2;                       // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch1;                       // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_RCRocket_Thruster_Launch;                        // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_CoralBuddies_Rocket_01;                          // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_CoralBuddies_LaunchPad_01;                       // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConsolidatedQuestComponent*            ConsolidatedQuest;                                 // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ConstructionAudio;                                 // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_Launch_C9B480234FEECCB177504EA8963B4D02; // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_C9B480234FEECCB177504EA8963B4D02; // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8576[0x3];                                     // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Scale_B0452B6A4AA5332CF79EA297F0A5BB5A; // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B0452B6A4AA5332CF79EA297F0A5BB5A; // 0x085C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8577[0x3];                                     // 0x085D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Launch_8C40B0AE44FE6C89EBBAF8912852F741; // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_8C40B0AE44FE6C89EBBAF8912852F741; // 0x086C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8578[0x3];                                     // 0x086D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Scale_A594FDBF43B8F79A500E4898137FC61D; // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A594FDBF43B8F79A500E4898137FC61D; // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8579[0x3];                                     // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     TIMER_VISUALS;                                     // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TestVisuals;                                       // 0x0890(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_857A[0x7];                                     // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaGameMessageData                 MessageData_NeedMetal;                             // 0x0898(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                InitialRocketLocation;                             // 0x08D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_857B[0x4];                                     // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Interact_text;                                     // 0x08E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaGameMessageData                 MessageData_Launching;                             // 0x0900(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaQuestActor_CB3_QuestB(int32 EntryPoint);
	void BndEvt__QuestComponent_K2Node_ComponentBoundEvent_1_SimpleQuestComponentDelegate__DelegateSignature(class AFortPlayerController* PlayerController);
	void CompleteInteraction(class AFortPlayerController* PlayerController);
	void DisplayMessage_Launch(class AFortPlayerController* PC);
	void DisplayMessage_NeedMetal(class AFortPlayerController* PC);
	void CustomEvent();
	void LaunchShip();
	void BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_2_SimpleQuestComponentDelegate__DelegateSignature(class AFortPlayerController* PlayerController);
	void Test();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ReceiveBeginPlay();
	void Timeline_3__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_CB3_QuestB_C">();
	}
	static class AAthenaQuestActor_CB3_QuestB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_CB3_QuestB_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_CB3_QuestB_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_CB3_QuestB_C");
static_assert(sizeof(AAthenaQuestActor_CB3_QuestB_C) == 0x000940, "Wrong size on AAthenaQuestActor_CB3_QuestB_C");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, UberGraphFrame_AthenaQuestActor_CB3_QuestB_C) == 0x0007D0, "Member 'AAthenaQuestActor_CB3_QuestB_C::UberGraphFrame_AthenaQuestActor_CB3_QuestB_C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, ForceFeedback) == 0x0007D8, "Member 'AAthenaQuestActor_CB3_QuestB_C::ForceFeedback' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, AA_Ship_Launch_Cue1) == 0x0007E0, "Member 'AAthenaQuestActor_CB3_QuestB_C::AA_Ship_Launch_Cue1' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch4) == 0x0007E8, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch4' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch5) == 0x0007F0, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch5' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch3) == 0x0007F8, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch3' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, TestVisualRocket) == 0x000800, "Member 'AAthenaQuestActor_CB3_QuestB_C::TestVisualRocket' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, AA_Ship_Launch_Cue) == 0x000808, "Member 'AAthenaQuestActor_CB3_QuestB_C::AA_Ship_Launch_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch2) == 0x000810, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch2' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch1) == 0x000818, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch1' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, P_RCRocket_Thruster_Launch) == 0x000820, "Member 'AAthenaQuestActor_CB3_QuestB_C::P_RCRocket_Thruster_Launch' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, S_CoralBuddies_Rocket_01) == 0x000828, "Member 'AAthenaQuestActor_CB3_QuestB_C::S_CoralBuddies_Rocket_01' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, S_CoralBuddies_LaunchPad_01) == 0x000830, "Member 'AAthenaQuestActor_CB3_QuestB_C::S_CoralBuddies_LaunchPad_01' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, ConsolidatedQuest) == 0x000838, "Member 'AAthenaQuestActor_CB3_QuestB_C::ConsolidatedQuest' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, ConstructionAudio) == 0x000840, "Member 'AAthenaQuestActor_CB3_QuestB_C::ConstructionAudio' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_3_Launch_C9B480234FEECCB177504EA8963B4D02) == 0x000848, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_3_Launch_C9B480234FEECCB177504EA8963B4D02' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_3__Direction_C9B480234FEECCB177504EA8963B4D02) == 0x00084C, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_3__Direction_C9B480234FEECCB177504EA8963B4D02' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_3) == 0x000850, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_0_Scale_B0452B6A4AA5332CF79EA297F0A5BB5A) == 0x000858, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_0_Scale_B0452B6A4AA5332CF79EA297F0A5BB5A' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_0__Direction_B0452B6A4AA5332CF79EA297F0A5BB5A) == 0x00085C, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_0__Direction_B0452B6A4AA5332CF79EA297F0A5BB5A' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_0) == 0x000860, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_2_Launch_8C40B0AE44FE6C89EBBAF8912852F741) == 0x000868, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_2_Launch_8C40B0AE44FE6C89EBBAF8912852F741' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_2__Direction_8C40B0AE44FE6C89EBBAF8912852F741) == 0x00086C, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_2__Direction_8C40B0AE44FE6C89EBBAF8912852F741' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_2) == 0x000870, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_1_Scale_A594FDBF43B8F79A500E4898137FC61D) == 0x000878, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_1_Scale_A594FDBF43B8F79A500E4898137FC61D' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_1__Direction_A594FDBF43B8F79A500E4898137FC61D) == 0x00087C, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_1__Direction_A594FDBF43B8F79A500E4898137FC61D' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Timeline_1) == 0x000880, "Member 'AAthenaQuestActor_CB3_QuestB_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, TIMER_VISUALS) == 0x000888, "Member 'AAthenaQuestActor_CB3_QuestB_C::TIMER_VISUALS' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, TestVisuals) == 0x000890, "Member 'AAthenaQuestActor_CB3_QuestB_C::TestVisuals' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, MessageData_NeedMetal) == 0x000898, "Member 'AAthenaQuestActor_CB3_QuestB_C::MessageData_NeedMetal' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, InitialRocketLocation) == 0x0008D8, "Member 'AAthenaQuestActor_CB3_QuestB_C::InitialRocketLocation' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, Interact_text) == 0x0008E8, "Member 'AAthenaQuestActor_CB3_QuestB_C::Interact_text' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_CB3_QuestB_C, MessageData_Launching) == 0x000900, "Member 'AAthenaQuestActor_CB3_QuestB_C::MessageData_Launching' has a wrong offset!");

}

