#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPackResource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaPackResource.AthenaPackResource_C
// 0x0070 (0x02C8 - 0x0258)
class UAthenaPackResource_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Background;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ContentOverlay;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CountWidgetSwitcher;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MaxUnderline;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResourceIcon;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NumericTextCount;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShorthandCount;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortResourceType                             ResourceType;                                      // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6DAF[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResourceCount;                                     // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveResource;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB0[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              TouchStart;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LargeIconOffset;                                   // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottomTextOffset;                                  // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInfiniteResources;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ResourceCountNeedsUpdate(bool* NeedsUpdate);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void UpdateMaxStyle(struct FSlateColor* SlateColor);
	void RefreshLargerCountLayout();
	void RefreshSmallerCountLayout();
	void Change_Material();
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void Set_ResourceStyle(bool UseLargeIcon);
	void TryUpdateCount();
	void TryUpdateBackground();
	void UpdateType(EFortResourceType Param_ResourceType);
	void UpdateCount();
	void Construct();
	void On_Material_Change();
	void ExecuteUbergraph_AthenaPackResource(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaPackResource_C">();
	}
	static class UAthenaPackResource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPackResource_C>();
	}
};
static_assert(alignof(UAthenaPackResource_C) == 0x000008, "Wrong alignment on UAthenaPackResource_C");
static_assert(sizeof(UAthenaPackResource_C) == 0x0002C8, "Wrong size on UAthenaPackResource_C");
static_assert(offsetof(UAthenaPackResource_C, UberGraphFrame) == 0x000258, "Member 'UAthenaPackResource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, Background) == 0x000260, "Member 'UAthenaPackResource_C::Background' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ContentOverlay) == 0x000268, "Member 'UAthenaPackResource_C::ContentOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, CountWidgetSwitcher) == 0x000270, "Member 'UAthenaPackResource_C::CountWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, Image_MaxUnderline) == 0x000278, "Member 'UAthenaPackResource_C::Image_MaxUnderline' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ImageResourceIcon) == 0x000280, "Member 'UAthenaPackResource_C::ImageResourceIcon' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, NumericTextCount) == 0x000288, "Member 'UAthenaPackResource_C::NumericTextCount' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ShorthandCount) == 0x000290, "Member 'UAthenaPackResource_C::ShorthandCount' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, SizeBoxContainer) == 0x000298, "Member 'UAthenaPackResource_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ResourceType) == 0x0002A0, "Member 'UAthenaPackResource_C::ResourceType' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ResourceCount) == 0x0002A4, "Member 'UAthenaPackResource_C::ResourceCount' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, ActiveResource) == 0x0002A8, "Member 'UAthenaPackResource_C::ActiveResource' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, TouchStart) == 0x0002B0, "Member 'UAthenaPackResource_C::TouchStart' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, LargeIconOffset) == 0x0002B8, "Member 'UAthenaPackResource_C::LargeIconOffset' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, BottomTextOffset) == 0x0002BC, "Member 'UAthenaPackResource_C::BottomTextOffset' has a wrong offset!");
static_assert(offsetof(UAthenaPackResource_C, bInfiniteResources) == 0x0002C0, "Member 'UAthenaPackResource_C::bInfiniteResources' has a wrong offset!");

}

