#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_SilkyVeteran_Hood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_SilkyVeteran_Hood.Athena_Prop_SilkyVeteran_Hood_C
// 0x0028 (0x0BE8 - 0x0BC0)
class AAthena_Prop_SilkyVeteran_Hood_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Haze;                                              // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Haze1;                                             // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Haze3;                                             // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Haze2;                                             // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_SilkyVeteran_Hood(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_SilkyVeteran_Hood_C">();
	}
	static class AAthena_Prop_SilkyVeteran_Hood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_SilkyVeteran_Hood_C>();
	}
};
static_assert(alignof(AAthena_Prop_SilkyVeteran_Hood_C) == 0x000008, "Wrong alignment on AAthena_Prop_SilkyVeteran_Hood_C");
static_assert(sizeof(AAthena_Prop_SilkyVeteran_Hood_C) == 0x000BE8, "Wrong size on AAthena_Prop_SilkyVeteran_Hood_C");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_Hood_C, UberGraphFrame) == 0x000BC0, "Member 'AAthena_Prop_SilkyVeteran_Hood_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_Hood_C, Haze) == 0x000BC8, "Member 'AAthena_Prop_SilkyVeteran_Hood_C::Haze' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_Hood_C, Haze1) == 0x000BD0, "Member 'AAthena_Prop_SilkyVeteran_Hood_C::Haze1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_Hood_C, Haze3) == 0x000BD8, "Member 'AAthena_Prop_SilkyVeteran_Hood_C::Haze3' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_SilkyVeteran_Hood_C, Haze2) == 0x000BE0, "Member 'AAthena_Prop_SilkyVeteran_Hood_C::Haze2' has a wrong offset!");

}

