#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHitPointBar_CNStorm2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.updateEdgeColor
// 0x0068 (0x0068 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor final
{
public:
	struct FLinearColor                           NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697A[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697B[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor) == 0x000068, "Wrong size on AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, NewParam) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::NewParam' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, Temp_int_Variable) == 0x000010, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, Temp_int_Variable_1) == 0x00001C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, K2Node_MakeArray_Array) == 0x000028, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_Array_Get_Item) == 0x000038, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, K2Node_MakeArray_Array_1) == 0x000048, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateEdgeColor::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.updateAnimation
// 0x0060 (0x0060 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_UpdateAnimation final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValuePercentage_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697E[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLastValuePercentage_ReturnValue;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_697F[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6980[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_UpdateAnimation");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation) == 0x000060, "Wrong size on AthenaHitPointBar_CNStorm2_C_UpdateAnimation");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000010, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_GetCurrentValuePercentage_ReturnValue) == 0x000030, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_GetCurrentValuePercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_GetLastValuePercentage_ReturnValue) == 0x000038, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_GetLastValuePercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000048, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_FCeil_ReturnValue) == 0x00004C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Clamp_ReturnValue) == 0x000050, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000058, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateAnimation, CallFunc_Less_FloatFloat_ReturnValue) == 0x00005C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateAnimation::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.SetSize
// 0x001C (0x001C - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_SetSize final
{
public:
	bool                                          UseLargeSize;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6981[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TallHeight;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NormalHeight;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6982[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_SetSize) == 0x000004, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_SetSize");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_SetSize) == 0x00001C, "Wrong size on AthenaHitPointBar_CNStorm2_C_SetSize");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, UseLargeSize) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::UseLargeSize' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, TallHeight) == 0x000004, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::TallHeight' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, NormalHeight) == 0x000008, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::NormalHeight' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, Temp_bool_Variable) == 0x00000C, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, K2Node_Select_Default) == 0x000010, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_SetSize, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'AthenaHitPointBar_CNStorm2_C_SetSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.UpdateDBNOState
// 0x0003 (0x0003 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_UpdateDBNOState final
{
public:
	bool                                          bIsDBNO;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_UpdateDBNOState) == 0x000001, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_UpdateDBNOState");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_UpdateDBNOState) == 0x000003, "Wrong size on AthenaHitPointBar_CNStorm2_C_UpdateDBNOState");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateDBNOState, bIsDBNO) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateDBNOState::bIsDBNO' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateDBNOState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateDBNOState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateDBNOState, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000002, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateDBNOState::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.Update Delta Bar
// 0x0004 (0x0004 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar final
{
public:
	float                                         CallFunc_GetLastValuePercentage_ReturnValue;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar) == 0x000004, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar) == 0x000004, "Wrong size on AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar, CallFunc_GetLastValuePercentage_ReturnValue) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_Update_Delta_Bar::CallFunc_GetLastValuePercentage_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.Initialize Bar
// 0x01D0 (0x01D0 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_Initialize_Bar final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthBarType                                Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6983[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthBarType                                Temp_byte_Variable_1;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6984[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthBarType                                Temp_byte_Variable_2;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6985[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> Temp_interface_Variable;                           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlateTextureAtlasInterface> Temp_interface_Variable_1;                         // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthBarType                                Temp_byte_Variable_3;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6986[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_16;                           // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_17;                           // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6987[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISlateTextureAtlasInterface> K2Node_Select_Default_3;                           // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHealthBarType                                Temp_byte_Variable_4;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6988[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6989[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_Initialize_Bar");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar) == 0x0001D0, "Wrong size on AthenaHitPointBar_CNStorm2_C_Initialize_Bar");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_1) == 0x000010, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_2) == 0x000020, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_byte_Variable) == 0x000030, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_3) == 0x000034, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_4) == 0x000044, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_5) == 0x000054, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_6) == 0x000064, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_7) == 0x000074, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_byte_Variable_1) == 0x000084, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_8) == 0x000088, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_9) == 0x000098, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_10) == 0x0000A8, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_11) == 0x0000B8, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_12) == 0x0000C8, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_byte_Variable_2) == 0x0000D8, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_interface_Variable) == 0x0000E0, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_interface_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_interface_Variable_1) == 0x0000F0, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_interface_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_13) == 0x000100, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_byte_Variable_3) == 0x000110, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_14) == 0x000114, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_15) == 0x000124, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_16) == 0x000134, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_struct_Variable_17) == 0x000144, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_struct_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_Select_Default) == 0x000154, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_Select_Default_1) == 0x000164, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_Select_Default_2) == 0x000174, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000188, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_Select_Default_3) == 0x000190, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, Temp_byte_Variable_4) == 0x0001A0, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_MakeStruct_Margin) == 0x0001A4, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, K2Node_Select_Default_4) == 0x0001B4, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Initialize_Bar, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001C8, "Member 'AthenaHitPointBar_CNStorm2_C_Initialize_Bar::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.Update Fill Bar
// 0x0004 (0x0004 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar final
{
public:
	float                                         CallFunc_GetCurrentValuePercentage_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar) == 0x000004, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar) == 0x000004, "Wrong size on AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar, CallFunc_GetCurrentValuePercentage_ReturnValue) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_Update_Fill_Bar::CallFunc_GetCurrentValuePercentage_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.UpdateCurrentValue
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0018(0x0018)()
	struct FLinearColor                           CallFunc_Array_Get_Item_2;                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_3;                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	float                                         CallFunc_GetCurrentValuePercentage_ReturnValue;    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_698B[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_4;                         // 0x0090(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00A8(0x0018)()
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue) == 0x0000C0, "Wrong size on AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, Temp_int_Variable) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Array_Get_Item) == 0x000004, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Array_Get_Item_3) == 0x000040, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_GetCurrentValuePercentage_ReturnValue) == 0x000078, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_GetCurrentValuePercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000080, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000084, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_FCeil_ReturnValue) == 0x000088, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Clamp_ReturnValue) == 0x00008C, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, CallFunc_Array_Get_Item_4) == 0x000090, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue, K2Node_Select_Default) == 0x0000A8, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateCurrentValue::K2Node_Select_Default' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.UpdateMaxValue
// 0x0018 (0x0018 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_UpdateMaxValue final
{
public:
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0000(0x0018)()
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_UpdateMaxValue) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_UpdateMaxValue");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_UpdateMaxValue) == 0x000018, "Wrong size on AthenaHitPointBar_CNStorm2_C_UpdateMaxValue");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_UpdateMaxValue, CallFunc_Conv_FloatToText_ReturnValue) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_UpdateMaxValue::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_PreConstruct");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_PreConstruct) == 0x000001, "Wrong size on AthenaHitPointBar_CNStorm2_C_PreConstruct");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.OnMaxValueChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged) == 0x000004, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged) == 0x000004, "Wrong size on AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged, Value) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_OnMaxValueChanged::Value' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.OnValueChangedWithReason
// 0x0008 (0x0008 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortHitPointModificationReason               Reason;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason) == 0x000004, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason) == 0x000008, "Wrong size on AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason, Value) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason::Value' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason, Reason) == 0x000004, "Member 'AthenaHitPointBar_CNStorm2_C_OnValueChangedWithReason::Reason' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.OnDBNOStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged final
{
public:
	bool                                          IsDBNO;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged) == 0x000001, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged) == 0x000001, "Wrong size on AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged, IsDBNO) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_OnDBNOStateChanged::IsDBNO' has a wrong offset!");

// Function AthenaHitPointBar_CNStorm2.AthenaHitPointBar_CNStorm2_C.ExecuteUbergraph_AthenaHitPointBar_CNStorm2
// 0x0030 (0x0030 - 0x0000)
struct AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_698C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortHitPointModificationReason               K2Node_Event_Reason;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDBNO;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_698D[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStormCN_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2) == 0x000008, "Wrong alignment on AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2");
static_assert(sizeof(AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2) == 0x000030, "Wrong size on AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2, EntryPoint) == 0x000000, "Member 'AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'AthenaHitPointBar_CNStorm2_C_ExecuteUbergraph_AthenaHitPointBar_CNStorm2::K2Node_Event_IsDesignTime' has a wrong offset!");
