#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastStormStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastStormStatus.AthenaBroadcastStormStatus_C
// 0x0020 (0x02C0 - 0x02A0)
class UAthenaBroadcastStormStatus_C final : public UAthenaBroadcastMatchStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBroadcastGameTimeWidget_C*       AthenaBroadcastGameTimeWidget;                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentStormPhaseText;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StormPhaseSB;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaBroadcastStormStatus(int32 EntryPoint);
	void SetMinigameOverride(class AFortMinigame* MinigameOverride);
	void OnStormPhaseChanged(int32 StormPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastStormStatus_C">();
	}
	static class UAthenaBroadcastStormStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastStormStatus_C>();
	}
};
static_assert(alignof(UAthenaBroadcastStormStatus_C) == 0x000008, "Wrong alignment on UAthenaBroadcastStormStatus_C");
static_assert(sizeof(UAthenaBroadcastStormStatus_C) == 0x0002C0, "Wrong size on UAthenaBroadcastStormStatus_C");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, UberGraphFrame) == 0x0002A0, "Member 'UAthenaBroadcastStormStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, AthenaBroadcastGameTimeWidget) == 0x0002A8, "Member 'UAthenaBroadcastStormStatus_C::AthenaBroadcastGameTimeWidget' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, CurrentStormPhaseText) == 0x0002B0, "Member 'UAthenaBroadcastStormStatus_C::CurrentStormPhaseText' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastStormStatus_C, StormPhaseSB) == 0x0002B8, "Member 'UAthenaBroadcastStormStatus_C::StormPhaseSB' has a wrong offset!");

}

