#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEventMatchStatusScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C
// 0x00F8 (0x0590 - 0x0498)
class UAthenaEventMatchStatusScreen_C final : public UAthenaEventMatchStatusScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ChestsLooted;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CircleRadius;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageHealed;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageHealedPlayer;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageHealedTitleText;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageInflicted;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageInflictedPlayer;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageTaken;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageTakenPlayer;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DamageTakenTitleText;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchStatusTextPlayer_C*         FastestEliminationPlayer;                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          FastestEliminationTime;                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamePhaseTime;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamePhaseTitleText;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          LongestElimination;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchStatusTextPlayer_C*         LongestEliminationPlayer;                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LongestEliminationTitleText;                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MatchTime;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          MostEliminations;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchStatusTextPlayer_C*         MostEliminationsPlayer;                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PiecesBuilt;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PiecesDestroyed;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          PlayersRemaining;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShotsFired;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          StormPhase;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SupplyDropsLooted;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaEventMatchStatusText_C*          TimeSinceLastKill;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      NewTopPlayerFontMaterial;                          // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaEventMatchStatusText_C*>  TopPlayerWidgets;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaEventMatchStatusScreen(int32 EntryPoint);
	void OnPlayerDeadStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	void UpdateGamePhaseText(const class FText& GamePhaseText);
	void UpdateTimeSinceLastKillText(const class FText& TimeSinceLastKillText);
	void UpdatePlayersRemainingText(const class FText& PlayersRemainingText);
	void UpdateGamePhaseTimeTitleText(const class FText& GamePhaseTimeTitleText);
	void UpdateGamePhaseTimeText(const class FText& GamePhaseTimeText);
	void UpdateLongestEliminationScore(const class FText& LongestEliminationScore);
	void UpdateMostKillsScore(const class FText& MostKillsScore);
	void UpdateChestsLootedText(const class FText& ChestsLootedText);
	void UpdateDamageInflictedText(const class FText& DamageInflictedText);
	void UpdateDamageHealedText(const class FText& DamageHealedText);
	void UpdateDamageTakenText(const class FText& DamageTakenText);
	void UpdateLongestEliminationText(const class FText& LongestEliminationText);
	void UpdatePiecesBuiltText(const class FText& PiecesBuiltText);
	void UpdatePiecesDestroyedText(const class FText& PiecesDestroyedText);
	void UpdateShotsFiredText(const class FText& ShotsFiredText);
	void UpdateSupplyDropsLootedText(const class FText& SupplyDropsLootedText);
	void Construct();
	void UpdateFastestKillText(const class FText& FastestKillText, const class FText& FastestKillTime);
	void UpdateMostKillsText(const class FText& MostKillsText);
	void UpdateCircleRadiusText(const class FText& CircleRadiusText);
	void UpdateMatchTimeText(const class FText& MatchTimeText);
	void NewTopPlayer(class UAthenaMatchStatusTextPlayer_C* TargetWidget, const class FText& InText);
	void NewTopScore(class UAthenaEventMatchStatusText_C* TargetWidget, const class FText& InText);
	void NewStatUpdate3Pulse(class UAthenaEventMatchStatusText_C* TargetWidget, const class FText& InText, bool SkipTextUpdate);
	void NewStatUpdate1Pulse(class UAthenaEventMatchStatusText_C* TargetWidget, const class FText& InText, bool SkipTextUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEventMatchStatusScreen_C">();
	}
	static class UAthenaEventMatchStatusScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventMatchStatusScreen_C>();
	}
};
static_assert(alignof(UAthenaEventMatchStatusScreen_C) == 0x000008, "Wrong alignment on UAthenaEventMatchStatusScreen_C");
static_assert(sizeof(UAthenaEventMatchStatusScreen_C) == 0x000590, "Wrong size on UAthenaEventMatchStatusScreen_C");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, UberGraphFrame) == 0x000498, "Member 'UAthenaEventMatchStatusScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, ChestsLooted) == 0x0004A0, "Member 'UAthenaEventMatchStatusScreen_C::ChestsLooted' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, CircleRadius) == 0x0004A8, "Member 'UAthenaEventMatchStatusScreen_C::CircleRadius' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageHealed) == 0x0004B0, "Member 'UAthenaEventMatchStatusScreen_C::DamageHealed' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageHealedPlayer) == 0x0004B8, "Member 'UAthenaEventMatchStatusScreen_C::DamageHealedPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageHealedTitleText) == 0x0004C0, "Member 'UAthenaEventMatchStatusScreen_C::DamageHealedTitleText' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageInflicted) == 0x0004C8, "Member 'UAthenaEventMatchStatusScreen_C::DamageInflicted' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageInflictedPlayer) == 0x0004D0, "Member 'UAthenaEventMatchStatusScreen_C::DamageInflictedPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageTaken) == 0x0004D8, "Member 'UAthenaEventMatchStatusScreen_C::DamageTaken' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageTakenPlayer) == 0x0004E0, "Member 'UAthenaEventMatchStatusScreen_C::DamageTakenPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, DamageTakenTitleText) == 0x0004E8, "Member 'UAthenaEventMatchStatusScreen_C::DamageTakenTitleText' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, FastestEliminationPlayer) == 0x0004F0, "Member 'UAthenaEventMatchStatusScreen_C::FastestEliminationPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, FastestEliminationTime) == 0x0004F8, "Member 'UAthenaEventMatchStatusScreen_C::FastestEliminationTime' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, GamePhaseTime) == 0x000500, "Member 'UAthenaEventMatchStatusScreen_C::GamePhaseTime' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, GamePhaseTitleText) == 0x000508, "Member 'UAthenaEventMatchStatusScreen_C::GamePhaseTitleText' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, LongestElimination) == 0x000510, "Member 'UAthenaEventMatchStatusScreen_C::LongestElimination' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, LongestEliminationPlayer) == 0x000518, "Member 'UAthenaEventMatchStatusScreen_C::LongestEliminationPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, LongestEliminationTitleText) == 0x000520, "Member 'UAthenaEventMatchStatusScreen_C::LongestEliminationTitleText' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, MatchTime) == 0x000528, "Member 'UAthenaEventMatchStatusScreen_C::MatchTime' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, MostEliminations) == 0x000530, "Member 'UAthenaEventMatchStatusScreen_C::MostEliminations' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, MostEliminationsPlayer) == 0x000538, "Member 'UAthenaEventMatchStatusScreen_C::MostEliminationsPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, PiecesBuilt) == 0x000540, "Member 'UAthenaEventMatchStatusScreen_C::PiecesBuilt' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, PiecesDestroyed) == 0x000548, "Member 'UAthenaEventMatchStatusScreen_C::PiecesDestroyed' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, PlayersRemaining) == 0x000550, "Member 'UAthenaEventMatchStatusScreen_C::PlayersRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, ShotsFired) == 0x000558, "Member 'UAthenaEventMatchStatusScreen_C::ShotsFired' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, StormPhase) == 0x000560, "Member 'UAthenaEventMatchStatusScreen_C::StormPhase' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, SupplyDropsLooted) == 0x000568, "Member 'UAthenaEventMatchStatusScreen_C::SupplyDropsLooted' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, TimeSinceLastKill) == 0x000570, "Member 'UAthenaEventMatchStatusScreen_C::TimeSinceLastKill' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, NewTopPlayerFontMaterial) == 0x000578, "Member 'UAthenaEventMatchStatusScreen_C::NewTopPlayerFontMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaEventMatchStatusScreen_C, TopPlayerWidgets) == 0x000580, "Member 'UAthenaEventMatchStatusScreen_C::TopPlayerWidgets' has a wrong offset!");

}

