#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDropBalloon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaSupplyDropBalloon.AthenaSupplyDropBalloon_C.ExecuteUbergraph_AthenaSupplyDropBalloon
// 0x0308 (0x0308 - 0x0000)
struct AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5002[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_2;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5003[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x003C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_2;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x00D8(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5004[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAnalyticsEventAttribute           K2Node_MakeStruct_FortAnalyticsEventAttribute;     // 0x00F8(0x0020)()
	float                                         K2Node_Event_Damage_1;                             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5005[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0120(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x014C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x01E8(0x0018)()
	float                                         K2Node_Event_Damage;                               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5006[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0208(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0234(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02D0(0x0018)()
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5007[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon) == 0x000008, "Wrong alignment on AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon");
static_assert(sizeof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon) == 0x000308, "Wrong size on AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, EntryPoint) == 0x000000, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Damage_2) == 0x000008, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Damage_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageTags_2) == 0x000010, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageTags_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Momentum_2) == 0x000030, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Momentum_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_HitInfo_2) == 0x00003C, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_InstigatedBy_2) == 0x0000C8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_InstigatedBy_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageCauser_2) == 0x0000D0, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageCauser_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_EffectContext_2) == 0x0000D8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_EffectContext_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, Temp_bool_Has_Been_Initd_Variable) == 0x0000F0, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_MakeStruct_FortAnalyticsEventAttribute) == 0x0000F8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_MakeStruct_FortAnalyticsEventAttribute' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Damage_1) == 0x000118, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageTags_1) == 0x000120, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Momentum_1) == 0x000140, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_HitInfo_1) == 0x00014C, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_InstigatedBy_1) == 0x0001D8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageCauser_1) == 0x0001E0, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_EffectContext_1) == 0x0001E8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Damage) == 0x000200, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageTags) == 0x000208, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_Momentum) == 0x000228, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_HitInfo) == 0x000234, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_InstigatedBy) == 0x0002C0, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_DamageCauser) == 0x0002C8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, K2Node_Event_EffectContext) == 0x0002D0, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, CallFunc_GetSocketLocation_ReturnValue) == 0x0002E8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002F8, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000300, "Member 'AthenaSupplyDropBalloon_C_ExecuteUbergraph_AthenaSupplyDropBalloon::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");

// Function AthenaSupplyDropBalloon.AthenaSupplyDropBalloon_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDropBalloon_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5008[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDropBalloon_C_OnDeathServer) == 0x000008, "Wrong alignment on AthenaSupplyDropBalloon_C_OnDeathServer");
static_assert(sizeof(AthenaSupplyDropBalloon_C_OnDeathServer) == 0x0000E8, "Wrong size on AthenaSupplyDropBalloon_C_OnDeathServer");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, Damage) == 0x000000, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, DamageTags) == 0x000008, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, Momentum) == 0x000028, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, HitInfo) == 0x000034, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDropBalloon_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function AthenaSupplyDropBalloon.AthenaSupplyDropBalloon_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDropBalloon_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5009[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on AthenaSupplyDropBalloon_C_OnDeathPlayEffects");
static_assert(sizeof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on AthenaSupplyDropBalloon_C_OnDeathPlayEffects");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDropBalloon_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function AthenaSupplyDropBalloon.AthenaSupplyDropBalloon_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDropBalloon_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_500A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDropBalloon_C_OnDamageServer) == 0x000008, "Wrong alignment on AthenaSupplyDropBalloon_C_OnDamageServer");
static_assert(sizeof(AthenaSupplyDropBalloon_C_OnDamageServer) == 0x0000E8, "Wrong size on AthenaSupplyDropBalloon_C_OnDamageServer");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, Damage) == 0x000000, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, DamageTags) == 0x000008, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, Momentum) == 0x000028, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, HitInfo) == 0x000034, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDropBalloon_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDropBalloon_C_OnDamageServer::EffectContext' has a wrong offset!");

}

