#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickBarEditorWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaQuickBarEditorWidget.AthenaQuickbarEditorWidget_C.ExecuteUbergraph_AthenaQuickbarEditorWidget
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryEquipSlot_C*            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C05[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaInventoryEquipSlot_C*>    K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C06[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget) == 0x000008, "Wrong alignment on AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget");
static_assert(sizeof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget) == 0x000038, "Wrong size on AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, EntryPoint) == 0x000000, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, K2Node_MakeArray_Array) == 0x000018, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'AthenaQuickbarEditorWidget_C_ExecuteUbergraph_AthenaQuickbarEditorWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

