#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaMOTDWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UCommonButton*                          CallFunc_GetSelectedButton_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_OnFocusReceived");
static_assert(sizeof(AthenaMOTDWidget_C_OnFocusReceived) == 0x0001B8, "Wrong size on AthenaMOTDWidget_C_OnFocusReceived");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AthenaMOTDWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AthenaMOTDWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AthenaMOTDWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'AthenaMOTDWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_OnFocusReceived, CallFunc_GetSelectedButton_ReturnValue) == 0x0001B0, "Member 'AthenaMOTDWidget_C_OnFocusReceived::CallFunc_GetSelectedButton_ReturnValue' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.UpdateCustomColorStyle
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaMOTDWidget_C_UpdateCustomColorStyle final
{
public:
	bool                                          bHasCustomColor;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74A9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CustomDarkColor;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CustomLightColor;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74AA[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74AB[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74AC[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_UpdateCustomColorStyle) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_UpdateCustomColorStyle");
static_assert(sizeof(AthenaMOTDWidget_C_UpdateCustomColorStyle) == 0x0000A0, "Wrong size on AthenaMOTDWidget_C_UpdateCustomColorStyle");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, bHasCustomColor) == 0x000000, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::bHasCustomColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CustomDarkColor) == 0x000004, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CustomDarkColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CustomLightColor) == 0x000008, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CustomLightColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, Temp_bool_Variable) == 0x00000C, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000010, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000020, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, Temp_struct_Variable) == 0x000030, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, Temp_bool_Variable_1) == 0x000040, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, K2Node_Select_Default) == 0x000044, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, Temp_struct_Variable_1) == 0x000054, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateCustomColorStyle, K2Node_Select_Default_1) == 0x000090, "Member 'AthenaMOTDWidget_C_UpdateCustomColorStyle::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.DialogResult_B7839D98483DEF9593D448BA28AE74F7
// 0x000C (0x000C - 0x0000)
struct AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74AD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7) == 0x000004, "Wrong alignment on AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7");
static_assert(sizeof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7) == 0x00000C, "Wrong size on AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7");
static_assert(offsetof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7, Result) == 0x000000, "Member 'AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7::Result' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7, ResultName) == 0x000004, "Member 'AthenaMOTDWidget_C_DialogResult_B7839D98483DEF9593D448BA28AE74F7::ResultName' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.OnSelectedNews
// 0x01E8 (0x01E8 - 0x0000)
struct AthenaMOTDWidget_C_OnSelectedNews final
{
public:
	struct FAthenaNewsEntry                       NewsEntry;                                         // 0x0000(0x01E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_OnSelectedNews) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_OnSelectedNews");
static_assert(sizeof(AthenaMOTDWidget_C_OnSelectedNews) == 0x0001E8, "Wrong size on AthenaMOTDWidget_C_OnSelectedNews");
static_assert(offsetof(AthenaMOTDWidget_C_OnSelectedNews, NewsEntry) == 0x000000, "Member 'AthenaMOTDWidget_C_OnSelectedNews::NewsEntry' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMOTDWidget_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetSpecialButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetSpecialButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetSpecialButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetSpecialButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetSpecialButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetSpecialButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetSpecialButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetSpecialButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.SetNormalButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMOTDWidget_C_SetNormalButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMOTDWidget_C_SetNormalButtonText) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_SetNormalButtonText");
static_assert(sizeof(AthenaMOTDWidget_C_SetNormalButtonText) == 0x000018, "Wrong size on AthenaMOTDWidget_C_SetNormalButtonText");
static_assert(offsetof(AthenaMOTDWidget_C_SetNormalButtonText, InText) == 0x000000, "Member 'AthenaMOTDWidget_C_SetNormalButtonText::InText' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.ExecuteUbergraph_AthenaMOTDWidget
// 0x02E0 (0x02E0 - 0x0000)
struct AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74AE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74AF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaNewsEntry                       K2Node_Event_NewsEntry;                            // 0x0020(0x01E8)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0228(0x0018)()
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B0[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74B1[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0254(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B2[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0260(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B3[0x2];                                     // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B4[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74B5[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText_1;                             // 0x02A0(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InText;                               // 0x02B8(0x0018)(ConstParm)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget) == 0x000008, "Wrong alignment on AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget");
static_assert(sizeof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget) == 0x0002E0, "Wrong size on AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, EntryPoint) == 0x000000, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000018, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_NewsEntry) == 0x000020, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_NewsEntry' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000208, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000210, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_ComponentBoundEvent_Button) == 0x000218, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000220, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000228, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, Temp_byte_Variable) == 0x000240, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x000248, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000250, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_IsValid_ReturnValue) == 0x000251, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, Temp_name_Variable) == 0x000254, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_GetAllActorsOfClass_OutActors) == 0x000260, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, CallFunc_Array_Get_Item) == 0x000270, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsSolo_Button) == 0x000278, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsSolo_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CustomEvent_Result) == 0x000281, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CustomEvent_ResultName) == 0x000284, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000290, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_DynamicCast_bSuccess_1) == 0x000298, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText_1) == 0x0002A0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText_1' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_Event_InText) == 0x0002B8, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0002D0, "Member 'AthenaMOTDWidget_C_ExecuteUbergraph_AthenaMOTDWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaMOTDWidget.AthenaMOTDWidget_C.UpdateStyle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AthenaMOTDWidget_C_UpdateStyle__DelegateSignature final
{
public:
	EAthenaNewsStyle                              NewStyle;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMOTDWidget_C_UpdateStyle__DelegateSignature) == 0x000001, "Wrong alignment on AthenaMOTDWidget_C_UpdateStyle__DelegateSignature");
static_assert(sizeof(AthenaMOTDWidget_C_UpdateStyle__DelegateSignature) == 0x000001, "Wrong size on AthenaMOTDWidget_C_UpdateStyle__DelegateSignature");
static_assert(offsetof(AthenaMOTDWidget_C_UpdateStyle__DelegateSignature, NewStyle) == 0x000000, "Member 'AthenaMOTDWidget_C_UpdateStyle__DelegateSignature::NewStyle' has a wrong offset!");

}

