#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryPerkInspectionContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryPerkInspectionContainer.AthenaInventoryPerkInspectionContainer_C.ExecuteUbergraph_AthenaInventoryPerkInspectionContainer
// 0x0048 (0x0048 - 0x0000)
struct AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaInventoryPerkInspectionEntry_C*  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSpyTechItemDefinition*             CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA3[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaInventoryPerkInspectionEntry_C*> K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer) == 0x000008, "Wrong alignment on AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer");
static_assert(sizeof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer) == 0x000048, "Wrong size on AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, EntryPoint) == 0x000000, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, K2Node_Event_IsDesignTime) == 0x000008, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Array_Get_Item) == 0x000020, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer, K2Node_MakeArray_Array) == 0x000038, "Member 'AthenaInventoryPerkInspectionContainer_C_ExecuteUbergraph_AthenaInventoryPerkInspectionContainer::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaInventoryPerkInspectionContainer.AthenaInventoryPerkInspectionContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryPerkInspectionContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPerkInspectionContainer_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaInventoryPerkInspectionContainer_C_PreConstruct");
static_assert(sizeof(AthenaInventoryPerkInspectionContainer_C_PreConstruct) == 0x000001, "Wrong size on AthenaInventoryPerkInspectionContainer_C_PreConstruct");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaInventoryPerkInspectionContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaInventoryPerkInspectionContainer.AthenaInventoryPerkInspectionContainer_C.AddItem
// 0x0060 (0x0060 - 0x0000)
struct AthenaInventoryPerkInspectionContainer_C_AddItem final
{
public:
	class UFortSpyTechItemDefinition*             SpyTechItemDef;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA5[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryPerkInspectionEntry_C*  CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPerkInspectionContainer_C_AddItem) == 0x000008, "Wrong alignment on AthenaInventoryPerkInspectionContainer_C_AddItem");
static_assert(sizeof(AthenaInventoryPerkInspectionContainer_C_AddItem) == 0x000060, "Wrong size on AthenaInventoryPerkInspectionContainer_C_AddItem");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, SpyTechItemDef) == 0x000000, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::SpyTechItemDef' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, Temp_int_Variable) == 0x000008, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_GetChildrenCount_ReturnValue) == 0x00000C, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000014, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_Divide_IntInt_ReturnValue) == 0x000024, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, Temp_int_Variable_1) == 0x000028, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, Temp_bool_Variable) == 0x00002C, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, K2Node_Select_Default) == 0x000030, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_Create_ReturnValue) == 0x000040, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000048, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000050, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_AddItem, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000058, "Member 'AthenaInventoryPerkInspectionContainer_C_AddItem::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPerkInspectionContainer.AthenaInventoryPerkInspectionContainer_C.Populate
// 0x0038 (0x0038 - 0x0000)
struct AthenaInventoryPerkInspectionContainer_C_Populate final
{
public:
	TArray<class UFortSpyTechItemDefinition*>     SpyTechItemDefs;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA7[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA8[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSpyTechItemDefinition*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPerkInspectionContainer_C_Populate) == 0x000008, "Wrong alignment on AthenaInventoryPerkInspectionContainer_C_Populate");
static_assert(sizeof(AthenaInventoryPerkInspectionContainer_C_Populate) == 0x000038, "Wrong size on AthenaInventoryPerkInspectionContainer_C_Populate");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, SpyTechItemDefs) == 0x000000, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::SpyTechItemDefs' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_byte_Variable) == 0x000010, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_byte_Variable_1) == 0x000011, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_bool_Variable) == 0x000012, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_byte_Variable_2) == 0x000013, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_byte_Variable_3) == 0x000014, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, Temp_bool_Variable_1) == 0x000035, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, K2Node_Select_Default) == 0x000036, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_Populate, K2Node_Select_Default_1) == 0x000037, "Member 'AthenaInventoryPerkInspectionContainer_C_Populate::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaInventoryPerkInspectionContainer.AthenaInventoryPerkInspectionContainer_C.UpdateVisibility
// 0x0018 (0x0018 - 0x0000)
struct AthenaInventoryPerkInspectionContainer_C_UpdateVisibility final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPerkInspectionContainer_C_UpdateVisibility) == 0x000008, "Wrong alignment on AthenaInventoryPerkInspectionContainer_C_UpdateVisibility");
static_assert(sizeof(AthenaInventoryPerkInspectionContainer_C_UpdateVisibility) == 0x000018, "Wrong size on AthenaInventoryPerkInspectionContainer_C_UpdateVisibility");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_UpdateVisibility, Param_Show) == 0x000000, "Member 'AthenaInventoryPerkInspectionContainer_C_UpdateVisibility::Param_Show' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_UpdateVisibility, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'AthenaInventoryPerkInspectionContainer_C_UpdateVisibility::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPerkInspectionContainer_C_UpdateVisibility, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'AthenaInventoryPerkInspectionContainer_C_UpdateVisibility::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

