#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_P2_Retrieve

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "BGA_BaseQuestObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_SW_P2_Retrieve.AthenaQuestActor_SW_P2_Retrieve_C
// 0x0080 (0x0850 - 0x07D0)
class AAthenaQuestActor_SW_P2_Retrieve_C final : public ABGA_BaseQuestObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuestActor_SW_P2_Retrieve_C;  // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Hidden_LoopingSound_Cue;                           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PlayerNearTrigger;                                 // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                ForceFeedback;                                     // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Quest_SWShip_Open_RoofPiece;                     // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ScaleDownTime_8B790E2A45942923051ED7A5C656B214; // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8B790E2A45942923051ED7A5C656B214; // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8292[0x3];                                     // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TestVisuals;                                       // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8293[0x7];                                     // 0x0809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaGameMessageData                 MessageData;                                       // 0x0810(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaQuestActor_SW_P2_Retrieve(int32 EntryPoint);
	void CompleteInteraction(class AFortPlayerController* PC);
	void DisplayMessage(class AFortPlayerController* PC);
	void BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Test();
	void HandleQuestComponentSuccessEvent(class AFortPlayerController* Player);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);

	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_SW_P2_Retrieve_C">();
	}
	static class AAthenaQuestActor_SW_P2_Retrieve_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_SW_P2_Retrieve_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_SW_P2_Retrieve_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_SW_P2_Retrieve_C");
static_assert(sizeof(AAthenaQuestActor_SW_P2_Retrieve_C) == 0x000850, "Wrong size on AAthenaQuestActor_SW_P2_Retrieve_C");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, UberGraphFrame_AthenaQuestActor_SW_P2_Retrieve_C) == 0x0007D0, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::UberGraphFrame_AthenaQuestActor_SW_P2_Retrieve_C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, Hidden_LoopingSound_Cue) == 0x0007D8, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::Hidden_LoopingSound_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, PlayerNearTrigger) == 0x0007E0, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::PlayerNearTrigger' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, ForceFeedback) == 0x0007E8, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::ForceFeedback' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, S_Quest_SWShip_Open_RoofPiece) == 0x0007F0, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::S_Quest_SWShip_Open_RoofPiece' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, Timeline_0_ScaleDownTime_8B790E2A45942923051ED7A5C656B214) == 0x0007F8, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::Timeline_0_ScaleDownTime_8B790E2A45942923051ED7A5C656B214' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, Timeline_0__Direction_8B790E2A45942923051ED7A5C656B214) == 0x0007FC, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::Timeline_0__Direction_8B790E2A45942923051ED7A5C656B214' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, Timeline_0) == 0x000800, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, TestVisuals) == 0x000808, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::TestVisuals' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_P2_Retrieve_C, MessageData) == 0x000810, "Member 'AAthenaQuestActor_SW_P2_Retrieve_C::MessageData' has a wrong offset!");

}

