#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaSupplyDrop.AthenaSupplyDrop_C
// 0x01A0 (0x0A60 - 0x08C0)
class AAthenaSupplyDrop_C final : public AFortAthenaSupplyDrop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       WaterCollisionSphere;                              // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         FortWaterInteraction;                              // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FallingAudio;                                      // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ReticlePSC;                                        // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CrateCollision;                                    // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FlareAudio;                                        // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FlarePSC;                                          // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ReticleAudio;                                      // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CrateStaticMesh;                                   // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              MyInteractingPawn;                                 // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTableName;                                     // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LootSpawnOffset;                                   // 0x0930(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6717[0x4];                                     // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_Looted;                                      // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Destroyed;                                   // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Landing;                                     // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x0958(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          BalloonPopped;                                     // 0x0959(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6718[0x6];                                     // 0x095A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        LandingFX;                                         // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DestroyedFX;                                       // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        LootedFX;                                          // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallSpeed;                                         // 0x0978(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReticleUpdateInterval;                             // 0x097C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialFallDelay;                                  // 0x0980(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6719[0x4];                                     // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurveTableRowHandle                   CurveTable_FallTime;                               // 0x0988(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FallTrailFX;                                       // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Appear;                                      // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ReticleAppear;                               // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_AlmostLanded;                                // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LandingLocation;                                   // 0x09B8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoOpen;                                          // 0x09C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671A[0x3];                                     // 0x09C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallHeight;                                        // 0x09C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DescentOffsetMin;                                  // 0x09CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DescentOffsetMax;                                  // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FallDirection;                                     // 0x09D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GroundLocation;                                    // 0x09E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DescentYOffsetMin;                                 // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DescentYOffsetMax;                                 // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGroundLocationInitialized;                        // 0x09F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOverrideRotation;                                 // 0x09F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671B[0x2];                                     // 0x09F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OverrideRotation;                                  // 0x09F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671C[0x4];                                     // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           NewVar_0;                                          // 0x0A08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BlingDrop;                                         // 0x0A10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671D[0x3];                                     // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LootTableNameToUse;                                // 0x0A14(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671E[0x4];                                     // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 VehicleType;                                       // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FallingAudioCheckTimerHandle;                      // 0x0A28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerDistanceCheckTimeLoop;                       // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InfDrop;                                           // 0x0A34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671F[0x3];                                     // 0x0A35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_Looted_Inf;                                  // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Appear_Dialogue;                             // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemEntry>                 DelayedSpawnLoot;                                  // 0x0A48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         RandomSpawnRangeMin;                               // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomSpawnRangeMax;                               // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSupplyDrop(int32 EntryPoint);
	void OnDelayedSpawnLoot();
	void BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody);
	void SetupQuestData();
	void BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void Play_Looted_Dialogue();
	void DestroyGroundComponents();
	void TimerCheckPlayerDistance();
	void OnLanding();
	void StopFallAudioTimeline();
	void BeginFallAudioTimeline();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void Multicast_ApplyGravityForFall();
	void OnLandingLocationChanged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SpawnLoot();
	void Setup_Bind_To_Building_Actor(class UObject* Object);
	void OnRep_Opened();
	void OpenSupplyDrop();
	void UpdateReticleLocation();
	void BalloonDestroyed();
	void OnRep_BalloonPopped();
	void InitFall();
	void PlayLandingFX(bool bSpawnVFX);
	void InitFallHeightAndSpeed();
	void DisableFlare();
	void AlmostLanded();
	void OnRep_LandingLocation();
	void ForceSetLocationOnLanding();
	void HandleProjectileMovementStop(const struct FHitResult& ImpactResult);
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void Analytics(const TArray<struct FFortItemEntry>& ItemsToSpawn);
	void SpawnVehicle();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	void GetLootSpawnLocation(struct FVector* LootSpawnLocation) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSupplyDrop_C">();
	}
	static class AAthenaSupplyDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaSupplyDrop_C>();
	}
};
static_assert(alignof(AAthenaSupplyDrop_C) == 0x000008, "Wrong alignment on AAthenaSupplyDrop_C");
static_assert(sizeof(AAthenaSupplyDrop_C) == 0x000A60, "Wrong size on AAthenaSupplyDrop_C");
static_assert(offsetof(AAthenaSupplyDrop_C, UberGraphFrame) == 0x0008C0, "Member 'AAthenaSupplyDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, WaterCollisionSphere) == 0x0008C8, "Member 'AAthenaSupplyDrop_C::WaterCollisionSphere' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FortProjectileMovement) == 0x0008D0, "Member 'AAthenaSupplyDrop_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FortWaterInteraction) == 0x0008D8, "Member 'AAthenaSupplyDrop_C::FortWaterInteraction' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallingAudio) == 0x0008E0, "Member 'AAthenaSupplyDrop_C::FallingAudio' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, ReticlePSC) == 0x0008E8, "Member 'AAthenaSupplyDrop_C::ReticlePSC' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, CrateCollision) == 0x0008F0, "Member 'AAthenaSupplyDrop_C::CrateCollision' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, ChildActor) == 0x0008F8, "Member 'AAthenaSupplyDrop_C::ChildActor' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FlareAudio) == 0x000900, "Member 'AAthenaSupplyDrop_C::FlareAudio' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FlarePSC) == 0x000908, "Member 'AAthenaSupplyDrop_C::FlarePSC' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, ReticleAudio) == 0x000910, "Member 'AAthenaSupplyDrop_C::ReticleAudio' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, CrateStaticMesh) == 0x000918, "Member 'AAthenaSupplyDrop_C::CrateStaticMesh' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, MyInteractingPawn) == 0x000920, "Member 'AAthenaSupplyDrop_C::MyInteractingPawn' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LootTableName) == 0x000928, "Member 'AAthenaSupplyDrop_C::LootTableName' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LootSpawnOffset) == 0x000930, "Member 'AAthenaSupplyDrop_C::LootSpawnOffset' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Looted) == 0x000940, "Member 'AAthenaSupplyDrop_C::Sound_Looted' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Destroyed) == 0x000948, "Member 'AAthenaSupplyDrop_C::Sound_Destroyed' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Landing) == 0x000950, "Member 'AAthenaSupplyDrop_C::Sound_Landing' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Opened) == 0x000958, "Member 'AAthenaSupplyDrop_C::Opened' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, BalloonPopped) == 0x000959, "Member 'AAthenaSupplyDrop_C::BalloonPopped' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LandingFX) == 0x000960, "Member 'AAthenaSupplyDrop_C::LandingFX' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DestroyedFX) == 0x000968, "Member 'AAthenaSupplyDrop_C::DestroyedFX' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LootedFX) == 0x000970, "Member 'AAthenaSupplyDrop_C::LootedFX' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallSpeed) == 0x000978, "Member 'AAthenaSupplyDrop_C::FallSpeed' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, ReticleUpdateInterval) == 0x00097C, "Member 'AAthenaSupplyDrop_C::ReticleUpdateInterval' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, InitialFallDelay) == 0x000980, "Member 'AAthenaSupplyDrop_C::InitialFallDelay' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, CurveTable_FallTime) == 0x000988, "Member 'AAthenaSupplyDrop_C::CurveTable_FallTime' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallTrailFX) == 0x000998, "Member 'AAthenaSupplyDrop_C::FallTrailFX' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Appear) == 0x0009A0, "Member 'AAthenaSupplyDrop_C::Sound_Appear' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_ReticleAppear) == 0x0009A8, "Member 'AAthenaSupplyDrop_C::Sound_ReticleAppear' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_AlmostLanded) == 0x0009B0, "Member 'AAthenaSupplyDrop_C::Sound_AlmostLanded' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LandingLocation) == 0x0009B8, "Member 'AAthenaSupplyDrop_C::LandingLocation' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, AutoOpen) == 0x0009C4, "Member 'AAthenaSupplyDrop_C::AutoOpen' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallHeight) == 0x0009C8, "Member 'AAthenaSupplyDrop_C::FallHeight' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DescentOffsetMin) == 0x0009CC, "Member 'AAthenaSupplyDrop_C::DescentOffsetMin' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DescentOffsetMax) == 0x0009D0, "Member 'AAthenaSupplyDrop_C::DescentOffsetMax' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallDirection) == 0x0009D4, "Member 'AAthenaSupplyDrop_C::FallDirection' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, GroundLocation) == 0x0009E0, "Member 'AAthenaSupplyDrop_C::GroundLocation' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DescentYOffsetMin) == 0x0009EC, "Member 'AAthenaSupplyDrop_C::DescentYOffsetMin' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DescentYOffsetMax) == 0x0009F0, "Member 'AAthenaSupplyDrop_C::DescentYOffsetMax' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, bGroundLocationInitialized) == 0x0009F4, "Member 'AAthenaSupplyDrop_C::bGroundLocationInitialized' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, bOverrideRotation) == 0x0009F5, "Member 'AAthenaSupplyDrop_C::bOverrideRotation' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, OverrideRotation) == 0x0009F8, "Member 'AAthenaSupplyDrop_C::OverrideRotation' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, NewVar_0) == 0x000A08, "Member 'AAthenaSupplyDrop_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, BlingDrop) == 0x000A10, "Member 'AAthenaSupplyDrop_C::BlingDrop' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, LootTableNameToUse) == 0x000A14, "Member 'AAthenaSupplyDrop_C::LootTableNameToUse' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, VehicleType) == 0x000A20, "Member 'AAthenaSupplyDrop_C::VehicleType' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, FallingAudioCheckTimerHandle) == 0x000A28, "Member 'AAthenaSupplyDrop_C::FallingAudioCheckTimerHandle' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, PlayerDistanceCheckTimeLoop) == 0x000A30, "Member 'AAthenaSupplyDrop_C::PlayerDistanceCheckTimeLoop' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, InfDrop) == 0x000A34, "Member 'AAthenaSupplyDrop_C::InfDrop' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Looted_Inf) == 0x000A38, "Member 'AAthenaSupplyDrop_C::Sound_Looted_Inf' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, Sound_Appear_Dialogue) == 0x000A40, "Member 'AAthenaSupplyDrop_C::Sound_Appear_Dialogue' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, DelayedSpawnLoot) == 0x000A48, "Member 'AAthenaSupplyDrop_C::DelayedSpawnLoot' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, RandomSpawnRangeMin) == 0x000A58, "Member 'AAthenaSupplyDrop_C::RandomSpawnRangeMin' has a wrong offset!");
static_assert(offsetof(AAthenaSupplyDrop_C, RandomSpawnRangeMax) == 0x000A5C, "Member 'AAthenaSupplyDrop_C::RandomSpawnRangeMax' has a wrong offset!");

}

