#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaContextualChallengeEntry_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaContextualChallengeEntry_BP.AthenaContextualChallengeEntry_BP_C
// 0x0018 (0x0250 - 0x0238)
class UAthenaContextualChallengeEntry_BP_C final : public UAthenaChallengeEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 EmptyCheckBox;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StyleLastElement(bool IsLast);
	void ExecuteUbergraph_AthenaContextualChallengeEntry_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaContextualChallengeEntry_BP_C">();
	}
	static class UAthenaContextualChallengeEntry_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaContextualChallengeEntry_BP_C>();
	}
};
static_assert(alignof(UAthenaContextualChallengeEntry_BP_C) == 0x000008, "Wrong alignment on UAthenaContextualChallengeEntry_BP_C");
static_assert(sizeof(UAthenaContextualChallengeEntry_BP_C) == 0x000250, "Wrong size on UAthenaContextualChallengeEntry_BP_C");
static_assert(offsetof(UAthenaContextualChallengeEntry_BP_C, UberGraphFrame) == 0x000238, "Member 'UAthenaContextualChallengeEntry_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengeEntry_BP_C, EmptyCheckBox) == 0x000240, "Member 'UAthenaContextualChallengeEntry_BP_C::EmptyCheckBox' has a wrong offset!");
static_assert(offsetof(UAthenaContextualChallengeEntry_BP_C, Separator) == 0x000248, "Member 'UAthenaContextualChallengeEntry_BP_C::Separator' has a wrong offset!");

}

