#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPickupManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaPickupManager.AthenaPickupManager_C
// 0x0040 (0x02D8 - 0x0298)
class UAthenaPickupManager_C final : public UAthenaResourcesBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaPackResource_C*                  _Pack_Resource__Stone;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPackResource_C*                  _Pack_Resource__Wood;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPackResource_C*                  PackResourceGoldCurrency;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPackResource_C*                  PackResourceMetal;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       PickupManagerInvalidationBox;                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URebootCardsCollectedWidget_C*          RebootCardsCollectedWidget;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Max_Displayed_Items;                               // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastUpdateTime;                                    // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWorldResourceWidgetsVisibility();
	void HandleSetWorldResourceWidgetVisibility(EFortResourceType ResourceType, bool bVisible);
	void RefreshBackground();
	void RefreshCounts();
	void Construct();
	void HandleWorldItemsChanged();
	void HandleWorldItemListChanged(const TArray<class UFortWorldItem*>& ItemsAdded, const TArray<class UFortWorldItem*>& ItemsRemoved);
	void Destruct();
	void HandleBuildingMaterialChanged();
	void HandleItemPickup(class UFortWorldItem* NewItem, int32 Count);
	void InvalidateAllPackResources();
	void ExecuteUbergraph_AthenaPickupManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaPickupManager_C">();
	}
	static class UAthenaPickupManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPickupManager_C>();
	}
};
static_assert(alignof(UAthenaPickupManager_C) == 0x000008, "Wrong alignment on UAthenaPickupManager_C");
static_assert(sizeof(UAthenaPickupManager_C) == 0x0002D8, "Wrong size on UAthenaPickupManager_C");
static_assert(offsetof(UAthenaPickupManager_C, UberGraphFrame) == 0x000298, "Member 'UAthenaPickupManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, _Pack_Resource__Stone) == 0x0002A0, "Member 'UAthenaPickupManager_C::_Pack_Resource__Stone' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, _Pack_Resource__Wood) == 0x0002A8, "Member 'UAthenaPickupManager_C::_Pack_Resource__Wood' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, PackResourceGoldCurrency) == 0x0002B0, "Member 'UAthenaPickupManager_C::PackResourceGoldCurrency' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, PackResourceMetal) == 0x0002B8, "Member 'UAthenaPickupManager_C::PackResourceMetal' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, PickupManagerInvalidationBox) == 0x0002C0, "Member 'UAthenaPickupManager_C::PickupManagerInvalidationBox' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, RebootCardsCollectedWidget) == 0x0002C8, "Member 'UAthenaPickupManager_C::RebootCardsCollectedWidget' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, Max_Displayed_Items) == 0x0002D0, "Member 'UAthenaPickupManager_C::Max_Displayed_Items' has a wrong offset!");
static_assert(offsetof(UAthenaPickupManager_C, LastUpdateTime) == 0x0002D4, "Member 'UAthenaPickupManager_C::LastUpdateTime' has a wrong offset!");

}

