#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_SoccerGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SoccerGameTypes_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_SoccerGame.Athena_SoccerGame_C
// 0x01D0 (0x03F0 - 0x0220)
class AAthena_SoccerGame_C final : public AFortStaticReplicatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       BallOverlapCheck;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ScoreSign;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Team_B_GoalOverlap;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Team_A_GoalOverlap;                                // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Team_A_GoalLocation;                               // 0x0250(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Team_B_GoalLocation;                               // 0x025C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GoalExtent;                                        // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score_Team_A;                                      // 0x0274(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         Score_Team_B;                                      // 0x0278(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Ball_Respawn_Location;                             // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ScoreLocation;                                     // 0x0288(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         ScoreAnnounceDelay;                                // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScoreEvaluateDelay;                                // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WinScoreLimit;                                     // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WinningTeam;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8546[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        PS_ScoredGoal;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_WonGame;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_WonGame;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_ScoredGoal;                                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_ScoreUp;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_RespawnBall;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_RespawnBall;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MatchRestartDelay;                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8547[0xC];                                     // 0x02E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ScoreSign_Transform;                               // 0x02F0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               MID_Score_TeamA;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Score_TeamB;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_WonGame_Stadium;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_ScoredGoal_Stadium;                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_RespawnBall_Stadium;                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PlayerWhoScored;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackendObjName;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          QuestLocallyActive;                                // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8548[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             QuestSuccessSound;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        QuestSuccessEmitter;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        VuvuzulaSpecificEmitter;                           // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             VuvuzulaSpecificSound;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SoccerGameTypes                             SoccerGameType;                                    // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8549[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             S_RespawnBall_Small;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_ScoredGoal_Small;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S_WonGame_Small;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_854A[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   QuestSourceTags;                                   // 0x03B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           VuvuzelaCheckMesh;                                 // 0x03C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UObject*                                Vuvuzela_WID;                                      // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_SoccerGame(int32 EntryPoint);
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void BndEvt__Goal_02_Overlap_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Goal_01_Overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PlayVuvuzulaFX();
	void SomeoneScored();
	void BallRespawnFX();
	void RestartMatch();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void OnRep_Score_Team_A();
	void RespawnBall();
	void OnRep_ScoreLocation();
	void OnRep_Score_Team_B();
	void EvaluateScore();
	void OnRep_WinningTeam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_SoccerGame_C">();
	}
	static class AAthena_SoccerGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_SoccerGame_C>();
	}
};
static_assert(alignof(AAthena_SoccerGame_C) == 0x000010, "Wrong alignment on AAthena_SoccerGame_C");
static_assert(sizeof(AAthena_SoccerGame_C) == 0x0003F0, "Wrong size on AAthena_SoccerGame_C");
static_assert(offsetof(AAthena_SoccerGame_C, UberGraphFrame) == 0x000220, "Member 'AAthena_SoccerGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, BallOverlapCheck) == 0x000228, "Member 'AAthena_SoccerGame_C::BallOverlapCheck' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, SM_ScoreSign) == 0x000230, "Member 'AAthena_SoccerGame_C::SM_ScoreSign' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Team_B_GoalOverlap) == 0x000238, "Member 'AAthena_SoccerGame_C::Team_B_GoalOverlap' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Billboard) == 0x000240, "Member 'AAthena_SoccerGame_C::Billboard' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Team_A_GoalOverlap) == 0x000248, "Member 'AAthena_SoccerGame_C::Team_A_GoalOverlap' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Team_A_GoalLocation) == 0x000250, "Member 'AAthena_SoccerGame_C::Team_A_GoalLocation' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Team_B_GoalLocation) == 0x00025C, "Member 'AAthena_SoccerGame_C::Team_B_GoalLocation' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, GoalExtent) == 0x000268, "Member 'AAthena_SoccerGame_C::GoalExtent' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Score_Team_A) == 0x000274, "Member 'AAthena_SoccerGame_C::Score_Team_A' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Score_Team_B) == 0x000278, "Member 'AAthena_SoccerGame_C::Score_Team_B' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Ball_Respawn_Location) == 0x00027C, "Member 'AAthena_SoccerGame_C::Ball_Respawn_Location' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, ScoreLocation) == 0x000288, "Member 'AAthena_SoccerGame_C::ScoreLocation' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, ScoreAnnounceDelay) == 0x000294, "Member 'AAthena_SoccerGame_C::ScoreAnnounceDelay' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, ScoreEvaluateDelay) == 0x000298, "Member 'AAthena_SoccerGame_C::ScoreEvaluateDelay' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, WinScoreLimit) == 0x00029C, "Member 'AAthena_SoccerGame_C::WinScoreLimit' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, WinningTeam) == 0x0002A0, "Member 'AAthena_SoccerGame_C::WinningTeam' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, PS_ScoredGoal) == 0x0002A8, "Member 'AAthena_SoccerGame_C::PS_ScoredGoal' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, PS_WonGame) == 0x0002B0, "Member 'AAthena_SoccerGame_C::PS_WonGame' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_WonGame) == 0x0002B8, "Member 'AAthena_SoccerGame_C::S_WonGame' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_ScoredGoal) == 0x0002C0, "Member 'AAthena_SoccerGame_C::S_ScoredGoal' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_ScoreUp) == 0x0002C8, "Member 'AAthena_SoccerGame_C::S_ScoreUp' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_RespawnBall) == 0x0002D0, "Member 'AAthena_SoccerGame_C::S_RespawnBall' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, PS_RespawnBall) == 0x0002D8, "Member 'AAthena_SoccerGame_C::PS_RespawnBall' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, MatchRestartDelay) == 0x0002E0, "Member 'AAthena_SoccerGame_C::MatchRestartDelay' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, ScoreSign_Transform) == 0x0002F0, "Member 'AAthena_SoccerGame_C::ScoreSign_Transform' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, MID_Score_TeamA) == 0x000320, "Member 'AAthena_SoccerGame_C::MID_Score_TeamA' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, MID_Score_TeamB) == 0x000328, "Member 'AAthena_SoccerGame_C::MID_Score_TeamB' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_WonGame_Stadium) == 0x000330, "Member 'AAthena_SoccerGame_C::S_WonGame_Stadium' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_ScoredGoal_Stadium) == 0x000338, "Member 'AAthena_SoccerGame_C::S_ScoredGoal_Stadium' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_RespawnBall_Stadium) == 0x000340, "Member 'AAthena_SoccerGame_C::S_RespawnBall_Stadium' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, PlayerWhoScored) == 0x000348, "Member 'AAthena_SoccerGame_C::PlayerWhoScored' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, QuestItem) == 0x000350, "Member 'AAthena_SoccerGame_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, BackendObjName) == 0x000358, "Member 'AAthena_SoccerGame_C::BackendObjName' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, QuestLocallyActive) == 0x000360, "Member 'AAthena_SoccerGame_C::QuestLocallyActive' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, QuestSuccessSound) == 0x000368, "Member 'AAthena_SoccerGame_C::QuestSuccessSound' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, QuestSuccessEmitter) == 0x000370, "Member 'AAthena_SoccerGame_C::QuestSuccessEmitter' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, VuvuzulaSpecificEmitter) == 0x000378, "Member 'AAthena_SoccerGame_C::VuvuzulaSpecificEmitter' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, VuvuzulaSpecificSound) == 0x000380, "Member 'AAthena_SoccerGame_C::VuvuzulaSpecificSound' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, SoccerGameType) == 0x000388, "Member 'AAthena_SoccerGame_C::SoccerGameType' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_RespawnBall_Small) == 0x000390, "Member 'AAthena_SoccerGame_C::S_RespawnBall_Small' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_ScoredGoal_Small) == 0x000398, "Member 'AAthena_SoccerGame_C::S_ScoredGoal_Small' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, S_WonGame_Small) == 0x0003A0, "Member 'AAthena_SoccerGame_C::S_WonGame_Small' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, CreativeMode) == 0x0003A8, "Member 'AAthena_SoccerGame_C::CreativeMode' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, QuestSourceTags) == 0x0003B0, "Member 'AAthena_SoccerGame_C::QuestSourceTags' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, VuvuzelaCheckMesh) == 0x0003C0, "Member 'AAthena_SoccerGame_C::VuvuzelaCheckMesh' has a wrong offset!");
static_assert(offsetof(AAthena_SoccerGame_C, Vuvuzela_WID) == 0x0003E8, "Member 'AAthena_SoccerGame_C::Vuvuzela_WID' has a wrong offset!");

}

