#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaVehicleFeedback

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.ExecuteUbergraph_AthenaVehicleFeedback
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_701A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701C[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701D[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701E[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701F[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7020[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7021[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback) == 0x000008, "Wrong alignment on AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback");
static_assert(sizeof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback) == 0x0000E8, "Wrong size on AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, EntryPoint) == 0x000000, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000028, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000040, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000050, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000060, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetChildrenCount_ReturnValue) == 0x000090, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Get_Item) == 0x000098, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_GetContext_ReturnValue) == 0x0000D0, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_Array_Get_Item_1) == 0x0000DC, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000E4, "Member 'AthenaVehicleFeedback_C_ExecuteUbergraph_AthenaVehicleFeedback::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function AthenaVehicleFeedback.AthenaVehicleFeedback_C.GetKeybindInputType
// 0x0030 (0x0030 - 0x0000)
struct AthenaVehicleFeedback_C_GetKeybindInputType final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7022[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7023[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDFeedbackLine_C*               CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaVehicleFeedback_C_GetKeybindInputType) == 0x000008, "Wrong alignment on AthenaVehicleFeedback_C_GetKeybindInputType");
static_assert(sizeof(AthenaVehicleFeedback_C_GetKeybindInputType) == 0x000030, "Wrong size on AthenaVehicleFeedback_C_GetKeybindInputType");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, InputType) == 0x000000, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::InputType' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_GetCurrentInputType_ReturnValue) == 0x000018, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVehicleFeedback_C_GetKeybindInputType, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'AthenaVehicleFeedback_C_GetKeybindInputType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

