#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaScoreAlert

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaScoreAlert.AthenaScoreAlert_C.TryToDisplayMessage
// 0x0060 (0x0060 - 0x0000)
struct AthenaScoreAlert_C_TryToDisplayMessage final
{
public:
	struct FHUDMessageData                        Param_CurrentMessage;                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsMessageValidForWidget_bIsValid;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleMessageQueuing_bMessageWasQueued;   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_TryToDisplayMessage) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_TryToDisplayMessage");
static_assert(sizeof(AthenaScoreAlert_C_TryToDisplayMessage) == 0x000060, "Wrong size on AthenaScoreAlert_C_TryToDisplayMessage");
static_assert(offsetof(AthenaScoreAlert_C_TryToDisplayMessage, Param_CurrentMessage) == 0x000000, "Member 'AthenaScoreAlert_C_TryToDisplayMessage::Param_CurrentMessage' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_TryToDisplayMessage, CallFunc_IsMessageValidForWidget_bIsValid) == 0x000058, "Member 'AthenaScoreAlert_C_TryToDisplayMessage::CallFunc_IsMessageValidForWidget_bIsValid' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_TryToDisplayMessage, CallFunc_HandleMessageQueuing_bMessageWasQueued) == 0x000059, "Member 'AthenaScoreAlert_C_TryToDisplayMessage::CallFunc_HandleMessageQueuing_bMessageWasQueued' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.HandleMessageQueuing
// 0x0028 (0x0028 - 0x0000)
struct AthenaScoreAlert_C_HandleMessageQueuing final
{
public:
	bool                                          bMessageWasQueued;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA9[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_HandleMessageQueuing) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_HandleMessageQueuing");
static_assert(sizeof(AthenaScoreAlert_C_HandleMessageQueuing) == 0x000028, "Wrong size on AthenaScoreAlert_C_HandleMessageQueuing");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, bMessageWasQueued) == 0x000000, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::bMessageWasQueued' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000010, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000019, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_Array_Add_ReturnValue_1) == 0x000020, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_IsVisible_ReturnValue) == 0x000024, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_HandleMessageQueuing, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'AthenaScoreAlert_C_HandleMessageQueuing::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.DisplayMessage
// 0x0002 (0x0002 - 0x0000)
struct AthenaScoreAlert_C_DisplayMessage final
{
public:
	bool                                          CallFunc_ShouldPlayIntroAnimations_bShouldPlay;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_DisplayMessage) == 0x000001, "Wrong alignment on AthenaScoreAlert_C_DisplayMessage");
static_assert(sizeof(AthenaScoreAlert_C_DisplayMessage) == 0x000002, "Wrong size on AthenaScoreAlert_C_DisplayMessage");
static_assert(offsetof(AthenaScoreAlert_C_DisplayMessage, CallFunc_ShouldPlayIntroAnimations_bShouldPlay) == 0x000000, "Member 'AthenaScoreAlert_C_DisplayMessage::CallFunc_ShouldPlayIntroAnimations_bShouldPlay' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_DisplayMessage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'AthenaScoreAlert_C_DisplayMessage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.UpdateExclamationTextBlockColors
// 0x0310 (0x0310 - 0x0000)
struct AthenaScoreAlert_C_UpdateExclamationTextBlockColors final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   CallFunc_GetRichTextStyleFromMessage_Style;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRichTextStyleRow                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0270)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAA[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0298(0x0050)(HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetTextFillColor_ReturnValue;             // 0x02E8(0x0028)()
};
static_assert(alignof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_UpdateExclamationTextBlockColors");
static_assert(sizeof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors) == 0x000310, "Wrong size on AthenaScoreAlert_C_UpdateExclamationTextBlockColors");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, Message) == 0x000000, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::Message' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, CallFunc_GetRichTextStyleFromMessage_Style) == 0x000018, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::CallFunc_GetRichTextStyleFromMessage_Style' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000290, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, K2Node_MakeStruct_SlateFontInfo) == 0x000298, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateExclamationTextBlockColors, CallFunc_GetTextFillColor_ReturnValue) == 0x0002E8, "Member 'AthenaScoreAlert_C_UpdateExclamationTextBlockColors::CallFunc_GetTextFillColor_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.PlayIntroAnimations
// 0x0018 (0x0018 - 0x0000)
struct AthenaScoreAlert_C_PlayIntroAnimations final
{
public:
	bool                                          CallFunc_ShouldColorizeExclamationTextBlock_bShouldColorize; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowExclamation_bShouldShow;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAB[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_PlayIntroAnimations) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_PlayIntroAnimations");
static_assert(sizeof(AthenaScoreAlert_C_PlayIntroAnimations) == 0x000018, "Wrong size on AthenaScoreAlert_C_PlayIntroAnimations");
static_assert(offsetof(AthenaScoreAlert_C_PlayIntroAnimations, CallFunc_ShouldColorizeExclamationTextBlock_bShouldColorize) == 0x000000, "Member 'AthenaScoreAlert_C_PlayIntroAnimations::CallFunc_ShouldColorizeExclamationTextBlock_bShouldColorize' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlayIntroAnimations, CallFunc_ShouldShowExclamation_bShouldShow) == 0x000001, "Member 'AthenaScoreAlert_C_PlayIntroAnimations::CallFunc_ShouldShowExclamation_bShouldShow' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlayIntroAnimations, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaScoreAlert_C_PlayIntroAnimations::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlayIntroAnimations, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'AthenaScoreAlert_C_PlayIntroAnimations::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.ShouldPlayIntroAnimations
// 0x0020 (0x0020 - 0x0000)
struct AthenaScoreAlert_C_ShouldPlayIntroAnimations final
{
public:
	bool                                          bShouldPlay;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_ShouldPlayIntroAnimations) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_ShouldPlayIntroAnimations");
static_assert(sizeof(AthenaScoreAlert_C_ShouldPlayIntroAnimations) == 0x000020, "Wrong size on AthenaScoreAlert_C_ShouldPlayIntroAnimations");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, bShouldPlay) == 0x000000, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::bShouldPlay' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, ReturnValue) == 0x000001, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000010, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x00001A, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ShouldPlayIntroAnimations, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001B, "Member 'AthenaScoreAlert_C_ShouldPlayIntroAnimations::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.StartHideTimer
// 0x0030 (0x0030 - 0x0000)
struct AthenaScoreAlert_C_StartHideTimer final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAD[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetShowTimeInterval_ShowTimeInterval;     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_StartHideTimer) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_StartHideTimer");
static_assert(sizeof(AthenaScoreAlert_C_StartHideTimer) == 0x000030, "Wrong size on AthenaScoreAlert_C_StartHideTimer");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'AthenaScoreAlert_C_StartHideTimer::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000008, "Member 'AthenaScoreAlert_C_StartHideTimer::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaScoreAlert_C_StartHideTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'AthenaScoreAlert_C_StartHideTimer::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000012, "Member 'AthenaScoreAlert_C_StartHideTimer::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'AthenaScoreAlert_C_StartHideTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, CallFunc_GetShowTimeInterval_ShowTimeInterval) == 0x000024, "Member 'AthenaScoreAlert_C_StartHideTimer::CallFunc_GetShowTimeInterval_ShowTimeInterval' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_StartHideTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'AthenaScoreAlert_C_StartHideTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.OnOutroAnimationFinished
// 0x0048 (0x0048 - 0x0000)
struct AthenaScoreAlert_C_OnOutroAnimationFinished final
{
public:
	struct FAthenaGameMessageData                 NextMessage2;                                      // 0x0000(0x0040)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_OnOutroAnimationFinished) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_OnOutroAnimationFinished");
static_assert(sizeof(AthenaScoreAlert_C_OnOutroAnimationFinished) == 0x000048, "Wrong size on AthenaScoreAlert_C_OnOutroAnimationFinished");
static_assert(offsetof(AthenaScoreAlert_C_OnOutroAnimationFinished, NextMessage2) == 0x000000, "Member 'AthenaScoreAlert_C_OnOutroAnimationFinished::NextMessage2' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnOutroAnimationFinished, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AthenaScoreAlert_C_OnOutroAnimationFinished::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnOutroAnimationFinished, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'AthenaScoreAlert_C_OnOutroAnimationFinished::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.OnGameModeMessageRequest
// 0x0098 (0x0098 - 0x0000)
struct AthenaScoreAlert_C_OnGameModeMessageRequest final
{
public:
	struct FAthenaGameMessageData                 MessageData;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHUDMessageData                        CallFunc_ConvertToHUDMessage_HUDMessageData;       // 0x0040(0x0058)()
};
static_assert(alignof(AthenaScoreAlert_C_OnGameModeMessageRequest) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_OnGameModeMessageRequest");
static_assert(sizeof(AthenaScoreAlert_C_OnGameModeMessageRequest) == 0x000098, "Wrong size on AthenaScoreAlert_C_OnGameModeMessageRequest");
static_assert(offsetof(AthenaScoreAlert_C_OnGameModeMessageRequest, MessageData) == 0x000000, "Member 'AthenaScoreAlert_C_OnGameModeMessageRequest::MessageData' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnGameModeMessageRequest, CallFunc_ConvertToHUDMessage_HUDMessageData) == 0x000040, "Member 'AthenaScoreAlert_C_OnGameModeMessageRequest::CallFunc_ConvertToHUDMessage_HUDMessageData' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.OnHideGameModeMessageRequest
// 0x0030 (0x0030 - 0x0000)
struct AthenaScoreAlert_C_OnHideGameModeMessageRequest final
{
public:
	EAthenaGameMsgType                            MessageType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInstantHide;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bClearQueue;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAE[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesWidgetHandleThisEnum_bIsValid;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FAF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_OnHideGameModeMessageRequest) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_OnHideGameModeMessageRequest");
static_assert(sizeof(AthenaScoreAlert_C_OnHideGameModeMessageRequest) == 0x000030, "Wrong size on AthenaScoreAlert_C_OnHideGameModeMessageRequest");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, MessageType) == 0x000000, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::MessageType' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, bInstantHide) == 0x000001, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::bInstantHide' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, bClearQueue) == 0x000002, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::bClearQueue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_DoesWidgetHandleThisEnum_bIsValid) == 0x000020, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_DoesWidgetHandleThisEnum_bIsValid' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_IsVisible_ReturnValue) == 0x000021, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_OnHideGameModeMessageRequest, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaScoreAlert_C_OnHideGameModeMessageRequest::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.BindToGameStateEvents
// 0x0038 (0x0038 - 0x0000)
struct AthenaScoreAlert_C_BindToGameStateEvents final
{
public:
	class AFortGameState*                         GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAthenaGameMsgType MsgType, bool bInstantHide, bool bClearQueue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB0[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAthenaGameMessageData& MsgData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_BindToGameStateEvents) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_BindToGameStateEvents");
static_assert(sizeof(AthenaScoreAlert_C_BindToGameStateEvents) == 0x000038, "Wrong size on AthenaScoreAlert_C_BindToGameStateEvents");
static_assert(offsetof(AthenaScoreAlert_C_BindToGameStateEvents, GameState) == 0x000000, "Member 'AthenaScoreAlert_C_BindToGameStateEvents::GameState' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_BindToGameStateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaScoreAlert_C_BindToGameStateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_BindToGameStateEvents, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000018, "Member 'AthenaScoreAlert_C_BindToGameStateEvents::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_BindToGameStateEvents, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaScoreAlert_C_BindToGameStateEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_BindToGameStateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'AthenaScoreAlert_C_BindToGameStateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.UpdateContentTranslation
// 0x0020 (0x0020 - 0x0000)
struct AthenaScoreAlert_C_UpdateContentTranslation final
{
public:
	bool                                          bShiftContentDown;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB1[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_UpdateContentTranslation) == 0x000004, "Wrong alignment on AthenaScoreAlert_C_UpdateContentTranslation");
static_assert(sizeof(AthenaScoreAlert_C_UpdateContentTranslation) == 0x000020, "Wrong size on AthenaScoreAlert_C_UpdateContentTranslation");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, bShiftContentDown) == 0x000000, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::bShiftContentDown' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, Temp_bool_Variable) == 0x000001, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, Temp_struct_Variable) == 0x000004, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_UpdateContentTranslation, K2Node_Select_Default) == 0x000018, "Member 'AthenaScoreAlert_C_UpdateContentTranslation::K2Node_Select_Default' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.PlaySoundFromType
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaScoreAlert_C_PlaySoundFromType final
{
public:
	struct FHUDMessageData                        MessageData;                                       // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class USoundCue*                              SoundCue;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_2;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_3;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_4;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_5;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_6;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_7;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_8;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_9;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_10;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_11;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_12;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_13;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Temp_object_Variable_14;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaGameMsgType                            Temp_byte_Variable;                                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB2[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_PlaySoundFromType) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_PlaySoundFromType");
static_assert(sizeof(AthenaScoreAlert_C_PlaySoundFromType) == 0x0000F8, "Wrong size on AthenaScoreAlert_C_PlaySoundFromType");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, MessageData) == 0x000000, "Member 'AthenaScoreAlert_C_PlaySoundFromType::MessageData' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, SoundCue) == 0x000058, "Member 'AthenaScoreAlert_C_PlaySoundFromType::SoundCue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable) == 0x000060, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_1) == 0x000068, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_2) == 0x000070, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_3) == 0x000078, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_4) == 0x000080, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_5) == 0x000088, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_6) == 0x000090, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_7) == 0x000098, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_8) == 0x0000A0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_9) == 0x0000A8, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_10) == 0x0000B0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_11) == 0x0000B8, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_12) == 0x0000C0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_13) == 0x0000C8, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_object_Variable_14) == 0x0000D0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, CallFunc_GetGameState_ReturnValue) == 0x0000D8, "Member 'AthenaScoreAlert_C_PlaySoundFromType::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0000E0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'AthenaScoreAlert_C_PlaySoundFromType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, Temp_byte_Variable) == 0x0000E9, "Member 'AthenaScoreAlert_C_PlaySoundFromType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x0000EA, "Member 'AthenaScoreAlert_C_PlaySoundFromType::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, CallFunc_IsValid_ReturnValue) == 0x0000EB, "Member 'AthenaScoreAlert_C_PlaySoundFromType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_PlaySoundFromType, K2Node_Select_Default) == 0x0000F0, "Member 'AthenaScoreAlert_C_PlaySoundFromType::K2Node_Select_Default' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaScoreAlert_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaScoreAlert_C_PreConstruct");
static_assert(sizeof(AthenaScoreAlert_C_PreConstruct) == 0x000001, "Wrong size on AthenaScoreAlert_C_PreConstruct");
static_assert(offsetof(AthenaScoreAlert_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaScoreAlert_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.BP_OnGameStateInitialized
// 0x0008 (0x0008 - 0x0000)
struct AthenaScoreAlert_C_BP_OnGameStateInitialized final
{
public:
	class AFortGameState*                         GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaScoreAlert_C_BP_OnGameStateInitialized) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_BP_OnGameStateInitialized");
static_assert(sizeof(AthenaScoreAlert_C_BP_OnGameStateInitialized) == 0x000008, "Wrong size on AthenaScoreAlert_C_BP_OnGameStateInitialized");
static_assert(offsetof(AthenaScoreAlert_C_BP_OnGameStateInitialized, GameState) == 0x000000, "Member 'AthenaScoreAlert_C_BP_OnGameStateInitialized::GameState' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.BP_OnShowHUDMessage
// 0x0058 (0x0058 - 0x0000)
struct AthenaScoreAlert_C_BP_OnShowHUDMessage final
{
public:
	struct FHUDMessageData                        MessageData;                                       // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaScoreAlert_C_BP_OnShowHUDMessage) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_BP_OnShowHUDMessage");
static_assert(sizeof(AthenaScoreAlert_C_BP_OnShowHUDMessage) == 0x000058, "Wrong size on AthenaScoreAlert_C_BP_OnShowHUDMessage");
static_assert(offsetof(AthenaScoreAlert_C_BP_OnShowHUDMessage, MessageData) == 0x000000, "Member 'AthenaScoreAlert_C_BP_OnShowHUDMessage::MessageData' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.ExecuteUbergraph_AthenaScoreAlert
// 0x0128 (0x0128 - 0x0000)
struct AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FB3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB4[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB5[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameState*                         K2Node_Event_GameState;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB6[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDMessageData                        K2Node_Event_MessageData;                          // 0x00C8(0x0058)()
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert");
static_assert(sizeof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert) == 0x000128, "Wrong size on AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, EntryPoint) == 0x000000, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_text_Variable) == 0x000008, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_text_Variable_1) == 0x000020, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_text_Variable_2) == 0x000038, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_text_Variable_3) == 0x000050, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_text_Variable_4) == 0x000068, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_Event_IsDesignTime) == 0x000080, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000081, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, Temp_int_Variable) == 0x000084, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_Select_Default) == 0x000088, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, CallFunc_GetGameState_ReturnValue) == 0x0000A0, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0000A8, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_Event_GameState) == 0x0000B8, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_Event_GameState' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x0000C0, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, K2Node_Event_MessageData) == 0x0000C8, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::K2Node_Event_MessageData' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert, CallFunc_RemoveGameplayTag_ReturnValue) == 0x000120, "Member 'AthenaScoreAlert_C_ExecuteUbergraph_AthenaScoreAlert::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.FillInitialPositionData
// 0x0070 (0x0070 - 0x0000)
struct AthenaScoreAlert_C_FillInitialPositionData final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB7[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDMessageOverlaySlotPlacementData    K2Node_MakeStruct_HUDMessageOverlaySlotPlacementData; // 0x001C(0x0014)(NoDestructor)
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0030(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB8[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDMessageCanvasSlotPlacementData     K2Node_MakeStruct_HUDMessageCanvasSlotPlacementData; // 0x004C(0x0020)(NoDestructor)
};
static_assert(alignof(AthenaScoreAlert_C_FillInitialPositionData) == 0x000008, "Wrong alignment on AthenaScoreAlert_C_FillInitialPositionData");
static_assert(sizeof(AthenaScoreAlert_C_FillInitialPositionData) == 0x000070, "Wrong size on AthenaScoreAlert_C_FillInitialPositionData");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_GetAlignment_ReturnValue) == 0x000010, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, K2Node_MakeStruct_HUDMessageOverlaySlotPlacementData) == 0x00001C, "Member 'AthenaScoreAlert_C_FillInitialPositionData::K2Node_MakeStruct_HUDMessageOverlaySlotPlacementData' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_GetAnchors_ReturnValue) == 0x000030, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_GetPosition_ReturnValue) == 0x000040, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'AthenaScoreAlert_C_FillInitialPositionData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaScoreAlert_C_FillInitialPositionData, K2Node_MakeStruct_HUDMessageCanvasSlotPlacementData) == 0x00004C, "Member 'AthenaScoreAlert_C_FillInitialPositionData::K2Node_MakeStruct_HUDMessageCanvasSlotPlacementData' has a wrong offset!");

// Function AthenaScoreAlert.AthenaScoreAlert_C.SetPlacement
// 0x0060 (0x0060 - 0x0000)
struct AthenaScoreAlert_C_SetPlacement final
{
public:
	class UCanvasPanelSlot*                       CanvasSlot;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           OverlaySlot;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHUDMessagePlacement                          Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FB9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDMessageCanvasSlotPlacementData     K2Node_Select_Default;                             // 0x0014(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHUDMessagePlacement                          Temp_byte_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FBA[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDMessageOverlaySlotPlacementData    K2Node_Select_Default_1;                           // 0x0038(0x0014)(NoDestructor)
