#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_Video_Stream_Trigger1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MediaUtils_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_Video_Stream_Trigger1.Athena_Prop_Video_Stream_Trigger1_C.ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1
// 0x04F0 (0x04F0 - 0x0000)
struct Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88B9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_RetrievedUrl_1;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RetrievedUrl;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsActorBeingDestroyed_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88BA[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_OpenedUrl;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_9;                   // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_VideoUID_1;                     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartTime;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88BB[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScreen_IsThisScreen;                 // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88BC[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ScreenName_8;                   // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_1;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88BD[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& FailedUrl)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_88BE[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_VideoMeshTrigger_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlayStartTime;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_VideoUID;                       // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_7;                   // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_2;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88BF[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_FailedUrl;                      // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_VideoScreen_1;                  // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_6;                   // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartPlayTime;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_3;               // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C0[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StartWarmingTime;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C1[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ScreenName_5;                   // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_4;                   // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_4;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C2[0xF];                                     // 0x01D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Galileo_VideoPreBuffer_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_3;                   // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_5;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C3[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ScreenName_2;                   // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_6;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C4[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ScreenName)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C5[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ScreenName)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C6[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    K2Node_MakeStruct_MediaPlayerOptions;              // 0x0290(0x0030)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C7[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_1;                // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88C8[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMediaPlayerOptions                    K2Node_MakeStruct_MediaPlayerOptions_1;            // 0x02D8(0x0030)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& VideoScreen)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_88C9[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CA[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Reason;                         // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CB[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Screen_Name;                    // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_7;               // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScreen_IsThisScreen_8;               // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0363(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CC[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_VideoScreen;                    // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldStreamBePlaying_ReturnValue;        // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CD[0x2];                                     // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x037C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ShouldStreamBePlaying_ReturnValue_1;      // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CE[0x3];                                     // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ScreenName_1;                   // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxBandwidth;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_9;               // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88CF[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ScreenName, int32 MaxBW)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_ScreenName;                     // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SeekTime;                       // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Exact;                          // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D0[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_2;                // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScreen_IsThisScreen_10;              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Seek_ReturnValue;                         // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SupportsSeeking_ReturnValue;              // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D1[0x5];                                     // 0x03E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTime_ReturnValue;                      // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D2[0x3];                                     // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88D3[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_3;                // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Seek_ReturnValue_1;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D4[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float StartWarmingTime, const class FString& ScreenName)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x040C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& VideoScreen)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D5[0x3];                                     // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0430(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    K2Node_Select_Default;                             // 0x0448(0x0030)(NoDestructor)
	bool                                          CallFunc_OpenSourceWithOptions_ReturnValue;        // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldStreamBePlaying_ReturnValue_2;      // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D6[0x1];                                     // 0x047B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x047C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_88D7[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0490(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D8[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VideoMeshTrigger_C*                 CallFunc_Array_Get_Item;                           // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D9[0x1];                                     // 0x04AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float PlayStartTime, const class FString& VideoUID, const class FString& ScreenName)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x04AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DA[0x2];                                     // 0x04BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMediaPlayerCtrl*                   CallFunc_SpawnObject_ReturnValue;                  // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSourceWithOptions_ReturnValue_1;      // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBlocks_CompleteBlock;                // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DB[0x1];                                     // 0x04CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x04DC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1) == 0x000010, "Wrong alignment on Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1");
static_assert(sizeof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1) == 0x0004F0, "Wrong size on Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, EntryPoint) == 0x000000, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_RetrievedUrl_1) == 0x000008, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_RetrievedUrl_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_RetrievedUrl) == 0x000018, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_RetrievedUrl' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_IsActorBeingDestroyed_ReturnValue) == 0x000048, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_IsActorBeingDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_OpenedUrl) == 0x000050, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_OpenedUrl' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000060, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_9) == 0x000068, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_9' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_VideoUID_1) == 0x000078, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_VideoUID_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_StartTime) == 0x000088, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_StartTime' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Len_ReturnValue) == 0x000090, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Conv_IntToBool_ReturnValue) == 0x000094, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen) == 0x000095, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_8) == 0x000098, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_8' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_1) == 0x0000A8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000DC, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000F0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_PlayStartTime) == 0x000104, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_PlayStartTime' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_VideoUID) == 0x000108, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_VideoUID' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_7) == 0x000118, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_7' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_2) == 0x000128, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_FailedUrl) == 0x000130, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_FailedUrl' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_6) == 0x000140, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_VideoScreen_1) == 0x000160, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_VideoScreen_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_8) == 0x000170, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_UtcNow_ReturnValue) == 0x000188, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_6) == 0x000190, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_6' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_StartPlayTime) == 0x0001A0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_StartPlayTime' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_3) == 0x0001A4, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_Event_EndPlayReason) == 0x0001A5, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_StartWarmingTime) == 0x0001A8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_StartWarmingTime' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_5) == 0x0001B0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_4) == 0x0001C0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_4) == 0x0001D0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetTransform_ReturnValue) == 0x0001E0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000210, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_FinishSpawningActor_ReturnValue) == 0x000218, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_3) == 0x000220, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_5) == 0x000230, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_2) == 0x000238, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_6) == 0x000248, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_6' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_9) == 0x00024C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00025C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_10) == 0x000260, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_SetLooping_ReturnValue) == 0x000270, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_FromSeconds_ReturnValue) == 0x000278, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_SelectString_ReturnValue) == 0x000280, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_MakeStruct_MediaPlayerOptions) == 0x000290, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_MakeStruct_MediaPlayerOptions' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, Temp_int_Loop_Counter_Variable) == 0x0002C0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_FromSeconds_ReturnValue_1) == 0x0002C8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_FromSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Less_IntInt_ReturnValue) == 0x0002D0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_MakeStruct_MediaPlayerOptions_1) == 0x0002D8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_MakeStruct_MediaPlayerOptions_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Add_IntInt_ReturnValue) == 0x000308, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_11) == 0x00030C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetCommandLine_ReturnValue) == 0x000320, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Contains_ReturnValue) == 0x000330, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_Reason) == 0x000338, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_IsPlaying_ReturnValue) == 0x000348, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_Screen_Name) == 0x000350, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_Screen_Name' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_7) == 0x000360, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_7' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000361, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_8) == 0x000362, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_8' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_IsValid_ReturnValue) == 0x000363, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_VideoScreen) == 0x000368, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_VideoScreen' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_ShouldStreamBePlaying_ReturnValue) == 0x000378, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_ShouldStreamBePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_BooleanAND_ReturnValue) == 0x000379, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_12) == 0x00037C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_ShouldStreamBePlaying_ReturnValue_1) == 0x00038C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_ShouldStreamBePlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000390, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName_1) == 0x000398, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_MaxBandwidth) == 0x0003A8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_MaxBandwidth' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_9) == 0x0003AC, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_9' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_13) == 0x0003B0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_ScreenName) == 0x0003C0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_ScreenName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_SeekTime) == 0x0003D0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_SeekTime' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CustomEvent_Exact) == 0x0003D4, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CustomEvent_Exact' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_FromSeconds_ReturnValue_2) == 0x0003D8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_FromSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_CheckScreen_IsThisScreen_10) == 0x0003E0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_CheckScreen_IsThisScreen_10' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Seek_ReturnValue) == 0x0003E1, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Seek_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_SupportsSeeking_ReturnValue) == 0x0003E2, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_SupportsSeeking_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetTime_ReturnValue) == 0x0003E8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_BooleanAND_ReturnValue_1) == 0x0003F0, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_GetTotalSeconds_ReturnValue) == 0x0003F4, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003F8, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_FromSeconds_ReturnValue_3) == 0x000400, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_FromSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_Seek_ReturnValue_1) == 0x000408, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_Seek_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_14) == 0x00040C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_15) == 0x00041C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, Temp_bool_Variable) == 0x00042C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_16) == 0x000430, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000440, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_Select_Default) == 0x000448, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_OpenSourceWithOptions_ReturnValue) == 0x000478, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_OpenSourceWithOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000479, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_ShouldStreamBePlaying_ReturnValue_2) == 0x00047A, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_ShouldStreamBePlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, K2Node_CreateDelegate_OutputDelegate_17) == 0x00047C, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000490, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1, Temp_int_Array_Index_Variable) == 0x000498, "Member 'Athena_Prop_Video_Stream_Trigger1_C_ExecuteUbergraph_Athena_Prop_Video_Stream_Trigger1::Temp_int_Array_Index_Variable' has a wrong offset!");
