#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectatorWeaponLoadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectatorWeaponLoadout.AthenaSpectatorWeaponLoadout_C
// 0x0030 (0x02D8 - 0x02A8)
class UAthenaSpectatorWeaponLoadout_C final : public UAthenaSpectatorQuickbarBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaSpectatorInventorySlot_C*        Slot1;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorInventorySlot_C*        Slot2;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorInventorySlot_C*        Slot3;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorInventorySlot_C*        Slot4;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaSpectatorInventorySlot_C*        Slot5;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSpectatorWeaponLoadout(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectatorWeaponLoadout_C">();
	}
	static class UAthenaSpectatorWeaponLoadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorWeaponLoadout_C>();
	}
};
static_assert(alignof(UAthenaSpectatorWeaponLoadout_C) == 0x000008, "Wrong alignment on UAthenaSpectatorWeaponLoadout_C");
static_assert(sizeof(UAthenaSpectatorWeaponLoadout_C) == 0x0002D8, "Wrong size on UAthenaSpectatorWeaponLoadout_C");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, UberGraphFrame) == 0x0002A8, "Member 'UAthenaSpectatorWeaponLoadout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, Slot1) == 0x0002B0, "Member 'UAthenaSpectatorWeaponLoadout_C::Slot1' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, Slot2) == 0x0002B8, "Member 'UAthenaSpectatorWeaponLoadout_C::Slot2' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, Slot3) == 0x0002C0, "Member 'UAthenaSpectatorWeaponLoadout_C::Slot3' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, Slot4) == 0x0002C8, "Member 'UAthenaSpectatorWeaponLoadout_C::Slot4' has a wrong offset!");
static_assert(offsetof(UAthenaSpectatorWeaponLoadout_C, Slot5) == 0x0002D0, "Member 'UAthenaSpectatorWeaponLoadout_C::Slot5' has a wrong offset!");

}

