#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDrop_Llama

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.ExecuteUbergraph_AthenaSupplyDrop_Llama
// 0x0498 (0x0498 - 0x0000)
struct AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0010(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB0[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB1[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB2[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0178(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01A4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0240(0x0018)()
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB3[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0268(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0270(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB4[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB5[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB6[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB7[0x5];                                     // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB8[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x02D0(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB9[0x2];                                     // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x02F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EBA[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0300(0x0020)(ConstParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBB[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GroundTrace_OutHit;                       // 0x033C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GroundTrace_ReturnValue;                  // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBC[0x3];                                     // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBD[0x2];                                     // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EBE[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBF[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0460(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC0[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0490(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama) == 0x000498, "Wrong size on AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, EntryPoint) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_ComponentBoundEvent_ImpactResult) == 0x000010, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_bBlockingHit) == 0x00009C, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009D, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Time) == 0x0000A0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Distance) == 0x0000A4, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Location) == 0x0000A8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B4, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Normal) == 0x0000C0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_ImpactNormal) == 0x0000CC, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_DamagedActor) == 0x000128, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_Damage) == 0x000130, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_InstigatedBy) == 0x000138, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_DamageCauser) == 0x000140, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_HitLocation) == 0x000148, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_FHitComponent) == 0x000158, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_BoneName) == 0x000160, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_Momentum) == 0x000168, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_Damage) == 0x000174, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_DamageTags) == 0x000178, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_Momentum) == 0x000198, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_HitInfo) == 0x0001A4, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_InstigatedBy) == 0x000230, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_DamageCauser) == 0x000238, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_EffectContext) == 0x000240, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000258, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_InteractingPawn) == 0x000268, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_Event_InteractionBeingAttempted) == 0x000270, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_GetController_ReturnValue) == 0x000278, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000280, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Not_PreBool_ReturnValue) == 0x000289, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000290, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_MakeArray_Array) == 0x0002A0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_GetGameState_ReturnValue) == 0x0002B0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x0002B8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x0002B9, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x0002BA, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0002C0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_DynamicCast_bSuccess_3) == 0x0002C8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002C9, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x0002D0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BooleanAND_ReturnValue) == 0x0002F0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_HasTag_ReturnValue) == 0x0002F1, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_PlaylistName) == 0x0002F4, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CustomEvent_PlaylistContextTags) == 0x000300, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_HasAuthority_ReturnValue) == 0x000320, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_HasTag_ReturnValue_1) == 0x000321, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000324, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_Add_VectorVector_ReturnValue) == 0x000330, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_GroundTrace_OutHit) == 0x00033C, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_GroundTrace_OutHit' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_GroundTrace_ReturnValue) == 0x0003C8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_GroundTrace_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003CC, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0003D8, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0003D9, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Time_1) == 0x0003DC, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Distance_1) == 0x0003E0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Location_1) == 0x0003E4, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003F0, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_Normal_1) == 0x0003FC, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000408, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_PhysMat_1) == 0x000418, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitActor_1) == 0x000420, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitComponent_1) == 0x000428, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitBoneName_1) == 0x000430, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_HitItem_1) == 0x000438, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_FaceIndex_1) == 0x00043C, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_TraceStart_1) == 0x000440, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_BreakHitResult_TraceEnd_1) == 0x00044C, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_HasAuthority_ReturnValue_1) == 0x000458, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, Temp_object_Variable) == 0x000460, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, K2Node_CreateDelegate_OutputDelegate_1) == 0x000470, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_IsValid_ReturnValue) == 0x000480, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000484, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000490, "Member 'AthenaSupplyDrop_Llama_C_ExecuteUbergraph_AthenaSupplyDrop_Llama::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct AthenaSupplyDrop_Llama_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_PlaylistLoaded) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_PlaylistLoaded");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_PlaylistLoaded) == 0x000028, "Wrong size on AthenaSupplyDrop_Llama_C_PlaylistLoaded");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaSupplyDrop_Llama_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_BlueprintOnInteract");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaSupplyDrop_Llama_C_BlueprintOnInteract");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDrop_Llama_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_OnDeathServer) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_OnDeathServer");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_OnDeathServer) == 0x0000E8, "Wrong size on AthenaSupplyDrop_Llama_C_OnDeathServer");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, Damage) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, DamageTags) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, Momentum) == 0x000028, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, HitInfo) == 0x000034, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDrop_Llama_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x008C (0x008C - 0x0000)
struct AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature) == 0x00008C, "Wrong size on AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.OnLandingLocationChanged
// 0x0050 (0x0050 - 0x0000)
struct AthenaSupplyDrop_Llama_C_OnLandingLocationChanged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_OnLandingLocationChanged");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged) == 0x000050, "Wrong size on AthenaSupplyDrop_Llama_C_OnLandingLocationChanged");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, DamagedActor) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, Damage) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, InstigatedBy) == 0x000010, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, DamageCauser) == 0x000018, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, HitLocation) == 0x000020, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, FHitComponent) == 0x000030, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, BoneName) == 0x000038, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::BoneName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_OnLandingLocationChanged, Momentum) == 0x000040, "Member 'AthenaSupplyDrop_Llama_C_OnLandingLocationChanged::Momentum' has a wrong offset!");

// Function AthenaSupplyDrop_Llama.AthenaSupplyDrop_Llama_C.SpawnLoot
// 0x01D0 (0x01D0 - 0x0000)
struct AthenaSupplyDrop_Llama_C_SpawnLoot final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLootTierGroupOverride_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLootSpawnLocation_LootSpawnLocation;   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLootLevel_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC6[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemEntry>                 CallFunc_PickLootDrops_OutLootToDrop;              // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_PickLootDrops_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC7[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_Array_Get_Item;                           // 0x0050(0x0160)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC8[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC9[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_SpawnPickup_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_Llama_C_SpawnLoot) == 0x000008, "Wrong alignment on AthenaSupplyDrop_Llama_C_SpawnLoot");
static_assert(sizeof(AthenaSupplyDrop_Llama_C_SpawnLoot) == 0x0001D0, "Wrong size on AthenaSupplyDrop_Llama_C_SpawnLoot");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_SpawnLoot, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'AthenaSupplyDrop_Llama_C_SpawnLoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_SpawnLoot, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSupplyDrop_Llama_C_SpawnLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_Llama_C_SpawnLoot, Temp_int_Array_Index_Variable) == 0x000008, "Member 'AthenaSupplyDrop_Llama_C_SpawnLoot::Temp_int_Array_Index_Variable' has a wrong offset!");
