#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseChangeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.ExecuteUbergraph_AthenaGamePhaseChangeWidget
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_Step;                                 // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7272[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_TimeText;                             // 0x0020(0x0018)(ConstParm)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7273[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_10;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_11;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_12;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7274[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	EAthenaGamePhaseStep                          K2Node_Event_Step_1;                               // 0x00D0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x0000D8, "Wrong size on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, EntryPoint) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step) == 0x000004, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Message) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_TimeText) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_TimeText' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_1) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_2) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_3) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_4) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_5) == 0x000060, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_6) == 0x000068, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_7) == 0x000070, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_8) == 0x000078, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_9) == 0x000080, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetFeatureState_OutFeatureState) == 0x000090, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_GetFeatureState_OutReason) == 0x000091, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000092, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_10) == 0x000098, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_11) == 0x0000A0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable_12) == 0x0000A8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable) == 0x0000B0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default) == 0x0000B8, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step_1) == 0x0000D0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000D1, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.BP_UpdateMessaging
// 0x0038 (0x0038 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7275[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_Message;                                     // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Param_TimeText;                                    // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging) == 0x000038, "Wrong size on AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, Param_Message) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::Param_Message' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging, Param_TimeText) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_BP_UpdateMessaging::Param_TimeText' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.BP_HandleGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged) == 0x000001, "Wrong alignment on AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged) == 0x000001, "Wrong size on AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_BP_HandleGamePhaseStepChanged::Step' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayGamePhaseAlertSound
// 0x0080 (0x0080 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7276[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_9;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_10;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_11;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_12;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000080, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_byte_Variable) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_1) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_2) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_3) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_4) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_5) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_6) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_7) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_8) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_9) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_10) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_11) == 0x000060, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable_12) == 0x000068, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, K2Node_Select_Default) == 0x000070, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayIntroAnimation
// 0x0038 (0x0038 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayIntroAnimation final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7277[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000038, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Temp_bool_Variable) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, K2Node_Select_Default) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

