#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaRespawnIndicator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.ToggleRespawnState
// 0x0001 (0x0001 - 0x0000)
struct AthenaRespawnIndicator_C_ToggleRespawnState final
{
public:
	bool                                          Param_CanRespawn;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnIndicator_C_ToggleRespawnState) == 0x000001, "Wrong alignment on AthenaRespawnIndicator_C_ToggleRespawnState");
static_assert(sizeof(AthenaRespawnIndicator_C_ToggleRespawnState) == 0x000001, "Wrong size on AthenaRespawnIndicator_C_ToggleRespawnState");
static_assert(offsetof(AthenaRespawnIndicator_C_ToggleRespawnState, Param_CanRespawn) == 0x000000, "Member 'AthenaRespawnIndicator_C_ToggleRespawnState::Param_CanRespawn' has a wrong offset!");

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.SetVisibilty
// 0x0001 (0x0001 - 0x0000)
struct AthenaRespawnIndicator_C_SetVisibilty final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnIndicator_C_SetVisibilty) == 0x000001, "Wrong alignment on AthenaRespawnIndicator_C_SetVisibilty");
static_assert(sizeof(AthenaRespawnIndicator_C_SetVisibilty) == 0x000001, "Wrong size on AthenaRespawnIndicator_C_SetVisibilty");
static_assert(offsetof(AthenaRespawnIndicator_C_SetVisibilty, Visible) == 0x000000, "Member 'AthenaRespawnIndicator_C_SetVisibilty::Visible' has a wrong offset!");

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaRespawnIndicator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnIndicator_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaRespawnIndicator_C_PreConstruct");
static_assert(sizeof(AthenaRespawnIndicator_C_PreConstruct) == 0x000001, "Wrong size on AthenaRespawnIndicator_C_PreConstruct");
static_assert(offsetof(AthenaRespawnIndicator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaRespawnIndicator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.OnUpdateRespawnState
// 0x0001 (0x0001 - 0x0000)
struct AthenaRespawnIndicator_C_OnUpdateRespawnState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnIndicator_C_OnUpdateRespawnState) == 0x000001, "Wrong alignment on AthenaRespawnIndicator_C_OnUpdateRespawnState");
static_assert(sizeof(AthenaRespawnIndicator_C_OnUpdateRespawnState) == 0x000001, "Wrong size on AthenaRespawnIndicator_C_OnUpdateRespawnState");
static_assert(offsetof(AthenaRespawnIndicator_C_OnUpdateRespawnState, bEnabled) == 0x000000, "Member 'AthenaRespawnIndicator_C_OnUpdateRespawnState::bEnabled' has a wrong offset!");

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.OnUpdateLives
// 0x0004 (0x0004 - 0x0000)
struct AthenaRespawnIndicator_C_OnUpdateLives final
{
public:
	int32                                         Lives;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRespawnIndicator_C_OnUpdateLives) == 0x000004, "Wrong alignment on AthenaRespawnIndicator_C_OnUpdateLives");
static_assert(sizeof(AthenaRespawnIndicator_C_OnUpdateLives) == 0x000004, "Wrong size on AthenaRespawnIndicator_C_OnUpdateLives");
static_assert(offsetof(AthenaRespawnIndicator_C_OnUpdateLives, Lives) == 0x000000, "Member 'AthenaRespawnIndicator_C_OnUpdateLives::Lives' has a wrong offset!");

// Function AthenaRespawnIndicator.AthenaRespawnIndicator_C.ExecuteUbergraph_AthenaRespawnIndicator
// 0x0138 (0x0138 - 0x0000)
struct AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_633E[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_633F[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_canRespawn;                     // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0058(0x0018)()
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6340[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x00D0(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6341[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6342[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Lives;                                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator) == 0x000008, "Wrong alignment on AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator");
static_assert(sizeof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator) == 0x000138, "Wrong size on AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, EntryPoint) == 0x000000, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable) == 0x000004, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable_1) == 0x000005, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_byte_Variable) == 0x000006, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_byte_Variable_1) == 0x000007, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable_2) == 0x000008, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_byte_Variable_2) == 0x000009, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_byte_Variable_3) == 0x00000A, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable_3) == 0x00000B, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable_4) == 0x00000C, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_text_Variable) == 0x000010, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_text_Variable_1) == 0x000028, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_bool_Variable_5) == 0x000040, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_struct_Variable) == 0x000044, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_struct_Variable_1) == 0x00004C, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, CallFunc_GetVisibility_ReturnValue) == 0x000054, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_CustomEvent_canRespawn) == 0x000055, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_CustomEvent_canRespawn' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000056, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default) == 0x000057, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default_1) == 0x000058, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default_2) == 0x000070, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_CustomEvent_Visible) == 0x000078, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default_3) == 0x000079, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_MakeStruct_SlateColor) == 0x000080, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_MakeStruct_SlateColor_1) == 0x0000A8, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default_4) == 0x0000D0, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Event_IsDesignTime) == 0x0000F8, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_struct_Variable_2) == 0x0000FC, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, Temp_struct_Variable_3) == 0x00010C, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Event_bEnabled) == 0x00011C, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Select_Default_5) == 0x000120, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, K2Node_Event_Lives) == 0x000130, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::K2Node_Event_Lives' has a wrong offset!");
static_assert(offsetof(AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator, CallFunc_IsVisible_ReturnValue) == 0x000134, "Member 'AthenaRespawnIndicator_C_ExecuteUbergraph_AthenaRespawnIndicator::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

}

