#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_ShipReturn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_SW_ShipReturn.AthenaQuestActor_SW_ShipReturn_C
// 0x0130 (0x0350 - 0x0220)
class AAthenaQuestActor_SW_ShipReturn_C final : public AFortStaticReplicatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Engine_Sound_Loop_Stage_3;                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Quest_SWShip_Open_Ship;                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Athena_QuestItem_PickupSuccess;                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Athena_CollectHiddenStarReward_Cue;                // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      TouchCapsule;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HoverTimeline_NewTrack_0_90EC44CB42A4670D4C2A94A1D797D26C; // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoverTimeline_PuzzleIconGlowIntensity_90EC44CB42A4670D4C2A94A1D797D26C; // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoverTimeline_MoveZ_90EC44CB42A4670D4C2A94A1D797D26C; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoverTimeline_RotateZ_90EC44CB42A4670D4C2A94A1D797D26C; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            HoverTimeline__Direction_90EC44CB42A4670D4C2A94A1D797D26C; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6387[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     HoverTimeline;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RequiresConditionToComplete;                       // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLocallyValid;                                    // 0x0292(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6388[0x5];                                     // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GenericSuccessSound;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        GenericSuccessFX;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeGenericSuccessSoundAndFX;               // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerObjectiveCount;                              // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerThatTriggeredObject;                         // 0x02B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaSKPushVehicle*               ShoppingCartThatTriggered;                         // 0x02B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bTestQuest;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6389[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TagToCheck;                                        // 0x02C4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestShared;                                    // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlaySuccessFX;                                     // 0x02CD(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          TestVisuals;                                       // 0x02CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_638A[0x1];                                     // 0x02CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Emissive_Material_Instance2;                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     AirVents_Transforms;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UPointLightComponent*                   Green_Light;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     Engines_Transforms;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             FX_Vent_Systems;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             FX_Engine_Systems;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           FX_TOD_Particle_Color;                             // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     HoverDust;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IdleHoverPlayRate;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HoveringShipLoc;                                   // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DestroyActor;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_AthenaQuestActor_SW_ShipReturn(int32 EntryPoint);
	void TouchedActorInCreativeMode();
	void TellChildOfSuccess();
	void ReceiveBeginPlay();
	void ObjectiveSuccessfullyCompleted(class AActor* PlayerWhoTriggeredObject);
	void QuestInitializedAndValid();
	void QuestSuccessfullyUpdated();
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void TouchedQuestActor(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnCurrentQuestsReady_4BFC2E824911CD49AB110386C11F7FCD(class UFortQuestManager* OwningQuestManager, bool bFoundAllQuestsOnProfile);
	void HoverTimeline__UpdateFunc();
	void HoverTimeline__FinishedFunc();
	void UserConstructionScript();
	void OnRep_ShoppingCartThatTriggered();
	void CheckShouldShowLocally(bool* ShouldShowLocally);
	void OnRep_PlaySuccessFX();
	void OnRep_DestroyActor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_SW_ShipReturn_C">();
	}
	static class AAthenaQuestActor_SW_ShipReturn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_SW_ShipReturn_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_SW_ShipReturn_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_SW_ShipReturn_C");
static_assert(sizeof(AAthenaQuestActor_SW_ShipReturn_C) == 0x000350, "Wrong size on AAthenaQuestActor_SW_ShipReturn_C");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, UberGraphFrame) == 0x000220, "Member 'AAthenaQuestActor_SW_ShipReturn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, Engine_Sound_Loop_Stage_3) == 0x000228, "Member 'AAthenaQuestActor_SW_ShipReturn_C::Engine_Sound_Loop_Stage_3' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, S_Quest_SWShip_Open_Ship) == 0x000230, "Member 'AAthenaQuestActor_SW_ShipReturn_C::S_Quest_SWShip_Open_Ship' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, P_Athena_QuestItem_PickupSuccess) == 0x000238, "Member 'AAthenaQuestActor_SW_ShipReturn_C::P_Athena_QuestItem_PickupSuccess' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, Athena_CollectHiddenStarReward_Cue) == 0x000240, "Member 'AAthenaQuestActor_SW_ShipReturn_C::Athena_CollectHiddenStarReward_Cue' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, TouchCapsule) == 0x000248, "Member 'AAthenaQuestActor_SW_ShipReturn_C::TouchCapsule' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, DefaultSceneRoot) == 0x000250, "Member 'AAthenaQuestActor_SW_ShipReturn_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline_NewTrack_0_90EC44CB42A4670D4C2A94A1D797D26C) == 0x000258, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline_NewTrack_0_90EC44CB42A4670D4C2A94A1D797D26C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline_PuzzleIconGlowIntensity_90EC44CB42A4670D4C2A94A1D797D26C) == 0x000264, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline_PuzzleIconGlowIntensity_90EC44CB42A4670D4C2A94A1D797D26C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline_MoveZ_90EC44CB42A4670D4C2A94A1D797D26C) == 0x000268, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline_MoveZ_90EC44CB42A4670D4C2A94A1D797D26C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline_RotateZ_90EC44CB42A4670D4C2A94A1D797D26C) == 0x00026C, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline_RotateZ_90EC44CB42A4670D4C2A94A1D797D26C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline__Direction_90EC44CB42A4670D4C2A94A1D797D26C) == 0x000270, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline__Direction_90EC44CB42A4670D4C2A94A1D797D26C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverTimeline) == 0x000278, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverTimeline' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, QuestItem) == 0x000280, "Member 'AAthenaQuestActor_SW_ShipReturn_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, ObjBackendName) == 0x000288, "Member 'AAthenaQuestActor_SW_ShipReturn_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, CreativeMode) == 0x000290, "Member 'AAthenaQuestActor_SW_ShipReturn_C::CreativeMode' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, RequiresConditionToComplete) == 0x000291, "Member 'AAthenaQuestActor_SW_ShipReturn_C::RequiresConditionToComplete' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, IsLocallyValid) == 0x000292, "Member 'AAthenaQuestActor_SW_ShipReturn_C::IsLocallyValid' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, GenericSuccessSound) == 0x000298, "Member 'AAthenaQuestActor_SW_ShipReturn_C::GenericSuccessSound' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, GenericSuccessFX) == 0x0002A0, "Member 'AAthenaQuestActor_SW_ShipReturn_C::GenericSuccessFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, DelayBeforeGenericSuccessSoundAndFX) == 0x0002A8, "Member 'AAthenaQuestActor_SW_ShipReturn_C::DelayBeforeGenericSuccessSoundAndFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, PlayerObjectiveCount) == 0x0002AC, "Member 'AAthenaQuestActor_SW_ShipReturn_C::PlayerObjectiveCount' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, PlayerThatTriggeredObject) == 0x0002B0, "Member 'AAthenaQuestActor_SW_ShipReturn_C::PlayerThatTriggeredObject' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, ShoppingCartThatTriggered) == 0x0002B8, "Member 'AAthenaQuestActor_SW_ShipReturn_C::ShoppingCartThatTriggered' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, bTestQuest) == 0x0002C0, "Member 'AAthenaQuestActor_SW_ShipReturn_C::bTestQuest' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, TagToCheck) == 0x0002C4, "Member 'AAthenaQuestActor_SW_ShipReturn_C::TagToCheck' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, bIsQuestShared) == 0x0002CC, "Member 'AAthenaQuestActor_SW_ShipReturn_C::bIsQuestShared' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, PlaySuccessFX) == 0x0002CD, "Member 'AAthenaQuestActor_SW_ShipReturn_C::PlaySuccessFX' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, TestVisuals) == 0x0002CE, "Member 'AAthenaQuestActor_SW_ShipReturn_C::TestVisuals' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, Emissive_Material_Instance2) == 0x0002D0, "Member 'AAthenaQuestActor_SW_ShipReturn_C::Emissive_Material_Instance2' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, AirVents_Transforms) == 0x0002D8, "Member 'AAthenaQuestActor_SW_ShipReturn_C::AirVents_Transforms' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, Green_Light) == 0x0002E8, "Member 'AAthenaQuestActor_SW_ShipReturn_C::Green_Light' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, Engines_Transforms) == 0x0002F0, "Member 'AAthenaQuestActor_SW_ShipReturn_C::Engines_Transforms' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, FX_Vent_Systems) == 0x000300, "Member 'AAthenaQuestActor_SW_ShipReturn_C::FX_Vent_Systems' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, FX_Engine_Systems) == 0x000310, "Member 'AAthenaQuestActor_SW_ShipReturn_C::FX_Engine_Systems' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, FX_TOD_Particle_Color) == 0x000320, "Member 'AAthenaQuestActor_SW_ShipReturn_C::FX_TOD_Particle_Color' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoverDust) == 0x000330, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoverDust' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, IdleHoverPlayRate) == 0x000338, "Member 'AAthenaQuestActor_SW_ShipReturn_C::IdleHoverPlayRate' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, HoveringShipLoc) == 0x00033C, "Member 'AAthenaQuestActor_SW_ShipReturn_C::HoveringShipLoc' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_SW_ShipReturn_C, DestroyActor) == 0x000348, "Member 'AAthenaQuestActor_SW_ShipReturn_C::DestroyActor' has a wrong offset!");

}

