#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaLobby.AthenaLobby_C.HandleLobbyColorSchemeChange
// 0x0050 (0x0050 - 0x0000)
struct AthenaLobby_C_HandleLobbyColorSchemeChange final
{
public:
	struct FLinearColor                           NewColorScheme;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDefaultScheme;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_752E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_752F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaLobbyMatchmakingPlay_C*          K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7530[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_HandleLobbyColorSchemeChange) == 0x000008, "Wrong alignment on AthenaLobby_C_HandleLobbyColorSchemeChange");
static_assert(sizeof(AthenaLobby_C_HandleLobbyColorSchemeChange) == 0x000050, "Wrong size on AthenaLobby_C_HandleLobbyColorSchemeChange");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, NewColorScheme) == 0x000000, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::NewColorScheme' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, UseDefaultScheme) == 0x000010, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::UseDefaultScheme' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, Temp_struct_Variable) == 0x000014, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play) == 0x000028, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, Temp_bool_Variable) == 0x000031, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_HandleLobbyColorSchemeChange, K2Node_Select_Default) == 0x000040, "Member 'AthenaLobby_C_HandleLobbyColorSchemeChange::K2Node_Select_Default' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.ConfigureGenericLinkButton
// 0x0078 (0x0078 - 0x0000)
struct AthenaLobby_C_ConfigureGenericLinkButton final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7531[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	TScriptInterface<class IFortClientAnnouncement_TutorialInterface> K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7532[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue; // 0x0040(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7533[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(AthenaLobby_C_ConfigureGenericLinkButton) == 0x000008, "Wrong alignment on AthenaLobby_C_ConfigureGenericLinkButton");
static_assert(sizeof(AthenaLobby_C_ConfigureGenericLinkButton) == 0x000078, "Wrong size on AthenaLobby_C_ConfigureGenericLinkButton");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, Temp_bool_Variable) == 0x000000, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, Temp_text_Variable) == 0x000008, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface) == 0x000020, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000038, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue) == 0x000040, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ConfigureGenericLinkButton, K2Node_Select_Default) == 0x000060, "Member 'AthenaLobby_C_ConfigureGenericLinkButton::K2Node_Select_Default' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.StartAthenaLobbyMusic
// 0x0020 (0x0020 - 0x0000)
struct AthenaLobby_C_StartAthenaLobbyMusic final
{
public:
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_StartAthenaLobbyMusic) == 0x000008, "Wrong alignment on AthenaLobby_C_StartAthenaLobbyMusic");
static_assert(sizeof(AthenaLobby_C_StartAthenaLobbyMusic) == 0x000020, "Wrong size on AthenaLobby_C_StartAthenaLobbyMusic");
static_assert(offsetof(AthenaLobby_C_StartAthenaLobbyMusic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'AthenaLobby_C_StartAthenaLobbyMusic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_StartAthenaLobbyMusic, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaLobby_C_StartAthenaLobbyMusic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_StartAthenaLobbyMusic, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaLobby_C_StartAthenaLobbyMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnComplete_9036807A49B907A7A1B78EB727BAB97A
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A) == 0x000008, "Wrong alignment on AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A");
static_assert(sizeof(AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A) == 0x000008, "Wrong size on AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A");
static_assert(offsetof(AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A, UserWidget) == 0x000000, "Member 'AthenaLobby_C_OnComplete_9036807A49B907A7A1B78EB727BAB97A::UserWidget' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.DisplayStoreUpdated
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_DisplayStoreUpdated final
{
public:
	class UStoreToastRequest*                     StoreUpdatedRequest;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong alignment on AthenaLobby_C_DisplayStoreUpdated");
static_assert(sizeof(AthenaLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong size on AthenaLobby_C_DisplayStoreUpdated");
static_assert(offsetof(AthenaLobby_C_DisplayStoreUpdated, StoreUpdatedRequest) == 0x000000, "Member 'AthenaLobby_C_DisplayStoreUpdated::StoreUpdatedRequest' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnPlaylistChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_OnPlaylistChanged final
{
public:
	EFortLobbyType                                LobbyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7534[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              PlaylistData;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnPlaylistChanged) == 0x000008, "Wrong alignment on AthenaLobby_C_OnPlaylistChanged");
static_assert(sizeof(AthenaLobby_C_OnPlaylistChanged) == 0x000010, "Wrong size on AthenaLobby_C_OnPlaylistChanged");
static_assert(offsetof(AthenaLobby_C_OnPlaylistChanged, LobbyType) == 0x000000, "Member 'AthenaLobby_C_OnPlaylistChanged::LobbyType' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnPlaylistChanged, PlaylistData) == 0x000008, "Member 'AthenaLobby_C_OnPlaylistChanged::PlaylistData' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.DisplayGlyphQuestUpdated
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_DisplayGlyphQuestUpdated final
{
public:
	int32                                         NewGlyphs;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_DisplayGlyphQuestUpdated) == 0x000004, "Wrong alignment on AthenaLobby_C_DisplayGlyphQuestUpdated");
static_assert(sizeof(AthenaLobby_C_DisplayGlyphQuestUpdated) == 0x000004, "Wrong size on AthenaLobby_C_DisplayGlyphQuestUpdated");
static_assert(offsetof(AthenaLobby_C_DisplayGlyphQuestUpdated, NewGlyphs) == 0x000000, "Member 'AthenaLobby_C_DisplayGlyphQuestUpdated::NewGlyphs' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.ExecuteUbergraph_AthenaLobby
// 0x01E0 (0x01E0 - 0x0000)
struct AthenaLobby_C_ExecuteUbergraph_AthenaLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7535[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7536[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7537[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue_2;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                Temp_byte_Variable_5;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7538[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7539[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_753A[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_753B[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_753C[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default;                             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_753D[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStoreToastRequest*                     K2Node_Event_StoreUpdatedRequest;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeginRequest_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_753E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStoreCallout                          CallFunc_GetToast_ReturnValue;                     // 0x00E8(0x0090)()
	bool                                          CallFunc_IsRequestReady_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLobbyType                                K2Node_Event_LobbyType;                            // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_753F[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              K2Node_Event_PlaylistData;                         // 0x0180(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7540[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7541[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMatchmakingPlayLegacy_C*         K2Node_DynamicCast_AsAthena_Matchmaking_Play_Legacy; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7542[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewGlyphs;                            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_2;                           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7543[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_EnsureClientQuestLogin* CallFunc_SendEnsureClientQuestLogin_ReturnValue;   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x000008, "Wrong alignment on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(sizeof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x0001E0, "Wrong size on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, EntryPoint) == 0x000000, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
