#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaRespawnTimer

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaRespawnTimer.AthenaRespawnTimer_C.ExecuteUbergraph_AthenaRespawnTimer
// 0x0030 (0x0030 - 0x0000)
struct AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A8F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer) == 0x000008, "Wrong alignment on AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer");
static_assert(sizeof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer) == 0x000030, "Wrong size on AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, EntryPoint) == 0x000000, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, K2Node_Event_Widget) == 0x000008, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetGameStateAthena_ReturnValue) == 0x000020, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue) == 0x000028, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_GetShouldPlayRespawnTimerSFX_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'AthenaRespawnTimer_C_ExecuteUbergraph_AthenaRespawnTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaRespawnTimer.AthenaRespawnTimer_C.AddExtensionWidget_BP
// 0x0008 (0x0008 - 0x0000)
struct AthenaRespawnTimer_C_AddExtensionWidget_BP final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaRespawnTimer_C_AddExtensionWidget_BP) == 0x000008, "Wrong alignment on AthenaRespawnTimer_C_AddExtensionWidget_BP");
static_assert(sizeof(AthenaRespawnTimer_C_AddExtensionWidget_BP) == 0x000008, "Wrong size on AthenaRespawnTimer_C_AddExtensionWidget_BP");
static_assert(offsetof(AthenaRespawnTimer_C_AddExtensionWidget_BP, Widget) == 0x000000, "Member 'AthenaRespawnTimer_C_AddExtensionWidget_BP::Widget' has a wrong offset!");

}

