#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSupplyDrop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.ExecuteUbergraph_AthenaSupplyDrop
// 0x0520 (0x0520 - 0x0000)
struct AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6720[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6721[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6722[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6723[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6724[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0068(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0094(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0130(0x0018)()
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0148(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0150(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6725[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6726[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0178(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01A4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0240(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6727[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6728[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6729[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaSupplyDropBalloon_C*             K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon;   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672A[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672B[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672C[0x2];                                     // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672D[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672E[0x3];                                     // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue_1;              // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672F[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0408(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6730[0x3];                                     // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6731[0x4];                                     // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0420(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6732[0x2];                                     // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyListenersWithinRange_ReturnValue;   // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6733[0x5];                                     // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0448(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6734[0x3];                                     // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0454(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6735[0x3];                                     // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLootSpawnLocation_LootSpawnLocation;   // 0x04F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6736[0x3];                                     // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6737[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_SpawnPickup_ReturnValue;                  // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop) == 0x000010, "Wrong alignment on AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop");
static_assert(sizeof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop) == 0x000520, "Wrong size on AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, EntryPoint) == 0x000000, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_DamagedActor) == 0x000010, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_Damage) == 0x000018, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_InstigatedBy) == 0x000020, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_DamageCauser) == 0x000028, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_HitLocation) == 0x000030, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_FHitComponent) == 0x000040, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_BoneName) == 0x000048, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CustomEvent_Momentum) == 0x000050, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsDedicatedServer_ReturnValue) == 0x00005C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_Damage_1) == 0x000060, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_DamageTags_1) == 0x000068, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_Momentum_1) == 0x000088, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_HitInfo_1) == 0x000094, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_InstigatedBy_1) == 0x000120, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_DamageCauser_1) == 0x000128, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_EffectContext_1) == 0x000130, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_InteractingPawn) == 0x000148, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_InteractionBeingAttempted) == 0x000150, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000158, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000160, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000168, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_Damage) == 0x000170, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_DamageTags) == 0x000178, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_Momentum) == 0x000198, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_HitInfo) == 0x0001A4, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_InstigatedBy) == 0x000230, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_DamageCauser) == 0x000238, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_Event_EffectContext) == 0x000240, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000258, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000270, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakTransform_Location) == 0x0002A0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakTransform_Rotation) == 0x0002AC, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakTransform_Scale) == 0x0002B8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002C8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002D0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002E0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002F0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002F8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000300, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue) == 0x000308, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000309, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon) == 0x000310, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_CreateDelegate_OutputDelegate_3) == 0x00031C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00032C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_1) == 0x000338, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00033C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_2) == 0x000348, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000349, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00034C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000358, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000364, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakVector_X) == 0x000370, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakVector_Y) == 0x000374, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BreakVector_Z) == 0x000378, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Add_FloatFloat_ReturnValue) == 0x00037C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000380, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_MakeVector_ReturnValue) == 0x00038C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_HasAuthority_ReturnValue) == 0x000398, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_RandomFloatInRange_ReturnValue) == 0x00039C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0003A0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003AC, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Normal_ReturnValue) == 0x0003B8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0003C4, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_MakeVector_ReturnValue_1) == 0x0003C8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Add_VectorVector_ReturnValue) == 0x0003D4, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_TeleportTo_ReturnValue) == 0x0003E0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_SelectRotator_ReturnValue) == 0x0003E4, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, Temp_bool_Has_Been_Initd_Variable) == 0x0003F0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_TeleportTo_ReturnValue_1) == 0x0003F1, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_TeleportTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_3) == 0x0003F2, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_4) == 0x0003F3, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0003F8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000400, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000408, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000410, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_HasAuthority_ReturnValue_1) == 0x000414, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_FMax_ReturnValue) == 0x000418, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000420, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, Temp_bool_IsClosed_Variable) == 0x000428, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_5) == 0x000429, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00042C, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_AreAnyListenersWithinRange_ReturnValue) == 0x000438, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_AreAnyListenersWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsPlaying_ReturnValue) == 0x000439, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00043A, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000440, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x000448, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_IsValid_ReturnValue_6) == 0x000450, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_ComponentBoundEvent_ImpactResult) == 0x000454, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_ComponentBoundEvent_WaterBody) == 0x0004E0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0004E8, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0004F0, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_GetLootSpawnLocation_LootSpawnLocation) == 0x0004F4, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_GetLootSpawnLocation_LootSpawnLocation' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_Array_Length_ReturnValue_1) == 0x000500, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000504, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_DynamicCast_AsFort_World_Item_Definition) == 0x000508, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_DynamicCast_AsFort_World_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, K2Node_DynamicCast_bSuccess_1) == 0x000510, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop, CallFunc_SpawnPickup_ReturnValue) == 0x000518, "Member 'AthenaSupplyDrop_C_ExecuteUbergraph_AthenaSupplyDrop::CallFunc_SpawnPickup_ReturnValue' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent) == 0x000008, "Member 'AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'AthenaSupplyDrop_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_3_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature
// 0x008C (0x008C - 0x0000)
struct AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature) == 0x00008C, "Wrong size on AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'AthenaSupplyDrop_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDrop_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6738[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDrop_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on AthenaSupplyDrop_C_OnDeathPlayEffects");
static_assert(sizeof(AthenaSupplyDrop_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on AthenaSupplyDrop_C_OnDeathPlayEffects");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDrop_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaSupplyDrop_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSupplyDrop_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaSupplyDrop_C_BlueprintOnInteract");
static_assert(sizeof(AthenaSupplyDrop_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaSupplyDrop_C_BlueprintOnInteract");
static_assert(offsetof(AthenaSupplyDrop_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaSupplyDrop_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaSupplyDrop_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaSupplyDrop_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6739[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaSupplyDrop_C_OnDeathServer) == 0x000008, "Wrong alignment on AthenaSupplyDrop_C_OnDeathServer");
static_assert(sizeof(AthenaSupplyDrop_C_OnDeathServer) == 0x0000E8, "Wrong size on AthenaSupplyDrop_C_OnDeathServer");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, Damage) == 0x000000, "Member 'AthenaSupplyDrop_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, DamageTags) == 0x000008, "Member 'AthenaSupplyDrop_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, Momentum) == 0x000028, "Member 'AthenaSupplyDrop_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, HitInfo) == 0x000034, "Member 'AthenaSupplyDrop_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'AthenaSupplyDrop_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'AthenaSupplyDrop_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaSupplyDrop_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'AthenaSupplyDrop_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function AthenaSupplyDrop.AthenaSupplyDrop_C.OnLandingLocationChanged
// 0x0050 (0x0050 - 0x0000)
struct AthenaSupplyDrop_C_OnLandingLocationChanged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
