#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMarkerDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.Show
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_Show final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMarkerDetails_C_Show) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_Show");
static_assert(sizeof(AthenaMarkerDetails_C_Show) == 0x000001, "Wrong size on AthenaMarkerDetails_C_Show");
static_assert(offsetof(AthenaMarkerDetails_C_Show, Param_Show) == 0x000000, "Member 'AthenaMarkerDetails_C_Show::Param_Show' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.SetDisplayText
// 0x0030 (0x0030 - 0x0000)
struct AthenaMarkerDetails_C_SetDisplayText final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(AthenaMarkerDetails_C_SetDisplayText) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_SetDisplayText");
static_assert(sizeof(AthenaMarkerDetails_C_SetDisplayText) == 0x000030, "Wrong size on AthenaMarkerDetails_C_SetDisplayText");
static_assert(offsetof(AthenaMarkerDetails_C_SetDisplayText, NewText) == 0x000000, "Member 'AthenaMarkerDetails_C_SetDisplayText::NewText' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_SetDisplayText, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'AthenaMarkerDetails_C_SetDisplayText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.GetMarkedItemDetails
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaMarkerDetails_C_GetMarkedItemDetails final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Parm, OutParm)
	TSoftObjectPtr<class UTexture2D>              SmallPreviewImage;                                 // 0x0018(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	struct FLinearColor                           RarityColor;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarkedActorDisplayInfo                CallFunc_GetDisplayInfoForMarkerData_ReturnValue;  // 0x0050(0x0068)()
};
static_assert(alignof(AthenaMarkerDetails_C_GetMarkedItemDetails) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_GetMarkedItemDetails");
static_assert(sizeof(AthenaMarkerDetails_C_GetMarkedItemDetails) == 0x0000B8, "Wrong size on AthenaMarkerDetails_C_GetMarkedItemDetails");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, DisplayName) == 0x000000, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::DisplayName' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, SmallPreviewImage) == 0x000018, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::SmallPreviewImage' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, RarityColor) == 0x000040, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::RarityColor' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_GetMarkedItemDetails, CallFunc_GetDisplayInfoForMarkerData_ReturnValue) == 0x000050, "Member 'AthenaMarkerDetails_C_GetMarkedItemDetails::CallFunc_GetDisplayInfoForMarkerData_ReturnValue' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE
// 0x0008 (0x0008 - 0x0000)
struct AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE");
static_assert(sizeof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE) == 0x000008, "Wrong size on AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE");
static_assert(offsetof(AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE, Loaded) == 0x000000, "Member 'AthenaMarkerDetails_C_OnLoaded_2801580E4D1C0BB88FD9D4B09B65ACAE::Loaded' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.UpdateMarkerData
// 0x0100 (0x0100 - 0x0000)
struct AthenaMarkerDetails_C_UpdateMarkerData final
{
public:
	struct FFortWorldMarkerData                   MarkerData;                                        // 0x0000(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMarkerDetails_C_UpdateMarkerData) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_UpdateMarkerData");
static_assert(sizeof(AthenaMarkerDetails_C_UpdateMarkerData) == 0x000100, "Wrong size on AthenaMarkerDetails_C_UpdateMarkerData");
static_assert(offsetof(AthenaMarkerDetails_C_UpdateMarkerData, MarkerData) == 0x000000, "Member 'AthenaMarkerDetails_C_UpdateMarkerData::MarkerData' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMarkerDetails_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_PreConstruct");
static_assert(sizeof(AthenaMarkerDetails_C_PreConstruct) == 0x000001, "Wrong size on AthenaMarkerDetails_C_PreConstruct");
static_assert(offsetof(AthenaMarkerDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMarkerDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.UpdateMarkerAction
// 0x0001 (0x0001 - 0x0000)
struct AthenaMarkerDetails_C_UpdateMarkerAction final
{
public:
	EFortMarkerActions                            MarkerAction;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMarkerDetails_C_UpdateMarkerAction) == 0x000001, "Wrong alignment on AthenaMarkerDetails_C_UpdateMarkerAction");
static_assert(sizeof(AthenaMarkerDetails_C_UpdateMarkerAction) == 0x000001, "Wrong size on AthenaMarkerDetails_C_UpdateMarkerAction");
static_assert(offsetof(AthenaMarkerDetails_C_UpdateMarkerAction, MarkerAction) == 0x000000, "Member 'AthenaMarkerDetails_C_UpdateMarkerAction::MarkerAction' has a wrong offset!");

// Function AthenaMarkerDetails.AthenaMarkerDetails_C.ExecuteUbergraph_AthenaMarkerDetails
// 0x0428 (0x0428 - 0x0000)
struct AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0018)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479C[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMarkedItemDetails_DisplayName;         // 0x0078(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMarkedItemDetails_SmallPreviewImage;   // 0x0090(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMarkedItemDetails_RarityColor;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479D[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMarkedItemDetails_DisplayName_1;       // 0x00E8(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMarkedItemDetails_SmallPreviewImage_1; // 0x0100(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMarkedItemDetails_RarityColor_1;       // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479E[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479F[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A0[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMarkedItemDetails_DisplayName_2;       // 0x0168(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMarkedItemDetails_SmallPreviewImage_2; // 0x0180(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMarkedItemDetails_RarityColor_2;       // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_2;                 // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A1[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x01DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A2[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWorldMarkerData                   K2Node_Event_MarkerData;                           // 0x0208(0x0100)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A3[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A4[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMarkedItemDetails_DisplayName_3;       // 0x0328(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMarkedItemDetails_SmallPreviewImage_3; // 0x0340(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMarkedItemDetails_RarityColor_3;       // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            Temp_byte_Variable_4;                              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A5[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMarkedItemDetails_DisplayName_4;       // 0x0380(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMarkedItemDetails_SmallPreviewImage_4; // 0x0398(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMarkedItemDetails_RarityColor_4;       // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMarkerActions                            K2Node_Event_MarkerAction;                         // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A6[0x3];                                     // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A7[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0400(0x0018)()
	class UObject*                                Temp_object_Variable;                              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails) == 0x000008, "Wrong alignment on AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails");
static_assert(sizeof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails) == 0x000428, "Wrong size on AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, EntryPoint) == 0x000000, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'AthenaMarkerDetails_C_ExecuteUbergraph_AthenaMarkerDetails::K2Node_CustomEvent_Loaded' has a wrong offset!");
