#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFrontend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "S12_CineTransitionData_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaFrontend.AthenaFrontend_C
// 0x0090 (0x0788 - 0x06F8)
class UAthenaFrontend_C final : public UAthenaUIStateWidget_Frontend
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaFPS_C*                           AthenaFPS;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTemperature_C*                   AthenaTemperature;                                 // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PTT;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortVoiceChannelSpeakerContainer_C*    FortVoiceChannelSpeakerContainer;                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PTT_Image;                                         // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Bottom;                                   // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxPTT;                                        // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          StartedPlayingVideo;                               // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7496[0x3];                                     // 0x0749(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TransitionIndex;                                   // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS12_CineTransitionData>        TransitionAudioData;                               // 0x0750(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           MovieMediaPlayer;                                  // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransitionSound01;                                 // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransitionSound02;                                 // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTimerHandle>                   AudioTimerHandles;                                 // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnTrailerMediaEnded();
	void OnTrailerMediaOpened(const class FString& OpenedUrl);
	void OnTrailerTransitionAudioCheck();
	void PlayTrailer();
	void InitChatVisibilityButton();
	void UpdatePttVisibility(EPTTState PTTState);
	void SetOverlayTitleBarVisibility(bool Visible);
	void SetChatWidgetVisibility(bool Visible);
	void BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void On_Can_PTT();
	void Construct();
	void BndEvt__Button_PTT_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSetFrontendVisibilityMode(EFrontendVisibilityMode InFrontendVisibilityMode);
	void StartTrailerTransitionAudioCheck(class UMediaPlayer* MediaPlayer);
	void StopTrailerTransitionAudioCheck();
	void ExecuteUbergraph_AthenaFrontend(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaFrontend_C">();
	}
	static class UAthenaFrontend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaFrontend_C>();
	}
};
static_assert(alignof(UAthenaFrontend_C) == 0x000008, "Wrong alignment on UAthenaFrontend_C");
static_assert(sizeof(UAthenaFrontend_C) == 0x000788, "Wrong size on UAthenaFrontend_C");
static_assert(offsetof(UAthenaFrontend_C, UberGraphFrame) == 0x0006F8, "Member 'UAthenaFrontend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AthenaFPS) == 0x000700, "Member 'UAthenaFrontend_C::AthenaFPS' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AthenaTemperature) == 0x000708, "Member 'UAthenaFrontend_C::AthenaTemperature' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, BuildWatermark) == 0x000710, "Member 'UAthenaFrontend_C::BuildWatermark' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, Button_PTT) == 0x000718, "Member 'UAthenaFrontend_C::Button_PTT' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, FortVoiceChannelSpeakerContainer) == 0x000720, "Member 'UAthenaFrontend_C::FortVoiceChannelSpeakerContainer' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, PTT_Image) == 0x000728, "Member 'UAthenaFrontend_C::PTT_Image' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SafeZone_1) == 0x000730, "Member 'UAthenaFrontend_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SafeZone_Bottom) == 0x000738, "Member 'UAthenaFrontend_C::SafeZone_Bottom' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, SizeBoxPTT) == 0x000740, "Member 'UAthenaFrontend_C::SizeBoxPTT' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, StartedPlayingVideo) == 0x000748, "Member 'UAthenaFrontend_C::StartedPlayingVideo' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionIndex) == 0x00074C, "Member 'UAthenaFrontend_C::TransitionIndex' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionAudioData) == 0x000750, "Member 'UAthenaFrontend_C::TransitionAudioData' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, MovieMediaPlayer) == 0x000760, "Member 'UAthenaFrontend_C::MovieMediaPlayer' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionSound01) == 0x000768, "Member 'UAthenaFrontend_C::TransitionSound01' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, TransitionSound02) == 0x000770, "Member 'UAthenaFrontend_C::TransitionSound02' has a wrong offset!");
static_assert(offsetof(UAthenaFrontend_C, AudioTimerHandles) == 0x000778, "Member 'UAthenaFrontend_C::AudioTimerHandles' has a wrong offset!");

}

