#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferPurchasedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C
// 0x0190 (0x0880 - 0x06F0)
class UAthenaDirectAcquisitionOfferPurchasedOverlay_C final : public UFortPurchaseOverlayModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessfullyRefundedBundleItem;                    // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Refunded;                                          // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item__Minus_FAST;               // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Successfully_Purchased___Bundle_Item_;             // 0x0710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__out_;                                 // 0x0718(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__loop_;                                // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item_;                          // 0x0728(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased_;                                        // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderItemNAme;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards1;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards2;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards3;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards4;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityFlare;                                  // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                ItemCard;                                          // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayMainItem;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMiniBundleItems;                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Bundle_Item_Index;                                 // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid_Minus_Column;                       // 0x0794(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid_Minus_Row;                          // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B5[0x4];                                     // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReceivedItemLootInfo              Fort_Received_Loot_Info_Struct;                    // 0x07A0(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBundleItemMiniCardWidget_C*>    Bundle_Mini_Item_Cards;                            // 0x0868(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          BundleBlurPlayed;                                  // 0x0878(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Mini_Bundle_Item_Location(int32 Param_Bundle_Item_Index, class UHorizontalBox** HBox_Row);
	void Bundle_Item_Anim_Speed(float* Speed);
	void Get_Bundle_Info_from_Item_Def(class UFortAccountItemDefinition* Item_Definition, struct FBundledItemInfo* Bundled_Item_Info, bool* bFoundItem);
	void HandleBack(bool* PassThrough);
	void UpdateFromOffer(class UFortAccountItemDefinition* Item_Definition);
	void WidgetAnimationEvt_Purchased__K2Node_WidgetAnimationEvent_0();
	void Show_Next_Item();
	void BundleBlurOut();
	void WidgetAnimationEvt_Purchased___Bundle_Item__K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Purchased___Bundle_Item__Minus_FAST_K2Node_WidgetAnimationEvent_1();
	void Populate_Bundle_MiniMinusCards();
	void Show_Bundle_Mini_Item_Card();
	void WidgetAnimationEvt_Refunded_K2Node_WidgetAnimationEvent_3();
	void InitBundleLayout();
	void OnOfferSet();
	void Destruct();
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferPurchasedOverlay_C">();
	}
	static class UAthenaDirectAcquisitionOfferPurchasedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferPurchasedOverlay_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x000880, "Wrong size on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, UberGraphFrame) == 0x0006F0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, SuccessfullyRefundedBundleItem) == 0x0006F8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::SuccessfullyRefundedBundleItem' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Refunded) == 0x000700, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Refunded' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item__Minus_FAST) == 0x000708, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item__Minus_FAST' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Successfully_Purchased___Bundle_Item_) == 0x000710, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Successfully_Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__out_) == 0x000718, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__out_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__loop_) == 0x000720, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__loop_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item_) == 0x000728, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased_) == 0x000730, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BorderItemNAme) == 0x000738, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BorderItemNAme' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards1) == 0x000740, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards2) == 0x000748, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards3) == 0x000750, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards3' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards4) == 0x000758, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards4' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ImageRarityFlare) == 0x000760, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ImageRarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ItemCard) == 0x000768, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, OverlayMainItem) == 0x000770, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::OverlayMainItem' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, RarityGlow) == 0x000778, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, SizeBoxMiniBundleItems) == 0x000780, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::SizeBoxMiniBundleItems' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, TextName) == 0x000788, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Item_Index) == 0x000790, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Item_Index' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid_Minus_Column) == 0x000794, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid_Minus_Column' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid_Minus_Row) == 0x000798, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid_Minus_Row' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Fort_Received_Loot_Info_Struct) == 0x0007A0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Fort_Received_Loot_Info_Struct' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Mini_Item_Cards) == 0x000868, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Mini_Item_Cards' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleBlurPlayed) == 0x000878, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleBlurPlayed' has a wrong offset!");

}

