#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"
#include "AthenaDragDropAction_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.ExecuteUbergraph_AthenaInventoryPanel
// 0x0390 (0x0390 - 0x0000)
struct AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7922[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_Item;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleClose_PassThrough;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7923[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId_1;                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7924[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTopBarTabButton_C*                     K2Node_DynamicCast_AsTop_Bar_Tab_Button;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7925[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0040(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryDragDrop_C*             K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7926[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingMinigame_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleClose_PassThrough_1;                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuickBars                                K2Node_CustomEvent_QuickbarIndex;                  // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7927[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_ChangedSlots;                   // 0x00E8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7928[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7929[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolumeManager*                     CallFunc_GetVolumeManager_OutVolumeManager;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVolumeValidityResult                         CallFunc_GetVolumeManager_OutIsValid;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           K2Node_CustomEvent_Client_1;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            K2Node_CustomEvent_Volume_1;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          CallFunc_GetMinigameForVolume_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792A[0x2];                                     // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* Client, class AFortVolume* Volume)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_792B[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Client;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            K2Node_CustomEvent_Volume;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          CallFunc_GetMinigameForVolume_ReturnValue_1;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792C[0x2];                                     // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* Client, class AFortVolume* Volume)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792D[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            CallFunc_GetVolumeForPlayerState_ReturnValue;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_792E[0x1];                                     // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792F[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HandleDirectCloseFromPlaceNow_PassThrough; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7930[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleLabModePlaylist_ReturnValue;      // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7931[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetMyIslandWidget_ReturnValue;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetMyIslandWidget_ReturnValue_1;          // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface; // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7932[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_1; // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7933[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_2; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7934[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetMyIslandWidget_ReturnValue_2;          // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_3; // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7935[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCreativeInventoryWidget_ReturnValue;   // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_4; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7936[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCreativeInventoryWidget_ReturnValue_1; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_5; // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7937[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_6; // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7938[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryContext*                CallFunc_GetContext_ReturnValue_2;                 // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TabIndex;                             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7939[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_793A[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0324(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_793B[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_793C[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcherSlot*                    CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue;     // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryContext*                CallFunc_GetContext_ReturnValue_3;                 // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_3;                           // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EFortQuickBars QuickbarIndex, TArray<int32>& ChangedSlots)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel");
static_assert(sizeof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel) == 0x000390, "Wrong size on AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, EntryPoint) == 0x000000, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_Item) == 0x000008, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_HandleClose_PassThrough) == 0x000010, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_HandleClose_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetType_ReturnValue) == 0x000011, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_ComponentBoundEvent_TabId_1) == 0x000014, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_ComponentBoundEvent_TabId_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_ComponentBoundEvent_TabId) == 0x00001C, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_ComponentBoundEvent_TabButton) == 0x000028, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsTop_Bar_Tab_Button) == 0x000030, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsTop_Bar_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_PointerEvent) == 0x000040, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_Operation) == 0x0000B0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop) == 0x0000B8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000C8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000D0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000D8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsPlayingMinigame_ReturnValue) == 0x0000E1, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsPlayingMinigame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_HandleClose_PassThrough_1) == 0x0000E2, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_HandleClose_PassThrough_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_QuickbarIndex) == 0x0000E3, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_ChangedSlots) == 0x0000E8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_ChangedSlots' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue) == 0x0000F8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000100, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000104, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetVolumeManager_OutVolumeManager) == 0x000118, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetVolumeManager_OutVolumeManager' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetVolumeManager_OutIsValid) == 0x000120, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetVolumeManager_OutIsValid' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000121, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue) == 0x000122, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_bool_Variable) == 0x000123, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_int_Variable) == 0x000124, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_Client_1) == 0x000128, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_Client_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_Volume_1) == 0x000130, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_Volume_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetMinigameForVolume_ReturnValue) == 0x000138, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetMinigameForVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_2) == 0x000141, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000144, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_Client) == 0x000158, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_Client' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CustomEvent_Volume) == 0x000160, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CustomEvent_Volume' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetMinigameForVolume_ReturnValue_1) == 0x000168, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetMinigameForVolume_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_3) == 0x000170, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_4) == 0x000171, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000174, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_int_Variable_1) == 0x000184, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000188, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_3) == 0x000190, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_5) == 0x0001A0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001A8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetVolumeForPlayerState_ReturnValue) == 0x0001B0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetVolumeForPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_6) == 0x0001B8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_byte_Variable) == 0x0001B9, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_byte_Variable_1) == 0x0001BA, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001BC, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001CC, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_bool_Variable_1) == 0x0001DC, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001E0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001F0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_HandleDirectCloseFromPlaceNow_PassThrough) == 0x000200, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_HandleDirectCloseFromPlaceNow_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetGameState_ReturnValue) == 0x000208, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetActiveWidget_ReturnValue) == 0x000210, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000218, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000221, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsBattleLabModePlaylist_ReturnValue) == 0x000222, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsBattleLabModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_Not_PreBool_ReturnValue) == 0x000223, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000224, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000225, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_BooleanAND_ReturnValue) == 0x000226, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Select_Default) == 0x000227, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_IsValid_ReturnValue_7) == 0x000228, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetMyIslandWidget_ReturnValue) == 0x000230, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetMyIslandWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetMyIslandWidget_ReturnValue_1) == 0x000238, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetMyIslandWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface) == 0x000240, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_4) == 0x000250, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_1) == 0x000258, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_5) == 0x000268, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_2) == 0x000270, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_6) == 0x000280, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetMyIslandWidget_ReturnValue_2) == 0x000288, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetMyIslandWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_3) == 0x000290, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_7) == 0x0002A0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetCreativeInventoryWidget_ReturnValue) == 0x0002A8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetCreativeInventoryWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_4) == 0x0002B0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_8) == 0x0002C0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetCreativeInventoryWidget_ReturnValue_1) == 0x0002C8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetCreativeInventoryWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_5) == 0x0002D0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_5' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_9) == 0x0002E0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsCreative_Inventory_Interface_6) == 0x0002E8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsCreative_Inventory_Interface_6' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess_10) == 0x0002F8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue_1) == 0x000300, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue_2) == 0x000308, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_TabIndex) == 0x000310, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_TabIndex' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Select_Default_1) == 0x000318, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000320, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Select_Default_2) == 0x000324, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_ComponentBoundEvent_Button) == 0x000330, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_SelectTabByID_ReturnValue) == 0x000338, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue) == 0x000340, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue_3) == 0x000348, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_MakeStruct_Margin) == 0x000350, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_MakeStruct_Margin_1) == 0x000360, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Select_Default_3) == 0x000370, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate_8) == 0x000380, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaInventoryPanel_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.OnOpenInventoryTab
// 0x0004 (0x0004 - 0x0000)
struct AthenaInventoryPanel_C_OnOpenInventoryTab final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_OnOpenInventoryTab) == 0x000004, "Wrong alignment on AthenaInventoryPanel_C_OnOpenInventoryTab");
static_assert(sizeof(AthenaInventoryPanel_C_OnOpenInventoryTab) == 0x000004, "Wrong size on AthenaInventoryPanel_C_OnOpenInventoryTab");
static_assert(offsetof(AthenaInventoryPanel_C_OnOpenInventoryTab, TabIndex) == 0x000000, "Member 'AthenaInventoryPanel_C_OnOpenInventoryTab::TabIndex' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.OnClientExitVolume
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryPanel_C_OnClientExitVolume final
{
public:
	class APlayerState*                           Client;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_OnClientExitVolume) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_OnClientExitVolume");
static_assert(sizeof(AthenaInventoryPanel_C_OnClientExitVolume) == 0x000010, "Wrong size on AthenaInventoryPanel_C_OnClientExitVolume");
static_assert(offsetof(AthenaInventoryPanel_C_OnClientExitVolume, Client) == 0x000000, "Member 'AthenaInventoryPanel_C_OnClientExitVolume::Client' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_OnClientExitVolume, Volume) == 0x000008, "Member 'AthenaInventoryPanel_C_OnClientExitVolume::Volume' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.OnClientEnterVolume
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryPanel_C_OnClientEnterVolume final
{
public:
	class APlayerState*                           Client;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_OnClientEnterVolume) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_OnClientEnterVolume");
static_assert(sizeof(AthenaInventoryPanel_C_OnClientEnterVolume) == 0x000010, "Wrong size on AthenaInventoryPanel_C_OnClientEnterVolume");
static_assert(offsetof(AthenaInventoryPanel_C_OnClientEnterVolume, Client) == 0x000000, "Member 'AthenaInventoryPanel_C_OnClientEnterVolume::Client' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_OnClientEnterVolume, Volume) == 0x000008, "Member 'AthenaInventoryPanel_C_OnClientEnterVolume::Volume' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.OnQuickbarContentsChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaInventoryPanel_C_OnQuickbarContentsChanged final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_793D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ChangedSlots;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_OnQuickbarContentsChanged) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_OnQuickbarContentsChanged");
static_assert(sizeof(AthenaInventoryPanel_C_OnQuickbarContentsChanged) == 0x000018, "Wrong size on AthenaInventoryPanel_C_OnQuickbarContentsChanged");
static_assert(offsetof(AthenaInventoryPanel_C_OnQuickbarContentsChanged, QuickbarIndex) == 0x000000, "Member 'AthenaInventoryPanel_C_OnQuickbarContentsChanged::QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_OnQuickbarContentsChanged, ChangedSlots) == 0x000008, "Member 'AthenaInventoryPanel_C_OnQuickbarContentsChanged::ChangedSlots' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000004, "Wrong alignment on AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaInventoryPanel_C_BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
