#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLevelEffects

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaLevelEffects.AthenaLevelEffects_C.BP_HandleEffectsLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLevelEffects_C_BP_HandleEffectsLevelChanged final
{
public:
	int32                                         EffectsLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLevelEffects_C_BP_HandleEffectsLevelChanged) == 0x000004, "Wrong alignment on AthenaLevelEffects_C_BP_HandleEffectsLevelChanged");
static_assert(sizeof(AthenaLevelEffects_C_BP_HandleEffectsLevelChanged) == 0x000004, "Wrong size on AthenaLevelEffects_C_BP_HandleEffectsLevelChanged");
static_assert(offsetof(AthenaLevelEffects_C_BP_HandleEffectsLevelChanged, EffectsLevel) == 0x000000, "Member 'AthenaLevelEffects_C_BP_HandleEffectsLevelChanged::EffectsLevel' has a wrong offset!");

// Function AthenaLevelEffects.AthenaLevelEffects_C.ExecuteUbergraph_AthenaLevelEffects
// 0x001C (0x001C - 0x0000)
struct AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70CD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EffectsLevel;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects) == 0x000004, "Wrong alignment on AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects");
static_assert(sizeof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects) == 0x00001C, "Wrong size on AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, EntryPoint) == 0x000000, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable) == 0x000004, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_bool_Variable) == 0x000006, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable_2) == 0x000007, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable_3) == 0x000008, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_bool_Variable_1) == 0x000009, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable_4) == 0x00000A, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_byte_Variable_5) == 0x00000B, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, Temp_bool_Variable_2) == 0x00000C, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, K2Node_Event_EffectsLevel) == 0x000010, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::K2Node_Event_EffectsLevel' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000015, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, K2Node_Select_Default) == 0x000016, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, K2Node_Select_Default_1) == 0x000017, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000018, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects, K2Node_Select_Default_2) == 0x000019, "Member 'AthenaLevelEffects_C_ExecuteUbergraph_AthenaLevelEffects::K2Node_Select_Default_2' has a wrong offset!");

}

