#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEquipProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaEquipProgress.AthenaEquipProgress_C
// 0x0050 (0x02E8 - 0x0298)
class UAthenaEquipProgress_C final : public UFortHUDEquipProgressBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageTimer;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayTimer;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Root;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextTimeRemaining;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime;                                         // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Progress;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CueCount;                                          // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VerifyCueCountTimerHandle;                         // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ConsumableInProgress;                              // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ConsumableInProgress__DelegateSignature(bool IsConsumable);
	void ExecuteUbergraph_AthenaEquipProgress(int32 EntryPoint);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void HideSelf();
	void VerifyCueCountIsClear();
	void Destruct();
	void OnUIGameplayCue_Event_0(class FName CueName, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaEquipProgress_C">();
	}
	static class UAthenaEquipProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquipProgress_C>();
	}
};
static_assert(alignof(UAthenaEquipProgress_C) == 0x000008, "Wrong alignment on UAthenaEquipProgress_C");
static_assert(sizeof(UAthenaEquipProgress_C) == 0x0002E8, "Wrong size on UAthenaEquipProgress_C");
static_assert(offsetof(UAthenaEquipProgress_C, UberGraphFrame) == 0x000298, "Member 'UAthenaEquipProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, ImageTimer) == 0x0002A0, "Member 'UAthenaEquipProgress_C::ImageTimer' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, OverlayTimer) == 0x0002A8, "Member 'UAthenaEquipProgress_C::OverlayTimer' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, Root) == 0x0002B0, "Member 'UAthenaEquipProgress_C::Root' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, TextTimeRemaining) == 0x0002B8, "Member 'UAthenaEquipProgress_C::TextTimeRemaining' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, Duration) == 0x0002C0, "Member 'UAthenaEquipProgress_C::Duration' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, StartTime) == 0x0002C4, "Member 'UAthenaEquipProgress_C::StartTime' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, Progress) == 0x0002C8, "Member 'UAthenaEquipProgress_C::Progress' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, CueCount) == 0x0002CC, "Member 'UAthenaEquipProgress_C::CueCount' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, VerifyCueCountTimerHandle) == 0x0002D0, "Member 'UAthenaEquipProgress_C::VerifyCueCountTimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaEquipProgress_C, ConsumableInProgress) == 0x0002D8, "Member 'UAthenaEquipProgress_C::ConsumableInProgress' has a wrong offset!");

}

