#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPickupManager

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaPickupManager.AthenaPickupManager_C.UpdateWorldResourceWidgetsVisibility
// 0x0068 (0x0068 - 0x0000)
struct AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility final
{
public:
	class AFortPlayerController*                  FortPlayerController;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   FortGameStateAthena;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54BB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54BC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortResourceType>                     K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             CallFunc_Array_Get_Item;                           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWorldResourceWidgetVisible_ReturnValue; // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility) == 0x000008, "Wrong alignment on AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility");
static_assert(sizeof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility) == 0x000068, "Wrong size on AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, FortPlayerController) == 0x000000, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::FortPlayerController' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, FortGameStateAthena) == 0x000008, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::FortGameStateAthena' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000030, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000040, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, K2Node_MakeArray_Array) == 0x000050, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_Array_Get_Item) == 0x000064, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility, CallFunc_IsWorldResourceWidgetVisible_ReturnValue) == 0x000066, "Member 'AthenaPickupManager_C_UpdateWorldResourceWidgetsVisibility::CallFunc_IsWorldResourceWidgetVisible_ReturnValue' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.HandleSetWorldResourceWidgetVisibility
// 0x0038 (0x0038 - 0x0000)
struct AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility final
{
public:
	EFortResourceType                             ResourceType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54BD[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPackResource_C*                  SelectedPackResource;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54BE[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPackResource_C*                  Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaPackResource_C*                  Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             Temp_byte_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BF[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPackResource_C*                  K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility) == 0x000008, "Wrong alignment on AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility");
static_assert(sizeof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility) == 0x000038, "Wrong size on AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, ResourceType) == 0x000000, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::ResourceType' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, bVisible) == 0x000001, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::bVisible' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, SelectedPackResource) == 0x000008, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::SelectedPackResource' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_bool_Variable) == 0x000010, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_byte_Variable) == 0x000011, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_byte_Variable_1) == 0x000012, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, K2Node_Select_Default) == 0x000013, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_object_Variable) == 0x000018, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_object_Variable_1) == 0x000020, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, Temp_byte_Variable_2) == 0x000028, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility, K2Node_Select_Default_1) == 0x000030, "Member 'AthenaPickupManager_C_HandleSetWorldResourceWidgetVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.RefreshCounts
// 0x0020 (0x0020 - 0x0000)
struct AthenaPickupManager_C_RefreshCounts final
{
public:
	float                                         CurrentUpdateTime;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesRequireResourceUpdate_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54C1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaPickupManager_C_RefreshCounts) == 0x000008, "Wrong alignment on AthenaPickupManager_C_RefreshCounts");
static_assert(sizeof(AthenaPickupManager_C_RefreshCounts) == 0x000020, "Wrong size on AthenaPickupManager_C_RefreshCounts");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CurrentUpdateTime) == 0x000000, "Member 'AthenaPickupManager_C_RefreshCounts::CurrentUpdateTime' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_DoesRequireResourceUpdate_ReturnValue) == 0x000010, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_DoesRequireResourceUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000014, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_RefreshCounts, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'AthenaPickupManager_C_RefreshCounts::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.HandleWorldItemListChanged
// 0x0020 (0x0020 - 0x0000)
struct AthenaPickupManager_C_HandleWorldItemListChanged final
{
public:
	TArray<class UFortWorldItem*>                 ItemsAdded;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UFortWorldItem*>                 ItemsRemoved;                                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_HandleWorldItemListChanged) == 0x000008, "Wrong alignment on AthenaPickupManager_C_HandleWorldItemListChanged");
static_assert(sizeof(AthenaPickupManager_C_HandleWorldItemListChanged) == 0x000020, "Wrong size on AthenaPickupManager_C_HandleWorldItemListChanged");
static_assert(offsetof(AthenaPickupManager_C_HandleWorldItemListChanged, ItemsAdded) == 0x000000, "Member 'AthenaPickupManager_C_HandleWorldItemListChanged::ItemsAdded' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleWorldItemListChanged, ItemsRemoved) == 0x000010, "Member 'AthenaPickupManager_C_HandleWorldItemListChanged::ItemsRemoved' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.HandleItemPickup
// 0x0010 (0x0010 - 0x0000)
struct AthenaPickupManager_C_HandleItemPickup final
{
public:
	class UFortWorldItem*                         NewItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaPickupManager_C_HandleItemPickup) == 0x000008, "Wrong alignment on AthenaPickupManager_C_HandleItemPickup");
static_assert(sizeof(AthenaPickupManager_C_HandleItemPickup) == 0x000010, "Wrong size on AthenaPickupManager_C_HandleItemPickup");
static_assert(offsetof(AthenaPickupManager_C_HandleItemPickup, NewItem) == 0x000000, "Member 'AthenaPickupManager_C_HandleItemPickup::NewItem' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_HandleItemPickup, Count) == 0x000008, "Member 'AthenaPickupManager_C_HandleItemPickup::Count' has a wrong offset!");

// Function AthenaPickupManager.AthenaPickupManager_C.ExecuteUbergraph_AthenaPickupManager
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortWorldItem* NewItem, int32 Count)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54C2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortWorldItem*>                 K2Node_CustomEvent_ItemsAdded;                     // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UFortWorldItem*>                 K2Node_CustomEvent_ItemsRemoved;                   // 0x0028(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_2;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_3;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItem*                         K2Node_CustomEvent_NewItem;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Count;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C3[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue_4;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortResourceType ResourceType, bool bVisible)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager) == 0x000008, "Wrong alignment on AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager");
static_assert(sizeof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager) == 0x0000B0, "Wrong size on AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, EntryPoint) == 0x000000, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_ItemsAdded) == 0x000018, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_ItemsAdded' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_ItemsRemoved) == 0x000028, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_ItemsRemoved' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue) == 0x000058, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue_1) == 0x000060, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue_2) == 0x000068, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue_3) == 0x000080, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_NewItem) == 0x000088, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CustomEvent_Count) == 0x000090, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, CallFunc_GetContext_ReturnValue_4) == 0x000098, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A0, "Member 'AthenaPickupManager_C_ExecuteUbergraph_AthenaPickupManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

}

