#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockedStyleNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockedStyleNotification.AthenaLockedStyleNotification_C
// 0x0030 (0x02E8 - 0x02B8)
class UAthenaLockedStyleNotification_C final : public UAthenaCosmeticUnlockingInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DataUpdate;                                        // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ProgressInfo;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_StaticText;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_LockedInfo;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnUnlockingInfoSet(bool bShowProgression);
	void RequestUpdateAnim();
	void RequestIntroAnim();
	void RequestOutroAnim();
	void OutroFinished();
	void ExecuteUbergraph_AthenaLockedStyleNotification(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockedStyleNotification_C">();
	}
	static class UAthenaLockedStyleNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockedStyleNotification_C>();
	}
};
static_assert(alignof(UAthenaLockedStyleNotification_C) == 0x000008, "Wrong alignment on UAthenaLockedStyleNotification_C");
static_assert(sizeof(UAthenaLockedStyleNotification_C) == 0x0002E8, "Wrong size on UAthenaLockedStyleNotification_C");
static_assert(offsetof(UAthenaLockedStyleNotification_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaLockedStyleNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, DataUpdate) == 0x0002C0, "Member 'UAthenaLockedStyleNotification_C::DataUpdate' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, Intro) == 0x0002C8, "Member 'UAthenaLockedStyleNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, SizeBox_ProgressInfo) == 0x0002D0, "Member 'UAthenaLockedStyleNotification_C::SizeBox_ProgressInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, SizeBox_StaticText) == 0x0002D8, "Member 'UAthenaLockedStyleNotification_C::SizeBox_StaticText' has a wrong offset!");
static_assert(offsetof(UAthenaLockedStyleNotification_C, Switcher_LockedInfo) == 0x0002E0, "Member 'UAthenaLockedStyleNotification_C::Switcher_LockedInfo' has a wrong offset!");

}

