#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapPanel

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMapPanel.AthenaMapPanel_C
// 0x0138 (0x05C8 - 0x0490)
class UAthenaMapPanel_C final : public UAthenaMapPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGamePhaseWidget_C*               AthenaGamePhaseWidget;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaTeamCountWidget_C*               AthenaTeamCountWidget;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Bacchus_MapInfo;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                BacchusSpacer;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_2;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_GameInfo;                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderQuestBacking;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          Button_MobileInspect;                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeMinigameInfoMapPanelWidget_C*  CreativeMinigameInfoMapPanelWidget;                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Extension_Box;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GameInfoBox;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GameModeInfo;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_Challenge;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_PlaceRemoveMarker;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_MobileButtons;                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_MobileClosebutton;                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         MobileCloseBUtton;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MobileCloseOverlay;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_GameInfo;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_PanelDisplay;                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlaceMarker;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlaceRemoveMarker;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RemoveMarker;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    ToggleMapCursorAction;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidget*                ZoomDesktop;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ScoreboardClassPtr;                                // 0x0570(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   PlaceMarker;                                       // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RemoveMarker;                                      // 0x05B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateDisplayShowAllBtn(ECommonInputType InputMethode);
	void On_Activated_or_Deactivated(bool bActivating);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void Add_Extension_Widget(class UUserWidget* New_Widget);
	void SetDisplayedWidget();
	void Clear_Touches();
	void OnLoaded_2A6416D349E44531654BBCB6287CB1A5(class UClass* Loaded);
	void Construct();
	void FlashPlayerIcon();
	void LoadScoreboardWidget();
	void OnChangeViewMode(bool bChallengesFocusedMode);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void HandleInputMethodChanged(ECommonInputType InputType);
	void OnInspectChallengesToggled(bool bEnabled);
	void UpdateInspectText(const class FText& InText);
	void BndEvt__Button_MobileInspect_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_HandleMapCursorToggled(bool bShowingMapCursor);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_AthenaMapPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMapPanel_C">();
	}
	static class UAthenaMapPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapPanel_C>();
	}
};
static_assert(alignof(UAthenaMapPanel_C) == 0x000008, "Wrong alignment on UAthenaMapPanel_C");
static_assert(sizeof(UAthenaMapPanel_C) == 0x0005C8, "Wrong size on UAthenaMapPanel_C");
static_assert(offsetof(UAthenaMapPanel_C, UberGraphFrame) == 0x000490, "Member 'UAthenaMapPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, AthenaGamePhaseWidget) == 0x000498, "Member 'UAthenaMapPanel_C::AthenaGamePhaseWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, AthenaTeamCountWidget) == 0x0004A0, "Member 'UAthenaMapPanel_C::AthenaTeamCountWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Bacchus_MapInfo) == 0x0004A8, "Member 'UAthenaMapPanel_C::Bacchus_MapInfo' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, BacchusSpacer) == 0x0004B0, "Member 'UAthenaMapPanel_C::BacchusSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, BackgroundBlur_2) == 0x0004B8, "Member 'UAthenaMapPanel_C::BackgroundBlur_2' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, BackgroundBlur_GameInfo) == 0x0004C0, "Member 'UAthenaMapPanel_C::BackgroundBlur_GameInfo' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Border_0) == 0x0004C8, "Member 'UAthenaMapPanel_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, BorderQuestBacking) == 0x0004D0, "Member 'UAthenaMapPanel_C::BorderQuestBacking' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Button_MobileInspect) == 0x0004D8, "Member 'UAthenaMapPanel_C::Button_MobileInspect' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, CreativeMinigameInfoMapPanelWidget) == 0x0004E0, "Member 'UAthenaMapPanel_C::CreativeMinigameInfoMapPanelWidget' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Extension_Box) == 0x0004E8, "Member 'UAthenaMapPanel_C::Extension_Box' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, GameInfoBox) == 0x0004F0, "Member 'UAthenaMapPanel_C::GameInfoBox' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, GameModeInfo) == 0x0004F8, "Member 'UAthenaMapPanel_C::GameModeInfo' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, GridPanel_Challenge) == 0x000500, "Member 'UAthenaMapPanel_C::GridPanel_Challenge' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, HBox_PlaceRemoveMarker) == 0x000508, "Member 'UAthenaMapPanel_C::HBox_PlaceRemoveMarker' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, HorizontalBox_MobileButtons) == 0x000510, "Member 'UAthenaMapPanel_C::HorizontalBox_MobileButtons' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, HorizontalBox_MobileClosebutton) == 0x000518, "Member 'UAthenaMapPanel_C::HorizontalBox_MobileClosebutton' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Image_2) == 0x000520, "Member 'UAthenaMapPanel_C::Image_2' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, MobileCloseBUtton) == 0x000528, "Member 'UAthenaMapPanel_C::MobileCloseBUtton' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, MobileCloseOverlay) == 0x000530, "Member 'UAthenaMapPanel_C::MobileCloseOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, ScaleBox_GameInfo) == 0x000538, "Member 'UAthenaMapPanel_C::ScaleBox_GameInfo' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Switcher_PanelDisplay) == 0x000540, "Member 'UAthenaMapPanel_C::Switcher_PanelDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Text_PlaceMarker) == 0x000548, "Member 'UAthenaMapPanel_C::Text_PlaceMarker' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Text_PlaceRemoveMarker) == 0x000550, "Member 'UAthenaMapPanel_C::Text_PlaceRemoveMarker' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, Text_RemoveMarker) == 0x000558, "Member 'UAthenaMapPanel_C::Text_RemoveMarker' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, ToggleMapCursorAction) == 0x000560, "Member 'UAthenaMapPanel_C::ToggleMapCursorAction' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, ZoomDesktop) == 0x000568, "Member 'UAthenaMapPanel_C::ZoomDesktop' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, ScoreboardClassPtr) == 0x000570, "Member 'UAthenaMapPanel_C::ScoreboardClassPtr' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, PlaceMarker) == 0x000598, "Member 'UAthenaMapPanel_C::PlaceMarker' has a wrong offset!");
static_assert(offsetof(UAthenaMapPanel_C, RemoveMarker) == 0x0005B0, "Member 'UAthenaMapPanel_C::RemoveMarker' has a wrong offset!");

}

