#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Athena_DamageStateParticles_structs.hpp"
#include "Athena_Prop_BurstReaction_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_BurstReaction_Exploding.Athena_Prop_BurstReaction_Exploding_C
// 0x01A8 (0x0DA8 - 0x0C00)
class AAthena_Prop_BurstReaction_Exploding_C : public AAthena_Prop_BurstReaction_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_BurstReaction_Exploding_C; // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PreExplosion_Scale_5BD61C87451A0F643D8AA1B1FA7C11DD; // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PreExplosion__Direction_5BD61C87451A0F643D8AA1B1FA7C11DD; // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78CA[0x3];                                     // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PreExplosion;                                      // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      OverlapObjectTypes;                                // 0x0C18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         DamageStateNotify;                                 // 0x0C28(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78CB[0x4];                                     // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAthena_DamageStateParticles>   DamageStateParticleSystems;                        // 0x0C30(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       SpawnedDamageStateEmitters;                        // 0x0C40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         KnockbackAmount;                                   // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackEffectRadius;                             // 0x0C54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentPlayerToLaunch;                             // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Explode;                                        // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ExplosionCUE;                                      // 0x0C68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthIsZero;                                      // 0x0C70(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldDieInstantly;                                // 0x0C71(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CC[0x6];                                     // 0x0C72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_MeleeDamage;                                    // 0x0C78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanGenerateResources;                              // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78CD[0x7];                                     // 0x0C99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Radius;                                            // 0x0CA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         KnockbackStrength;                                 // 0x0CC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FinalLaunchVel;                                    // 0x0CE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78CE[0x4];                                     // 0x0CEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinKnockbackAngle;                                 // 0x0CF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             PreExplodeSound;                                   // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SpawnRampCurve;                                    // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnFireThreshold;                                   // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FireCue;                                           // 0x0D24(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldDie;                                        // 0x0D2C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_78CF[0x3];                                     // 0x0D2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  LastDamageInstigator;                              // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         VehicleDamage;                                     // 0x0D38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleImpulseStrength;                            // 0x0D58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleImpulseStrengthZ;                           // 0x0D78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DestroyedByPickAxe;                                // 0x0D98(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D0[0x7];                                     // 0x0D99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FireInstigator;                                    // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ExplosionTrace();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ExplodeAndDie();
	void OnFireFx();
	void DeathFX();
	void GrowTimeline();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void DeactivateEmitter();
	void FireEffect(const struct FVector& HitLocation);
	void ReceiveBeginPlay();
	void PreExplosion__UpdateFunc();
	void PreExplosion__FinishedFunc();
	void OnRep_DamageStateNotify();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void OnRep_bShouldDie();
	void ExecuteFireApplicationInRadiusIfCurieEnabled(class AActor* Fire_Application_Target);

	bool BlueprintCanAttemptGenerateResources(const struct FGameplayTagContainer& InTags, class AController* InstigatorController) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_BurstReaction_Exploding_C">();
	}
	static class AAthena_Prop_BurstReaction_Exploding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_BurstReaction_Exploding_C>();
	}
};
static_assert(alignof(AAthena_Prop_BurstReaction_Exploding_C) == 0x000008, "Wrong alignment on AAthena_Prop_BurstReaction_Exploding_C");
static_assert(sizeof(AAthena_Prop_BurstReaction_Exploding_C) == 0x000DA8, "Wrong size on AAthena_Prop_BurstReaction_Exploding_C");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, UberGraphFrame_Athena_Prop_BurstReaction_Exploding_C) == 0x000C00, "Member 'AAthena_Prop_BurstReaction_Exploding_C::UberGraphFrame_Athena_Prop_BurstReaction_Exploding_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, PreExplosion_Scale_5BD61C87451A0F643D8AA1B1FA7C11DD) == 0x000C08, "Member 'AAthena_Prop_BurstReaction_Exploding_C::PreExplosion_Scale_5BD61C87451A0F643D8AA1B1FA7C11DD' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, PreExplosion__Direction_5BD61C87451A0F643D8AA1B1FA7C11DD) == 0x000C0C, "Member 'AAthena_Prop_BurstReaction_Exploding_C::PreExplosion__Direction_5BD61C87451A0F643D8AA1B1FA7C11DD' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, PreExplosion) == 0x000C10, "Member 'AAthena_Prop_BurstReaction_Exploding_C::PreExplosion' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, OverlapObjectTypes) == 0x000C18, "Member 'AAthena_Prop_BurstReaction_Exploding_C::OverlapObjectTypes' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, DamageStateNotify) == 0x000C28, "Member 'AAthena_Prop_BurstReaction_Exploding_C::DamageStateNotify' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, DamageStateParticleSystems) == 0x000C30, "Member 'AAthena_Prop_BurstReaction_Exploding_C::DamageStateParticleSystems' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, SpawnedDamageStateEmitters) == 0x000C40, "Member 'AAthena_Prop_BurstReaction_Exploding_C::SpawnedDamageStateEmitters' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, KnockbackAmount) == 0x000C50, "Member 'AAthena_Prop_BurstReaction_Exploding_C::KnockbackAmount' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, KnockbackEffectRadius) == 0x000C54, "Member 'AAthena_Prop_BurstReaction_Exploding_C::KnockbackEffectRadius' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, CurrentPlayerToLaunch) == 0x000C58, "Member 'AAthena_Prop_BurstReaction_Exploding_C::CurrentPlayerToLaunch' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, GE_Explode) == 0x000C60, "Member 'AAthena_Prop_BurstReaction_Exploding_C::GE_Explode' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, ExplosionCUE) == 0x000C68, "Member 'AAthena_Prop_BurstReaction_Exploding_C::ExplosionCUE' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, HealthIsZero) == 0x000C70, "Member 'AAthena_Prop_BurstReaction_Exploding_C::HealthIsZero' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, ShouldDieInstantly) == 0x000C71, "Member 'AAthena_Prop_BurstReaction_Exploding_C::ShouldDieInstantly' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, TC_MeleeDamage) == 0x000C78, "Member 'AAthena_Prop_BurstReaction_Exploding_C::TC_MeleeDamage' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, CanGenerateResources) == 0x000C98, "Member 'AAthena_Prop_BurstReaction_Exploding_C::CanGenerateResources' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, Radius) == 0x000CA0, "Member 'AAthena_Prop_BurstReaction_Exploding_C::Radius' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, KnockbackStrength) == 0x000CC0, "Member 'AAthena_Prop_BurstReaction_Exploding_C::KnockbackStrength' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, FinalLaunchVel) == 0x000CE0, "Member 'AAthena_Prop_BurstReaction_Exploding_C::FinalLaunchVel' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, MinKnockbackAngle) == 0x000CF0, "Member 'AAthena_Prop_BurstReaction_Exploding_C::MinKnockbackAngle' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, PreExplodeSound) == 0x000D10, "Member 'AAthena_Prop_BurstReaction_Exploding_C::PreExplodeSound' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, SpawnRampCurve) == 0x000D18, "Member 'AAthena_Prop_BurstReaction_Exploding_C::SpawnRampCurve' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, OnFireThreshold) == 0x000D20, "Member 'AAthena_Prop_BurstReaction_Exploding_C::OnFireThreshold' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, FireCue) == 0x000D24, "Member 'AAthena_Prop_BurstReaction_Exploding_C::FireCue' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, bShouldDie) == 0x000D2C, "Member 'AAthena_Prop_BurstReaction_Exploding_C::bShouldDie' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, LastDamageInstigator) == 0x000D30, "Member 'AAthena_Prop_BurstReaction_Exploding_C::LastDamageInstigator' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, VehicleDamage) == 0x000D38, "Member 'AAthena_Prop_BurstReaction_Exploding_C::VehicleDamage' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, VehicleImpulseStrength) == 0x000D58, "Member 'AAthena_Prop_BurstReaction_Exploding_C::VehicleImpulseStrength' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, VehicleImpulseStrengthZ) == 0x000D78, "Member 'AAthena_Prop_BurstReaction_Exploding_C::VehicleImpulseStrengthZ' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, DestroyedByPickAxe) == 0x000D98, "Member 'AAthena_Prop_BurstReaction_Exploding_C::DestroyedByPickAxe' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_BurstReaction_Exploding_C, FireInstigator) == 0x000DA0, "Member 'AAthena_Prop_BurstReaction_Exploding_C::FireInstigator' has a wrong offset!");

}

