#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWinnerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaWinnerList.AthenaWinnerList_C
// 0x0090 (0x02F0 - 0x0260)
class UAthenaWinnerList_C final : public UAthenaWinnersList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_WinnersTitle;                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_WinnerListStyle;              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Winnerlist;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RichTextBlock_VerticalWinners;                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RichTextBlock_VerticalWinners_column2;             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RichTextBlock_VerticalWinners_column3;             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RichTextBlock_VerticalWinners_column4;             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RichTextBlock_VerticalWinners_column5;             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         WinnerListPosition;                                // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7625[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LocalWinnerList;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         OutputWinnerList;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsWinner;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7626[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonTextBlock*>               WinnerListTextBoxes;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         OnScreenDuration;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaWinnerList(int32 EntryPoint);
	void ClearList();
	void TimeoutDuration(float Duration);
	void UpdateWinnerList();
	void OnWinnersAnnounced(const struct FAthenaWinnerInfo& WinnerInfo);
	void Construct();
	void OnRep_isWinner();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaWinnerList_C">();
	}
	static class UAthenaWinnerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWinnerList_C>();
	}
};
static_assert(alignof(UAthenaWinnerList_C) == 0x000008, "Wrong alignment on UAthenaWinnerList_C");
static_assert(sizeof(UAthenaWinnerList_C) == 0x0002F0, "Wrong size on UAthenaWinnerList_C");
static_assert(offsetof(UAthenaWinnerList_C, UberGraphFrame) == 0x000260, "Member 'UAthenaWinnerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, CommonTextBlock_WinnersTitle) == 0x000268, "Member 'UAthenaWinnerList_C::CommonTextBlock_WinnersTitle' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, CommonWidgetSwitcher_WinnerListStyle) == 0x000270, "Member 'UAthenaWinnerList_C::CommonWidgetSwitcher_WinnerListStyle' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RetainerBox_Winnerlist) == 0x000278, "Member 'UAthenaWinnerList_C::RetainerBox_Winnerlist' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RichTextBlock_VerticalWinners) == 0x000280, "Member 'UAthenaWinnerList_C::RichTextBlock_VerticalWinners' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RichTextBlock_VerticalWinners_column2) == 0x000288, "Member 'UAthenaWinnerList_C::RichTextBlock_VerticalWinners_column2' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RichTextBlock_VerticalWinners_column3) == 0x000290, "Member 'UAthenaWinnerList_C::RichTextBlock_VerticalWinners_column3' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RichTextBlock_VerticalWinners_column4) == 0x000298, "Member 'UAthenaWinnerList_C::RichTextBlock_VerticalWinners_column4' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, RichTextBlock_VerticalWinners_column5) == 0x0002A0, "Member 'UAthenaWinnerList_C::RichTextBlock_VerticalWinners_column5' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, WinnerListPosition) == 0x0002A8, "Member 'UAthenaWinnerList_C::WinnerListPosition' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, LocalWinnerList) == 0x0002B0, "Member 'UAthenaWinnerList_C::LocalWinnerList' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, OutputWinnerList) == 0x0002C0, "Member 'UAthenaWinnerList_C::OutputWinnerList' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, IsWinner) == 0x0002D0, "Member 'UAthenaWinnerList_C::IsWinner' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, WinnerListTextBoxes) == 0x0002D8, "Member 'UAthenaWinnerList_C::WinnerListTextBoxes' has a wrong offset!");
static_assert(offsetof(UAthenaWinnerList_C, OnScreenDuration) == 0x0002E8, "Member 'UAthenaWinnerList_C::OnScreenDuration' has a wrong offset!");

}

