#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_PlayerController.Athena_PlayerController_C
// 0x00C0 (0x3930 - 0x3870)
class AAthena_PlayerController_C final : public AFortPlayerControllerAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3870(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnderwaterAudioComponent_C*            UnderwaterAudioComponent;                          // 0x3878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ListenerOverride;                                  // 0x3880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VictoryRoyaleAudio;                                // 0x3888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VictoryRoyaleMusic;                                // 0x3890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             VictoryRoyaleMenuMusicAsset;                       // 0x3898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BladeWielderTag;                                   // 0x38A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EFortItemType                                 InteractingItemType;                               // 0x38C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5192[0x7];                                     // 0x38C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InteractionTags;                                   // 0x38C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             PawnPossessedDispatcher;                           // 0x38E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           PermissionsRecheckTimerHandle;                     // 0x38F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LobbyMusicOnVictoryDelayTime;                      // 0x3900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5193[0x4];                                     // 0x3904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              CamUnderwaterSoundMix;                             // 0x3908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CamUnderwaterLoopSound;                            // 0x3910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CamUnderwaterAudio;                                // 0x3918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CamUnderwaterStartSound;                           // 0x3920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CamUnderwaterStopSound;                            // 0x3928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PawnPossessedDispatcher__DelegateSignature(class APawn* PossessedPawn);
	void ExecuteUbergraph_Athena_PlayerController(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Handle_Victory_Royale_Audio(bool Audio_Only);
	void K2_OnEnterVolume(class AFortVolume* Volume);
	void K2_OnLeaveVolume(class AFortVolume* Volume);
	void PlayWinEffects(class APawn* FinisherPawn, const class UFortWeaponItemDefinition* FinishingWeapon, EDeathCause DeathCause, bool bAudioOnly);
	void ReplicateRotationScaleReset();
	void ReactToPawnPossession(class APawn* PossessedPawn);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RemoveItem();
	void OnLocalInteraction(class AActor* ReceivingActor);
	void RevokeItem(TSoftObjectPtr<class UFortWorldItemDefinition> Item);
	void GrantItem(TSoftObjectPtr<class UFortWorldItemDefinition> Item);
	void OnMusicPackLoaded(const class UAthenaMusicPackItemDefinition* NewMusicPack);
	void Start_Victory_Royale_Music();
	void OnReady_B4409EAB4038578B1EBA9DB1586489B9(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnLoaded_F82CC70840156DFAFAF85EB0D93E5E2D(class UObject* Loaded);
	void UserConstructionScript();
	void LeftAllVolumes(bool* bLeftVolumes);
	void SetupPermissionRecheckTimer();
	bool Is_Creative_Mode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_PlayerController_C">();
	}
	static class AAthena_PlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_PlayerController_C>();
	}
};
static_assert(alignof(AAthena_PlayerController_C) == 0x000010, "Wrong alignment on AAthena_PlayerController_C");
static_assert(sizeof(AAthena_PlayerController_C) == 0x003930, "Wrong size on AAthena_PlayerController_C");
static_assert(offsetof(AAthena_PlayerController_C, UberGraphFrame) == 0x003870, "Member 'AAthena_PlayerController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, UnderwaterAudioComponent) == 0x003878, "Member 'AAthena_PlayerController_C::UnderwaterAudioComponent' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, ListenerOverride) == 0x003880, "Member 'AAthena_PlayerController_C::ListenerOverride' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, VictoryRoyaleAudio) == 0x003888, "Member 'AAthena_PlayerController_C::VictoryRoyaleAudio' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, VictoryRoyaleMusic) == 0x003890, "Member 'AAthena_PlayerController_C::VictoryRoyaleMusic' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, VictoryRoyaleMenuMusicAsset) == 0x003898, "Member 'AAthena_PlayerController_C::VictoryRoyaleMenuMusicAsset' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, BladeWielderTag) == 0x0038A0, "Member 'AAthena_PlayerController_C::BladeWielderTag' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, InteractingItemType) == 0x0038C0, "Member 'AAthena_PlayerController_C::InteractingItemType' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, InteractionTags) == 0x0038C8, "Member 'AAthena_PlayerController_C::InteractionTags' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, PawnPossessedDispatcher) == 0x0038E8, "Member 'AAthena_PlayerController_C::PawnPossessedDispatcher' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, PermissionsRecheckTimerHandle) == 0x0038F8, "Member 'AAthena_PlayerController_C::PermissionsRecheckTimerHandle' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, LobbyMusicOnVictoryDelayTime) == 0x003900, "Member 'AAthena_PlayerController_C::LobbyMusicOnVictoryDelayTime' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, CamUnderwaterSoundMix) == 0x003908, "Member 'AAthena_PlayerController_C::CamUnderwaterSoundMix' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, CamUnderwaterLoopSound) == 0x003910, "Member 'AAthena_PlayerController_C::CamUnderwaterLoopSound' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, CamUnderwaterAudio) == 0x003918, "Member 'AAthena_PlayerController_C::CamUnderwaterAudio' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, CamUnderwaterStartSound) == 0x003920, "Member 'AAthena_PlayerController_C::CamUnderwaterStartSound' has a wrong offset!");
static_assert(offsetof(AAthena_PlayerController_C, CamUnderwaterStopSound) == 0x003928, "Member 'AAthena_PlayerController_C::CamUnderwaterStopSound' has a wrong offset!");

}

