#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_Sandcastle_Trident

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AthenaQuest_BGA_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AthenaQuestActor_Sandcastle_Trident.AthenaQuestActor_Sandcastle_Trident_C
// 0x0028 (0x08E8 - 0x08C0)
class AAthenaQuestActor_Sandcastle_Trident_C final : public AAthenaQuest_BGA_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuestActor_Sandcastle_Trident_C; // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   InteractString;                                    // 0x08D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaQuestActor_Sandcastle_Trident(int32 EntryPoint);
	void OnObjectiveCompleteForPlayer(class UFortQuestObjectiveInfo* ObjectiveInfo, class AFortPlayerController* PCOverrideForVisualTesting);
	void OnQuestEnabledForPlayer(class AFortPlayerController* FortPlayerController);
	void SetPrimitiveGroupsToHide(TArray<class UPrimitiveComponent*>* Param_PrimitivesToHideByDefault, TArray<class UPrimitiveComponent*>* Param_PrimitivesToShowIfQuestComplete, TArray<class UPrimitiveComponent*>* Param_PrimitivesToShowIfQuestInProgress);

	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuestActor_Sandcastle_Trident_C">();
	}
	static class AAthenaQuestActor_Sandcastle_Trident_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaQuestActor_Sandcastle_Trident_C>();
	}
};
static_assert(alignof(AAthenaQuestActor_Sandcastle_Trident_C) == 0x000008, "Wrong alignment on AAthenaQuestActor_Sandcastle_Trident_C");
static_assert(sizeof(AAthenaQuestActor_Sandcastle_Trident_C) == 0x0008E8, "Wrong size on AAthenaQuestActor_Sandcastle_Trident_C");
static_assert(offsetof(AAthenaQuestActor_Sandcastle_Trident_C, UberGraphFrame_AthenaQuestActor_Sandcastle_Trident_C) == 0x0008C0, "Member 'AAthenaQuestActor_Sandcastle_Trident_C::UberGraphFrame_AthenaQuestActor_Sandcastle_Trident_C' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_Sandcastle_Trident_C, Mesh) == 0x0008C8, "Member 'AAthenaQuestActor_Sandcastle_Trident_C::Mesh' has a wrong offset!");
static_assert(offsetof(AAthenaQuestActor_Sandcastle_Trident_C, InteractString) == 0x0008D0, "Member 'AAthenaQuestActor_Sandcastle_Trident_C::InteractString' has a wrong offset!");

}

