#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMapNavigableIconStackOfChallenges

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMapNavigableIconStackOfChallenges.AthenaMapNavigableIconStackOfChallenges_C
// 0x0078 (0x0378 - 0x0300)
class UAthenaMapNavigableIconStackOfChallenges_C final : public UAthenaMapNavigableIconStackOfChallenges
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelectAnimMinusFromHover;                        // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlareMinusLoop;                                    // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnStartAnim;                                       // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnChangingStackIndexAnim;                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelectedAnim;                                    // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Stack_Count;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Bang;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_Flare;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ShadowFor3dMap;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               DefaultIcon;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChangingStackIndexBaseStateTime;                   // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnforceHideCount;                                 // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetAnywhereState(bool bIsAnytimeChallenge);
	void SetMaterialState(bool Complete, bool Locked, bool HasIconOverride);
	void OnChallengeSet(bool bIsComplete, bool bIsLocked, bool bHasIconOverride, float Progress, bool bShouldShowBang);
	void OnSetIsInGame(bool bIsInGame);
	void OnChangingStackIndexAnimFinished();
	void Destruct();
	void Construct();
	void OnChallengeReset();
	void OnBeginIntroAnimation();
	void OnSetHasLocation(bool bHasLocation);
	void OnChangedStackData(int32 NewStackCount, int32 NonCompletedCount);
	void OnChallengeIconOverriden(const class UTexture2D* Icon);
	void OnSelected(bool bUserInteraction);
	void OnUnselected(bool bUserInteraction);
	void OnHovered(bool bUserInteraction);
	void OnUnhovered(bool bUserInteraction);
	void OnChangeBangVisibility(bool bShouldShow);
	void ExecuteUbergraph_AthenaMapNavigableIconStackOfChallenges(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMapNavigableIconStackOfChallenges_C">();
	}
	static class UAthenaMapNavigableIconStackOfChallenges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapNavigableIconStackOfChallenges_C>();
	}
};
static_assert(alignof(UAthenaMapNavigableIconStackOfChallenges_C) == 0x000008, "Wrong alignment on UAthenaMapNavigableIconStackOfChallenges_C");
static_assert(sizeof(UAthenaMapNavigableIconStackOfChallenges_C) == 0x000378, "Wrong size on UAthenaMapNavigableIconStackOfChallenges_C");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, UberGraphFrame) == 0x000300, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnSelectAnimMinusFromHover) == 0x000308, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnSelectAnimMinusFromHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnHover) == 0x000310, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, FlareMinusLoop) == 0x000318, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::FlareMinusLoop' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnStartAnim) == 0x000320, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnStartAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnChangingStackIndexAnim) == 0x000328, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnChangingStackIndexAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, OnSelectedAnim) == 0x000330, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::OnSelectedAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, CommonText_Stack) == 0x000338, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::CommonText_Stack' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, CommonText_Stack_Count) == 0x000340, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::CommonText_Stack_Count' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Image_Bang) == 0x000348, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Image_Bang' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Image_Flare) == 0x000350, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Image_ShadowFor3dMap) == 0x000358, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Image_ShadowFor3dMap' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, Overlay_1) == 0x000360, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, DefaultIcon) == 0x000368, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::DefaultIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, ChangingStackIndexBaseStateTime) == 0x000370, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::ChangingStackIndexBaseStateTime' has a wrong offset!");
static_assert(offsetof(UAthenaMapNavigableIconStackOfChallenges_C, bEnforceHideCount) == 0x000374, "Member 'UAthenaMapNavigableIconStackOfChallenges_C::bEnforceHideCount' has a wrong offset!");

}

