#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_P1_Retrieve

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FF[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_Event_Player;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCompHiddenControllerOnly_ReturnValue_1; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6400[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6401[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0060(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6402[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedObjectiveWithName_ReturnValue; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedObjectiveWithName_ReturnValue_1; // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6403[0x1];                                     // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6404[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PC_1;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_ComponentBoundEvent_PlayerController;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6405[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_PC;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6406[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6407[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x0188(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6408[0x6];                                     // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6409[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve) == 0x0001C0, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_Event_InteractingPawn) == 0x000018, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_Event_InteractionBeingAttempted) == 0x000020, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000028, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_Event_Player) == 0x000030, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SetCompHiddenControllerOnly_ReturnValue) == 0x000038, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SetCompHiddenControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SetCompHiddenControllerOnly_ReturnValue_1) == 0x000039, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SetCompHiddenControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000040, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_OtherActor) == 0x000048, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_OtherComp) == 0x000050, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000058, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_bFromSweep) == 0x00005C, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_SweepResult) == 0x000060, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000EC, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0000F8, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000100, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000108, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000118, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetQuestManager_ReturnValue) == 0x000120, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_HasCompletedObjectiveWithName_ReturnValue) == 0x000128, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_HasCompletedObjectiveWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_IsPlaying_ReturnValue) == 0x000129, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_HasCompletedObjectiveWithName_ReturnValue_1) == 0x00012A, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_HasCompletedObjectiveWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, Temp_int_Loop_Counter_Variable) == 0x00012C, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetGameStateAthena_ReturnValue) == 0x000138, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_CustomEvent_PC_1) == 0x000140, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_CustomEvent_PC_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_ComponentBoundEvent_PlayerController) == 0x000148, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_ComponentBoundEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_CustomEvent_PC) == 0x000158, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_CustomEvent_PC' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000160, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000168, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x000170, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetQuestManager_ReturnValue_1) == 0x000180, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x000188, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000198, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000199, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x0001B0, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve, CallFunc_OnSameTeam_ReturnValue) == 0x0001B9, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ExecuteUbergraph_AthenaQuestActor_SW_P1_Retrieve::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.CompleteInteraction
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction) == 0x000008, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction, PC) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_CompleteInteraction::PC' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature) == 0x000008, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature, PlayerController) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__ConsolidatedQuest_K2Node_ComponentBoundEvent_5_SimpleQuestComponentDelegate__DelegateSignature::PlayerController' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.DispalyMessage
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage) == 0x000008, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage, PC) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_DispalyMessage::PC' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BndEvt__PlayerNearTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.HandleQuestComponentSuccessEvent
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent final
{
public:
	class AFortPlayerController*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent) == 0x000008, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent, Player) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_HandleQuestComponentSuccessEvent::Player' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract) == 0x000010, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie) == 0x000020, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie, Damage) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie, EventInstigator) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie, DamageCauser) == 0x000010, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie, ReturnValue) == 0x000018, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_ShouldDie::ReturnValue' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.RemoveAll
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll final
{
public:
	bool                                          ShouldRemoveActor;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll) == 0x000028, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, ShouldRemoveActor) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::ShouldRemoveActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000020, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000021, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x000022, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_RemoveAll::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640D[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

// Function AthenaQuestActor_SW_P1_Retrieve.AthenaQuestActor_SW_P1_Retrieve_C.BlueprintCanInteract
// 0x0038 (0x0038 - 0x0000)
struct AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640E[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective_1; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract");
static_assert(sizeof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract) == 0x000038, "Wrong size on AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'AthenaQuestActor_SW_P1_Retrieve_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
