#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaVariantTileButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaVariantTileButton.AthenaVariantTileButton_C.ExecuteUbergraph_AthenaVariantTileButton
// 0x0018 (0x0018 - 0x0000)
struct AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton) == 0x000008, "Wrong alignment on AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton");
static_assert(sizeof(AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton) == 0x000018, "Wrong size on AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton");
static_assert(offsetof(AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton, EntryPoint) == 0x000000, "Member 'AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton, K2Node_Event_ListItemObject) == 0x000010, "Member 'AthenaVariantTileButton_C_ExecuteUbergraph_AthenaVariantTileButton::K2Node_Event_ListItemObject' has a wrong offset!");

// Function AthenaVariantTileButton.AthenaVariantTileButton_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaVariantTileButton_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaVariantTileButton_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on AthenaVariantTileButton_C_OnListItemObjectSet");
static_assert(sizeof(AthenaVariantTileButton_C_OnListItemObjectSet) == 0x000008, "Wrong size on AthenaVariantTileButton_C_OnListItemObjectSet");
static_assert(offsetof(AthenaVariantTileButton_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'AthenaVariantTileButton_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

