#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuestActor_SW_Locate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.ExecuteUbergraph_AthenaQuestActor_SW_Locate
// 0x0248 (0x0248 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81FC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81FD[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81FE[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81FF[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x00B8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8200[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_PlayerWhoTriggeredObject;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8201[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0160(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_2; // 0x0190(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8202[0x2];                                     // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShouldShowLocally_ShouldShowLocally; // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8203[0x2];                                     // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8204[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_PC_1;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8205[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x01E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_CustomEvent_PC;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_3;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8206[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_HasQuest_PlayerHasQuest;           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8207[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8208[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate) == 0x000248, "Wrong size on AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, EntryPoint) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_PlaylistName) == 0x000010, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000038, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000048, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Array_Get_Item) == 0x000058, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetQuestManager_ReturnValue) == 0x000060, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_OverlappedComponent) == 0x000098, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_OtherActor) == 0x0000A0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_OtherComp) == 0x0000A8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_OtherBodyIndex) == 0x0000B0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_bFromSweep) == 0x0000B4, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_SweepResult) == 0x0000B8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_PlayerWhoTriggeredObject) == 0x000148, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_PlayerWhoTriggeredObject' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000150, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_IsValid_ReturnValue_1) == 0x000159, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000160, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetPlayerPawn_ReturnValue) == 0x000178, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000180, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, Temp_int_Loop_Counter_Variable) == 0x000188, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Add_IntInt_ReturnValue) == 0x00018C, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetLocalFortPlayerControllers_ReturnValue_2) == 0x000190, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetLocalFortPlayerControllers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Array_Get_Item_2) == 0x0001A0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved) == 0x0001A8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Athena_QuestObjectiveCounter_QuestCountAchieved' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired) == 0x0001AC, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Athena_QuestObjectiveCounter_QuestCountRequired' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned) == 0x0001B0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Athena_QuestObjectiveCounter_CountSuccessfullyReturned' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B1, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_HasAuthority_ReturnValue_1) == 0x0001C4, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_CheckShouldShowLocally_ShouldShowLocally) == 0x0001C5, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_CheckShouldShowLocally_ShouldShowLocally' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_PC_1) == 0x0001D0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_PC_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetGameStateAthena_ReturnValue) == 0x0001D8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x0001E8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_CustomEvent_PC) == 0x0001F8, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_CustomEvent_PC' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Array_Get_Item_3) == 0x000200, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000208, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_OnSameTeam_ReturnValue) == 0x000210, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut) == 0x000218, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_HasPlayerCompletedQuestObjective_PlayerControllerOut' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective) == 0x000220, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_HasPlayerCompletedQuestObjective_CompletedQuestObjective' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Athena_HasQuest_PlayerHasQuest) == 0x000221, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Athena_HasQuest_PlayerHasQuest' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000228, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_GetQuestManager_ReturnValue_1) == 0x000238, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000241, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000242, "Member 'AthenaQuestActor_SW_Locate_C_ExecuteUbergraph_AthenaQuestActor_SW_Locate::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.FoundEvent
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_FoundEvent final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_FoundEvent) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_FoundEvent");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_FoundEvent) == 0x000008, "Wrong size on AthenaQuestActor_SW_Locate_C_FoundEvent");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_FoundEvent, PC) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_FoundEvent::PC' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.DisplayMessage
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_DisplayMessage final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_DisplayMessage) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_DisplayMessage");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_DisplayMessage) == 0x000008, "Wrong size on AthenaQuestActor_SW_Locate_C_DisplayMessage");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_DisplayMessage, PC) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_DisplayMessage::PC' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.ObjectiveSuccessfullyCompleted
// 0x0008 (0x0008 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted final
{
public:
	class AActor*                                 PlayerWhoTriggeredObject;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted) == 0x000008, "Wrong size on AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted, PlayerWhoTriggeredObject) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_ObjectiveSuccessfullyCompleted::PlayerWhoTriggeredObject' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_PlaylistLoaded) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_PlaylistLoaded");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_PlaylistLoaded) == 0x000028, "Wrong size on AthenaQuestActor_SW_Locate_C_PlaylistLoaded");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'AthenaQuestActor_SW_Locate_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.TouchedQuestActor
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_TouchedQuestActor final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8209[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_TouchedQuestActor");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor) == 0x0000B0, "Wrong size on AthenaQuestActor_SW_Locate_C_TouchedQuestActor");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, OverlappedComponent) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, OtherActor) == 0x000008, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::OtherActor' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, OtherComp) == 0x000010, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::OtherComp' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, OtherBodyIndex) == 0x000018, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, bFromSweep) == 0x00001C, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::bFromSweep' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_TouchedQuestActor, SweepResult) == 0x000020, "Member 'AthenaQuestActor_SW_Locate_C_TouchedQuestActor::SweepResult' has a wrong offset!");

// Function AthenaQuestActor_SW_Locate.AthenaQuestActor_SW_Locate_C.CheckShouldShowLocally
// 0x0030 (0x0030 - 0x0000)
struct AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally final
{
public:
	bool                                          ShouldShowLocally;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_820A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally) == 0x000008, "Wrong alignment on AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally");
static_assert(sizeof(AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally) == 0x000030, "Wrong size on AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally, ShouldShowLocally) == 0x000000, "Member 'AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally::ShouldShowLocally' has a wrong offset!");
static_assert(offsetof(AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000008, "Member 'AthenaQuestActor_SW_Locate_C_CheckShouldShowLocally::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
