#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBroadcastKillFeedItem

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBroadcastKillFeedItem.AthenaBroadcastKillFeedItem_C
// 0x0028 (0x03A8 - 0x0380)
class UAthenaBroadcastKillFeedItem_C final : public UAthenaBroadcastKillFeedItemBase
{
public:
	class UWidgetAnimation*                       SlideUp;                                           // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideFadeOut;                                      // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideFadeIn;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortNumericTextBlock*                  InstigatorElims;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortNumericTextBlock*                  VictimElims;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBroadcastKillFeedItem_C">();
	}
	static class UAthenaBroadcastKillFeedItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastKillFeedItem_C>();
	}
};
static_assert(alignof(UAthenaBroadcastKillFeedItem_C) == 0x000008, "Wrong alignment on UAthenaBroadcastKillFeedItem_C");
static_assert(sizeof(UAthenaBroadcastKillFeedItem_C) == 0x0003A8, "Wrong size on UAthenaBroadcastKillFeedItem_C");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideUp) == 0x000380, "Member 'UAthenaBroadcastKillFeedItem_C::SlideUp' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideFadeOut) == 0x000388, "Member 'UAthenaBroadcastKillFeedItem_C::SlideFadeOut' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, SlideFadeIn) == 0x000390, "Member 'UAthenaBroadcastKillFeedItem_C::SlideFadeIn' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, InstigatorElims) == 0x000398, "Member 'UAthenaBroadcastKillFeedItem_C::InstigatorElims' has a wrong offset!");
static_assert(offsetof(UAthenaBroadcastKillFeedItem_C, VictimElims) == 0x0003A0, "Member 'UAthenaBroadcastKillFeedItem_C::VictimElims' has a wrong offset!");

}

