#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferPurchasedOverlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.Mini Bundle Item Location
// 0x0070 (0x0070 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location final
{
public:
	int32                                         Param_Bundle_Item_Index;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         HBox_Row;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Bundle_Item_Index__local_;                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue;            // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue_1;          // 0x0030(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51B8[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B9[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location) == 0x000070, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, Param_Bundle_Item_Index) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::Param_Bundle_Item_Index' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, HBox_Row) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::HBox_Row' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, Bundle_Item_Index__local_) == 0x000010, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::Bundle_Item_Index__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, Temp_int_Variable) == 0x000014, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, Temp_int_Variable_1) == 0x000018, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_GetPurchasedItems_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_GetPurchasedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_GetPurchasedItems_ReturnValue_1) == 0x000030, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_GetPurchasedItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000049, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_SelectFloat_ReturnValue) == 0x00004C, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_FMod_Remainder) == 0x000054, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, CallFunc_FMod_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, K2Node_Select_Default) == 0x000060, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location, K2Node_Select_Default_1) == 0x000068, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Mini_Bundle_Item_Location::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.Bundle Item Anim Speed
// 0x0028 (0x0028 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue;            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51BB[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed) == 0x000028, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, Speed) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::Speed' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_GetPurchasedItems_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_GetPurchasedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001D, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed, CallFunc_SelectFloat_ReturnValue_1) == 0x000024, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Bundle_Item_Anim_Speed::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.Get Bundle Info from Item Def
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def final
{
public:
	class UFortAccountItemDefinition*             Item_Definition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBundledItemInfo                       Bundled_Item_Info;                                 // 0x0008(0x0018)(Parm, OutParm)
	bool                                          bFoundItem;                                        // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51BC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             Item_Definition__local_;                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBundledItemInfo                       Bundled_Item_Info__local_;                         // 0x0030(0x0018)(Edit, BlueprintVisible)
	bool                                          bFoundItem__local_;                                // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51BD[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51BE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51BF[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBundledItemInfo>               CallFunc_GetDynamicBundleItems_Items;              // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FBundledItemInfo                       CallFunc_Array_Get_Item;                           // 0x0090(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C0[0x1];                                     // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def) == 0x0000B8, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Item_Definition) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Bundled_Item_Info) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Bundled_Item_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, bFoundItem) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::bFoundItem' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Item_Definition__local_) == 0x000028, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Item_Definition__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Bundled_Item_Info__local_) == 0x000030, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Bundled_Item_Info__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, bFoundItem__local_) == 0x000048, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::bFoundItem__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, Temp_bool_True_if_break_was_hit_Variable) == 0x000058, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_GetPersistentName_ReturnValue) == 0x000060, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_GetOfferInfo_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_GetDynamicBundleItems_Items) == 0x000080, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_GetDynamicBundleItems_Items' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Array_Get_Item) == 0x000090, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000AD, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_BooleanAND_ReturnValue) == 0x0000AE, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_Get_Bundle_Info_from_Item_Def::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_HandleBack::PassThrough' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.UpdateFromOffer
// 0x01A0 (0x01A0 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer final
{
public:
	class UFortAccountItemDefinition*             Item_Definition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Grant_Quantity__local_;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             Item_Definition__local_;                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C2[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0020(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBundledItemInfo                       CallFunc_Get_Bundle_Info_from_Item_Def_Bundled_Item_Info; // 0x00B0(0x0018)()
	bool                                          CallFunc_Get_Bundle_Info_from_Item_Def_bFoundItem; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C3[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00D0(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantityPurchased_ReturnValue;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMultipleItems_ReturnValue;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C4[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C5[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMultipleItems_ReturnValue_1;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C6[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C7[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemTypeText_ReturnValue;              // 0x0130(0x0018)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0148(0x0018)()
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C8[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGrantedItemQuantity_ReturnValue;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0170(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0188(0x0018)()
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer) == 0x0001A0, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, Item_Definition) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, Grant_Quantity__local_) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::Grant_Quantity__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, Item_Definition__local_) == 0x000010, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::Item_Definition__local_' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetRarity_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_BPGetRarityData_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_Get_Bundle_Info_from_Item_Def_Bundled_Item_Info) == 0x0000B0, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_Get_Bundle_Info_from_Item_Def_Bundled_Item_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_Get_Bundle_Info_from_Item_Def_bFoundItem) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_Get_Bundle_Info_from_Item_Def_bFoundItem' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetDisplayName_ReturnValue) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000E8, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue) == 0x0000F0, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000F8, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetQuantityPurchased_ReturnValue) == 0x000100, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetQuantityPurchased_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_HasMultipleItems_ReturnValue) == 0x000104, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_HasMultipleItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_Multiply_IntInt_ReturnValue) == 0x000108, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000110, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_HasMultipleItems_ReturnValue_1) == 0x000118, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_HasMultipleItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x000120, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, Temp_bool_Variable) == 0x000128, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetItemTypeText_ReturnValue) == 0x000130, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetName_ReturnValue) == 0x000148, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000160, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_TextIsEmpty_ReturnValue) == 0x000168, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_GetGrantedItemQuantity_ReturnValue) == 0x00016C, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_GetGrantedItemQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, K2Node_Select_Default) == 0x000170, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer, CallFunc_TextToUpper_ReturnValue) == 0x000188, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_UpdateFromOffer::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51C9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51CA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         CallFunc_Mini_Bundle_Item_Location_HBox_Row;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51CB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51CC[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetGrantedItemDefinition_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CD[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Bundle_Item_Anim_Speed_speed;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Bundle_Item_Anim_Speed_speed_1;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51CE[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Bundle_Item_Anim_Speed_speed_2;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51CF[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBundleItemMiniCardWidget_C*            CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D0[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D1[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBundleItemMiniCardWidget_C*            CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D2[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue;            // 0x00C8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastItem_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D3[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue_1;          // 0x00E0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D4[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             K2Node_DynamicCast_AsFort_Account_Item_Definition; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D5[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             CallFunc_GetPurchasedItems_ReturnValue_2;          // 0x0110(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FPurchasedItemInfo                     CallFunc_Array_Get_Item_1;                         // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D6[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             K2Node_DynamicCast_AsFort_Account_Item_Definition_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowAsRefund_ReturnValue;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D7[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowAsRefund_ReturnValue_1;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D8[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowAsRefund_ReturnValue_2;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D9[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMultipleItems_ReturnValue;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMultipleItems_ReturnValue_1;           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMultipleItems_ReturnValue_2;           // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMultipleItems_ReturnValue_3;           // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51DA[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             K2Node_Select_Default_3;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51DB[0x6];                                     // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51DC[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_5;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay) == 0x0001B8, "Wrong size on AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedOverlay_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay::EntryPoint' has a wrong offset!");
