#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_VehicleSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_VehicleSpawner.Athena_VehicleSpawner_C.ExecuteUbergraph_Athena_VehicleSpawner
// 0x01B0 (0x01B0 - 0x0000)
struct Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceSpawnAlways_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreAthenaVehiclesEnabled_ReturnValue;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_786D[0xA];                                     // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_786E[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameModeAthena*                    K2Node_DynamicCast_AsFort_Game_Mode_Athena;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_786F[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7870[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetVehicleClass_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7871[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetVehicleClassOverride_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7872[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7873[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7874[0xF];                                     // 0x0141(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default_1;                           // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7875[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner) == 0x000010, "Wrong alignment on Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner");
static_assert(sizeof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner) == 0x0001B0, "Wrong size on Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, EntryPoint) == 0x000000, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetForceSpawnAlways_ReturnValue) == 0x000004, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetForceSpawnAlways_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_AreAthenaVehiclesEnabled_ReturnValue) == 0x000005, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_AreAthenaVehiclesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetTransform_ReturnValue_1) == 0x000040, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetGameMode_ReturnValue) == 0x000070, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Variable) == 0x000078, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_AsFort_Game_Mode_Athena) == 0x000080, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_AsFort_Game_Mode_Athena' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000089, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000090, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000098, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x0000A0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetVehicleClass_ReturnValue) == 0x0000A8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetVehicleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_ClassDynamicCast_AsActor) == 0x0000B0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_ClassDynamicCast_bSuccess) == 0x0000B8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_GetVehicleClassOverride_ReturnValue) == 0x0000C0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_GetVehicleClassOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Option_B___If_false__use_Option_A_Variable) == 0x0000C8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Option_B___If_false__use_Option_A_Variable' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_IsValidClass_ReturnValue) == 0x0000C9, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_Select_Default) == 0x0000D0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_HasAuthority_ReturnValue) == 0x0000D8, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_ComposeTransforms_ReturnValue) == 0x000110, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, Temp_bool_Variable_1) == 0x000140, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_Select_Default_1) == 0x000150, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000188, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001A0, "Member 'Athena_VehicleSpawner_C_ExecuteUbergraph_Athena_VehicleSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

