#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberIndicator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.ExecuteUbergraph_AthenaTeamMemberIndicator
// 0x0090 (0x0090 - 0x0000)
struct AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDBNO;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsTalking;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7841[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerName;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	struct FLinearColor                           K2Node_Event_PinColor;                             // 0x0040(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7842[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7843[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_Event_PlayerStateAthena;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator");
static_assert(sizeof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator) == 0x000090, "Wrong size on AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, EntryPoint) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, Temp_byte_Variable) == 0x000004, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_bIsDBNO) == 0x000006, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_bIsDBNO' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_bIsTalking) == 0x000007, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_bIsTalking' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_PlayerName) == 0x000010, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_PlayerName' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000020, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_PinColor) == 0x000040, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_PinColor' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, Temp_bool_Variable) == 0x000078, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Select_Default) == 0x000079, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_MakeLiteralName_ReturnValue) == 0x00007C, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_PlayAnimationByName_ReturnValue) == 0x000084, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_PlayerStateAthena) == 0x000088, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_PlayerStateAthena' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.BP_OnHandlePlayerStateSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet final
{
public:
	class AFortPlayerStateAthena*                 PlayerStateAthena;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet");
static_assert(sizeof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet) == 0x000008, "Wrong size on AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet");
static_assert(offsetof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet, PlayerStateAthena) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_BP_OnHandlePlayerStateSet::PlayerStateAthena' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.BP_OnHandlePinColorChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged final
{
public:
	struct FLinearColor                           PinColor;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged) == 0x000004, "Wrong alignment on AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged");
static_assert(sizeof(AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged) == 0x000010, "Wrong size on AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged");
static_assert(offsetof(AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged, PinColor) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_BP_OnHandlePinColorChanged::PinColor' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.BP_OnHandlePlayerNameReplicated
// 0x0010 (0x0010 - 0x0000)
struct AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated final
{
public:
	class FString                                 Param_PlayerName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated");
static_assert(sizeof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated) == 0x000010, "Wrong size on AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated");
static_assert(offsetof(AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated, Param_PlayerName) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_BP_OnHandlePlayerNameReplicated::Param_PlayerName' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.BP_OnHandleTalkingStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged final
{
public:
	bool                                          bIsTalking;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged) == 0x000001, "Wrong alignment on AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged");
static_assert(sizeof(AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged) == 0x000001, "Wrong size on AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged");
static_assert(offsetof(AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged, bIsTalking) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_BP_OnHandleTalkingStateChanged::bIsTalking' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.BP_OnHandleDBNOStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged final
{
public:
	bool                                          bIsDBNO;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged) == 0x000001, "Wrong alignment on AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged");
static_assert(sizeof(AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged) == 0x000001, "Wrong size on AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged");
static_assert(offsetof(AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged, bIsDBNO) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_BP_OnHandleDBNOStateChanged::bIsDBNO' has a wrong offset!");

}

