#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStoreReward

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaStoreReward.AthenaStoreReward_C.GetItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaStoreReward_C_GetItem final
{
public:
	class UFortItem*                              Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStoreReward_C_GetItem) == 0x000008, "Wrong alignment on AthenaStoreReward_C_GetItem");
static_assert(sizeof(AthenaStoreReward_C_GetItem) == 0x000008, "Wrong size on AthenaStoreReward_C_GetItem");
static_assert(offsetof(AthenaStoreReward_C_GetItem, Result) == 0x000000, "Member 'AthenaStoreReward_C_GetItem::Result' has a wrong offset!");

// Function AthenaStoreReward.AthenaStoreReward_C.GetAthenaCosmeticItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct AthenaStoreReward_C_GetAthenaCosmeticItemDefinition final
{
public:
	class UAthenaCosmeticItemDefinition*          AsAthena_Cosmetic_Item_Definition;                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition) == 0x000008, "Wrong alignment on AthenaStoreReward_C_GetAthenaCosmeticItemDefinition");
static_assert(sizeof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition) == 0x000020, "Wrong size on AthenaStoreReward_C_GetAthenaCosmeticItemDefinition");
static_assert(offsetof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition, AsAthena_Cosmetic_Item_Definition) == 0x000000, "Member 'AthenaStoreReward_C_GetAthenaCosmeticItemDefinition::AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'AthenaStoreReward_C_GetAthenaCosmeticItemDefinition::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000010, "Member 'AthenaStoreReward_C_GetAthenaCosmeticItemDefinition::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetAthenaCosmeticItemDefinition, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaStoreReward_C_GetAthenaCosmeticItemDefinition::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaStoreReward.AthenaStoreReward_C.SetState
// 0x0014 (0x0014 - 0x0000)
struct AthenaStoreReward_C_SetState final
{
public:
	bool                                          Claimed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Locked;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LevelAchieved;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOwned;                                            // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStoreReward_C_SetState) == 0x000001, "Wrong alignment on AthenaStoreReward_C_SetState");
static_assert(sizeof(AthenaStoreReward_C_SetState) == 0x000014, "Wrong size on AthenaStoreReward_C_SetState");
static_assert(offsetof(AthenaStoreReward_C_SetState, Claimed) == 0x000000, "Member 'AthenaStoreReward_C_SetState::Claimed' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Locked) == 0x000001, "Member 'AthenaStoreReward_C_SetState::Locked' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, LevelAchieved) == 0x000002, "Member 'AthenaStoreReward_C_SetState::LevelAchieved' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, bOwned) == 0x000003, "Member 'AthenaStoreReward_C_SetState::bOwned' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_bool_Variable) == 0x000004, "Member 'AthenaStoreReward_C_SetState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable) == 0x000005, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_bool_Variable_1) == 0x000007, "Member 'AthenaStoreReward_C_SetState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, K2Node_Select_Default) == 0x000008, "Member 'AthenaStoreReward_C_SetState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_2) == 0x000009, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_3) == 0x00000A, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_bool_Variable_2) == 0x00000B, "Member 'AthenaStoreReward_C_SetState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, K2Node_Select_Default_1) == 0x00000C, "Member 'AthenaStoreReward_C_SetState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_4) == 0x00000D, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_5) == 0x00000E, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, K2Node_Select_Default_2) == 0x00000F, "Member 'AthenaStoreReward_C_SetState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_6) == 0x000010, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_byte_Variable_7) == 0x000011, "Member 'AthenaStoreReward_C_SetState::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, Temp_bool_Variable_3) == 0x000012, "Member 'AthenaStoreReward_C_SetState::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_SetState, K2Node_Select_Default_3) == 0x000013, "Member 'AthenaStoreReward_C_SetState::K2Node_Select_Default_3' has a wrong offset!");

// Function AthenaStoreReward.AthenaStoreReward_C.Setup
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaStoreReward_C_Setup final
{
public:
	class UFortItem*                              InItemToRepresent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Claimed;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Locked;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LevelAchieved;                                     // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOwned;                                            // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemCardSize                             ItemCardSize;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761D[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Quantity;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0030(0x0080)()
};
static_assert(alignof(AthenaStoreReward_C_Setup) == 0x000008, "Wrong alignment on AthenaStoreReward_C_Setup");
static_assert(sizeof(AthenaStoreReward_C_Setup) == 0x0000B0, "Wrong size on AthenaStoreReward_C_Setup");
static_assert(offsetof(AthenaStoreReward_C_Setup, InItemToRepresent) == 0x000000, "Member 'AthenaStoreReward_C_Setup::InItemToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, Claimed) == 0x000008, "Member 'AthenaStoreReward_C_Setup::Claimed' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, Locked) == 0x000009, "Member 'AthenaStoreReward_C_Setup::Locked' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, LevelAchieved) == 0x00000A, "Member 'AthenaStoreReward_C_Setup::LevelAchieved' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, bOwned) == 0x00000B, "Member 'AthenaStoreReward_C_Setup::bOwned' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, ItemCardSize) == 0x00000C, "Member 'AthenaStoreReward_C_Setup::ItemCardSize' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, Quantity) == 0x000010, "Member 'AthenaStoreReward_C_Setup::Quantity' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'AthenaStoreReward_C_Setup::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'AthenaStoreReward_C_Setup::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, CallFunc_GetRarity_ReturnValue) == 0x000028, "Member 'AthenaStoreReward_C_Setup::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_Setup, CallFunc_BPGetRarityData_ReturnValue) == 0x000030, "Member 'AthenaStoreReward_C_Setup::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");

// Function AthenaStoreReward.AthenaStoreReward_C.ExecuteUbergraph_AthenaStoreReward
// 0x0010 (0x0010 - 0x0000)
struct AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7620[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward) == 0x000008, "Wrong alignment on AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward");
static_assert(sizeof(AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward) == 0x000010, "Wrong size on AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward");
static_assert(offsetof(AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward, EntryPoint) == 0x000000, "Member 'AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaStoreReward_C_ExecuteUbergraph_AthenaStoreReward::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaStoreReward.AthenaStoreReward_C.GetTemporaryItems
// 0x0070 (0x0070 - 0x0000)
struct AthenaStoreReward_C_GetTemporaryItems final
{
public:
	TArray<struct FFortCosmeticVariantPreviewElement> Cosmetics;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UFortItem*>                      Temporary_Items;                                   // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class UFortItem*>                      TemporaryItems;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7621[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCosmeticVariantPreviewElement     CallFunc_Array_Get_Item;                           // 0x0040(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7622[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStoreReward_C_GetTemporaryItems) == 0x000008, "Wrong alignment on AthenaStoreReward_C_GetTemporaryItems");
static_assert(sizeof(AthenaStoreReward_C_GetTemporaryItems) == 0x000070, "Wrong size on AthenaStoreReward_C_GetTemporaryItems");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, Cosmetics) == 0x000000, "Member 'AthenaStoreReward_C_GetTemporaryItems::Cosmetics' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, Temporary_Items) == 0x000010, "Member 'AthenaStoreReward_C_GetTemporaryItems::Temporary_Items' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, TemporaryItems) == 0x000020, "Member 'AthenaStoreReward_C_GetTemporaryItems::TemporaryItems' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, Temp_int_Array_Index_Variable) == 0x000034, "Member 'AthenaStoreReward_C_GetTemporaryItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'AthenaStoreReward_C_GetTemporaryItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_Array_Get_Item) == 0x000040, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000060, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStoreReward_C_GetTemporaryItems, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'AthenaStoreReward_C_GetTemporaryItems::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

