#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStoreReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStoreReward.AthenaStoreReward_C
// 0x0070 (0x0C20 - 0x0BB0)
class UAthenaStoreReward_C final : public UFortAthenaReward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 baking;                                            // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BorderOwned;                                       // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClaimedImage;                                      // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedImage;                                       // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityFlare;                                       // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RevealOverlay;                                     // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnEarned_OverlayTint;                              // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnReveal;                                     // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetItem(class UFortItem** Result);
	void GetAthenaCosmeticItemDefinition(class UAthenaCosmeticItemDefinition** AsAthena_Cosmetic_Item_Definition);
	void EnableRarityFlare();
	void SetState(bool Claimed, bool Locked, bool LevelAchieved, bool bOwned);
	void Setup(class UFortItem* InItemToRepresent, bool Claimed, bool Locked, bool LevelAchieved, bool bOwned, EFortItemCardSize ItemCardSize, int32 Quantity);
	void PlayIntro();
	void ExecuteUbergraph_AthenaStoreReward(int32 EntryPoint);

	void GetTemporaryItems(TArray<struct FFortCosmeticVariantPreviewElement>& Cosmetics, TArray<class UFortItem*>* Temporary_Items) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStoreReward_C">();
	}
	static class UAthenaStoreReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStoreReward_C>();
	}
};
static_assert(alignof(UAthenaStoreReward_C) == 0x000008, "Wrong alignment on UAthenaStoreReward_C");
static_assert(sizeof(UAthenaStoreReward_C) == 0x000C20, "Wrong size on UAthenaStoreReward_C");
static_assert(offsetof(UAthenaStoreReward_C, UberGraphFrame) == 0x000BB0, "Member 'UAthenaStoreReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Fade) == 0x000BB8, "Member 'UAthenaStoreReward_C::Fade' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Intro) == 0x000BC0, "Member 'UAthenaStoreReward_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, baking) == 0x000BC8, "Member 'UAthenaStoreReward_C::baking' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, BorderOwned) == 0x000BD0, "Member 'UAthenaStoreReward_C::BorderOwned' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Check) == 0x000BD8, "Member 'UAthenaStoreReward_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, ClaimedImage) == 0x000BE0, "Member 'UAthenaStoreReward_C::ClaimedImage' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, LockedImage) == 0x000BE8, "Member 'UAthenaStoreReward_C::LockedImage' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, OwnedText) == 0x000BF0, "Member 'UAthenaStoreReward_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, RarityFlare) == 0x000BF8, "Member 'UAthenaStoreReward_C::RarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, RevealOverlay) == 0x000C00, "Member 'UAthenaStoreReward_C::RevealOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, UnEarned_OverlayTint) == 0x000C08, "Member 'UAthenaStoreReward_C::UnEarned_OverlayTint' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, StrongItemToRepresent) == 0x000C10, "Member 'UAthenaStoreReward_C::StrongItemToRepresent' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, SoundOnReveal) == 0x000C18, "Member 'UAthenaStoreReward_C::SoundOnReveal' has a wrong offset!");

}

