#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATV_Driver_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ATV_Driver_AnimBP.ATV_Driver_AnimBP_C.ExecuteUbergraph_ATV_Driver_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP) == 0x000004, "Wrong alignment on ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP");
static_assert(sizeof(ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP) == 0x000004, "Wrong size on ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP");
static_assert(offsetof(ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP, EntryPoint) == 0x000000, "Member 'ATV_Driver_AnimBP_C_ExecuteUbergraph_ATV_Driver_AnimBP::EntryPoint' has a wrong offset!");

// Function ATV_Driver_AnimBP.ATV_Driver_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ATV_Driver_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ATV_Driver_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ATV_Driver_AnimBP_C_AnimGraph");
static_assert(sizeof(ATV_Driver_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on ATV_Driver_AnimBP_C_AnimGraph");
static_assert(offsetof(ATV_Driver_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ATV_Driver_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

