#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoRunHUDWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AutoRunHUDWidget.AutoRunHUDWidget_C.OnAutoRunEnabled_Bind
// 0x0001 (0x0001 - 0x0000)
struct AutoRunHUDWidget_C_OnAutoRunEnabled_Bind final
{
public:
	bool                                          bAutoRunEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AutoRunHUDWidget_C_OnAutoRunEnabled_Bind) == 0x000001, "Wrong alignment on AutoRunHUDWidget_C_OnAutoRunEnabled_Bind");
static_assert(sizeof(AutoRunHUDWidget_C_OnAutoRunEnabled_Bind) == 0x000001, "Wrong size on AutoRunHUDWidget_C_OnAutoRunEnabled_Bind");
static_assert(offsetof(AutoRunHUDWidget_C_OnAutoRunEnabled_Bind, bAutoRunEnabled) == 0x000000, "Member 'AutoRunHUDWidget_C_OnAutoRunEnabled_Bind::bAutoRunEnabled' has a wrong offset!");

// Function AutoRunHUDWidget.AutoRunHUDWidget_C.ExecuteUbergraph_AutoRunHUDWidget
// 0x0060 (0x0060 - 0x0000)
struct AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA7[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA8[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bAutoRunEnabled)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bAutoRunEnabled;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EAA[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bAutoRunEnabled)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget) == 0x000008, "Wrong alignment on AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget");
static_assert(sizeof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget) == 0x000060, "Wrong size on AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, EntryPoint) == 0x000000, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, Temp_bool_Variable) == 0x000004, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, Temp_byte_Variable) == 0x000005, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, Temp_byte_Variable_1) == 0x000006, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000010, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x000028, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_CustomEvent_bAutoRunEnabled) == 0x000044, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_CustomEvent_bAutoRunEnabled' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget, K2Node_Select_Default) == 0x000058, "Member 'AutoRunHUDWidget_C_ExecuteUbergraph_AutoRunHUDWidget::K2Node_Select_Default' has a wrong offset!");

}

