#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_DangerGrape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_DangerGrape.B_Athena_DangerGrape_C
// 0x00F0 (0x0310 - 0x0220)
class AB_Athena_DangerGrape_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortAthenaAIBotCustomizationData*      BotDataDefault;                                    // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurveTableRowHandle                   DecoyLifetimeRow;                                  // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  BotPawn;                                           // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeashUpdateInterval;                               // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BB_Key_LeashLocation;                              // 0x0254(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BB_Key_Radius;                                     // 0x025C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6453[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LeashRadius;                                       // 0x0268(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   BB_Key_Destination;                                // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DistanceFromPlayerToMoveDecoy;                     // 0x0290(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_QuestAbsorbDamage;                               // 0x02B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortQuestItemDefinition*               Quest_Item;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Quest_Backend_Name;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6454[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  No_Starting_Weapons_Tag;                           // 0x02E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortAthenaAIBotCustomizationData*      BotDataNoStartingWeapons;                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Athena_DangerGrape(int32 EntryPoint);
	void PawnDamaged(class AActor* DamagedActor, float Param_Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void PawnDied(class AActor* DeadActor, float Param_Damage, class AFortPawn* InstigatedBy, const struct FVector& HitLocation, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void UpdateLeashLocation();
	void RemoveDecoy();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_DangerGrape_C">();
	}
	static class AB_Athena_DangerGrape_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_DangerGrape_C>();
	}
};
static_assert(alignof(AB_Athena_DangerGrape_C) == 0x000008, "Wrong alignment on AB_Athena_DangerGrape_C");
static_assert(sizeof(AB_Athena_DangerGrape_C) == 0x000310, "Wrong size on AB_Athena_DangerGrape_C");
static_assert(offsetof(AB_Athena_DangerGrape_C, UberGraphFrame) == 0x000220, "Member 'AB_Athena_DangerGrape_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, DefaultSceneRoot) == 0x000228, "Member 'AB_Athena_DangerGrape_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BotDataDefault) == 0x000230, "Member 'AB_Athena_DangerGrape_C::BotDataDefault' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, DecoyLifetimeRow) == 0x000238, "Member 'AB_Athena_DangerGrape_C::DecoyLifetimeRow' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BotPawn) == 0x000248, "Member 'AB_Athena_DangerGrape_C::BotPawn' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, LeashUpdateInterval) == 0x000250, "Member 'AB_Athena_DangerGrape_C::LeashUpdateInterval' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BB_Key_LeashLocation) == 0x000254, "Member 'AB_Athena_DangerGrape_C::BB_Key_LeashLocation' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BB_Key_Radius) == 0x00025C, "Member 'AB_Athena_DangerGrape_C::BB_Key_Radius' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, LeashRadius) == 0x000268, "Member 'AB_Athena_DangerGrape_C::LeashRadius' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BB_Key_Destination) == 0x000288, "Member 'AB_Athena_DangerGrape_C::BB_Key_Destination' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, DistanceFromPlayerToMoveDecoy) == 0x000290, "Member 'AB_Athena_DangerGrape_C::DistanceFromPlayerToMoveDecoy' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, T_QuestAbsorbDamage) == 0x0002B0, "Member 'AB_Athena_DangerGrape_C::T_QuestAbsorbDamage' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, Quest_Item) == 0x0002D0, "Member 'AB_Athena_DangerGrape_C::Quest_Item' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, Quest_Backend_Name) == 0x0002D8, "Member 'AB_Athena_DangerGrape_C::Quest_Backend_Name' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, Damage) == 0x0002E0, "Member 'AB_Athena_DangerGrape_C::Damage' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, No_Starting_Weapons_Tag) == 0x0002E8, "Member 'AB_Athena_DangerGrape_C::No_Starting_Weapons_Tag' has a wrong offset!");
static_assert(offsetof(AB_Athena_DangerGrape_C, BotDataNoStartingWeapons) == 0x000308, "Member 'AB_Athena_DangerGrape_C::BotDataNoStartingWeapons' has a wrong offset!");

}

