#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Wumba

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Wumba.B_Athena_Wumba_C.UpdateAnimInstanceVisuals
// 0x0018 (0x0018 - 0x0000)
struct B_Athena_Wumba_C_UpdateAnimInstanceVisuals final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWumba_Gadget_AnimBP_C*                 K2Node_DynamicCast_AsWumba_Gadget_Anim_BP;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_Wumba_C_UpdateAnimInstanceVisuals) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_UpdateAnimInstanceVisuals");
static_assert(sizeof(B_Athena_Wumba_C_UpdateAnimInstanceVisuals) == 0x000018, "Wrong size on B_Athena_Wumba_C_UpdateAnimInstanceVisuals");
static_assert(offsetof(B_Athena_Wumba_C_UpdateAnimInstanceVisuals, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'B_Athena_Wumba_C_UpdateAnimInstanceVisuals::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_UpdateAnimInstanceVisuals, K2Node_DynamicCast_AsWumba_Gadget_Anim_BP) == 0x000008, "Member 'B_Athena_Wumba_C_UpdateAnimInstanceVisuals::K2Node_DynamicCast_AsWumba_Gadget_Anim_BP' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_UpdateAnimInstanceVisuals, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_Athena_Wumba_C_UpdateAnimInstanceVisuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.SetUiVisibility
// 0x0028 (0x0028 - 0x0000)
struct B_Athena_Wumba_C_SetUiVisibility final
{
public:
	class UWidgetComponent*                       UITarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDetail;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowDistance;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C55[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUD_InteractionPoint_C*                K2Node_DynamicCast_AsHUD_Interaction_Point;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_Wumba_C_SetUiVisibility) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_SetUiVisibility");
static_assert(sizeof(B_Athena_Wumba_C_SetUiVisibility) == 0x000028, "Wrong size on B_Athena_Wumba_C_SetUiVisibility");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, UITarget) == 0x000000, "Member 'B_Athena_Wumba_C_SetUiVisibility::UITarget' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, ShowDetail) == 0x000008, "Member 'B_Athena_Wumba_C_SetUiVisibility::ShowDetail' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, ShowDistance) == 0x000009, "Member 'B_Athena_Wumba_C_SetUiVisibility::ShowDistance' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000010, "Member 'B_Athena_Wumba_C_SetUiVisibility::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, K2Node_DynamicCast_AsHUD_Interaction_Point) == 0x000018, "Member 'B_Athena_Wumba_C_SetUiVisibility::K2Node_DynamicCast_AsHUD_Interaction_Point' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_Athena_Wumba_C_SetUiVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_SetUiVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'B_Athena_Wumba_C_SetUiVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.SetLightColor
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Wumba_C_SetLightColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_SetLightColor) == 0x000004, "Wrong alignment on B_Athena_Wumba_C_SetLightColor");
static_assert(sizeof(B_Athena_Wumba_C_SetLightColor) == 0x000010, "Wrong size on B_Athena_Wumba_C_SetLightColor");
static_assert(offsetof(B_Athena_Wumba_C_SetLightColor, NewColor) == 0x000000, "Member 'B_Athena_Wumba_C_SetLightColor::NewColor' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.SetRarityColors
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Wumba_C_SetRarityColors final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_SetRarityColors) == 0x000004, "Wrong alignment on B_Athena_Wumba_C_SetRarityColors");
static_assert(sizeof(B_Athena_Wumba_C_SetRarityColors) == 0x000010, "Wrong size on B_Athena_Wumba_C_SetRarityColors");
static_assert(offsetof(B_Athena_Wumba_C_SetRarityColors, Color) == 0x000000, "Member 'B_Athena_Wumba_C_SetRarityColors::Color' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.OnReady_524B43EB45254EC3646C7D81A1AA3359
// 0x0030 (0x0030 - 0x0000)
struct B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359");
static_assert(sizeof(B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359) == 0x000030, "Wrong size on B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359");
static_assert(offsetof(B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359, GameState) == 0x000000, "Member 'B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359::GameState' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359, Playlist) == 0x000008, "Member 'B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359::Playlist' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359, PlaylistContextTags) == 0x000010, "Member 'B_Athena_Wumba_C_OnReady_524B43EB45254EC3646C7D81A1AA3359::PlaylistContextTags' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.PlayUpgradeSuccess
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Wumba_C_PlayUpgradeSuccess final
{
public:
	struct FVector                                Color;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Param_Index;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_PlayUpgradeSuccess) == 0x000004, "Wrong alignment on B_Athena_Wumba_C_PlayUpgradeSuccess");
static_assert(sizeof(B_Athena_Wumba_C_PlayUpgradeSuccess) == 0x000010, "Wrong size on B_Athena_Wumba_C_PlayUpgradeSuccess");
static_assert(offsetof(B_Athena_Wumba_C_PlayUpgradeSuccess, Color) == 0x000000, "Member 'B_Athena_Wumba_C_PlayUpgradeSuccess::Color' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_PlayUpgradeSuccess, Param_Index) == 0x00000C, "Member 'B_Athena_Wumba_C_PlayUpgradeSuccess::Param_Index' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_PlayUpgradeSuccess, InteractionBeingAttempted) == 0x00000D, "Member 'B_Athena_Wumba_C_PlayUpgradeSuccess::InteractionBeingAttempted' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BlueprintOnBeginInteract
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Wumba_C_BlueprintOnBeginInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_BlueprintOnBeginInteract) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BlueprintOnBeginInteract");
static_assert(sizeof(B_Athena_Wumba_C_BlueprintOnBeginInteract) == 0x000010, "Wrong size on B_Athena_Wumba_C_BlueprintOnBeginInteract");
static_assert(offsetof(B_Athena_Wumba_C_BlueprintOnBeginInteract, InteractingPawn) == 0x000000, "Member 'B_Athena_Wumba_C_BlueprintOnBeginInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BlueprintOnBeginInteract, InteractionBeingAttempted) == 0x000008, "Member 'B_Athena_Wumba_C_BlueprintOnBeginInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BlueprintOnBeginInteract, InteractionType) == 0x000009, "Member 'B_Athena_Wumba_C_BlueprintOnBeginInteract::InteractionType' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_Wumba_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BlueprintOnInteract");
static_assert(sizeof(B_Athena_Wumba_C_BlueprintOnInteract) == 0x000010, "Wrong size on B_Athena_Wumba_C_BlueprintOnInteract");
static_assert(offsetof(B_Athena_Wumba_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'B_Athena_Wumba_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'B_Athena_Wumba_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct B_Athena_Wumba_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C56[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_Athena_Wumba_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_OnDeathPlayEffects");
static_assert(sizeof(B_Athena_Wumba_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on B_Athena_Wumba_C_OnDeathPlayEffects");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'B_Athena_Wumba_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.OnDamagePlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct B_Athena_Wumba_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C57[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_Athena_Wumba_C_OnDamagePlayEffects) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_OnDamagePlayEffects");
static_assert(sizeof(B_Athena_Wumba_C_OnDamagePlayEffects) == 0x0000E8, "Wrong size on B_Athena_Wumba_C_OnDamagePlayEffects");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, DamageTags) == 0x000008, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, Momentum) == 0x000028, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, HitInfo) == 0x000034, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, InstigatedBy) == 0x0000C0, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, DamageCauser) == 0x0000C8, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDamagePlayEffects, EffectContext) == 0x0000D0, "Member 'B_Athena_Wumba_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.CheckShouldDisplayUI
// 0x0002 (0x0002 - 0x0000)
struct B_Athena_Wumba_C_CheckShouldDisplayUI final
{
public:
	bool                                          ShowDetail;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowDistance;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_Wumba_C_CheckShouldDisplayUI) == 0x000001, "Wrong alignment on B_Athena_Wumba_C_CheckShouldDisplayUI");
static_assert(sizeof(B_Athena_Wumba_C_CheckShouldDisplayUI) == 0x000002, "Wrong size on B_Athena_Wumba_C_CheckShouldDisplayUI");
static_assert(offsetof(B_Athena_Wumba_C_CheckShouldDisplayUI, ShowDetail) == 0x000000, "Member 'B_Athena_Wumba_C_CheckShouldDisplayUI::ShowDetail' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_CheckShouldDisplayUI, ShowDistance) == 0x000001, "Member 'B_Athena_Wumba_C_CheckShouldDisplayUI::ShowDistance' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C58[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Athena_Wumba_C_BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C59[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Athena_Wumba_C_BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct B_Athena_Wumba_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_Athena_Wumba_C_OnDeathServer) == 0x000008, "Wrong alignment on B_Athena_Wumba_C_OnDeathServer");
static_assert(sizeof(B_Athena_Wumba_C_OnDeathServer) == 0x0000E8, "Wrong size on B_Athena_Wumba_C_OnDeathServer");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, Damage) == 0x000000, "Member 'B_Athena_Wumba_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, DamageTags) == 0x000008, "Member 'B_Athena_Wumba_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, Momentum) == 0x000028, "Member 'B_Athena_Wumba_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, HitInfo) == 0x000034, "Member 'B_Athena_Wumba_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'B_Athena_Wumba_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'B_Athena_Wumba_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Athena_Wumba_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'B_Athena_Wumba_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function B_Athena_Wumba.B_Athena_Wumba_C.ExecuteUbergraph_B_Athena_Wumba
// 0x09D8 (0x09D8 - 0x0000)
struct B_Athena_Wumba_C_ExecuteUbergraph_B_Athena_Wumba final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5C[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Temp_byte_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5D[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0098(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x00B8(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_3;                            // 0x00D8(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_4;                            // 0x00F8(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_5;                            // 0x0118(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_6;                            // 0x0138(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_7;                            // 0x0158(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_8;                            // 0x0178(0x0020)()
	EInteractionBeingAttempted                    Temp_byte_Variable_2;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5E[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_9;                            // 0x01A0(0x0020)()
	struct FVector                                K2Node_CustomEvent_Color;                          // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Index;                          // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_CustomEvent_InteractionBeingAttempted;      // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5F[0x2];                                     // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C60[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn_1;                    // 0x01D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted_1;          // 0x01E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             K2Node_Event_InteractionType;                      // 0x01E1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C61[0x5];                                     // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x01E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x01F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C62[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C63[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_2;                             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0230(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x025C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_2;                       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x02F8(0x0018)()
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0314(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C64[0x2];                                     // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_10;                           // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_11;                           // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_12;                           // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_13;                           // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C65[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x03B0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x03DC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0478(0x0018)()
	class AFortWeaponPickaxeAthena*               K2Node_DynamicCast_AsFort_Weapon_Pickaxe_Athena;   // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C66[0x2];                                     // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_14;                           // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowDetail;                     // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ShowDistance;                   // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C67[0x2];                                     // 0x04BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_15;                           // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C68[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C69[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6A[0x6];                                     // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6B[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUD_InteractionPoint_C*                K2Node_DynamicCast_AsHUD_Interaction_Point;        // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6C[0x7];                                     // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUD_InteractionPoint_C*                K2Node_DynamicCast_AsHUD_Interaction_Point_1;      // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6D[0x3];                                     // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6E[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_16;                           // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
