#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CameraLens_SpookyMist_Loop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CameraLens_SpookyMist_Loop.B_CameraLens_SpookyMist_Loop_C
// 0x0020 (0x0300 - 0x02E0)
class AB_CameraLens_SpookyMist_Loop_C final : public AEmitterCameraLensEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 VelocityActor;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetRot;                                         // 0x02F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_CameraLens_SpookyMist_Loop(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CameraLens_SpookyMist_Loop_C">();
	}
	static class AB_CameraLens_SpookyMist_Loop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CameraLens_SpookyMist_Loop_C>();
	}
};
static_assert(alignof(AB_CameraLens_SpookyMist_Loop_C) == 0x000010, "Wrong alignment on AB_CameraLens_SpookyMist_Loop_C");
static_assert(sizeof(AB_CameraLens_SpookyMist_Loop_C) == 0x000300, "Wrong size on AB_CameraLens_SpookyMist_Loop_C");
static_assert(offsetof(AB_CameraLens_SpookyMist_Loop_C, UberGraphFrame) == 0x0002E0, "Member 'AB_CameraLens_SpookyMist_Loop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_CameraLens_SpookyMist_Loop_C, VelocityActor) == 0x0002E8, "Member 'AB_CameraLens_SpookyMist_Loop_C::VelocityActor' has a wrong offset!");
static_assert(offsetof(AB_CameraLens_SpookyMist_Loop_C, TargetRot) == 0x0002F0, "Member 'AB_CameraLens_SpookyMist_Loop_C::TargetRot' has a wrong offset!");

}

