#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CCPM_Base_Niagara_Professor_Pup_Head

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.getIsFrontEnd
// 0x0002 (0x0002 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd final
{
public:
	bool                                          Param_IsInFrontEnd;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsFrontEnd_IsInFrontEnd;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd) == 0x000002, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd, Param_IsInFrontEnd) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd::Param_IsInFrontEnd' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd, CallFunc_getIsFrontEnd_IsInFrontEnd) == 0x000001, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsFrontEnd::CallFunc_getIsFrontEnd_IsInFrontEnd' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.getNiagaraParticles
// 0x0040 (0x0040 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles final
{
public:
	struct FGameplayTagContainer                  Gameplay_Tag_Container;                            // 0x0000(0x0020)(Parm, OutParm)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0020(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles) == 0x000040, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles, Gameplay_Tag_Container) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles::Gameplay_Tag_Container' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000020, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetNiagaraParticles::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.set Niagara System User Variable (Bool)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_) == 0x00000C, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_, Param_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_::Param_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Bool_::Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.set Niagara System User Variable (Vector)
// 0x0014 (0x0014 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Value;                                             // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_) == 0x000014, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_, Param_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_::Param_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Vector_::Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.set Niagara System User Variable (Int)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_) == 0x00000C, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_, Param_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_::Param_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Int_::Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.set Niagara System User Variable (Float)
// 0x000C (0x000C - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_) == 0x00000C, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_, Param_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_::Param_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Float_::Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.set Niagara System User Variable (Color)
// 0x0018 (0x0018 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_) == 0x000018, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_, Param_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_::Param_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Set_Niagara_System_User_Variable__Color_::Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.getIsDriving
// 0x0002 (0x0002 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving final
{
public:
	bool                                          Param_IsDriving;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsDriving_isDriving;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving) == 0x000002, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving, Param_IsDriving) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving::Param_IsDriving' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving, CallFunc_getIsDriving_isDriving) == 0x000001, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_GetIsDriving::CallFunc_getIsDriving_isDriving' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.Morning Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Morning_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.Day Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Day_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.Evening Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Evening_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.Night Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Night_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.OnHitPawn
// 0x00A8 (0x00A8 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x001C(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn) == 0x0000A8, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn, SelfActor) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn::SelfActor' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn, OtherActor) == 0x000008, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn::OtherActor' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn, NormalImpulse) == 0x000010, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn, Hit) == 0x00001C, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnHitPawn::Hit' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.OnDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged) == 0x000003, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged, CurrentDayPhase) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged::CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged, PreviousDayPhase) == 0x000001, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged, bAtCreation) == 0x000002, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_OnDayPhaseChanged::bAtCreation' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.Character Movement Updated
// 0x001C (0x001C - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated) == 0x00001C, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated, DeltaSeconds) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated, OldLocation) == 0x000004, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated::OldLocation' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated, OldVelocity) == 0x000010, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_Character_Movement_Updated::OldVelocity' has a wrong offset!");

// Function B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C.ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head
// 0x0168 (0x0168 - 0x0000)
struct B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)(ConstParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED0[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0030(0x0020)(ConstParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getIsFrontEnd_IsInFrontEnd;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_SelfActor;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0074(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_At_Creation_3;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation_2;                        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation_1;                        // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_At_Creation;                          // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldLocation;                          // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldVelocity;                          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED1[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED2[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED3[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM_LRG_Professor_Pup_AnimBP_C*          K2Node_DynamicCast_AsM_LRG_Professor_Pup_Anim_BP;  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head");
static_assert(sizeof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head) == 0x000168, "Wrong size on B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head");
static_assert(offsetof(B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head, EntryPoint) == 0x000000, "Member 'B_CCPM_Base_Niagara_Professor_Pup_Head_C_ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head::EntryPoint' has a wrong offset!");
