#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CCPM_Base_Niagara

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C
// 0x0068 (0x03D8 - 0x0370)
class AB_CCPM_Base_Niagara_C : public ACustomCharacterPartModifier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Niagara;                                           // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         Character_Part_Type;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Activate_Particles_During_Skydive;                 // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDriving;                                         // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_in_Vehicle;                      // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5642[0x5];                                     // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   Last_Pawn;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Stats;                                      // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5643[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortStatManagerTag                    Stat_Tag;                                          // 0x03AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Activate_Particles_After_Skydive_End;              // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Activate_Particles_on_Vehicle_Exit;                // 0x03B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Activate_Particles_in_Front_End;                   // 0x03B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Debug_Res;                                         // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5644[0x3];                                     // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Debug_Color;                                       // 0x03BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Activate_Particles_on_Res_In;                      // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsLanded;                                         // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	struct FGameplayTagContainer GetNiagaraSuperLevelParticles();
	void Debug_FX(const class FString& Print_String);
	void GetIsFrontEnd(bool* Param_IsInFrontEnd);
	void IsStageStatRequirementsMet();
	void Set_Niagara_System_User_Variable__Bool_(class FName Param_Name, bool Value);
	void Set_Niagara_System_User_Variable__Color_(class FName Param_Name, const struct FLinearColor& Value);
	void Set_Niagara_System_User_Variable__Vector_(class FName Param_Name, const struct FVector& Value);
	void Set_Niagara_System_User_Variable__Int_(class FName Param_Name, int32 Value);
	void Set_Niagara_System_User_Variable__Float_(class FName Param_Name, float Value);
	void GetIsDriving(bool* Param_IsDriving);
	void GetNiagaraParticles(struct FGameplayTagContainer* Gameplay_Tag_Container);
	void OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420(class FName StatName, int32 StatValue);
	void OnComponentsReady_697782874F9B58BD916BDBA30537E29E();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ResOut();
	void ResIn();
	void OnTargetingOrFirstPersonCameraChanged();
	void Watch_Stats();
	void On_Stat_Canged(const class FName Stat_Name, int32 Stat_Value);
	void Morning_Phase(bool At_Creation);
	void Day_Phase(bool At_Creation);
	void Evening_Phase(bool At_Creation);
	void Night_Phase(bool At_Creation);
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void Reset_Exit_Vehicle();
	void Reset_Enter_Vehicle();
	void Vehicle_Entry();
	void OnPawnAndPartChanged();
	void ReceiveBeginPlay();
	void Character_Movement_Updated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnBeginSkydiving();
	void OnEndSkydiving();
	void IsHiddenInProp(bool IsHidden);
	void Enter_Vehicle();
	void Exit_Vehicle();
	void OnEnterVehicle(const TScriptInterface<class IFortVehicleInterface>& VehicleEntered);
	void Manage_Particles();
	void ExecuteUbergraph_B_CCPM_Base_Niagara(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CCPM_Base_Niagara_C">();
	}
	static class AB_CCPM_Base_Niagara_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CCPM_Base_Niagara_C>();
	}
};
static_assert(alignof(AB_CCPM_Base_Niagara_C) == 0x000008, "Wrong alignment on AB_CCPM_Base_Niagara_C");
static_assert(sizeof(AB_CCPM_Base_Niagara_C) == 0x0003D8, "Wrong size on AB_CCPM_Base_Niagara_C");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, UberGraphFrame) == 0x000370, "Member 'AB_CCPM_Base_Niagara_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, DefaultSceneRoot) == 0x000378, "Member 'AB_CCPM_Base_Niagara_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Niagara) == 0x000380, "Member 'AB_CCPM_Base_Niagara_C::Niagara' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Character_Part_Type) == 0x000388, "Member 'AB_CCPM_Base_Niagara_C::Character_Part_Type' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Activate_Particles_During_Skydive) == 0x000390, "Member 'AB_CCPM_Base_Niagara_C::Activate_Particles_During_Skydive' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, IsDriving) == 0x000391, "Member 'AB_CCPM_Base_Niagara_C::IsDriving' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Disable_Particles_in_Vehicle) == 0x000392, "Member 'AB_CCPM_Base_Niagara_C::Disable_Particles_in_Vehicle' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Last_Pawn) == 0x000398, "Member 'AB_CCPM_Base_Niagara_C::Last_Pawn' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, PlayerPawn) == 0x0003A0, "Member 'AB_CCPM_Base_Niagara_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Enable_Stats) == 0x0003A8, "Member 'AB_CCPM_Base_Niagara_C::Enable_Stats' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Stat_Tag) == 0x0003AC, "Member 'AB_CCPM_Base_Niagara_C::Stat_Tag' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Activate_Particles_After_Skydive_End) == 0x0003B4, "Member 'AB_CCPM_Base_Niagara_C::Activate_Particles_After_Skydive_End' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Debug) == 0x0003B5, "Member 'AB_CCPM_Base_Niagara_C::Debug' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Activate_Particles_on_Vehicle_Exit) == 0x0003B6, "Member 'AB_CCPM_Base_Niagara_C::Activate_Particles_on_Vehicle_Exit' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Activate_Particles_in_Front_End) == 0x0003B7, "Member 'AB_CCPM_Base_Niagara_C::Activate_Particles_in_Front_End' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Debug_Res) == 0x0003B8, "Member 'AB_CCPM_Base_Niagara_C::Debug_Res' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Debug_Color) == 0x0003BC, "Member 'AB_CCPM_Base_Niagara_C::Debug_Color' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Time) == 0x0003CC, "Member 'AB_CCPM_Base_Niagara_C::Time' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, Activate_Particles_on_Res_In) == 0x0003D0, "Member 'AB_CCPM_Base_Niagara_C::Activate_Particles_on_Res_In' has a wrong offset!");
static_assert(offsetof(AB_CCPM_Base_Niagara_C, bIsLanded) == 0x0003D1, "Member 'AB_CCPM_Base_Niagara_C::bIsLanded' has a wrong offset!");

}

