#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DanceFloorSounds_Large

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_DanceFloorSounds_Large.B_DanceFloorSounds_Large_C.ExecuteUbergraph_B_DanceFloorSounds_Large
// 0x0028 (0x0028 - 0x0000)
struct B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8736[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large) == 0x000008, "Wrong alignment on B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large");
static_assert(sizeof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large) == 0x000028, "Wrong size on B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, EntryPoint) == 0x000000, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, K2Node_Event_OtherActor_1) == 0x000008, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, K2Node_Event_OtherActor) == 0x000010, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000020, "Member 'B_DanceFloorSounds_Large_C_ExecuteUbergraph_B_DanceFloorSounds_Large::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");

// Function B_DanceFloorSounds_Large.B_DanceFloorSounds_Large_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap");
static_assert(sizeof(B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'B_DanceFloorSounds_Large_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function B_DanceFloorSounds_Large.B_DanceFloorSounds_Large_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap");
static_assert(sizeof(B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap");
static_assert(offsetof(B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'B_DanceFloorSounds_Large_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

