#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DowntownTrashCan_BasketballMinigame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_DowntownTrashCan_BasketballMinigame.B_DowntownTrashCan_BasketballMinigame_C.ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame
// 0x00F0 (0x00F0 - 0x0000)
struct B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_843A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_ToyBasketball_Base_C*                K2Node_DynamicCast_AsB_Toy_Basketball_Base;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_843B[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame) == 0x000008, "Wrong alignment on B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame");
static_assert(sizeof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame) == 0x0000F0, "Wrong size on B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, EntryPoint) == 0x000000, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_GetActorUpVector_ReturnValue) == 0x000004, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000BC, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_DynamicCast_AsB_Toy_Basketball_Base) == 0x0000C8, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_DynamicCast_AsB_Toy_Basketball_Base' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_HasAuthority_ReturnValue) == 0x0000D1, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D4, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'B_DowntownTrashCan_BasketballMinigame_C_ExecuteUbergraph_B_DowntownTrashCan_BasketballMinigame::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function B_DowntownTrashCan_BasketballMinigame.B_DowntownTrashCan_BasketballMinigame_C.BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_843C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_DowntownTrashCan_BasketballMinigame_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

