#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ExplosiveBow_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.ExecuteUbergraph_B_ExplosiveBow_Athena
// 0x00F0 (0x00F0 - 0x0000)
struct B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateVelocity_Velocity;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargePercent_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659D[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659E[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659F[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChargePercent_ReturnValue_1;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A0[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A1[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A2[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_2;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_3;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena) == 0x000008, "Wrong alignment on B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena");
static_assert(sizeof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena) == 0x0000F0, "Wrong size on B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, EntryPoint) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_Variable) == 0x000004, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Event_bPersistentFire) == 0x000005, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Event_bSecondaryFire) == 0x000006, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_Variable_1) == 0x000007, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetValueAtLevel_ReturnValue) == 0x000020, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_CalculateVelocity_Velocity) == 0x000028, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_CalculateVelocity_Velocity' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetChargePercent_ReturnValue) == 0x000030, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetChargePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetInstigatorController_ReturnValue) == 0x000038, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000042, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_IsClosed_Variable) == 0x000045, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_Variable_2) == 0x000046, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetInstigator_ReturnValue_1) == 0x000048, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsLocallyControlled_ReturnValue) == 0x000050, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetInstigator_ReturnValue_2) == 0x000058, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000060, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000068, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetChargePercent_ReturnValue_1) == 0x00006C, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetChargePercent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_MakeArray_Array) == 0x000078, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, Temp_bool_Variable_3) == 0x000088, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00008C, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetActorTeam_ReturnValue) == 0x000098, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_IsValid_ReturnValue_2) == 0x000099, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Select_Default) == 0x0000A0, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Select_Default_1) == 0x0000A8, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Select_Default_2) == 0x0000B0, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, K2Node_Select_Default_3) == 0x0000B8, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000C0, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_GetInstigator_ReturnValue_3) == 0x0000C8, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x0000D0, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000D8, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000E0, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0000E8, "Member 'B_ExplosiveBow_Athena_C_ExecuteUbergraph_B_ExplosiveBow_Athena::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_ExplosiveBow_Athena_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_ReceiveTick) == 0x000004, "Wrong alignment on B_ExplosiveBow_Athena_C_ReceiveTick");
static_assert(sizeof(B_ExplosiveBow_Athena_C_ReceiveTick) == 0x000004, "Wrong size on B_ExplosiveBow_Athena_C_ReceiveTick");
static_assert(offsetof(B_ExplosiveBow_Athena_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_ExplosiveBow_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.SetupTrajectoryProjectile
// 0x0050 (0x0050 - 0x0000)
struct B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_ExplosiveBow_C* K2Node_DynamicCast_AsBP_Projectile_Trajectory_Explosive_Bow; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile) == 0x000010, "Wrong alignment on B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile");
static_assert(sizeof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile) == 0x000050, "Wrong size on B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000038, "Member 'B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile, K2Node_DynamicCast_AsBP_Projectile_Trajectory_Explosive_Bow) == 0x000040, "Member 'B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile::K2Node_DynamicCast_AsBP_Projectile_Trajectory_Explosive_Bow' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'B_ExplosiveBow_Athena_C_SetupTrajectoryProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.SetDummyVariables
// 0x0060 (0x0060 - 0x0000)
struct B_ExplosiveBow_Athena_C_SetDummyVariables final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A3[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutRadius;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutHalfHeight;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_SetDummyVariables) == 0x000010, "Wrong alignment on B_ExplosiveBow_Athena_C_SetDummyVariables");
static_assert(sizeof(B_ExplosiveBow_Athena_C_SetDummyVariables) == 0x000060, "Wrong size on B_ExplosiveBow_Athena_C_SetDummyVariables");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000038, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_FinishSpawningActor_ReturnValue) == 0x000040, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_GetScaledCapsuleSize_OutRadius) == 0x000048, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_GetScaledCapsuleSize_OutRadius' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_GetScaledCapsuleSize_OutHalfHeight) == 0x00004C, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_GetScaledCapsuleSize_OutHalfHeight' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_FMax_ReturnValue) == 0x000050, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetDummyVariables, CallFunc_GetGravityZ_ReturnValue) == 0x000054, "Member 'B_ExplosiveBow_Athena_C_SetDummyVariables::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.CalculateTrajectorySpline
// 0x00E0 (0x00E0 - 0x0000)
struct B_ExplosiveBow_Athena_C_CalculateTrajectorySpline final
{
public:
	float                                         CallFunc_GetChargePercent_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetupProjectileVariables_StartLocation;   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetupProjectileVariables_InitialVelocity; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetupProjectileVariables_ProjectileVelocity; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SetupProjectileVariables_OutRotation;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult; // 0x0030(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_65A4[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints; // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents; // 0x00D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline) == 0x000008, "Wrong alignment on B_ExplosiveBow_Athena_C_CalculateTrajectorySpline");
static_assert(sizeof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline) == 0x0000E0, "Wrong size on B_ExplosiveBow_Athena_C_CalculateTrajectorySpline");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_GetChargePercent_ReturnValue) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_GetChargePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_SetupProjectileVariables_StartLocation) == 0x000008, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_SetupProjectileVariables_StartLocation' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_SetupProjectileVariables_InitialVelocity) == 0x000014, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_SetupProjectileVariables_InitialVelocity' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_SetupProjectileVariables_ProjectileVelocity) == 0x000020, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_SetupProjectileVariables_ProjectileVelocity' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_SetupProjectileVariables_OutRotation) == 0x000024, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_SetupProjectileVariables_OutRotation' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult) == 0x000030, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutHitResult' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints) == 0x0000C0, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateTrajectorySpline, CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents) == 0x0000D0, "Member 'B_ExplosiveBow_Athena_C_CalculateTrajectorySpline::CallFunc_CalculateProjectileTrajectorySplineWithHit_OutSplineTangents' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.StartDrawAudio
// 0x0010 (0x0010 - 0x0000)
struct B_ExplosiveBow_Athena_C_StartDrawAudio final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_StartDrawAudio) == 0x000008, "Wrong alignment on B_ExplosiveBow_Athena_C_StartDrawAudio");
static_assert(sizeof(B_ExplosiveBow_Athena_C_StartDrawAudio) == 0x000010, "Wrong size on B_ExplosiveBow_Athena_C_StartDrawAudio");
static_assert(offsetof(B_ExplosiveBow_Athena_C_StartDrawAudio, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_StartDrawAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_StartDrawAudio, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'B_ExplosiveBow_Athena_C_StartDrawAudio::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.StopDrawAudio
// 0x0001 (0x0001 - 0x0000)
struct B_ExplosiveBow_Athena_C_StopDrawAudio final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_StopDrawAudio) == 0x000001, "Wrong alignment on B_ExplosiveBow_Athena_C_StopDrawAudio");
static_assert(sizeof(B_ExplosiveBow_Athena_C_StopDrawAudio) == 0x000001, "Wrong size on B_ExplosiveBow_Athena_C_StopDrawAudio");
static_assert(offsetof(B_ExplosiveBow_Athena_C_StopDrawAudio, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_StopDrawAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.CalculateVelocity
// 0x000C (0x000C - 0x0000)
struct B_ExplosiveBow_Athena_C_CalculateVelocity final
{
public:
	float                                         Velocity;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargePercent_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProjectileSpeed_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_CalculateVelocity) == 0x000004, "Wrong alignment on B_ExplosiveBow_Athena_C_CalculateVelocity");
static_assert(sizeof(B_ExplosiveBow_Athena_C_CalculateVelocity) == 0x00000C, "Wrong size on B_ExplosiveBow_Athena_C_CalculateVelocity");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateVelocity, Velocity) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_CalculateVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateVelocity, CallFunc_GetChargePercent_ReturnValue) == 0x000004, "Member 'B_ExplosiveBow_Athena_C_CalculateVelocity::CallFunc_GetChargePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_CalculateVelocity, CallFunc_GetProjectileSpeed_ReturnValue) == 0x000008, "Member 'B_ExplosiveBow_Athena_C_CalculateVelocity::CallFunc_GetProjectileSpeed_ReturnValue' has a wrong offset!");

// Function B_ExplosiveBow_Athena.B_ExplosiveBow_Athena_C.SetupProjectileVariables
// 0x0084 (0x0084 - 0x0000)
struct B_ExplosiveBow_Athena_C_SetupProjectileVariables final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialVelocity;                                   // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_ProjectileVelocity;                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRotation;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProjectilePitchOffset_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDamageStartLocation_AimDir;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDamageStartLocation_ReturnValue;       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ExplosiveBow_Athena_C_SetupProjectileVariables) == 0x000004, "Wrong alignment on B_ExplosiveBow_Athena_C_SetupProjectileVariables");
static_assert(sizeof(B_ExplosiveBow_Athena_C_SetupProjectileVariables) == 0x000084, "Wrong size on B_ExplosiveBow_Athena_C_SetupProjectileVariables");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupProjectileVariables, StartLocation) == 0x000000, "Member 'B_ExplosiveBow_Athena_C_SetupProjectileVariables::StartLocation' has a wrong offset!");
static_assert(offsetof(B_ExplosiveBow_Athena_C_SetupProjectileVariables, InitialVelocity) == 0x00000C, "Member 'B_ExplosiveBow_Athena_C_SetupProjectileVariables::InitialVelocity' has a wrong offset!");
