#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_GasPump_Valet_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_GasPump_Valet_Component.B_GasPump_Valet_Component_C.ExecuteUbergraph_B_GasPump_Valet_Component
// 0x00E0 (0x00E0 - 0x0000)
struct B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7357[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7358[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7359[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFuelIndicator_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFuelIndicator_C*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_735B[0xC];                                     // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance2DSquared_ReturnValue;     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_735C[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735D[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFuelIndicator_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735E[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component) == 0x000010, "Wrong alignment on B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component");
static_assert(sizeof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component) == 0x0000E0, "Wrong size on B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, EntryPoint) == 0x000000, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000008, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00000C, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_HasAuthority_ReturnValue) == 0x000023, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetSubGame_ReturnValue) == 0x000024, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Array_Get_Item) == 0x000040, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetOwner_ReturnValue_2) == 0x000060, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Vector_Distance2DSquared_ReturnValue) == 0x0000B0, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Vector_Distance2DSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B8, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component, CallFunc_BooleanAND_ReturnValue) == 0x0000DC, "Member 'B_GasPump_Valet_Component_C_ExecuteUbergraph_B_GasPump_Valet_Component::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

