#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObjectSocketManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_HeldObjectSocketManager.B_HeldObjectSocketManager_C.ExecuteUbergraph_B_HeldObjectSocketManager
// 0x0020 (0x0020 - 0x0000)
struct B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HeldObjectSocket_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager) == 0x000008, "Wrong alignment on B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager");
static_assert(sizeof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager) == 0x000020, "Wrong size on B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, EntryPoint) == 0x000000, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, CallFunc_Array_Get_Item) == 0x000010, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'B_HeldObjectSocketManager_C_ExecuteUbergraph_B_HeldObjectSocketManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function B_HeldObjectSocketManager.B_HeldObjectSocketManager_C.UpdateHeldObjectTags
// 0x0060 (0x0060 - 0x0000)
struct B_HeldObjectSocketManager_C_UpdateHeldObjectTags final
{
public:
	class AB_HeldObjectSocket_C*                  ChangedSocket;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0018(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0038(0x0020)(ConstParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags) == 0x000008, "Wrong alignment on B_HeldObjectSocketManager_C_UpdateHeldObjectTags");
static_assert(sizeof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags) == 0x000060, "Wrong size on B_HeldObjectSocketManager_C_UpdateHeldObjectTags");
static_assert(offsetof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags, ChangedSocket) == 0x000000, "Member 'B_HeldObjectSocketManager_C_UpdateHeldObjectTags::ChangedSocket' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x000008, "Member 'B_HeldObjectSocketManager_C_UpdateHeldObjectTags::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000018, "Member 'B_HeldObjectSocketManager_C_UpdateHeldObjectTags::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags, Temp_struct_Variable) == 0x000038, "Member 'B_HeldObjectSocketManager_C_UpdateHeldObjectTags::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_UpdateHeldObjectTags, CallFunc_Array_Find_ReturnValue) == 0x000058, "Member 'B_HeldObjectSocketManager_C_UpdateHeldObjectTags::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function B_HeldObjectSocketManager.B_HeldObjectSocketManager_C.VerifyHeldObjectTags
// 0x0128 (0x0128 - 0x0000)
struct B_HeldObjectSocketManager_C_VerifyHeldObjectTags final
{
public:
	TArray<struct FGameplayTagContainer>          CorrectTags;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FGameplayTagContainer>          Param_CurrentTags;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          OrderMatters;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsValidMatch;                                      // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TagsAreInOrder;                                    // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6644[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ConcatenatedCurrentTags;                           // 0x0028(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  ConcatenatedCorrectTags;                           // 0x0048(0x0020)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6645[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6646[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_Array_Get_Item;                           // 0x0090(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6647[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6648[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6649[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_Array_Get_Item_2;                         // 0x00F0(0x0020)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllTags_ReturnValue_1;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_664A[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_664B[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags) == 0x000008, "Wrong alignment on B_HeldObjectSocketManager_C_VerifyHeldObjectTags");
static_assert(sizeof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags) == 0x000128, "Wrong size on B_HeldObjectSocketManager_C_VerifyHeldObjectTags");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CorrectTags) == 0x000000, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CorrectTags' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Param_CurrentTags) == 0x000010, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Param_CurrentTags' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, OrderMatters) == 0x000020, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::OrderMatters' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, IsValidMatch) == 0x000021, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::IsValidMatch' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, TagsAreInOrder) == 0x000022, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::TagsAreInOrder' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, ConcatenatedCurrentTags) == 0x000028, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::ConcatenatedCurrentTags' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, ConcatenatedCorrectTags) == 0x000048, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::ConcatenatedCorrectTags' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Length_ReturnValue_3) == 0x000074, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Array_Index_Variable) == 0x000084, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_bool_True_if_break_was_hit_Variable) == 0x000088, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Get_Item) == 0x000090, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Array_Index_Variable_1) == 0x0000B4, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E0, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Array_Index_Variable_2) == 0x0000E4, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_HasAllTags_ReturnValue) == 0x0000E8, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Array_Get_Item_2) == 0x0000F0, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Greater_IntInt_ReturnValue) == 0x000110, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_HasAllTags_ReturnValue_1) == 0x000111, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_HasAllTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, Temp_int_Loop_Counter_Variable_2) == 0x000114, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Less_IntInt_ReturnValue_2) == 0x000118, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_Add_IntInt_ReturnValue_2) == 0x00011C, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HeldObjectSocketManager_C_VerifyHeldObjectTags, CallFunc_BooleanAND_ReturnValue) == 0x000120, "Member 'B_HeldObjectSocketManager_C_VerifyHeldObjectTags::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_HeldObjectSocketManager.B_HeldObjectSocketManager_C.CheckTagMatches
// 0x0001 (0x0001 - 0x0000)
struct B_HeldObjectSocketManager_C_CheckTagMatches final
{
public:
	bool                                          CallFunc_VerifyHeldObjectTags_IsValidMatch;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HeldObjectSocketManager_C_CheckTagMatches) == 0x000001, "Wrong alignment on B_HeldObjectSocketManager_C_CheckTagMatches");
static_assert(sizeof(B_HeldObjectSocketManager_C_CheckTagMatches) == 0x000001, "Wrong size on B_HeldObjectSocketManager_C_CheckTagMatches");
static_assert(offsetof(B_HeldObjectSocketManager_C_CheckTagMatches, CallFunc_VerifyHeldObjectTags_IsValidMatch) == 0x000000, "Member 'B_HeldObjectSocketManager_C_CheckTagMatches::CallFunc_VerifyHeldObjectTags_IsValidMatch' has a wrong offset!");

}

