#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObject_Generic_Component

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_HeldObject_Generic_Component.B_HeldObject_Generic_Component_C.ExecuteUbergraph_B_HeldObject_Generic_Component
// 0x0048 (0x0048 - 0x0000)
struct B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D3E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D3F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D40[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component) == 0x000008, "Wrong alignment on B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component");
static_assert(sizeof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component) == 0x000048, "Wrong size on B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, EntryPoint) == 0x000000, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, Temp_bool_Variable) == 0x000004, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue) == 0x000020, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000030, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000041, "Member 'B_HeldObject_Generic_Component_C_ExecuteUbergraph_B_HeldObject_Generic_Component::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

