#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_PhantomBooth

#include "Basic.hpp"

#include "B_HidingProp_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HidingProp_PhantomBooth.B_HidingProp_PhantomBooth_C
// 0x0160 (0x0FE8 - 0x0E88)
class AB_HidingProp_PhantomBooth_C final : public AB_HidingProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_HidingProp_PhantomBooth_C;        // 0x0E88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_PhantomBooth_DoorSlam;                          // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthena_FactionSelection_AlterEgo_C*    Athena_FactionSelection_AlterEgo;                  // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Telephone_Booth_DoorGlass;                      // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Telephone_Booth_GlassWindows2;                  // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Telephone_Booth_GlassWindows1;                  // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Telephone_Booth_GlassWindows;                   // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Float_19149CB347B5A16718A85CB6F64DAF79; // 0x0EC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_19149CB347B5A16718A85CB6F64DAF79; // 0x0ECC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC9[0x3];                                     // 0x0ECD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DoorSwing_Float_15A406674E1DBCBC991959ACB8563031;  // 0x0ED8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DoorSwing__Direction_15A406674E1DBCBC991959ACB8563031; // 0x0EDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCA[0x3];                                     // 0x0EDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DoorSwing;                                         // 0x0EE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Wobble_0;                                       // 0x0EE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               AGID_Alter;                                        // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Alter;                                           // 0x0EF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Ego;                                             // 0x0F00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFactionEgo;                                      // 0x0F08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BCB[0x7];                                     // 0x0F09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               AGID_Ego;                                          // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          PlayersThatHaveEnteredOnce;                        // 0x0F18(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class AFortPawn*                              ExitingPlayer;                                     // 0x0F28(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraDstance;                                     // 0x0F30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraHeight;                                      // 0x0F34(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExitMagnitude;                                     // 0x0F40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCC[0x4];                                     // 0x0F44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CameraMod;                                         // 0x0F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Faction;                                           // 0x0F50(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         PhantomBoothCycleType;                             // 0x0F58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EnabledRow;                                        // 0x0F78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FText>        FactionMap;                                        // 0x0F98(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_HidingProp_PhantomBooth(int32 EntryPoint);
	void BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature(const struct FGameplayTag& FactionTagOut);
	void ReceiveBeginPlay();
	void BlindsAnim();
	void Teleport(class AActor* Pawn);
	void ChangingOutFitWobble();
	void InteractEnter();
	void HidingPlayerCountChanged();
	void DoorSwingAnim();
	void OnReady_B63671614F33881B97F1CABC218A2B2D(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void DoorSwing__UpdateFunc();
	void DoorSwing__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HidingProp_PhantomBooth_C">();
	}
	static class AB_HidingProp_PhantomBooth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HidingProp_PhantomBooth_C>();
	}
};
static_assert(alignof(AB_HidingProp_PhantomBooth_C) == 0x000008, "Wrong alignment on AB_HidingProp_PhantomBooth_C");
static_assert(sizeof(AB_HidingProp_PhantomBooth_C) == 0x000FE8, "Wrong size on AB_HidingProp_PhantomBooth_C");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, UberGraphFrame_B_HidingProp_PhantomBooth_C) == 0x000E88, "Member 'AB_HidingProp_PhantomBooth_C::UberGraphFrame_B_HidingProp_PhantomBooth_C' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, NS_PhantomBooth_DoorSlam) == 0x000E90, "Member 'AB_HidingProp_PhantomBooth_C::NS_PhantomBooth_DoorSlam' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Athena_FactionSelection_AlterEgo) == 0x000E98, "Member 'AB_HidingProp_PhantomBooth_C::Athena_FactionSelection_AlterEgo' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, SM_Telephone_Booth_DoorGlass) == 0x000EA0, "Member 'AB_HidingProp_PhantomBooth_C::SM_Telephone_Booth_DoorGlass' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, SM_Telephone_Booth_GlassWindows2) == 0x000EA8, "Member 'AB_HidingProp_PhantomBooth_C::SM_Telephone_Booth_GlassWindows2' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, SM_Telephone_Booth_GlassWindows1) == 0x000EB0, "Member 'AB_HidingProp_PhantomBooth_C::SM_Telephone_Booth_GlassWindows1' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, SM_Telephone_Booth_GlassWindows) == 0x000EB8, "Member 'AB_HidingProp_PhantomBooth_C::SM_Telephone_Booth_GlassWindows' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Door) == 0x000EC0, "Member 'AB_HidingProp_PhantomBooth_C::Door' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Timeline_0_Float_19149CB347B5A16718A85CB6F64DAF79) == 0x000EC8, "Member 'AB_HidingProp_PhantomBooth_C::Timeline_0_Float_19149CB347B5A16718A85CB6F64DAF79' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Timeline_0__Direction_19149CB347B5A16718A85CB6F64DAF79) == 0x000ECC, "Member 'AB_HidingProp_PhantomBooth_C::Timeline_0__Direction_19149CB347B5A16718A85CB6F64DAF79' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Timeline_0) == 0x000ED0, "Member 'AB_HidingProp_PhantomBooth_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, DoorSwing_Float_15A406674E1DBCBC991959ACB8563031) == 0x000ED8, "Member 'AB_HidingProp_PhantomBooth_C::DoorSwing_Float_15A406674E1DBCBC991959ACB8563031' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, DoorSwing__Direction_15A406674E1DBCBC991959ACB8563031) == 0x000EDC, "Member 'AB_HidingProp_PhantomBooth_C::DoorSwing__Direction_15A406674E1DBCBC991959ACB8563031' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, DoorSwing) == 0x000EE0, "Member 'AB_HidingProp_PhantomBooth_C::DoorSwing' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, GC_Wobble_0) == 0x000EE8, "Member 'AB_HidingProp_PhantomBooth_C::GC_Wobble_0' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, AGID_Alter) == 0x000EF0, "Member 'AB_HidingProp_PhantomBooth_C::AGID_Alter' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, T_Alter) == 0x000EF8, "Member 'AB_HidingProp_PhantomBooth_C::T_Alter' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, T_Ego) == 0x000F00, "Member 'AB_HidingProp_PhantomBooth_C::T_Ego' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, IsFactionEgo) == 0x000F08, "Member 'AB_HidingProp_PhantomBooth_C::IsFactionEgo' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, AGID_Ego) == 0x000F10, "Member 'AB_HidingProp_PhantomBooth_C::AGID_Ego' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, PlayersThatHaveEnteredOnce) == 0x000F18, "Member 'AB_HidingProp_PhantomBooth_C::PlayersThatHaveEnteredOnce' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, ExitingPlayer) == 0x000F28, "Member 'AB_HidingProp_PhantomBooth_C::ExitingPlayer' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, CameraDstance) == 0x000F30, "Member 'AB_HidingProp_PhantomBooth_C::CameraDstance' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, CameraHeight) == 0x000F34, "Member 'AB_HidingProp_PhantomBooth_C::CameraHeight' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, ExitMagnitude) == 0x000F40, "Member 'AB_HidingProp_PhantomBooth_C::ExitMagnitude' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, CameraMod) == 0x000F48, "Member 'AB_HidingProp_PhantomBooth_C::CameraMod' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, Faction) == 0x000F50, "Member 'AB_HidingProp_PhantomBooth_C::Faction' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, PhantomBoothCycleType) == 0x000F58, "Member 'AB_HidingProp_PhantomBooth_C::PhantomBoothCycleType' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, EnabledRow) == 0x000F78, "Member 'AB_HidingProp_PhantomBooth_C::EnabledRow' has a wrong offset!");
static_assert(offsetof(AB_HidingProp_PhantomBooth_C, FactionMap) == 0x000F98, "Member 'AB_HidingProp_PhantomBooth_C::FactionMap' has a wrong offset!");

}

