#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HidingProp_WilliePete

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_HidingProp_WilliePete.B_HidingProp_WilliePete_C.ExecuteUbergraph_B_HidingProp_WilliePete
// 0x0980 (0x0980 - 0x0000)
struct B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EDE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TeleportingActor;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> K2Node_DynamicCast_AsFort_Projectile_Movement_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EDF[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       CallFunc_GetFortProjectileMovementComponent_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE0[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE1[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0058(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE2[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0140(0x00B8)(ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_3;                          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE3[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE4[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE5[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0258(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE6[0xF];                                     // 0x0311(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0320(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0380(0x0020)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE7[0x2];                                     // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x03C0(0x00B8)(ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x0480(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EE8[0x3];                                     // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x04A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5EE9[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EEA[0x3];                                     // 0x04E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x04E8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EEB[0x3];                                     // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EEC[0x6];                                     // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EED[0x5];                                     // 0x0593(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x05A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTethered_ReturnValue;                   // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EEE[0x6];                                     // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EEF[0x3];                                     // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF0[0x3];                                     // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_4;                          // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x05F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF1[0x4];                                     // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0608(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF2[0x7];                                     // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleForwardVector_ReturnValue;      // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive_1; // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted_1; // 0x0635(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF3[0x2];                                     // 0x0636(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0644(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF4[0x4];                                     // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EF5[0x4];                                     // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_AppleSun_Apple_Athena_C*           K2Node_DynamicCast_AsBGA_Apple_Sun_Apple_Athena;   // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF6[0x6];                                     // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0690(0x0030)(IsPlainOldData, NoDestructor)
	const class AFortPawn*                        K2Node_Event_Pawn;                                 // 0x06C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF7[0x7];                                     // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x06F0(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF8[0x6];                                     // 0x07A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF9[0x7];                                     // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EFA[0x7];                                     // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x07C8(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EFB[0x7];                                     // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortProjectileMovementComponent*       Temp_object_Variable_2;                            // 0x07F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x07FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x07FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EFC[0x4];                                     // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0808(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0810(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0830(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0840(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x084C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x08D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x08E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x08FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x090C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EFD[0x4];                                     // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0938(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0944(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0950(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EFE[0x4];                                     // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanBaseHeight_ReturnValue;           // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x096C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0974(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000010, "Wrong alignment on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(sizeof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete) == 0x000980, "Wrong size on B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, EntryPoint) == 0x000000, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_DestroyedActor) == 0x000008, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CustomEvent_TeleportingActor) == 0x000010, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CustomEvent_TeleportingActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_Projectile_Movement_Interface) == 0x000018, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_Projectile_Movement_Interface' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortProjectileMovementComponent_ReturnValue) == 0x000038, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortProjectileMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue) == 0x000052, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000053, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000058, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_3) == 0x0000E4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X) == 0x0000F4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z) == 0x0000FC, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000100, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000104, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_1) == 0x000110, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_1) == 0x000114, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_1) == 0x000118, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue) == 0x00011C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_2) == 0x000128, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_2) == 0x00012C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_2) == 0x000130, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetForwardVector_ReturnValue_1) == 0x000134, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000140, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_3) == 0x0001F8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_3) == 0x0001FC, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Z_3) == 0x000200, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RowToBool_ReturnValue) == 0x000204, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RandomFloatInRange_ReturnValue) == 0x000208, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetActorUpVector_ReturnValue) == 0x00020C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue) == 0x000218, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00021C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000220, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000230, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000238, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x000240, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortAbilitySystemComponent_ReturnValue_2) == 0x000248, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000250, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000258, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_4) == 0x000310, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetTransform_ReturnValue) == 0x000320, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Location) == 0x000350, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Rotation) == 0x00035C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakTransform_Scale) == 0x000368, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000374, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000380, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003A0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetQuestManager_ReturnValue) == 0x0003A8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0003B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0003B1, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0003B4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_MakeGameplayCueParameters_ReturnValue_2) == 0x0003C0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_MakeGameplayCueParameters_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000478, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00047C, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetOwnedGameplayTags_TagContainer_1) == 0x000480, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetOwnedGameplayTags_TagContainer_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasAuthority_ReturnValue_1) == 0x0004A0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate) == 0x0004A4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004B4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0004C8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherActor) == 0x0004D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherComp) == 0x0004D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0004E0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_bFromSweep) == 0x0004E4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_ComponentBoundEvent_SweepResult) == 0x0004E8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_5) == 0x000574, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000578, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess_1) == 0x000580, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_6) == 0x000581, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000588, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess_2) == 0x000590, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsInVehicle_ReturnValue) == 0x000591, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_7) == 0x000592, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000598, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0005A0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0005B0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsTethered_ReturnValue) == 0x0005B1, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsTethered_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_AsFort_AIPawn) == 0x0005B8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, K2Node_DynamicCast_bSuccess_3) == 0x0005C0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_GetActorForwardVector_ReturnValue) == 0x0005C4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_IsValid_ReturnValue_8) == 0x0005D0, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_X_4) == 0x0005D4, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete, CallFunc_BreakVector_Y_4) == 0x0005D8, "Member 'B_HidingProp_WilliePete_C_ExecuteUbergraph_B_HidingProp_WilliePete::CallFunc_BreakVector_Y_4' has a wrong offset!");
