#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_AppleSun_Attached

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_AppleSun_Attached.B_Prj_Athena_AppleSun_Attached_C.ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached
// 0x0578 (0x0578 - 0x0000)
struct B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689D[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A0[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0050(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A1[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A2[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnBGA__ReturnValue;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A3[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A4[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A5[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZiplining_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A6[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00F4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68A7[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A8[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnBGA__ReturnValue_1;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0214(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A9[0x6];                                     // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_2;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68AA[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_3;       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0340(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x03CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68AB[0x1];                                     // 0x045B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68AC[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnBGA__ReturnValue_2;                  // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x04E4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached) == 0x000008, "Wrong alignment on B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached");
static_assert(sizeof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached) == 0x000578, "Wrong size on B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_bool_IsClosed_Variable) == 0x000009, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GetAttachParentActor_ReturnValue) == 0x000010, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_HasAuthority_ReturnValue_1) == 0x000018, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_object_Variable) == 0x000030, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x000040, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_bool_Has_Been_Initd_Variable) == 0x00004C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_bool_Has_Been_Initd_Variable_1) == 0x00004D, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_object_Variable_1) == 0x000050, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, Temp_bool_IsClosed_Variable_1) == 0x000060, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000068, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_ComponentBoundEvent_WaterBody) == 0x000078, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000080, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000088, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00008C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_SpawnBGA__ReturnValue) == 0x000098, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_SpawnBGA__ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x0000A0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0000A8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000C0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000D0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_IsZiplining_ReturnValue) == 0x0000F0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_IsZiplining_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_LineTraceSingle_OutHit) == 0x0000F4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_LineTraceSingle_ReturnValue) == 0x000180, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BooleanOR_ReturnValue) == 0x000181, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_bBlockingHit) == 0x000182, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_bInitialOverlap) == 0x000183, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Time) == 0x000184, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Distance) == 0x000188, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Location) == 0x00018C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_ImpactPoint) == 0x000198, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Normal) == 0x0001A4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_FaceIndex) == 0x0001E4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_TraceStart) == 0x0001E8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_TraceEnd) == 0x0001F4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_HasAuthority_ReturnValue_2) == 0x000200, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_SpawnBGA__ReturnValue_1) == 0x000208, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_SpawnBGA__ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Dot_VectorVector_ReturnValue) == 0x000210, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000214, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002A0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002A1, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GetAttachParentActor_ReturnValue_2) == 0x0002A8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GetAttachParentActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0002B0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GetAttachParentActor_ReturnValue_3) == 0x0002C0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GetAttachParentActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_NegateRotator_ReturnValue) == 0x0002C8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002D4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0002E0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002EC, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002F8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Normal_ReturnValue) == 0x000304, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakVector_X) == 0x000310, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakVector_Y) == 0x000314, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakVector_Z) == 0x000318, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00031C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_MakeVector_ReturnValue) == 0x000328, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000334, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000340, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_LineTraceSingle_OutHit_1) == 0x0003CC, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_LineTraceSingle_ReturnValue_1) == 0x000458, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000459, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00045A, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Time_1) == 0x00045C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Distance_1) == 0x000460, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Location_1) == 0x000464, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000470, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_Normal_1) == 0x00047C, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000488, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_PhysMat_1) == 0x000498, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitActor_1) == 0x0004A0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitComponent_1) == 0x0004A8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitBoneName_1) == 0x0004B0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_HitItem_1) == 0x0004B8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_FaceIndex_1) == 0x0004BC, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_TraceStart_1) == 0x0004C0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_BreakHitResult_TraceEnd_1) == 0x0004CC, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_SpawnBGA__ReturnValue_2) == 0x0004D8, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_SpawnBGA__ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0004E0, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0004E4, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000570, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000571, "Member 'B_Prj_Athena_AppleSun_Attached_C_ExecuteUbergraph_B_Prj_Athena_AppleSun_Attached::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function B_Prj_Athena_AppleSun_Attached.B_Prj_Athena_AppleSun_Attached_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Athena_AppleSun_Attached_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_AppleSun_Attached_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Athena_AppleSun_Attached_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(B_Prj_Athena_AppleSun_Attached_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on B_Prj_Athena_AppleSun_Attached_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
