#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PrjPawn_Athena_RCRocket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_PrjPawn_Athena_RCRocket.B_PrjPawn_Athena_RCRocket_C.ExecuteUbergraph_B_PrjPawn_Athena_RCRocket
// 0x0688 (0x0688 - 0x0000)
struct B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77AD[0x1];                                     // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77AE[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_OldController;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77AF[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B0[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_PreviousTriggeredHealthThreshold;     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentTriggeredHealthThreshold;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B1[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B2[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B3[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B4[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B5[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B6[0x2];                                     // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B7[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B8[0x1];                                     // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B9[0x2];                                     // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x020C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0228(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02B4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0358(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_6;                // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_7;                // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_8;                // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x045C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_9;                // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_10;               // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_16;       // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_11;               // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_12;               // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77BA[0x3];                                     // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_17;       // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_13;               // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77BB[0x3];                                     // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_RCRocket_Launcher_Athena_C*          K2Node_DynamicCast_AsB_RCRocket_Launcher_Athena;   // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77BC[0x1];                                     // 0x04DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77BD[0x3];                                     // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77BE[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0500(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0514(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_77BF[0x4];                                     // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0528(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C0[0x3];                                     // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0544(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x054C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x055D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C1[0x2];                                     // 0x055E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0560(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0570(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C2[0x7];                                     // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x059B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C3[0x3];                                     // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C4[0x3];                                     // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x05C0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_77C5[0x4];                                     // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0650(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentlyDelayingLaunch_ReturnValue;    // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0663(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C6[0x3];                                     // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0668(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77C7[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0680(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket) == 0x000008, "Wrong alignment on B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket");
static_assert(sizeof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket) == 0x000688, "Wrong size on B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, EntryPoint) == 0x000000, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_name_Variable) == 0x000004, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_4) == 0x00000C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_3) == 0x000024, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_2) == 0x00003C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_1) == 0x000054, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName) == 0x00006C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_name_Variable_1) == 0x000084, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_IsValid_ReturnValue_1) == 0x00008D, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_HasAuthority_ReturnValue) == 0x00008E, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000090, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_Event_OldController) == 0x0000A0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_Event_OldController' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_Has_Been_Initd_Variable) == 0x0000B4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000B8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_Event_PreviousTriggeredHealthThreshold) == 0x0000C8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_Event_PreviousTriggeredHealthThreshold' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_Event_CurrentTriggeredHealthThreshold) == 0x0000CC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_Event_CurrentTriggeredHealthThreshold' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_IsClosed_Variable) == 0x0000D0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D1, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000D2, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x0000D3, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_Event_DeltaSeconds) == 0x0000D4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000D8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0000E4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_X) == 0x0000E8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_5) == 0x0000F4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_X_1) == 0x0000FC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_Y_1) == 0x000100, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_BreakVector_Z_1) == 0x000104, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000108, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00010C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000110, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000114, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Add_FloatFloat_ReturnValue) == 0x000120, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Abs_ReturnValue) == 0x000124, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000128, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Less_FloatFloat_ReturnValue) == 0x000129, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000138, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00013C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000140, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_FMax_ReturnValue) == 0x000144, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000148, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00014C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_MakeRotator_ReturnValue) == 0x000150, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_FMin_ReturnValue) == 0x00015C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000160, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000164, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_MakeRotator_ReturnValue_1) == 0x000168, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_FMin_ReturnValue_1) == 0x000174, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000178, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00017C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_MakeRotator_ReturnValue_2) == 0x000180, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_FMax_ReturnValue_1) == 0x00018C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000190, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_5) == 0x00019C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Normal_ReturnValue) == 0x0001AC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Normal_ReturnValue_1) == 0x0001B8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_Has_Been_Initd_Variable_1) == 0x0001C4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Dot_VectorVector_ReturnValue) == 0x0001C8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_DegAcos_ReturnValue) == 0x0001CC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Abs_ReturnValue_1) == 0x0001D0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_IsClosed_Variable_1) == 0x0001D4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001D8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_IsClosed_Variable_2) == 0x0001DC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0001DD, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_MapRangeClamped_ReturnValue) == 0x0001E0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001E4, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_FInterpTo_ReturnValue) == 0x0001E8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_IsPlaying_ReturnValue) == 0x0001EC, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_Has_Been_Initd_Variable_2) == 0x0001ED, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_Has_Been_Initd_Variable_3) == 0x0001EE, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CustomEvent_NotifyName_6) == 0x0001F0, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001F8, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_bool_IsClosed_Variable_3) == 0x000208, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, CallFunc_IsDedicatedServer_ReturnValue) == 0x000209, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket, Temp_struct_Variable) == 0x00020C, "Member 'B_PrjPawn_Athena_RCRocket_C_ExecuteUbergraph_B_PrjPawn_Athena_RCRocket::Temp_struct_Variable' has a wrong offset!");
