#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Consumable_Thrown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Consumable_Thrown.B_Prj_Athena_Consumable_Thrown_C
// 0x0090 (0x08F8 - 0x0868)
class AB_Prj_Athena_Consumable_Thrown_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Trail;                                          // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDefinition;                                    // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Projectile_Max_Lifetime;                           // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExploded_;                                     // 0x0894(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A91[0x3];                                     // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impact_Location;                                   // 0x0898(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Linger_Time;                                    // 0x08A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lifespan_Timer;                                    // 0x08A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x08B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A92[0x4];                                     // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             BounceOffWallSound;                                // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            Pickup;                                            // 0x08C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX;                                           // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX_Water;                                     // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Splash_Sound_;                                     // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSpawnDelay;                                   // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_Consumable_Thrown(int32 EntryPoint);
	void WaterImpactItemFX();
	void SpawnItem();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void Mark(class AActor* NewParam);
	void SpawnedItemFx();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnBounce(const struct FHitResult& Hit);
	void OnReachedLockTargetDistanceThreshold();
	void OnHomingPassedTarget();
	void Timeout();
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void OnRep_Impact_Location();
	void OnRep_Pickup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Consumable_Thrown_C">();
	}
	static class AB_Prj_Athena_Consumable_Thrown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Consumable_Thrown_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(sizeof(AB_Prj_Athena_Consumable_Thrown_C) == 0x0008F8, "Wrong size on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, UberGraphFrame) == 0x000868, "Member 'AB_Prj_Athena_Consumable_Thrown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SkeletalMesh) == 0x000870, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, StaticMesh) == 0x000878, "Member 'AB_Prj_Athena_Consumable_Thrown_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Trail) == 0x000880, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ItemDefinition) == 0x000888, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Projectile_Max_Lifetime) == 0x000890, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Projectile_Max_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, bHasExploded_) == 0x000894, "Member 'AB_Prj_Athena_Consumable_Thrown_C::bHasExploded_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Impact_Location) == 0x000898, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Impact_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Linger_Time) == 0x0008A4, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Linger_Time' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Lifespan_Timer) == 0x0008A8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Lifespan_Timer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnPositionOffset) == 0x0008B0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, BounceOffWallSound) == 0x0008C0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::BounceOffWallSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Pickup) == 0x0008C8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Pickup' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX) == 0x0008D0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX_Water) == 0x0008D8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX_Water' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnSound) == 0x0008E0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Splash_Sound_) == 0x0008E8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Splash_Sound_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, WaterSpawnDelay) == 0x0008F0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::WaterSpawnDelay' has a wrong offset!");

}

