#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Arrow_ExplodeOnImpact_Athena_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Arrow_ExplodeOnImpact_Athena_Parent.B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C.ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent
// 0x0208 (0x0208 - 0x0000)
struct B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0030(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bIsOverlap;                           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3A[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3B[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F3C[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingKilled_ReturnValue;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3D[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3E[0x1];                                     // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3F[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F40[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F41[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent) == 0x000008, "Wrong alignment on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent");
static_assert(sizeof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent) == 0x000208, "Wrong size on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, EntryPoint) == 0x000000, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_Event_OtherActor) == 0x000020, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_Event_OtherComp) == 0x000028, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_Event_HitResult) == 0x000030, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_Event_bIsOverlap) == 0x0000BC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_Event_bIsOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C9, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_Time) == 0x0000CC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_Distance) == 0x0000D0, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_Location) == 0x0000D4, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E0, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_Normal) == 0x0000EC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_HitItem) == 0x000128, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x00012C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_TraceStart) == 0x000130, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x00013C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_IsBeingKilled_ReturnValue) == 0x000148, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_IsBeingKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_DynamicCast_AsFort_Pawn) == 0x000150, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015A, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_MakeRotFromX_ReturnValue) == 0x00015C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000168, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000169, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000170, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00017C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetMuzzleLocation_ReturnValue) == 0x000180, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetVelocity_ReturnValue) == 0x00018C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_VSize_ReturnValue) == 0x000198, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_MapRangeClamped_ReturnValue) == 0x00019C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation) == 0x0001A0, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal) == 0x0001AC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition) == 0x0001B8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterDepth) == 0x0001C4, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx) == 0x0001C8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_GetLastWaterSurfaceInfo_WaterVelocity) == 0x0001CC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_GetLastWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001D8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001DC, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_ComponentBoundEvent_WaterBody) == 0x0001E8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0001F0, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0001F8, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000200, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_Arrow_ExplodeOnImpact_Athena_Parent.B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, Param_WaterInteractionComponent) == 0x000008, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function B_Prj_Arrow_ExplodeOnImpact_Athena_Parent.B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C.OnTouched
// 0x00A0 (0x00A0 - 0x0000)
struct B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0010(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bIsOverlap;                                        // 0x009C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched) == 0x000008, "Wrong alignment on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched");
static_assert(sizeof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched) == 0x0000A0, "Wrong size on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched, OtherActor) == 0x000000, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched, OtherComp) == 0x000008, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched, HitResult) == 0x000010, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched::HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched, bIsOverlap) == 0x00009C, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnTouched::bIsOverlap' has a wrong offset!");

// Function B_Prj_Arrow_ExplodeOnImpact_Athena_Parent.B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C.OnRep_HitLocation
// 0x00F8 (0x00F8 - 0x0000)
struct B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation final
{
public:
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0000(0x00B8)(ContainsInstancedReference)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F42[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F43[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F44[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation) == 0x000008, "Wrong alignment on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation");
static_assert(sizeof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation) == 0x0000F8, "Wrong size on B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation");
static_assert(offsetof(B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000000, "Member 'B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C_OnRep_HitLocation::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
