#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_PurpleMouse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_Athena_BGASpawner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_PurpleMouse.B_Prj_Athena_PurpleMouse_C
// 0x0018 (0x0900 - 0x08E8)
class AB_Prj_Athena_PurpleMouse_C final : public AB_Prj_Athena_BGASpawner_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_PurpleMouse_C;         // 0x08E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamHasBeenSet;                                    // 0x08F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_PurpleMouse(int32 EntryPoint);
	void SetTeam(uint8 Param_Team);
	void ReceiveBeginPlay();
	class AActor* SpawnBGA_(const struct FVector& Normal, class AActor* HitActor, class UPrimitiveComponent* HitComp, const struct FVector& Pos, bool FromWater);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_PurpleMouse_C">();
	}
	static class AB_Prj_Athena_PurpleMouse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_PurpleMouse_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_PurpleMouse_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_PurpleMouse_C");
static_assert(sizeof(AB_Prj_Athena_PurpleMouse_C) == 0x000900, "Wrong size on AB_Prj_Athena_PurpleMouse_C");
static_assert(offsetof(AB_Prj_Athena_PurpleMouse_C, UberGraphFrame_B_Prj_Athena_PurpleMouse_C) == 0x0008E8, "Member 'AB_Prj_Athena_PurpleMouse_C::UberGraphFrame_B_Prj_Athena_PurpleMouse_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_PurpleMouse_C, StaticMesh) == 0x0008F0, "Member 'AB_Prj_Athena_PurpleMouse_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_PurpleMouse_C, Team) == 0x0008F8, "Member 'AB_Prj_Athena_PurpleMouse_C::Team' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_PurpleMouse_C, TeamHasBeenSet) == 0x0008F9, "Member 'AB_Prj_Athena_PurpleMouse_C::TeamHasBeenSet' has a wrong offset!");

}

