#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PrjPawn_Athena_RCRocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_PrjPawn_Athena_RCRocket.B_PrjPawn_Athena_RCRocket_C
// 0x0160 (0x33D0 - 0x3270)
class AB_PrjPawn_Athena_RCRocket_C final : public AFortRemoteControlledPawnAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Jet_Launch;                                        // 0x3278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RideBox;                                           // 0x3280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          HitBox;                                            // 0x3288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 PoseableMissileMesh;                               // 0x3290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BlinkingLight;                                     // 0x3298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LoadMissile;                                       // 0x32A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Jet;                                               // 0x32A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MissileInAirBankingAudio;                          // 0x32B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MissileInAirAudio;                                 // 0x32B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ScaleUpRocket_ScaleRocket_AE4726BD4835EF8E9D886681DC468461; // 0x32C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScaleUpRocket__Direction_AE4726BD4835EF8E9D886681DC468461; // 0x32CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77A8[0x3];                                     // 0x32CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleUpRocket;                                     // 0x32D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDetached;                                         // 0x32D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bTransformed;                                      // 0x32D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77A9[0x6];                                     // 0x32DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ExplosionSound;                                    // 0x32E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ExplosionPS;                                       // 0x32E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        TransformationPS;                                  // 0x32F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransformationSound;                               // 0x32F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x3300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentVector;                                     // 0x3304(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousVector;                                    // 0x3310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelOutRotation;                                  // 0x331C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Turn_Rate;                                         // 0x3320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BankingAudioVolume;                                // 0x3324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BankingAudioPitch;                                 // 0x3328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnAudioModulator;                                // 0x332C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnAudioModulatorMax;                             // 0x3330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LeftWing;                                          // 0x3334(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightWing;                                         // 0x333C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TopWing;                                           // 0x3344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BottomWing;                                        // 0x334C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77AA[0x4];                                     // 0x3354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_RCRocket_Launcher_Athena_C*          MissileLauncher;                                   // 0x3358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SwapToIdleAnim;                                    // 0x3360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ControllerAnim;                                    // 0x3368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutTime;                                       // 0x3370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeMeshSwap;                               // 0x3374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxFuelAmount;                                     // 0x3378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77AB[0x4];                                     // 0x337C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FuelTimer;                                         // 0x3380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MissileInAirSound;                                 // 0x3388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MissileLowFuelSound;                               // 0x3390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Missile_LowFuelWarning;                            // 0x3398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ControllerRocketFX;                                // 0x33A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ScreenSoundComponent;                              // 0x33A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayToggleRC_Vis;                                 // 0x33B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77AC[0x4];                                     // 0x33B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        HologramRocket;                                    // 0x33B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPlayedFuelWarningSound;                        // 0x33C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_PrjPawn_Athena_RCRocket(int32 EntryPoint);
	void BndEvt__HitBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnClientSetupRemoteControlPawn();
	void StartFuelTimer();
	void ResetWeapon();
	void Handle_Movement_Audio();
	void LevelOutMissile();
	void SetPreviousVector();
	void Multicast_HandleOnKill();
	void OnDoKill();
	void ReceiveTick(float DeltaSeconds);
	void OnTriggeredHealthThreshold(float PreviousTriggeredHealthThreshold, float CurrentTriggeredHealthThreshold);
	void ReceiveUnpossessed(class AController* OldController);
	void ReceiveBeginPlay();
	void OnCompleted_FCA2D54B4941303C809ADFA4DDC7D622(class FName NotifyName);
	void OnBlendOut_FCA2D54B4941303C809ADFA4DDC7D622(class FName NotifyName);
	void OnInterrupted_FCA2D54B4941303C809ADFA4DDC7D622(class FName NotifyName);
	void OnNotifyBegin_FCA2D54B4941303C809ADFA4DDC7D622(class FName NotifyName);
	void OnNotifyEnd_FCA2D54B4941303C809ADFA4DDC7D622(class FName NotifyName);
	void OnCompleted_1C6565004725732561E54185F8C600B6(class FName NotifyName);
	void OnBlendOut_1C6565004725732561E54185F8C600B6(class FName NotifyName);
	void OnInterrupted_1C6565004725732561E54185F8C600B6(class FName NotifyName);
	void OnNotifyBegin_1C6565004725732561E54185F8C600B6(class FName NotifyName);
	void OnNotifyEnd_1C6565004725732561E54185F8C600B6(class FName NotifyName);
	void ScaleUpRocket__UpdateFunc();
	void ScaleUpRocket__FinishedFunc();
	void OnRep_bDetached();
	void FuelLevelVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_PrjPawn_Athena_RCRocket_C">();
	}
	static class AB_PrjPawn_Athena_RCRocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_PrjPawn_Athena_RCRocket_C>();
	}
};
static_assert(alignof(AB_PrjPawn_Athena_RCRocket_C) == 0x000010, "Wrong alignment on AB_PrjPawn_Athena_RCRocket_C");
static_assert(sizeof(AB_PrjPawn_Athena_RCRocket_C) == 0x0033D0, "Wrong size on AB_PrjPawn_Athena_RCRocket_C");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, UberGraphFrame) == 0x003270, "Member 'AB_PrjPawn_Athena_RCRocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, Jet_Launch) == 0x003278, "Member 'AB_PrjPawn_Athena_RCRocket_C::Jet_Launch' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, RideBox) == 0x003280, "Member 'AB_PrjPawn_Athena_RCRocket_C::RideBox' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, HitBox) == 0x003288, "Member 'AB_PrjPawn_Athena_RCRocket_C::HitBox' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, PoseableMissileMesh) == 0x003290, "Member 'AB_PrjPawn_Athena_RCRocket_C::PoseableMissileMesh' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, BlinkingLight) == 0x003298, "Member 'AB_PrjPawn_Athena_RCRocket_C::BlinkingLight' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, LoadMissile) == 0x0032A0, "Member 'AB_PrjPawn_Athena_RCRocket_C::LoadMissile' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, Jet) == 0x0032A8, "Member 'AB_PrjPawn_Athena_RCRocket_C::Jet' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MissileInAirBankingAudio) == 0x0032B0, "Member 'AB_PrjPawn_Athena_RCRocket_C::MissileInAirBankingAudio' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MissileInAirAudio) == 0x0032B8, "Member 'AB_PrjPawn_Athena_RCRocket_C::MissileInAirAudio' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ScaleUpRocket_ScaleRocket_AE4726BD4835EF8E9D886681DC468461) == 0x0032C0, "Member 'AB_PrjPawn_Athena_RCRocket_C::ScaleUpRocket_ScaleRocket_AE4726BD4835EF8E9D886681DC468461' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ScaleUpRocket__Direction_AE4726BD4835EF8E9D886681DC468461) == 0x0032CC, "Member 'AB_PrjPawn_Athena_RCRocket_C::ScaleUpRocket__Direction_AE4726BD4835EF8E9D886681DC468461' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ScaleUpRocket) == 0x0032D0, "Member 'AB_PrjPawn_Athena_RCRocket_C::ScaleUpRocket' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, bDetached) == 0x0032D8, "Member 'AB_PrjPawn_Athena_RCRocket_C::bDetached' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, bTransformed) == 0x0032D9, "Member 'AB_PrjPawn_Athena_RCRocket_C::bTransformed' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ExplosionSound) == 0x0032E0, "Member 'AB_PrjPawn_Athena_RCRocket_C::ExplosionSound' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ExplosionPS) == 0x0032E8, "Member 'AB_PrjPawn_Athena_RCRocket_C::ExplosionPS' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, TransformationPS) == 0x0032F0, "Member 'AB_PrjPawn_Athena_RCRocket_C::TransformationPS' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, TransformationSound) == 0x0032F8, "Member 'AB_PrjPawn_Athena_RCRocket_C::TransformationSound' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, Tick_Delta) == 0x003300, "Member 'AB_PrjPawn_Athena_RCRocket_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, CurrentVector) == 0x003304, "Member 'AB_PrjPawn_Athena_RCRocket_C::CurrentVector' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, PreviousVector) == 0x003310, "Member 'AB_PrjPawn_Athena_RCRocket_C::PreviousVector' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, LevelOutRotation) == 0x00331C, "Member 'AB_PrjPawn_Athena_RCRocket_C::LevelOutRotation' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, Turn_Rate) == 0x003320, "Member 'AB_PrjPawn_Athena_RCRocket_C::Turn_Rate' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, BankingAudioVolume) == 0x003324, "Member 'AB_PrjPawn_Athena_RCRocket_C::BankingAudioVolume' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, BankingAudioPitch) == 0x003328, "Member 'AB_PrjPawn_Athena_RCRocket_C::BankingAudioPitch' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, TurnAudioModulator) == 0x00332C, "Member 'AB_PrjPawn_Athena_RCRocket_C::TurnAudioModulator' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, TurnAudioModulatorMax) == 0x003330, "Member 'AB_PrjPawn_Athena_RCRocket_C::TurnAudioModulatorMax' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, LeftWing) == 0x003334, "Member 'AB_PrjPawn_Athena_RCRocket_C::LeftWing' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, RightWing) == 0x00333C, "Member 'AB_PrjPawn_Athena_RCRocket_C::RightWing' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, TopWing) == 0x003344, "Member 'AB_PrjPawn_Athena_RCRocket_C::TopWing' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, BottomWing) == 0x00334C, "Member 'AB_PrjPawn_Athena_RCRocket_C::BottomWing' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MissileLauncher) == 0x003358, "Member 'AB_PrjPawn_Athena_RCRocket_C::MissileLauncher' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, SwapToIdleAnim) == 0x003360, "Member 'AB_PrjPawn_Athena_RCRocket_C::SwapToIdleAnim' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ControllerAnim) == 0x003368, "Member 'AB_PrjPawn_Athena_RCRocket_C::ControllerAnim' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, FadeOutTime) == 0x003370, "Member 'AB_PrjPawn_Athena_RCRocket_C::FadeOutTime' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, DelayBeforeMeshSwap) == 0x003374, "Member 'AB_PrjPawn_Athena_RCRocket_C::DelayBeforeMeshSwap' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MaxFuelAmount) == 0x003378, "Member 'AB_PrjPawn_Athena_RCRocket_C::MaxFuelAmount' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, FuelTimer) == 0x003380, "Member 'AB_PrjPawn_Athena_RCRocket_C::FuelTimer' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MissileInAirSound) == 0x003388, "Member 'AB_PrjPawn_Athena_RCRocket_C::MissileInAirSound' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, MissileLowFuelSound) == 0x003390, "Member 'AB_PrjPawn_Athena_RCRocket_C::MissileLowFuelSound' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, Missile_LowFuelWarning) == 0x003398, "Member 'AB_PrjPawn_Athena_RCRocket_C::Missile_LowFuelWarning' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ControllerRocketFX) == 0x0033A0, "Member 'AB_PrjPawn_Athena_RCRocket_C::ControllerRocketFX' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, ScreenSoundComponent) == 0x0033A8, "Member 'AB_PrjPawn_Athena_RCRocket_C::ScreenSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, DelayToggleRC_Vis) == 0x0033B0, "Member 'AB_PrjPawn_Athena_RCRocket_C::DelayToggleRC_Vis' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, HologramRocket) == 0x0033B8, "Member 'AB_PrjPawn_Athena_RCRocket_C::HologramRocket' has a wrong offset!");
static_assert(offsetof(AB_PrjPawn_Athena_RCRocket_C, bHasPlayedFuelWarningSound) == 0x0033C0, "Member 'AB_PrjPawn_Athena_RCRocket_C::bHasPlayedFuelWarningSound' has a wrong offset!");

}

