#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Arrow_ExplodeOnImpact_Athena_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Arrow_ExplodeOnImpact_Athena_Parent.B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C
// 0x00A8 (0x0A38 - 0x0990)
class AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0990(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ProjectileTrail;                                   // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GrenadeFuse_AudioComponent;                        // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Explosion;                                       // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_DistantSound;                                  // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExplosionCameraShake;                              // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedback;                            // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HitRotation;                                       // 0x09F0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F38[0x4];                                     // 0x09FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               SpawnedTrail;                                      // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0A08(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         DrawDistance;                                      // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitPlayer;                                         // 0x0A18(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F39[0x3];                                     // 0x0A19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DecalSize;                                         // 0x0A1C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0A28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WaterImpactFX;                                     // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Arrow_ExplodeOnImpact_Athena_Parent(int32 EntryPoint);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveBeginPlay();
	void Event_Building_Actor_Destroyed();
	void UserConstructionScript();
	void OnRep_HitLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C">();
	}
	static class AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C>();
	}
};
static_assert(alignof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C) == 0x000008, "Wrong alignment on AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C");
static_assert(sizeof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C) == 0x000A38, "Wrong size on AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, UberGraphFrame) == 0x000990, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, ProjectileTrail) == 0x000998, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::ProjectileTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, TracerMesh) == 0x0009A0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, RotatingMovement) == 0x0009A8, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, GrenadeFuse_AudioComponent) == 0x0009B0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::GrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, P_Explosion) == 0x0009B8, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, Cue_DistantSound) == 0x0009C0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, Cue_CloseSound) == 0x0009C8, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, ExplosionCameraShake) == 0x0009D0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::ExplosionCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, ExplosionForceFeedback) == 0x0009D8, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::ExplosionForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, ExplosionForceFeedbackNear) == 0x0009E0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, ExplosionForceFeedbackFar) == 0x0009E8, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::ExplosionForceFeedbackFar' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, HitRotation) == 0x0009F0, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::HitRotation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, SpawnedTrail) == 0x000A00, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::SpawnedTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, HitLocation) == 0x000A08, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, DrawDistance) == 0x000A14, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::DrawDistance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, HitPlayer) == 0x000A18, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::HitPlayer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, DecalSize) == 0x000A1C, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::DecalSize' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, FeedbackCue) == 0x000A28, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::FeedbackCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C, WaterImpactFX) == 0x000A30, "Member 'AB_Prj_Arrow_ExplodeOnImpact_Athena_Parent_C::WaterImpactFX' has a wrong offset!");

}

