#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_FringePlankSecondary_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Prj_Athena_Generic_CurieFireball_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_FringePlankSecondary_Athena.B_Prj_Ranged_FringePlankSecondary_Athena_C
// 0x0048 (0x08F0 - 0x08A8)
class AB_Prj_Ranged_FringePlankSecondary_Athena_C final : public AB_Prj_Athena_Generic_CurieFireball_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C; // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_GL_Ribbon_SmokeTrail;                            // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingAudioTell;                                  // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        IntoWaterEffects;                                  // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HitWater_NoFire_Sound;                             // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BurnoutTime;                                       // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x08DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Impact_Sound;                                      // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ranged_FringePlankSecondary_Athena(int32 EntryPoint);
	void Play_Impact_Sound();
	void Burnout();
	void ReceiveBeginPlay();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnStop(const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_FringePlankSecondary_Athena_C">();
	}
	static class AB_Prj_Ranged_FringePlankSecondary_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_FringePlankSecondary_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Ranged_FringePlankSecondary_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x0008F0, "Wrong size on AB_Prj_Ranged_FringePlankSecondary_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C) == 0x0008A8, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::UberGraphFrame_B_Prj_Ranged_FringePlankSecondary_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, P_GL_Ribbon_SmokeTrail) == 0x0008B0, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::P_GL_Ribbon_SmokeTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, BP_SurfaceTypeSoundComponent) == 0x0008B8, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, LoopingAudioTell) == 0x0008C0, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::LoopingAudioTell' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, IntoWaterEffects) == 0x0008C8, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::IntoWaterEffects' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, HitWater_NoFire_Sound) == 0x0008D0, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::HitWater_NoFire_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, BurnoutTime) == 0x0008D8, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::BurnoutTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, Impact_Point) == 0x0008DC, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::Impact_Point' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_FringePlankSecondary_Athena_C, Impact_Sound) == 0x0008E8, "Member 'AB_Prj_Ranged_FringePlankSecondary_Athena_C::Impact_Sound' has a wrong offset!");

}

