#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Generic_CurieFireball_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_Generic_CurieFireball_Parent.B_Prj_Athena_Generic_CurieFireball_Parent_C.ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent
// 0x0120 (0x0120 - 0x0000)
struct B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0050(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_61A6[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Line_Trace_for_Mesh_Angle_ReturnValue;    // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent) == 0x000010, "Wrong alignment on B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent");
static_assert(sizeof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent) == 0x000120, "Wrong size on B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_MyComp) == 0x000010, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_Other) == 0x000018, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_OtherComp) == 0x000020, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_bSelfMoved) == 0x000028, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_HitLocation) == 0x00002C, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_HitNormal) == 0x000038, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_NormalImpulse) == 0x000044, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, K2Node_Event_Hit) == 0x000050, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, CallFunc_Line_Trace_for_Mesh_Angle_ReturnValue) == 0x0000E0, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::CallFunc_Line_Trace_for_Mesh_Angle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000110, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000118, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ExecuteUbergraph_B_Prj_Athena_Generic_CurieFireball_Parent::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_Generic_CurieFireball_Parent.B_Prj_Athena_Generic_CurieFireball_Parent_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A7[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit) == 0x0000D0, "Wrong size on B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, HitNormal) == 0x000028, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit, Hit) == 0x000040, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_Athena_Generic_CurieFireball_Parent.B_Prj_Athena_Generic_CurieFireball_Parent_C.Line Trace for Mesh Angle
// 0x0260 (0x0260 - 0x0000)
struct B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61A8[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0098(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A9[0x1];                                     // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61AA[0xC];                                     // 0x01C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue_1;            // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle) == 0x000010, "Wrong alignment on B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle");
static_assert(sizeof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle) == 0x000260, "Wrong size on B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, ReturnValue) == 0x000000, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, Temp_object_Variable) == 0x000040, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_LineTraceSingle_OutHit) == 0x000098, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_LineTraceSingle_ReturnValue) == 0x000124, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_bBlockingHit) == 0x000125, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_bInitialOverlap) == 0x000126, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_Time) == 0x000128, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_Distance) == 0x00012C, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_ImpactPoint) == 0x00013C, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_Normal) == 0x000148, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_ImpactNormal) == 0x000154, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_HitItem) == 0x000180, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_FaceIndex) == 0x000184, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_TraceStart) == 0x000188, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_BreakHitResult_TraceEnd) == 0x000194, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001A0, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_MakeRotFromZX_ReturnValue) == 0x0001AC, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001B8, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_MakeTransform_ReturnValue_1) == 0x0001D0, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_SelectTransform_ReturnValue) == 0x000200, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_SelectTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle, CallFunc_SelectTransform_ReturnValue_1) == 0x000230, "Member 'B_Prj_Athena_Generic_CurieFireball_Parent_C_Line_Trace_for_Mesh_Angle::CallFunc_SelectTransform_ReturnValue_1' has a wrong offset!");

}

