#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Generic_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_Generic_Athena.B_Ranged_Generic_Athena_C.ExecuteUbergraph_B_Ranged_Generic_Athena
// 0x0AB0 (0x0AB0 - 0x0000)
struct B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseFirstPersonTargeting_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6775[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6776[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MathExpression_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6777[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortAIPawn*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_Or_Disable;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6778[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_StencilBufferValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAlterationItemDefinition*          K2Node_Event_NewAlteration;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0070(0x05B8)()
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_1;                // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x062A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_2;                // 0x062B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_3;                // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6779[0x3];                                     // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeToNextFire_ReturnValue;            // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue;            // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_677A[0x2];                                     // 0x064A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_677B[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_677C[0x2];                                     // 0x068A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit_1;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_677D[0x4];                                     // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_677E[0x3];                                     // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit;                    // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingFirstPersonCamera_ReturnValue;     // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue; // 0x06BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_677F[0x1];                                     // 0x06BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6780[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWindManager*                       CallFunc_GetWindManager_ReturnValue;               // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetADSTransitionInTime_ReturnValue;       // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x06E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6781[0x4];                                     // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6782[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6783[0x7];                                     // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_1;          // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6784[0x6];                                     // 0x0732(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6785[0x4];                                     // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6786[0x7];                                     // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_1; // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6787[0x3];                                     // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_3;                  // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6788[0x7];                                     // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_4;                  // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6789[0x7];                                     // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_2; // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678A[0x2];                                     // 0x07A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x07A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x07B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x07BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x07CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_2;          // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x07DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x07DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678B[0x1];                                     // 0x07DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678C[0x3];                                     // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678D[0x2];                                     // 0x07F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue_1;     // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x07FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsTargeting_ReturnValue_1;             // 0x07FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678E[0x4];                                     // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetWeaponDataSmallPreviewImage_ReturnValue; // 0x0800(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayPersistentFireFX_ReturnValue;   // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_678F[0x7];                                     // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetOrLoadSynchronously_ReturnValue;       // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetBeamPSC_ReturnValue;                   // 0x0838(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseBeamParticles_ReturnValue;          // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6790[0x7];                                     // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6791[0x7];                                     // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_2;            // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6792[0x7];                                     // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_SetBeamParticleSystem_ReturnValue;        // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_3;            // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6793[0x3];                                     // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x088C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x089C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6794[0x4];                                     // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            CallFunc_Array_Get_Item;                           // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x08C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6795[0x2];                                     // 0x08C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x08C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x08CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6796[0x5];                                     // 0x08CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x08D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0900(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0930(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x093C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0948(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0954(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0960(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x096C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0984(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x098C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0994(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x09A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x09A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x09B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x09B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x09C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x09C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x09D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6797[0x3];                                     // 0x0A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0A6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0A74(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0A84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0A88(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0A94(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0AA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena) == 0x000010, "Wrong alignment on B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena");
static_assert(sizeof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena) == 0x000AB0, "Wrong size on B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, EntryPoint) == 0x000000, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetPI_ReturnValue) == 0x000004, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_UseFirstPersonTargeting_ReturnValue) == 0x00000C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_UseFirstPersonTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, Temp_int_Array_Index_Variable) == 0x000014, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000019, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_bPersistentFire) == 0x00001A, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_bSecondaryFire) == 0x00001B, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_ReloadStage) == 0x00001C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_MathExpression_ReturnValue) == 0x000024, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_MathExpression_ReturnValue_1) == 0x000028, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_bNewIsTargeting) == 0x000029, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue) == 0x00002A, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SetHiddenInGameControllerOnly_ReturnValue) == 0x00002B, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SetHiddenInGameControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1) == 0x00002C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_Enable_Or_Disable) == 0x000040, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_Enable_Or_Disable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_StencilBufferValue) == 0x000044, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_StencilBufferValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000058, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000060, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_NewAlteration) == 0x000068, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_NewAlteration' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_Event_CosmeticMod) == 0x000070, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsAssetNull_ReturnValue) == 0x000628, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsAssetNull_ReturnValue_1) == 0x000629, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsAssetNull_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Not_PreBool_ReturnValue) == 0x00062A, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsAssetNull_ReturnValue_2) == 0x00062B, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsAssetNull_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsAssetNull_ReturnValue_3) == 0x00062C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsAssetNull_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetTimeToNextFire_ReturnValue) == 0x000630, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetTimeToNextFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000634, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000638, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00063C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_K2_SetTimer_ReturnValue) == 0x000640, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_UseScopeTargeting_ReturnValue) == 0x000648, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_UseScopeTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsValid_ReturnValue) == 0x000649, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetSocketLocation_ReturnValue) == 0x00064C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000658, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, Temp_object_Variable) == 0x000660, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigator_ReturnValue) == 0x000668, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsParticle_System) == 0x000670, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess) == 0x000678, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Pawn) == 0x000680, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_1) == 0x000688, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_Enable_1) == 0x000689, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_TargetLimit_1) == 0x00068C, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_TargetLimit_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000690, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SelectInt_ReturnValue) == 0x000698, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0006A0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_Loaded) == 0x0006A8, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_Enable) == 0x0006B0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CustomEvent_TargetLimit) == 0x0006B4, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CustomEvent_TargetLimit' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_SelectInt_ReturnValue_1) == 0x0006B8, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsUsingFirstPersonCamera_ReturnValue) == 0x0006BC, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsUsingFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue) == 0x0006BD, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006BE, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigatorController_ReturnValue) == 0x0006C0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x0006C8, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_2) == 0x0006D0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetWindManager_ReturnValue) == 0x0006D8, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetWindManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetADSTransitionInTime_ReturnValue) == 0x0006E0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetADSTransitionInTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_CreateDelegate_OutputDelegate_1) == 0x0006E4, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigator_ReturnValue_1) == 0x0006F8, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, Temp_object_Variable_1) == 0x000700, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000708, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_3) == 0x000710, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsParticle_System_1) == 0x000718, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsParticle_System_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_4) == 0x000720, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000728, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_UseScopeTargeting_ReturnValue_1) == 0x000730, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_UseScopeTargeting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsValid_ReturnValue_1) == 0x000731, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigator_ReturnValue_2) == 0x000738, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, Temp_int_Loop_Counter_Variable) == 0x000740, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Pawn_2) == 0x000748, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Pawn_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_5) == 0x000750, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetLocalViewingPlayerController_ReturnValue_1) == 0x000758, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetLocalViewingPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_Add_IntInt_ReturnValue) == 0x000760, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsValid_ReturnValue_2) == 0x000764, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigator_ReturnValue_3) == 0x000768, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetInstigator_ReturnValue_4) == 0x000770, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetInstigator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Pawn_3) == 0x000778, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Pawn_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_6) == 0x000780, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_AsFort_Pawn_4) == 0x000788, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_AsFort_Pawn_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, K2Node_DynamicCast_bSuccess_7) == 0x000790, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_GetLocalViewingPlayerController_ReturnValue_2) == 0x000798, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_GetLocalViewingPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena, CallFunc_IsValid_ReturnValue_3) == 0x0007A0, "Member 'B_Ranged_Generic_Athena_C_ExecuteUbergraph_B_Ranged_Generic_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
