#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena.B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C.ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena
// 0x0080 (0x0080 - 0x0000)
struct B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC2[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC5[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC6[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC7[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC8[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena) == 0x000008, "Wrong alignment on B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena");
static_assert(sizeof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena) == 0x000080, "Wrong size on B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, EntryPoint) == 0x000000, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_Event_bNewIsTargeting) == 0x000009, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_AsFort_Pawn) == 0x000020, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000030, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetInstigator_ReturnValue_1) == 0x000040, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetIsTargeting_ReturnValue) == 0x000048, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetIsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000050, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetLocalViewingPlayerController_ReturnValue_1) == 0x000060, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetLocalViewingPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, CallFunc_GetIsTargeting_ReturnValue_1) == 0x000068, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::CallFunc_GetIsTargeting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000070, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena.B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C.OnSetTargeting
// 0x0001 (0x0001 - 0x0000)
struct B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting) == 0x000001, "Wrong alignment on B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting");
static_assert(sizeof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting) == 0x000001, "Wrong size on B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting");
static_assert(offsetof(B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting, bNewIsTargeting) == 0x000000, "Member 'B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C_OnSetTargeting::bNewIsTargeting' has a wrong offset!");

}

