#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RocketLauncher_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_RocketLauncher_Generic.B_RocketLauncher_Generic_C
// 0x0020 (0x1290 - 0x1270)
class AB_RocketLauncher_Generic_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_RocketLauncher_Generic_C;         // 0x1270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               RearMuzzle;                                        // 0x1278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_Offset;                                   // 0x1280(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_RocketLauncher_Generic(int32 EntryPoint);
	void Muzzle_Flash_FX(bool Persistent_Fire);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_RocketLauncher_Generic_C">();
	}
	static class AB_RocketLauncher_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_RocketLauncher_Generic_C>();
	}
};
static_assert(alignof(AB_RocketLauncher_Generic_C) == 0x000008, "Wrong alignment on AB_RocketLauncher_Generic_C");
static_assert(sizeof(AB_RocketLauncher_Generic_C) == 0x001290, "Wrong size on AB_RocketLauncher_Generic_C");
static_assert(offsetof(AB_RocketLauncher_Generic_C, UberGraphFrame_B_RocketLauncher_Generic_C) == 0x001270, "Member 'AB_RocketLauncher_Generic_C::UberGraphFrame_B_RocketLauncher_Generic_C' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Generic_C, RearMuzzle) == 0x001278, "Member 'AB_RocketLauncher_Generic_C::RearMuzzle' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Generic_C, Rotation_Offset) == 0x001280, "Member 'AB_RocketLauncher_Generic_C::Rotation_Offset' has a wrong offset!");

}

