#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ShootingTarget_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.ExecuteUbergraph_B_ShootingTarget_Master
// 0x0590 (0x0590 - 0x0000)
struct B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAttachToMinigame_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6533[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6534[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6535[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6536[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable_6;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6537[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_MinigameJustStartedOrStopped;   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPopUp_CanPopUp;                        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6538[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6539[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653A[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00D0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldTriggerTarget_Result;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653B[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653C[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653D[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0190(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01BC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0258(0x0018)()
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653E[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_WeakPointWasHit_HitComponent;             // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeakPointWasHit_ReturnValue;              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_653F[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AwardScore_ScoreAwarded;                  // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AwardScore_TeamAwardedPoints;             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TargetShouldFall_ReturnValue;             // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6540[0x2];                                     // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimerDuration;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6541[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InJumpUpPosition;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6542[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02AC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Get_Item;                           // 0x0350(0x0028)(HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Knocked_Down_;                  // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6543[0x3];                                     // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Check_for_Positive_Score;       // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Instigator;                     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6544[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6545[0xE];                                     // 0x03C2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_ImpactTransform;                // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0430(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6546[0x4];                                     // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x04D4(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x04E4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Jump_Up_;                       // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6547[0x3];                                     // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_2;                           // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeakPointArrayContainsItems_ArrayContainsItems; // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master) == 0x000010, "Wrong alignment on B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master");
static_assert(sizeof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master) == 0x000590, "Wrong size on B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, EntryPoint) == 0x000000, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_TryAttachToMinigame_ReturnValue) == 0x000004, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_TryAttachToMinigame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable) == 0x000024, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable) == 0x000028, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_1) == 0x000030, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable_1) == 0x000038, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_2) == 0x000040, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_3) == 0x000048, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable_2) == 0x000050, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_4) == 0x000058, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_5) == 0x000060, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Loaded) == 0x000068, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_6) == 0x000080, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_AsStatic_Mesh) == 0x000088, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_GetMaxHealth_ReturnValue) == 0x000094, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_MinigameJustStartedOrStopped) == 0x00009C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_MinigameJustStartedOrStopped' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_CanPopUp_CanPopUp) == 0x00009D, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_CanPopUp_CanPopUp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_int_Variable) == 0x0000A4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000C8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000CC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_SweepResult) == 0x0000D0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00015C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_ShouldTriggerTarget_Result) == 0x000160, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_ShouldTriggerTarget_Result' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_2) == 0x000164, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000174, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MatchReadyAsync_ReturnValue) == 0x000178, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000188, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValid_ReturnValue_1) == 0x000189, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00018A, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_Damage) == 0x00018C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_DamageTags) == 0x000190, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_Momentum) == 0x0001B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_HitInfo) == 0x0001BC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_InstigatedBy) == 0x000248, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_DamageCauser) == 0x000250, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_EffectContext) == 0x000258, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000270, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_bSuccess_1) == 0x000278, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointWasHit_HitComponent) == 0x000280, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointWasHit_HitComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointWasHit_ReturnValue) == 0x000288, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointWasHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_AwardScore_ScoreAwarded) == 0x00028C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_AwardScore_ScoreAwarded' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_AwardScore_TeamAwardedPoints) == 0x000290, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_AwardScore_TeamAwardedPoints' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_TargetShouldFall_ReturnValue) == 0x000294, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_TargetShouldFall_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsDedicatedServer_ReturnValue) == 0x000295, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_TimerDuration) == 0x000298, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_TimerDuration' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002A0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_InJumpUpPosition) == 0x0002A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_InJumpUpPosition' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002AC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000338, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_3) == 0x000340, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Array_Get_Item) == 0x000350, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Array_Get_Item_1) == 0x000378, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000380, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Knocked_Down_) == 0x00038C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Knocked_Down_' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default) == 0x000390, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000398, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Check_for_Positive_Score) == 0x0003A4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Check_for_Positive_Score' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Instigator) == 0x0003A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsLocalController_ReturnValue) == 0x0003B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default_1) == 0x0003B8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BooleanAND_ReturnValue) == 0x0003C0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003C1, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_ImpactTransform) == 0x0003D0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_ImpactTransform' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeRotator_ReturnValue) == 0x000400, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Location) == 0x00040C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Rotation) == 0x000418, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Scale) == 0x000424, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000430, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0004C0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeRotator_ReturnValue_1) == 0x0004C8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_4) == 0x0004D4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0004E4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Jump_Up_) == 0x000570, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Jump_Up_' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000574, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default_2) == 0x000580, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointArrayContainsItems_ArrayContainsItems) == 0x000588, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointArrayContainsItems_ArrayContainsItems' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_SetStaticMesh_ReturnValue) == 0x000589, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Target Movement Audio
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Target_Movement_Audio final
{
public:
	bool                                          Jump_Up_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Target_Movement_Audio) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Target_Movement_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Target_Movement_Audio) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Target_Movement_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Target_Movement_Audio, Jump_Up_) == 0x000000, "Member 'B_ShootingTarget_Master_C_Target_Movement_Audio::Jump_Up_' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.SpawnWeakpointFX
// 0x0030 (0x0030 - 0x0000)
struct B_ShootingTarget_Master_C_SpawnWeakpointFX final
{
public:
	struct FTransform                             ImpactTransform;                                   // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_SpawnWeakpointFX) == 0x000010, "Wrong alignment on B_ShootingTarget_Master_C_SpawnWeakpointFX");
static_assert(sizeof(B_ShootingTarget_Master_C_SpawnWeakpointFX) == 0x000030, "Wrong size on B_ShootingTarget_Master_C_SpawnWeakpointFX");
static_assert(offsetof(B_ShootingTarget_Master_C_SpawnWeakpointFX, ImpactTransform) == 0x000000, "Member 'B_ShootingTarget_Master_C_SpawnWeakpointFX::ImpactTransform' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Impact Audio
// 0x0010 (0x0010 - 0x0000)
struct B_ShootingTarget_Master_C_Impact_Audio final
{
public:
	int32                                         Check_for_Positive_Score;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6548[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Param_Instigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ShootingTarget_Master_C_Impact_Audio) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_Impact_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Impact_Audio) == 0x000010, "Wrong size on B_ShootingTarget_Master_C_Impact_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Impact_Audio, Check_for_Positive_Score) == 0x000000, "Member 'B_ShootingTarget_Master_C_Impact_Audio::Check_for_Positive_Score' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_Impact_Audio, Param_Instigator) == 0x000008, "Member 'B_ShootingTarget_Master_C_Impact_Audio::Param_Instigator' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Knock Down Audio
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Knock_Down_Audio final
{
public:
	bool                                          Knocked_Down_;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Knock_Down_Audio) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Knock_Down_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Knock_Down_Audio) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Knock_Down_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Knock_Down_Audio, Knocked_Down_) == 0x000000, "Member 'B_ShootingTarget_Master_C_Knock_Down_Audio::Knocked_Down_' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Hop
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Hop final
{
public:
	bool                                          Param_InJumpUpPosition;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Hop) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Hop");
static_assert(sizeof(B_ShootingTarget_Master_C_Hop) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Hop");
static_assert(offsetof(B_ShootingTarget_Master_C_Hop, Param_InJumpUpPosition) == 0x000000, "Member 'B_ShootingTarget_Master_C_Hop::Param_InJumpUpPosition' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.SetHideTargetTimer
// 0x0004 (0x0004 - 0x0000)
struct B_ShootingTarget_Master_C_SetHideTargetTimer final
{
public:
	float                                         TimerDuration;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ShootingTarget_Master_C_SetHideTargetTimer) == 0x000004, "Wrong alignment on B_ShootingTarget_Master_C_SetHideTargetTimer");
static_assert(sizeof(B_ShootingTarget_Master_C_SetHideTargetTimer) == 0x000004, "Wrong size on B_ShootingTarget_Master_C_SetHideTargetTimer");
static_assert(offsetof(B_ShootingTarget_Master_C_SetHideTargetTimer, TimerDuration) == 0x000000, "Member 'B_ShootingTarget_Master_C_SetHideTargetTimer::TimerDuration' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct B_ShootingTarget_Master_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6549[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_ShootingTarget_Master_C_OnDamageServer) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_OnDamageServer");
static_assert(sizeof(B_ShootingTarget_Master_C_OnDamageServer) == 0x0000E8, "Wrong size on B_ShootingTarget_Master_C_OnDamageServer");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, Damage) == 0x000000, "Member 'B_ShootingTarget_Master_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, DamageTags) == 0x000008, "Member 'B_ShootingTarget_Master_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, Momentum) == 0x000028, "Member 'B_ShootingTarget_Master_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, HitInfo) == 0x000034, "Member 'B_ShootingTarget_Master_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'B_ShootingTarget_Master_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'B_ShootingTarget_Master_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'B_ShootingTarget_Master_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_654A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.PopUpTarget
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_PopUpTarget final
{
public:
	bool                                          MinigameJustStartedOrStopped;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_PopUpTarget) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_PopUpTarget");
static_assert(sizeof(B_ShootingTarget_Master_C_PopUpTarget) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_PopUpTarget");
static_assert(offsetof(B_ShootingTarget_Master_C_PopUpTarget, MinigameJustStartedOrStopped) == 0x000000, "Member 'B_ShootingTarget_Master_C_PopUpTarget::MinigameJustStartedOrStopped' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.OnLoaded_068F5161459B8B1AEAD4A0B19781287D
// 0x0008 (0x0008 - 0x0000)
struct B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D");
static_assert(sizeof(B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D) == 0x000008, "Wrong size on B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D");
static_assert(offsetof(B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D, Loaded) == 0x000000, "Member 'B_ShootingTarget_Master_C_OnLoaded_068F5161459B8B1AEAD4A0B19781287D::Loaded' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.CanPopUp
// 0x0008 (0x0008 - 0x0000)
struct B_ShootingTarget_Master_C_CanPopUp final
{
public:
