#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "B_Shotgun_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C
// 0x0038 (0x12A8 - 0x1270)
class AB_Shotgun_Charge_Athena_C final : public AB_Shotgun_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_Charge_Athena_C;          // 0x1270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PartialCharged_MF;                               // 0x1278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FullyCharged_MF;                                 // 0x1280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeState;                                       // 0x1288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeForSwap;                                  // 0x128C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CEE[0x3];                                     // 0x128D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             MaxChargeSwapAudio;                                // 0x1290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioVisualizerEnabled;                            // 0x1298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CEF[0x7];                                     // 0x1299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AudioVisualizerTimer;                              // 0x12A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Shotgun_Charge_Athena(int32 EntryPoint);
	void ChargeAudioVisualizer();
	void OnEndCharge();
	void OnReachedMaxCharge();
	void OnStartCharge();
	void K2_OnUnEquip();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_Charge_Athena_C">();
	}
	static class AB_Shotgun_Charge_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Charge_Athena_C>();
	}
};
static_assert(alignof(AB_Shotgun_Charge_Athena_C) == 0x000008, "Wrong alignment on AB_Shotgun_Charge_Athena_C");
static_assert(sizeof(AB_Shotgun_Charge_Athena_C) == 0x0012A8, "Wrong size on AB_Shotgun_Charge_Athena_C");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, UberGraphFrame_B_Shotgun_Charge_Athena_C) == 0x001270, "Member 'AB_Shotgun_Charge_Athena_C::UberGraphFrame_B_Shotgun_Charge_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, P_PartialCharged_MF) == 0x001278, "Member 'AB_Shotgun_Charge_Athena_C::P_PartialCharged_MF' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, P_FullyCharged_MF) == 0x001280, "Member 'AB_Shotgun_Charge_Athena_C::P_FullyCharged_MF' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, ChargeState) == 0x001288, "Member 'AB_Shotgun_Charge_Athena_C::ChargeState' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, MaxChargeForSwap) == 0x00128C, "Member 'AB_Shotgun_Charge_Athena_C::MaxChargeForSwap' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, MaxChargeSwapAudio) == 0x001290, "Member 'AB_Shotgun_Charge_Athena_C::MaxChargeSwapAudio' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, AudioVisualizerEnabled) == 0x001298, "Member 'AB_Shotgun_Charge_Athena_C::AudioVisualizerEnabled' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, AudioVisualizerTimer) == 0x0012A0, "Member 'AB_Shotgun_Charge_Athena_C::AudioVisualizerTimer' has a wrong offset!");

}

