#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C.ExecuteUbergraph_B_Shotgun_Charge_Athena
// 0x0050 (0x0050 - 0x0000)
struct B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortWeaponChargeStateForFireFX               CallFunc_GetWeaponChargeStateForFireFX_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CF0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CF1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CF2[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6CF3[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena) == 0x000008, "Wrong alignment on B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena");
static_assert(sizeof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena) == 0x000050, "Wrong size on B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, EntryPoint) == 0x000000, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, CallFunc_GetWeaponChargeStateForFireFX_ReturnValue) == 0x000004, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::CallFunc_GetWeaponChargeStateForFireFX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000018, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, K2Node_MakeArray_Array) == 0x000020, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, CallFunc_GetActorTeam_ReturnValue) == 0x000030, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, K2Node_Event_bPersistentFire) == 0x000031, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, K2Node_Event_bSecondaryFire) == 0x000032, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'B_Shotgun_Charge_Athena_C_ExecuteUbergraph_B_Shotgun_Charge_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Shotgun_Charge_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

}

