#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ToyBasketball_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_ToyBasketball_Base.B_ToyBasketball_Base_C.ExecuteUbergraph_B_ToyBasketball_Base
// 0x0150 (0x0150 - 0x0000)
struct B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84BB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_Event_OwningPC;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumTimesSummoned;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84BC[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base) == 0x000010, "Wrong alignment on B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base");
static_assert(sizeof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base) == 0x000150, "Wrong size on B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, EntryPoint) == 0x000000, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, K2Node_Event_OwningPC) == 0x000008, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::K2Node_Event_OwningPC' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, K2Node_Event_NumTimesSummoned) == 0x000010, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::K2Node_Event_NumTimesSummoned' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000014, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_VLerp_ReturnValue) == 0x000024, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_BreakTransform_Location) == 0x000060, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000C0, "Member 'B_ToyBasketball_Base_C_ExecuteUbergraph_B_ToyBasketball_Base::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function B_ToyBasketball_Base.B_ToyBasketball_Base_C.InitializeToyInstance
// 0x0010 (0x0010 - 0x0000)
struct B_ToyBasketball_Base_C_InitializeToyInstance final
{
public:
	class AFortPlayerController*                  OwningPC;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumTimesSummoned;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ToyBasketball_Base_C_InitializeToyInstance) == 0x000008, "Wrong alignment on B_ToyBasketball_Base_C_InitializeToyInstance");
static_assert(sizeof(B_ToyBasketball_Base_C_InitializeToyInstance) == 0x000010, "Wrong size on B_ToyBasketball_Base_C_InitializeToyInstance");
static_assert(offsetof(B_ToyBasketball_Base_C_InitializeToyInstance, OwningPC) == 0x000000, "Member 'B_ToyBasketball_Base_C_InitializeToyInstance::OwningPC' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_InitializeToyInstance, NumTimesSummoned) == 0x000008, "Member 'B_ToyBasketball_Base_C_InitializeToyInstance::NumTimesSummoned' has a wrong offset!");

// Function B_ToyBasketball_Base.B_ToyBasketball_Base_C.PlayScoringCueAndDestruct
// 0x0038 (0x0038 - 0x0000)
struct B_ToyBasketball_Base_C_PlayScoringCueAndDestruct final
{
public:
	int32                                         ScoreAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetStartPos;                                    // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetEndPos;                                      // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CueToPlay;                                         // 0x001C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84BD[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct) == 0x000004, "Wrong alignment on B_ToyBasketball_Base_C_PlayScoringCueAndDestruct");
static_assert(sizeof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct) == 0x000038, "Wrong size on B_ToyBasketball_Base_C_PlayScoringCueAndDestruct");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, ScoreAmount) == 0x000000, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::ScoreAmount' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, TargetStartPos) == 0x000004, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::TargetStartPos' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, TargetEndPos) == 0x000010, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::TargetEndPos' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, CueToPlay) == 0x00001C, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::CueToPlay' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, Temp_int_Variable) == 0x000024, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, Temp_bool_Variable) == 0x000028, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000029, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, K2Node_Select_Default) == 0x00002C, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_ToyBasketball_Base_C_PlayScoringCueAndDestruct, CallFunc_Array_Get_Item) == 0x000030, "Member 'B_ToyBasketball_Base_C_PlayScoringCueAndDestruct::CallFunc_Array_Get_Item' has a wrong offset!");

}

