#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgerBangsLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ExecuteUbergraph_BadgerBangsLayerAnimBP
// 0x0004 (0x0004 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP) == 0x000004, "Wrong alignment on BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP) == 0x000004, "Wrong size on BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP, EntryPoint) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ExecuteUbergraph_BadgerBangsLayerAnimBP::EntryPoint' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_AnimGraph");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_AnimGraph");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSwimJumpStart
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSwimJumpStart final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpStart;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStart) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSwimJumpStart");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStart) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSwimJumpStart");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStart, Param_ItemSwimJumpStart) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSwimJumpStart::Param_ItemSwimJumpStart' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemRelaxedEntry;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemRelaxedEntry) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemRelaxedEntry");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemRelaxedEntry) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemRelaxedEntry");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemRelaxedEntry, InPoseRelaxedEntry) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemRelaxedEntry::InPoseRelaxedEntry' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemRelaxedEntry, Param_ItemRelaxedEntry) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemRelaxedEntry::Param_ItemRelaxedEntry' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPostPivot;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot, InPoseLowerBodyJogPostPivot) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot::InPoseLowerBodyJogPostPivot' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot, Param_ItemLowerBodyJogPostPivot) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPostPivot::Param_ItemLowerBodyJogPostPivot' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPrePivot;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot, InPoseLowerBodyJogPrePivot) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot::InPoseLowerBodyJogPrePivot' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot, Param_ItemLowerBodyJogPrePivot) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogPrePivot::Param_ItemLowerBodyJogPrePivot' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStop;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop, InPoseLowerBodyJogStop) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop::InPoseLowerBodyJogStop' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop, Param_ItemLowerBodyJogStop) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStop::Param_ItemLowerBodyJogStop' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStart;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart, InPoseLowerBodyJogStart) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart::InPoseLowerBodyJogStart' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart, Param_ItemLowerBodyJogStart) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyJogStart::Param_ItemLowerBodyJogStart' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyLeanAdditive;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive, InPoseLowerBodyLeanAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive::InPoseLowerBodyLeanAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive, Param_ItemLowerBodyLeanAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyLeanAdditive::Param_ItemLowerBodyLeanAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyMovement;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement, InPoseLowerBodyMovement) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement::InPoseLowerBodyMovement' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement, Param_ItemLowerBodyMovement) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemLowerBodyMovement::Param_ItemLowerBodyMovement' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogPostPivotAdditive;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive, InPosePostPivotAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive::InPosePostPivotAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive, Param_ItemJogPostPivotAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemJogPostPivotAdditive::Param_ItemJogPostPivotAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogPrePivotAdditive;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive, InPosePrePivotAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive::InPosePrePivotAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive, Param_ItemJogPrePivotAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemJogPrePivotAdditive::Param_ItemJogPrePivotAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogStopAdditive;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJogStopAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJogStopAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJogStopAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJogStopAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogStopAdditive, InPoseJogStopAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJogStopAdditive::InPoseJogStopAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogStopAdditive, Param_ItemJogStopAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemJogStopAdditive::Param_ItemJogStopAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJogStartAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJogStartAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJogStartAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJogStartAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJogStartAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogStartAdditive, InPoseJogStartAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJogStartAdditive::InPoseJogStartAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJogStartAdditive, Param_ItemJogStartAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemJogStartAdditive::Param_ItemJogStartAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              Param_ItemFlyModeLoopAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive, Param_ItemFlyModeLoopAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemFlyModeLoopAdditive::Param_ItemFlyModeLoopAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemFlyModeStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive, Param_ItemFlyModeStartAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemFlyModeStartAdditive::Param_ItemFlyModeStartAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemZipLineStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive, Param_ItemZipLineStartAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemZipLineStartAdditive::Param_ItemZipLineStartAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              Param_ItemJetPackJumpAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive, Param_ItemJetPackJumpAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJetPackJumpAdditive::Param_ItemJetPackJumpAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              Param_ItemJetPackStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive, Param_ItemJetPackStartAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJetPackStartAdditive::Param_ItemJetPackStartAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              Param_ItemFallLandAdditive;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemFallLandAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemFallLandAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemFallLandAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemFallLandAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFallLandAdditive, Param_ItemFallLandAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemFallLandAdditive::Param_ItemFallLandAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              Param_ItemFallAdditive;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemFallAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemFallAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemFallAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemFallAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFallAdditive, Param_ItemFallAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemFallAdditive::Param_ItemFallAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              Param_ItemJumpLoopAdditive;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive, Param_ItemJumpLoopAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJumpLoopAdditive::Param_ItemJumpLoopAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              Param_ItemJumpUpAdditive;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive, Param_ItemJumpUpAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemJumpUpAdditive::Param_ItemJumpUpAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              Param_ItemSlopeSliding;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSlopeSliding) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSlopeSliding");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSlopeSliding) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSlopeSliding");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSlopeSliding, Param_ItemSlopeSliding) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSlopeSliding::Param_ItemSlopeSliding' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              Param_ItemCrouchTurningAdditive;                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive, Param_ItemCrouchTurningAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemCrouchTurningAdditive::Param_ItemCrouchTurningAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemIdleAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemIdleAdditive) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemIdleAdditive");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemIdleAdditive) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemIdleAdditive");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemIdleAdditive, InPoseIdleAdditive) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemIdleAdditive::InPoseIdleAdditive' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemIdleAdditive, Param_ItemIdleAdditive) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemIdleAdditive::Param_ItemIdleAdditive' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFullBodySprint;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemFullBodySprint) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemFullBodySprint");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemFullBodySprint) == 0x000020, "Wrong size on BadgerBangsLayerAnimBP_C_ItemFullBodySprint");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFullBodySprint, InPoseSprint) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemFullBodySprint::InPoseSprint' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemFullBodySprint, Param_ItemFullBodySprint) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemFullBodySprint::Param_ItemFullBodySprint' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             Param_InputParam;                                  // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemUpperBody;                               // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemUpperBody) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemUpperBody");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemUpperBody) == 0x000260, "Wrong size on BadgerBangsLayerAnimBP_C_ItemUpperBody");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemUpperBody, InPoseUpperBody) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemUpperBody::InPoseUpperBody' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemUpperBody, Param_InputParam) == 0x000010, "Member 'BadgerBangsLayerAnimBP_C_ItemUpperBody::Param_InputParam' has a wrong offset!");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemUpperBody, Param_ItemUpperBody) == 0x000250, "Member 'BadgerBangsLayerAnimBP_C_ItemUpperBody::Param_ItemUpperBody' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSwimJumpStartLoop
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpStartLoop;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop, Param_ItemSwimJumpStartLoop) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSwimJumpStartLoop::Param_ItemSwimJumpStartLoop' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpFallLoop;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop, Param_ItemSwimJumpFallLoop) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSwimJumpFallLoop::Param_ItemSwimJumpFallLoop' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceLoop;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop, Param_ItemSwimJumpSurfaceLoop) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceLoop::Param_ItemSwimJumpSurfaceLoop' has a wrong offset!");

// Function BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd final
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceEnd;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd) == 0x000008, "Wrong alignment on BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd");
static_assert(sizeof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd) == 0x000010, "Wrong size on BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd");
static_assert(offsetof(BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd, Param_ItemSwimJumpSurfaceEnd) == 0x000000, "Member 'BadgerBangsLayerAnimBP_C_ItemSwimJumpSurfaceEnd::Param_ItemSwimJumpSurfaceEnd' has a wrong offset!");

}

