#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Barrel_FishingRod_Container_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Barrel_FishingRod_Container_Athena.Barrel_FishingRod_Container_Athena_C
// 0x0068 (0x0D70 - 0x0D08)
class ABarrel_FishingRod_Container_Athena_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_ActorEnabled;                                  // 0x0D10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_InteractEnabled;                               // 0x0D30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        FX_Open;                                           // 0x0D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FX_OpenOffsetLocation;                             // 0x0D58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_OpenPitchOffset;                                // 0x0D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Open;                                        // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnReady_5F66F6674FD9971E925E779E105FEA16(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	void OnLoot();
	void ExecuteUbergraph_Barrel_FishingRod_Container_Athena(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Barrel_FishingRod_Container_Athena_C">();
	}
	static class ABarrel_FishingRod_Container_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABarrel_FishingRod_Container_Athena_C>();
	}
};
static_assert(alignof(ABarrel_FishingRod_Container_Athena_C) == 0x000008, "Wrong alignment on ABarrel_FishingRod_Container_Athena_C");
static_assert(sizeof(ABarrel_FishingRod_Container_Athena_C) == 0x000D70, "Wrong size on ABarrel_FishingRod_Container_Athena_C");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, UberGraphFrame) == 0x000D08, "Member 'ABarrel_FishingRod_Container_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, Row_ActorEnabled) == 0x000D10, "Member 'ABarrel_FishingRod_Container_Athena_C::Row_ActorEnabled' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, Row_InteractEnabled) == 0x000D30, "Member 'ABarrel_FishingRod_Container_Athena_C::Row_InteractEnabled' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, FX_Open) == 0x000D50, "Member 'ABarrel_FishingRod_Container_Athena_C::FX_Open' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, FX_OpenOffsetLocation) == 0x000D58, "Member 'ABarrel_FishingRod_Container_Athena_C::FX_OpenOffsetLocation' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, FX_OpenPitchOffset) == 0x000D64, "Member 'ABarrel_FishingRod_Container_Athena_C::FX_OpenPitchOffset' has a wrong offset!");
static_assert(offsetof(ABarrel_FishingRod_Container_Athena_C, Sound_Open) == 0x000D68, "Member 'ABarrel_FishingRod_Container_Athena_C::Sound_Open' has a wrong offset!");

}

