#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Barrel_FishingRod_Container_Athena

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Barrel_FishingRod_Container_Athena.Barrel_FishingRod_Container_Athena_C.OnReady_5F66F6674FD9971E925E779E105FEA16
// 0x0030 (0x0030 - 0x0000)
struct Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16) == 0x000008, "Wrong alignment on Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16");
static_assert(sizeof(Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16) == 0x000030, "Wrong size on Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16, GameState) == 0x000000, "Member 'Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16::GameState' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16, Playlist) == 0x000008, "Member 'Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16::Playlist' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16, PlaylistContextTags) == 0x000010, "Member 'Barrel_FishingRod_Container_Athena_C_OnReady_5F66F6674FD9971E925E779E105FEA16::PlaylistContextTags' has a wrong offset!");

// Function Barrel_FishingRod_Container_Athena.Barrel_FishingRod_Container_Athena_C.ExecuteUbergraph_Barrel_FishingRod_Container_Athena
// 0x00E8 (0x00E8 - 0x0000)
struct Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1B[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1C[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0090(0x0020)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1D[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1E[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena) == 0x000008, "Wrong alignment on Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena");
static_assert(sizeof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena) == 0x0000E8, "Wrong size on Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, EntryPoint) == 0x000000, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, Temp_struct_Variable) == 0x000008, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, Temp_object_Variable) == 0x000028, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, Temp_object_Variable_1) == 0x000030, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000038, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_RowToBool_ReturnValue) == 0x000041, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_RowToBool_ReturnValue_1) == 0x000042, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_RowToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000054, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_IsValid_ReturnValue_1) == 0x00006C, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_MakeRotator_ReturnValue) == 0x000074, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, K2Node_CustomEvent_GameState) == 0x000080, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, K2Node_CustomEvent_Playlist) == 0x000088, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, K2Node_CustomEvent_PlaylistContextTags) == 0x000090, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B4, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000E0, "Member 'Barrel_FishingRod_Container_Athena_C_ExecuteUbergraph_Barrel_FishingRod_Container_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

