#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnPurchaseClicked
// 0x0002 (0x0002 - 0x0000)
struct BattlePassPurchaseScreen_C_OnPurchaseClicked final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBuyBattleBundle;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnPurchaseClicked) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_OnPurchaseClicked");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnPurchaseClicked) == 0x000002, "Wrong size on BattlePassPurchaseScreen_C_OnPurchaseClicked");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnPurchaseClicked, bPlayForward) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnPurchaseClicked::bPlayForward' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnPurchaseClicked, bBuyBattleBundle) == 0x000001, "Member 'BattlePassPurchaseScreen_C_OnPurchaseClicked::bBuyBattleBundle' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.ExecuteUbergraph_BattlePassPurchaseScreen
// 0x00C0 (0x00C0 - 0x0000)
struct BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B0F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B10[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AS12BP_MusicController_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B11[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimpleFeatured_YellowButton_C*         K2Node_DynamicCast_AsSimple_Featured_Yellow_Button; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayForward;                         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBuyBattleBundle;                     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B12[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldApplyEUText_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen) == 0x000010, "Wrong alignment on BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen");
static_assert(sizeof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen) == 0x0000C0, "Wrong size on BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, EntryPoint) == 0x000000, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000068, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_3) == 0x000070, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_4) == 0x000078, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetEndTime_ReturnValue) == 0x000080, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_5) == 0x000088, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_6) == 0x000090, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_SpawnSound2D_ReturnValue) == 0x000098, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_AsSimple_Featured_Yellow_Button) == 0x0000A0, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_AsSimple_Featured_Yellow_Button' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_bPlayForward) == 0x0000A9, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_bPlayForward' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_bBuyBattleBundle) == 0x0000AA, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_bBuyBattleBundle' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetContext_ReturnValue) == 0x0000B0, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_ShouldApplyEUText_ReturnValue) == 0x0000B8, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_ShouldApplyEUText_ReturnValue' has a wrong offset!");

}

