#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_SuperSilkyWolf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_SuperSilkyWolf.BGA_SuperSilkyWolf_C
// 0x0038 (0x07E8 - 0x07B0)
class ABGA_SuperSilkyWolf_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientAudio;                                      // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Water;                                             // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Fort_Pawn;                                         // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Slurp_MID;                                         // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           In_Vehicle_Check;                                  // 0x07E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_SuperSilkyWolf(int32 EntryPoint);
	void ReCheckScalability();
	void OnComponentEndOverlap_Event_0(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnComponentBeginOverlap_Event_0(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_SuperSilkyWolf_C">();
	}
	static class ABGA_SuperSilkyWolf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_SuperSilkyWolf_C>();
	}
};
static_assert(alignof(ABGA_SuperSilkyWolf_C) == 0x000008, "Wrong alignment on ABGA_SuperSilkyWolf_C");
static_assert(sizeof(ABGA_SuperSilkyWolf_C) == 0x0007E8, "Wrong size on ABGA_SuperSilkyWolf_C");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, UberGraphFrame) == 0x0007B0, "Member 'ABGA_SuperSilkyWolf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, AmbientAudio) == 0x0007B8, "Member 'ABGA_SuperSilkyWolf_C::AmbientAudio' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, Water) == 0x0007C0, "Member 'ABGA_SuperSilkyWolf_C::Water' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, DefaultSceneRoot) == 0x0007C8, "Member 'ABGA_SuperSilkyWolf_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, Fort_Pawn) == 0x0007D0, "Member 'ABGA_SuperSilkyWolf_C::Fort_Pawn' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, Slurp_MID) == 0x0007D8, "Member 'ABGA_SuperSilkyWolf_C::Slurp_MID' has a wrong offset!");
static_assert(offsetof(ABGA_SuperSilkyWolf_C, In_Vehicle_Check) == 0x0007E0, "Member 'ABGA_SuperSilkyWolf_C::In_Vehicle_Check' has a wrong offset!");

}

