#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FakeLock_Scanner_Interior

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior
// 0x0120 (0x0120 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80EB[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80EC[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_80ED[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Usable;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80EE[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80EF[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0080(0x0020)()
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80F0[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00E8(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSpyLTMPlaylist_ReturnValue;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior) == 0x000120, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, EntryPoint) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_RowToBool_ReturnValue) == 0x000014, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_Event_InteractingPawn) == 0x000018, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_Event_InteractionBeingAttempted) == 0x000020, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000038, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CustomEvent_Usable) == 0x000040, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CustomEvent_Usable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_IsServer_ReturnValue) == 0x000042, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, Temp_object_Variable) == 0x000048, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, Temp_object_Variable_1) == 0x000050, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_GetForwardVector_ReturnValue) == 0x000064, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, Temp_struct_Variable) == 0x000080, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000A0, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x0000AC, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x0000BC, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_Divide_VectorInt_ReturnValue) == 0x0000C8, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CustomEvent_GameState) == 0x0000D8, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CustomEvent_Playlist) == 0x0000E0, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CustomEvent_PlaylistContextTags) == 0x0000E8, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_RandomFloatInRange_ReturnValue) == 0x000118, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior, CallFunc_CheckSpyLTMPlaylist_ReturnValue) == 0x00011C, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_ExecuteUbergraph_BGA_Athena_FakeLock_Scanner_Interior::CallFunc_CheckSpyLTMPlaylist_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.SetLockVisuals
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals final
{
public:
	bool                                          Usable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals) == 0x000001, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals) == 0x000001, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals, Usable) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_SetLockVisuals::Usable' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract) == 0x000010, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.OnReady_99386E864CAAA4D78E0E5C8EE9818FB6
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6) == 0x000030, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6, GameState) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6, Playlist) == 0x000008, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_OnReady_99386E864CAAA4D78E0E5C8EE9818FB6::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript) == 0x000030, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.OnRep_FakeLockUseState
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState) == 0x000001, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState) == 0x000001, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_OnRep_FakeLockUseState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.BlueprintGetInteractionString
// 0x0060 (0x0060 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80F1[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80F2[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString) == 0x000060, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, Temp_byte_Variable) == 0x000028, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, Temp_text_Variable) == 0x000030, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString, K2Node_Select_Default) == 0x000048, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionString::K2Node_Select_Default' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.BlueprintGetInteractionTime
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInteractionTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80F3[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime) == 0x000018, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, InteractingPawn) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, OutInteractionTime) == 0x000008, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::OutInteractionTime' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, InteractionBeingAttempted) == 0x00000C, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, ReturnValue) == 0x00000D, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, Temp_byte_Variable) == 0x00000E, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, Temp_float_Variable) == 0x000010, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime, K2Node_Select_Default) == 0x000014, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintGetInteractionTime::K2Node_Select_Default' has a wrong offset!");

// Function BGA_Athena_FakeLock_Scanner_Interior.BGA_Athena_FakeLock_Scanner_Interior_C.BlueprintCanInteract
// 0x0080 (0x0080 - 0x0000)
struct BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80F4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80F5[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80F6[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80F7[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract");
static_assert(sizeof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract) == 0x000080, "Wrong size on BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_FakeLock_Scanner_Interior_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
