#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Vortex_Area_Effect_CoolingTower

#include "Basic.hpp"

#include "BGA_DudeBro_Mini_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Vortex_Area_Effect_CoolingTower.BGA_Vortex_Area_Effect_CoolingTower_C
// 0x0030 (0x09A0 - 0x0970)
class ABGA_Vortex_Area_Effect_CoolingTower_C final : public ABGA_DudeBro_Mini_C
{
public:
	class UStaticMeshComponent*                   Fan_Updraft_04;                                    // 0x0970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_01;                                    // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_02;                                    // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan_Updraft_03;                                    // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Apollo_PowerPlant_Updraft;                       // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        UpdraftAudio;                                      // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Vortex_Area_Effect_CoolingTower_C">();
	}
	static class ABGA_Vortex_Area_Effect_CoolingTower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Vortex_Area_Effect_CoolingTower_C>();
	}
};
static_assert(alignof(ABGA_Vortex_Area_Effect_CoolingTower_C) == 0x000008, "Wrong alignment on ABGA_Vortex_Area_Effect_CoolingTower_C");
static_assert(sizeof(ABGA_Vortex_Area_Effect_CoolingTower_C) == 0x0009A0, "Wrong size on ABGA_Vortex_Area_Effect_CoolingTower_C");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, Fan_Updraft_04) == 0x000970, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::Fan_Updraft_04' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, Fan_Updraft_01) == 0x000978, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::Fan_Updraft_01' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, Fan_Updraft_02) == 0x000980, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::Fan_Updraft_02' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, Fan_Updraft_03) == 0x000988, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::Fan_Updraft_03' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, P_Apollo_PowerPlant_Updraft) == 0x000990, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::P_Apollo_PowerPlant_Updraft' has a wrong offset!");
static_assert(offsetof(ABGA_Vortex_Area_Effect_CoolingTower_C, UpdraftAudio) == 0x000998, "Member 'ABGA_Vortex_Area_Effect_CoolingTower_C::UpdraftAudio' has a wrong offset!");

}

