#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SuperDingo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.MovingCheck
// 0x0014 (0x0014 - 0x0000)
struct BGA_Athena_SuperDingo_C_MovingCheck final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_MovingCheck) == 0x000004, "Wrong alignment on BGA_Athena_SuperDingo_C_MovingCheck");
static_assert(sizeof(BGA_Athena_SuperDingo_C_MovingCheck) == 0x000014, "Wrong size on BGA_Athena_SuperDingo_C_MovingCheck");
static_assert(offsetof(BGA_Athena_SuperDingo_C_MovingCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_MovingCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_MovingCheck, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x00000C, "Member 'BGA_Athena_SuperDingo_C_MovingCheck::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_MovingCheck, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_MovingCheck::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_MovingCheck, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BGA_Athena_SuperDingo_C_MovingCheck::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.CheckHitByVehicle
// 0x0038 (0x0038 - 0x0000)
struct BGA_Athena_SuperDingo_C_CheckHitByVehicle final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D3A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetDriver_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_CheckHitByVehicle) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_CheckHitByVehicle");
static_assert(sizeof(BGA_Athena_SuperDingo_C_CheckHitByVehicle) == 0x000038, "Wrong size on BGA_Athena_SuperDingo_C_CheckHitByVehicle");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, OtherActor) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, CallFunc_GetDriver_ReturnValue) == 0x000020, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_CheckHitByVehicle, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BGA_Athena_SuperDingo_C_CheckHitByVehicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.QuestProgress
// 0x0028 (0x0028 - 0x0000)
struct BGA_Athena_SuperDingo_C_QuestProgress final
{
public:
	class AActor*                                 PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D3B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_QuestProgress) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_QuestProgress");
static_assert(sizeof(BGA_Athena_SuperDingo_C_QuestProgress) == 0x000028, "Wrong size on BGA_Athena_SuperDingo_C_QuestProgress");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, PlayerPawn) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::PlayerPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, CallFunc_IsServer_ReturnValue) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000020, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_QuestProgress, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000021, "Member 'BGA_Athena_SuperDingo_C_QuestProgress::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.HeightCheckCalc
// 0x0240 (0x0240 - 0x0000)
struct BGA_Athena_SuperDingo_C_HeightCheckCalc final
{
public:
	struct FVector                                New_Velocity;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Adjust;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D3C[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HeightCheckVarience;                               // 0x0010(0x0020)(Edit, BlueprintVisible)
	float                                         HeightDownwardProjectionAdd;                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VelOut;                                            // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightVarience;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddedZVel;                                         // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceVariance;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinVel;                                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxVel;                                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GoDown;                                            // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D3D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeightCheckForwardProjection;                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D3E[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D3F[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D40[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0114(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D41[0x1];                                     // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D42[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D43[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D44[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_HeightCheckCalc) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_HeightCheckCalc");
static_assert(sizeof(BGA_Athena_SuperDingo_C_HeightCheckCalc) == 0x000240, "Wrong size on BGA_Athena_SuperDingo_C_HeightCheckCalc");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, New_Velocity) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::New_Velocity' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, Adjust) == 0x00000C, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::Adjust' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, HeightCheckVarience) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::HeightCheckVarience' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, HeightDownwardProjectionAdd) == 0x000030, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::HeightDownwardProjectionAdd' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, VelOut) == 0x000034, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::VelOut' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, HeightVarience) == 0x000040, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::HeightVarience' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, AddedZVel) == 0x000044, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::AddedZVel' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, DistanceVariance) == 0x000048, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::DistanceVariance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, MinVel) == 0x00004C, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::MinVel' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, MaxVel) == 0x000050, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::MaxVel' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, GoDown) == 0x000054, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::GoDown' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, HeightCheckForwardProjection) == 0x000058, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::HeightCheckForwardProjection' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, Temp_object_Variable) == 0x000060, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_GetValueAtLevel_ReturnValue) == 0x000070, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, Temp_float_Variable) == 0x000074, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_GetForwardVector_ReturnValue) == 0x000078, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000084, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Normal_ReturnValue) == 0x000090, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_MakeVector_ReturnValue) == 0x0000A4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, Temp_float_Variable_1) == 0x0000BC, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_VSize_ReturnValue) == 0x0000C4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakVector_X) == 0x0000C8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakVector_Y) == 0x0000CC, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_MakeVector_ReturnValue_1) == 0x0000E0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000EC, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, Temp_bool_Variable) == 0x0000F0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, K2Node_Select_Default) == 0x0000F4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000F8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000FC, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000108, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_LineTraceSingle_OutHit) == 0x000114, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_LineTraceSingle_ReturnValue) == 0x0001A0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A1, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001A2, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_Time) == 0x0001A4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_Distance) == 0x0001A8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_Location) == 0x0001AC, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_Normal) == 0x0001C4, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_PhysMat) == 0x0001E0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_HitActor) == 0x0001E8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_HitComponent) == 0x0001F0, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_HitBoneName) == 0x0001F8, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_HitItem) == 0x000200, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_FaceIndex) == 0x000204, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_TraceStart) == 0x000208, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_BreakHitResult_TraceEnd) == 0x000214, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000220, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000224, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Abs_ReturnValue) == 0x000228, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00022C, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000230, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Lerp_ReturnValue) == 0x000234, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HeightCheckCalc, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000238, "Member 'BGA_Athena_SuperDingo_C_HeightCheckCalc::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_SuperDingo_C_UserConstructionScript final
{
public:
	struct FColor                                 CallFunc_Map_Find_Value;                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D45[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_Athena_SuperDingo_C_UserConstructionScript");
static_assert(sizeof(BGA_Athena_SuperDingo_C_UserConstructionScript) == 0x000010, "Wrong size on BGA_Athena_SuperDingo_C_UserConstructionScript");
static_assert(offsetof(BGA_Athena_SuperDingo_C_UserConstructionScript, CallFunc_Map_Find_Value) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_UserConstructionScript::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_UserConstructionScript, CallFunc_Map_Find_ReturnValue) == 0x000004, "Member 'BGA_Athena_SuperDingo_C_UserConstructionScript::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BGA_Athena_SuperDingo_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.DamageEvent
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_SuperDingo_C_DamageEvent final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D46[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D47[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_DamageEvent) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_DamageEvent");
static_assert(sizeof(BGA_Athena_SuperDingo_C_DamageEvent) == 0x000050, "Wrong size on BGA_Athena_SuperDingo_C_DamageEvent");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, DamagedActor) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, Damage) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, InstigatedBy) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, DamageCauser) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, HitLocation) == 0x000020, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, FHitComponent) == 0x000030, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, BoneName) == 0x000038, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_DamageEvent, Momentum) == 0x000040, "Member 'BGA_Athena_SuperDingo_C_DamageEvent::Momentum' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.Destroyed
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_SuperDingo_C_Destroyed final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D48[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D49[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_Destroyed) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_Destroyed");
static_assert(sizeof(BGA_Athena_SuperDingo_C_Destroyed) == 0x000050, "Wrong size on BGA_Athena_SuperDingo_C_Destroyed");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, DamagedActor) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_Destroyed::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, Damage) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_Destroyed::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, InstigatedBy) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_Destroyed::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, DamageCauser) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_Destroyed::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, HitLocation) == 0x000020, "Member 'BGA_Athena_SuperDingo_C_Destroyed::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, FHitComponent) == 0x000030, "Member 'BGA_Athena_SuperDingo_C_Destroyed::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, BoneName) == 0x000038, "Member 'BGA_Athena_SuperDingo_C_Destroyed::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_Destroyed, Momentum) == 0x000040, "Member 'BGA_Athena_SuperDingo_C_Destroyed::Momentum' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct BGA_Athena_SuperDingo_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D4A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_ReceiveHit) == 0x000008, "Wrong alignment on BGA_Athena_SuperDingo_C_ReceiveHit");
static_assert(sizeof(BGA_Athena_SuperDingo_C_ReceiveHit) == 0x0000D0, "Wrong size on BGA_Athena_SuperDingo_C_ReceiveHit");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, MyComp) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, Other) == 0x000008, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_ReceiveHit, Hit) == 0x000040, "Member 'BGA_Athena_SuperDingo_C_ReceiveHit::Hit' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.HitTurnMulticast
// 0x001C (0x001C - 0x0000)
struct BGA_Athena_SuperDingo_C_HitTurnMulticast final
{
public:
	struct FRotator                               StartRot;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               EndRot;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         PlayRate;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SuperDingo_C_HitTurnMulticast) == 0x000004, "Wrong alignment on BGA_Athena_SuperDingo_C_HitTurnMulticast");
static_assert(sizeof(BGA_Athena_SuperDingo_C_HitTurnMulticast) == 0x00001C, "Wrong size on BGA_Athena_SuperDingo_C_HitTurnMulticast");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HitTurnMulticast, StartRot) == 0x000000, "Member 'BGA_Athena_SuperDingo_C_HitTurnMulticast::StartRot' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HitTurnMulticast, EndRot) == 0x00000C, "Member 'BGA_Athena_SuperDingo_C_HitTurnMulticast::EndRot' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SuperDingo_C_HitTurnMulticast, PlayRate) == 0x000018, "Member 'BGA_Athena_SuperDingo_C_HitTurnMulticast::PlayRate' has a wrong offset!");

// Function BGA_Athena_SuperDingo.BGA_Athena_SuperDingo_C.ExecuteUbergraph_BGA_Athena_SuperDingo
// 0x08C0 (0x08C0 - 0x0000)
struct BGA_Athena_SuperDingo_C_ExecuteUbergraph_BGA_Athena_SuperDingo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D4D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortSafeZoneIndicator*                 CallFunc_GetSafeZoneIndicator_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D4E[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetSafeZoneRadius_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSafeZoneCenter_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D4F[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D50[0x1];                                     // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5D51[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor_1;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D52[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy_1;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D53[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent_1;                // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum_1;                     // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D54[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0120(0x00B8)(ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D55[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D56[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
