#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Keycard_Lock_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_Athena_Lock_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent
// 0x00E0 (0x00E0 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVault_Door_C*                          K2Node_DynamicCast_AsVault_Door;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67D5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0028(0x0020)()
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D6[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0060(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D7[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_UI_ScannerScreen_C*                 K2Node_DynamicCast_AsBP_UI_Scanner_Screen;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67D8[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              K2Node_Event_LockState;                            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D9[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67DA[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_67DB[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent) == 0x000008, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent) == 0x0000E0, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, EntryPoint) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_DynamicCast_AsVault_Door) == 0x000008, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_DynamicCast_AsVault_Door' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x000018, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000028, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000048, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x000050, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_Event_InteractingPawn) == 0x000058, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000060, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000070, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000078, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_DynamicCast_AsBP_UI_Scanner_Screen) == 0x000080, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_DynamicCast_AsBP_UI_Scanner_Screen' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000090, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_Event_LockState) == 0x000098, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_Event_LockState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x0000A0, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x0000A8, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0000C0, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0000C1, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D8, "Member 'BGA_Athena_Keycard_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Keycard_Lock_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_SetLock final
{
public:
	Enum_Athena_Lock                              Param_LockState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_SetLock) == 0x000001, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_SetLock");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_SetLock) == 0x000001, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_SetLock");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_SetLock, Param_LockState) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_SetLock::Param_LockState' has a wrong offset!");

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract) == 0x000010, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.LockCheck
// 0x0028 (0x0028 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_LockCheck final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckPassed;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67DC[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck) == 0x000008, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_LockCheck");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck) == 0x000028, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_LockCheck");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_LockCheck::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_Keycard_Lock_Parent_C_LockCheck::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck, CheckPassed) == 0x000009, "Member 'BGA_Athena_Keycard_Lock_Parent_C_LockCheck::CheckPassed' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'BGA_Athena_Keycard_Lock_Parent_C_LockCheck::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_LockCheck, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'BGA_Athena_Keycard_Lock_Parent_C_LockCheck::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.BlueprintCanInteract
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BlueprintCanInteract_ReturnValue;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract) == 0x000010, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, CallFunc_BlueprintCanInteract_ReturnValue) == 0x00000B, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::CallFunc_BlueprintCanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Keycard_Lock_Parent.BGA_Athena_Keycard_Lock_Parent_C.BlueprintGetInteractionString
// 0x0120 (0x0120 - 0x0000)
struct BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67DD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_BlueprintGetInteractionString_ReturnValue; // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0018)()
	class ABGA_Athena_Lock_Parent_C*              K2Node_DynamicCast_AsBGA_Athena_Lock_Parent;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LockCheck_CheckPassed;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString");
static_assert(sizeof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString) == 0x000120, "Wrong size on BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, CallFunc_BlueprintGetInteractionString_ReturnValue) == 0x000028, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::CallFunc_BlueprintGetInteractionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_MakeArray_Array) == 0x000080, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_DynamicCast_AsBGA_Athena_Lock_Parent) == 0x000110, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_DynamicCast_AsBGA_Athena_Lock_Parent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString, CallFunc_LockCheck_CheckPassed) == 0x000119, "Member 'BGA_Athena_Keycard_Lock_Parent_C_BlueprintGetInteractionString::CallFunc_LockCheck_CheckPassed' has a wrong offset!");

}

