#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Sentry_Alarm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Enum_MANG_Security_ID_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_Sentry_Alarm.BGA_Athena_Sentry_Alarm_C.AlertDispatcherAggro__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature final
{
public:
	class AActor*                                 Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MANG_Security_ID                         Param_Camera_ID;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8145[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TrackingPawn;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature");
static_assert(sizeof(BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature) == 0x000018, "Wrong size on BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature, Camera) == 0x000000, "Member 'BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature::Camera' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature, Param_Camera_ID) == 0x000008, "Member 'BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature::Param_Camera_ID' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature, TrackingPawn) == 0x000010, "Member 'BGA_Athena_Sentry_Alarm_C_AlertDispatcherAggro__DelegateSignature::TrackingPawn' has a wrong offset!");

// Function BGA_Athena_Sentry_Alarm.BGA_Athena_Sentry_Alarm_C.ExecuteUbergraph_BGA_Athena_Sentry_Alarm
// 0x0560 (0x0560 - 0x0000)
struct BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8146[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8147[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	ETimelineDirection                            K2Node_CustomEvent_Direction;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8148[0x1];                                     // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBuildingGameplayActorSentry_State            Temp_byte_Variable;                                // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Aggro;                          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8149[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_FactionTagOut;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBuildingGameplayActorSentry_State            Temp_byte_Variable_1;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814A[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_2;   // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814B[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0178(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01A4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0240(0x0018)()
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_814C[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814D[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814E[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSpyLTMPlaylist_ReturnValue;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x02E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x02F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_3;   // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_2;            // 0x0324(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0357(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814F[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0368(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x03A0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x042E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x042F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8150[0x3];                                     // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_1; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x04C8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm) == 0x000010, "Wrong alignment on BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm");
static_assert(sizeof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm) == 0x000560, "Wrong size on BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, EntryPoint) == 0x000000, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable) == 0x000048, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_object_Variable) == 0x000068, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_object_Variable_1) == 0x000070, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_Direction) == 0x000094, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_SwitchEnum_CmpSuccess) == 0x000095, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsServer_ReturnValue) == 0x000096, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_object_Variable_2) == 0x0000A8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable_1) == 0x0000B8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable_2) == 0x0000C8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D9, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000DA, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_byte_Variable) == 0x0000DB, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable_3) == 0x0000DC, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Select_Default) == 0x0000EC, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000FC, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable_4) == 0x000108, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_Aggro) == 0x000118, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_Aggro' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x00011C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_ComponentBoundEvent_FactionTagOut) == 0x000128, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_ComponentBoundEvent_FactionTagOut' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_struct_Variable_5) == 0x000130, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000140, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsPlaying_ReturnValue) == 0x000150, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, Temp_byte_Variable_1) == 0x000151, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Select_Default_1) == 0x000154, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Conv_LinearColorToVector_ReturnValue_2) == 0x000164, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Conv_LinearColorToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_Damage) == 0x000170, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_DamageTags) == 0x000178, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_Momentum) == 0x000198, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_HitInfo) == 0x0001A4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_InstigatedBy) == 0x000230, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_DamageCauser) == 0x000238, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_Event_EffectContext) == 0x000240, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsServer_ReturnValue_1) == 0x000258, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_RandomFloat_ReturnValue) == 0x00025C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_DamagedActor) == 0x000260, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_Damage) == 0x000268, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_InstigatedBy) == 0x000270, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_DamageCauser) == 0x000278, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_HitLocation) == 0x000280, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_FHitComponent) == 0x000290, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_BoneName) == 0x000298, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_CustomEvent_Momentum) == 0x0002A0, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002AC, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002B8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0002C4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_CheckSpyLTMPlaylist_ReturnValue) == 0x0002D0, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_CheckSpyLTMPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsServer_ReturnValue_2) == 0x0002D1, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_RowToBool_ReturnValue) == 0x0002D2, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsServer_ReturnValue_3) == 0x0002D3, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002D4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002D8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_LinearColorLerp_ReturnValue) == 0x0002E4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_LinearColorLerp_ReturnValue_1) == 0x0002F4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Conv_LinearColorToVector_ReturnValue_3) == 0x000304, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Conv_LinearColorToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_MakeVector4_ReturnValue) == 0x000310, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Lerp_ReturnValue) == 0x000320, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_LinearColorLerp_ReturnValue_2) == 0x000324, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_LinearColorLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_VLerp_ReturnValue) == 0x000334, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_MakeVector4_ReturnValue_1) == 0x000340, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Lerp_ReturnValue_1) == 0x000350, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_SwitchEnum_CmpSuccess_2) == 0x000354, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000355, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_SwitchEnum_CmpSuccess_3) == 0x000356, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IsValid_ReturnValue_1) == 0x000357, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000358, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000368, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_GetForwardVector_ReturnValue) == 0x000370, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00037C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000388, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_Add_VectorVector_ReturnValue) == 0x000394, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_LineTraceSingle_OutHit) == 0x0003A0, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_LineTraceSingle_ReturnValue) == 0x00042C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00042D, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_bBlockingHit) == 0x00042E, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_bInitialOverlap) == 0x00042F, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_Time) == 0x000430, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_Distance) == 0x000434, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_Location) == 0x000438, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_ImpactPoint) == 0x000444, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_Normal) == 0x000450, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_ImpactNormal) == 0x00045C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_PhysMat) == 0x000468, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_HitActor) == 0x000470, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_HitComponent) == 0x000478, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_HitBoneName) == 0x000480, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_HitItem) == 0x000488, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_FaceIndex) == 0x00048C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_TraceStart) == 0x000490, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_BreakHitResult_TraceEnd) == 0x00049C, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_DynamicCast_AsBuilding_Actor) == 0x0004A8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, K2Node_DynamicCast_bSuccess) == 0x0004B0, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x0004B4, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_IncrementAnalyticMatchCount_ReturnValue_1) == 0x0004B8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_IncrementAnalyticMatchCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_MakeRotator_ReturnValue) == 0x0004BC, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0004C8, "Member 'BGA_Athena_Sentry_Alarm_C_ExecuteUbergraph_BGA_Athena_Sentry_Alarm::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BGA_Athena_Sentry_Alarm.BGA_Athena_Sentry_Alarm_C.BuildingDied
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_Sentry_Alarm_C_BuildingDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8151[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8152[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Sentry_Alarm_C_BuildingDied) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Alarm_C_BuildingDied");
static_assert(sizeof(BGA_Athena_Sentry_Alarm_C_BuildingDied) == 0x000050, "Wrong size on BGA_Athena_Sentry_Alarm_C_BuildingDied");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, DamagedActor) == 0x000000, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, Damage) == 0x000008, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, InstigatedBy) == 0x000010, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, DamageCauser) == 0x000018, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, HitLocation) == 0x000020, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, FHitComponent) == 0x000030, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, BoneName) == 0x000038, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_BuildingDied, Momentum) == 0x000040, "Member 'BGA_Athena_Sentry_Alarm_C_BuildingDied::Momentum' has a wrong offset!");

// Function BGA_Athena_Sentry_Alarm.BGA_Athena_Sentry_Alarm_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8153[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects");
static_assert(sizeof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'BGA_Athena_Sentry_Alarm_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function BGA_Athena_Sentry_Alarm.BGA_Athena_Sentry_Alarm_C.BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
