#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HeldObject_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_HeldObject_Parent.BGA_HeldObject_Parent_C.ExecuteUbergraph_BGA_HeldObject_Parent
// 0x0D10 (0x0D10 - 0x0000)
struct BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult_1;         // 0x0004(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x0090(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D5[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D6[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D7[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D8[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D9[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DA[0x5];                                     // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DB[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DC[0x6];                                     // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x01F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0200(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DD[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DE[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetInstigator_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62DF[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E0[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue;          // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E1[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x02A8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0336(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E2[0x1];                                     // 0x0337(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E3[0x2];                                     // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E4[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0430(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitNormal;                      // 0x043C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E5[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E6[0x3];                                     // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E7[0x3];                                     // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAngleBetweenTwoVectors_Angle__Degrees_; // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E8[0x4];                                     // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachComponent_Component;             // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0488(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0518(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0544(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x05E0(0x0018)()
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E9[0x4];                                     // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0610(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62EA[0x3];                                     // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0640(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62EB[0x7];                                     // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_Interacting_Pawn;               // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62EC[0x1];                                     // 0x06F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x06F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0708(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0714(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62ED[0xF];                                     // 0x0721(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0730(0x0030)(IsPlainOldData, NoDestructor)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0770(0x0020)()
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x07A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x07A8(0x0020)(ConstParm)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62EE[0x3];                                     // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x07CC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x07E0(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62EF[0x4];                                     // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x08A0(0x00B8)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0958(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0964(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0974(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x0980(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x0A3C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0A48(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F0[0x4];                                     // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_3;  // 0x0A58(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_3;      // 0x0B14(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0B20(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F1[0x4];                                     // 0x0B2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_4;  // 0x0B30(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_4;      // 0x0BEC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_5;  // 0x0BF8(0x00B8)(ContainsInstancedReference)
	class AFortPlayerPawn*                        CallFunc_GetInstigator_ReturnValue_1;              // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0CB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0CC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0CC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0CCA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F2[0x1];                                     // 0x0CCB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0CCC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorSubmergedInOcean_ReturnValue;      // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F3[0x3];                                     // 0x0CD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0CDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0CEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0CF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0CF2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue_1;        // 0x0CF3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0CF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F4[0x3];                                     // 0x0CF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0CFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F5[0x3];                                     // 0x0CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0D00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0D04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent) == 0x000010, "Wrong alignment on BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent");
static_assert(sizeof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent) == 0x000D10, "Wrong size on BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, EntryPoint) == 0x000000, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_ComponentBoundEvent_ImpactResult_1) == 0x000004, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_ComponentBoundEvent_ImpactResult_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x000090, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x00009C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009D, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Time) == 0x0000A0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Distance) == 0x0000A4, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Location) == 0x0000A8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B4, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Normal) == 0x0000C0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x0000CC, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000118, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000119, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Time_1) == 0x00011C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Distance_1) == 0x000120, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Location_1) == 0x000124, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000130, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_Normal_1) == 0x00013C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000148, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_PhysMat_1) == 0x000158, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitActor_1) == 0x000160, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitComponent_1) == 0x000168, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitBoneName_1) == 0x000170, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_HitItem_1) == 0x000178, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_FaceIndex_1) == 0x00017C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_TraceStart_1) == 0x000180, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakHitResult_TraceEnd_1) == 0x00018C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_ComponentHasTag_ReturnValue) == 0x000198, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakVector_X) == 0x00019C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakVector_Y) == 0x0001A0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BreakVector_Z) == 0x0001A4, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_AsFort_Pawn) == 0x0001A8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x0001B8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x0001C9, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001CA, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001D0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0001D9, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_ActorHasTag_ReturnValue) == 0x0001DA, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BooleanOR_ReturnValue) == 0x0001DB, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_ComponentBoundEvent_WaterBody) == 0x0001E0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0001E8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0001F0, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_BooleanOR_ReturnValue_1) == 0x0001F1, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_Event_InteractingPawn) == 0x0001F8, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000200, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000201, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000208, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, K2Node_DynamicCast_bSuccess_3) == 0x000210, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_VSize_ReturnValue) == 0x000214, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_GetInstigator_ReturnValue) == 0x000218, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000220, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue) == 0x000228, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_MakeVector_ReturnValue) == 0x000230, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00023C, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000248, "Member 'BGA_HeldObject_Parent_C_ExecuteUbergraph_BGA_HeldObject_Parent::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
