#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_SilkyDino_Horizontal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_SilkyDino_Horizontal.BGA_SilkyDino_Horizontal_C.ExecuteUbergraph_BGA_SilkyDino_Horizontal
// 0x0200 (0x0200 - 0x0000)
struct BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D0[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D1[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x00A8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_83D2[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D3[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D4[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D5[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D6[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D7[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_83D8[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorSubmergedInOcean_ReturnValue;      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D9[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal) == 0x000008, "Wrong alignment on BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal");
static_assert(sizeof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal) == 0x000200, "Wrong size on BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, EntryPoint) == 0x000000, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, Temp_struct_Variable) == 0x000048, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, Temp_object_Variable) == 0x000068, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, Temp_object_Variable_1) == 0x000070, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OverlappedComponent_1) == 0x000088, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherActor_1) == 0x000090, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherComp_1) == 0x000098, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherBodyIndex_1) == 0x0000A0, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_bFromSweep) == 0x0000A4, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_SweepResult) == 0x0000A8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OverlappedComponent) == 0x000138, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherActor) == 0x000140, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherComp) == 0x000148, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CustomEvent_OtherBodyIndex) == 0x000150, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_DynamicCast_AsFort_Pawn) == 0x000158, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000168, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000178, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000180, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000188, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000190, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001A0, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A4, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0001B8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x0001C0, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_GetOceanTotalHeight_ReturnValue) == 0x0001D8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_GetOceanTotalHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001DC, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_IsActorSubmergedInOcean_ReturnValue) == 0x0001E8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_IsActorSubmergedInOcean_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_BreakVector_X) == 0x0001EC, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_BreakVector_Y) == 0x0001F0, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_BreakVector_Z) == 0x0001F4, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001F8, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal, CallFunc_BooleanOR_ReturnValue) == 0x0001F9, "Member 'BGA_SilkyDino_Horizontal_C_ExecuteUbergraph_BGA_SilkyDino_Horizontal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BGA_SilkyDino_Horizontal.BGA_SilkyDino_Horizontal_C.OnComponentEndOverlap_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0 final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0) == 0x000008, "Wrong alignment on BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0");
static_assert(sizeof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0) == 0x000020, "Wrong size on BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0, OverlappedComponent) == 0x000000, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0, OtherActor) == 0x000008, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0, OtherComp) == 0x000010, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0, OtherBodyIndex) == 0x000018, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentEndOverlap_Event_0::OtherBodyIndex' has a wrong offset!");

// Function BGA_SilkyDino_Horizontal.BGA_SilkyDino_Horizontal_C.OnComponentBeginOverlap_Event_0
// 0x00B0 (0x00B0 - 0x0000)
struct BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0 final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83DA[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0) == 0x000008, "Wrong alignment on BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0");
static_assert(sizeof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0) == 0x0000B0, "Wrong size on BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, OverlappedComponent) == 0x000000, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, OtherActor) == 0x000008, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, OtherComp) == 0x000010, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, OtherBodyIndex) == 0x000018, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, bFromSweep) == 0x00001C, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0, SweepResult) == 0x000020, "Member 'BGA_SilkyDino_Horizontal_C_OnComponentBeginOverlap_Event_0::SweepResult' has a wrong offset!");

// Function BGA_SilkyDino_Horizontal.BGA_SilkyDino_Horizontal_C.OnReady_9918FC77440E5741CC285E967F3DD111
// 0x0030 (0x0030 - 0x0000)
struct BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111) == 0x000008, "Wrong alignment on BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111");
static_assert(sizeof(BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111) == 0x000030, "Wrong size on BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111, GameState) == 0x000000, "Member 'BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111::GameState' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111, Playlist) == 0x000008, "Member 'BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111, PlaylistContextTags) == 0x000010, "Member 'BGA_SilkyDino_Horizontal_C_OnReady_9918FC77440E5741CC285E967F3DD111::PlaylistContextTags' has a wrong offset!");

// Function BGA_SilkyDino_Horizontal.BGA_SilkyDino_Horizontal_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct BGA_SilkyDino_Horizontal_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakVector_X;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0024(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_SilkyDino_Horizontal_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_SilkyDino_Horizontal_C_UserConstructionScript");
static_assert(sizeof(BGA_SilkyDino_Horizontal_C_UserConstructionScript) == 0x000160, "Wrong size on BGA_SilkyDino_Horizontal_C_UserConstructionScript");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000000, "Member 'BGA_SilkyDino_Horizontal_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_SilkyDino_Horizontal_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000004, "Member 'BGA_SilkyDino_Horizontal_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
