#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_DudeBro_Mini

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.ExecuteUbergraph_BGA_DudeBro_Mini
// 0x0688 (0x0688 - 0x0000)
struct BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4387[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4388[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4389[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438A[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APhysicsBall_Master_C*                  K2Node_DynamicCast_AsPhysics_Ball_Master;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438B[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438C[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APhysicsBall_Master_C*                  K2Node_DynamicCast_AsPhysics_Ball_Master_1;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438D[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438E[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438F[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4390[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4391[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base_1;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4392[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4393[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtrConst_ReturnValue_1;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4394[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4395[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4396[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4397[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4398[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0200(0x00B0)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4399[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439A[0x1];                                     // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439B[0x2];                                     // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x02E8(0x00B8)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x03A0(0x00B8)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x0458(0x00B8)(ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0524(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x055C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0580(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0590(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439C[0x3];                                     // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_3;  // 0x05D0(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini");
static_assert(sizeof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini) == 0x000688, "Wrong size on BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, EntryPoint) == 0x000000, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsPhysics_Ball_Master) == 0x0000D8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsPhysics_Ball_Master' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x0000E8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsPhysics_Ball_Master_1) == 0x0000F8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsPhysics_Ball_Master_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000104, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Projectile_Base) == 0x000108, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Projectile_Base' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000118, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000130, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_5) == 0x000138, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetVehicleActorPtrConst_ReturnValue) == 0x000140, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetVehicleActorPtrConst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsB_BGA_Athena_C4_1) == 0x000148, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsB_BGA_Athena_C4_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_6) == 0x000150, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Projectile_Base_1) == 0x000158, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Projectile_Base_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_7) == 0x000160, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000164, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x000168, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_8) == 0x000178, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetVehicleVelocity_ReturnValue) == 0x00017C, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetVehicleVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetVehicleActorPtrConst_ReturnValue_1) == 0x000188, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetVehicleActorPtrConst_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000190, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_DynamicCast_bSuccess_9) == 0x000198, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00019C, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0001A8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_X) == 0x0001B0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_Y) == 0x0001B4, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_Z) == 0x0001B8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_IsValid_ReturnValue) == 0x0001BC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetQuestManager_ReturnValue) == 0x0001C0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0001C8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0001C9, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001D0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x0001D8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001DC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001E0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001E4, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001E8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0001EC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0001F0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0001F4, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_HasAuthority_ReturnValue) == 0x0001F8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_MakeStruct_GameplayEventData) == 0x000200, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002B0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002BC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BooleanAND_ReturnValue) == 0x0002C8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_MatchReadyAsync_ReturnValue) == 0x0002D0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_IsServer_ReturnValue) == 0x0002D9, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0002DA, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0002DC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_FTrunc_ReturnValue) == 0x0002E0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_SwitchEnum_CmpSuccess) == 0x0002E4, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Conv_IntToBool_ReturnValue) == 0x0002E5, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0002E8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x0003A0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_MakeGameplayCueParameters_ReturnValue_2) == 0x000458, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_MakeGameplayCueParameters_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000510, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000514, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000518, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x00051C, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x000520, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_CreateDelegate_OutputDelegate) == 0x000524, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x000534, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetActorUpVector_ReturnValue) == 0x000538, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000544, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Add_VectorVector_ReturnValue) == 0x000550, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_GetActorUpVector_ReturnValue_1) == 0x00055C, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000568, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000574, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, K2Node_CreateDelegate_OutputDelegate_1) == 0x000580, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000590, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Lerp_ReturnValue) == 0x000598, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Lerp_ReturnValue_1) == 0x00059C, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_VLerp_ReturnValue) == 0x0005A0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0005AC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_X_1) == 0x0005B8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_Y_1) == 0x0005BC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_BreakVector_Z_1) == 0x0005C0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Add_FloatFloat_ReturnValue) == 0x0005C4, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0005C8, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0005CC, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini, CallFunc_MakeGameplayCueParameters_ReturnValue_3) == 0x0005D0, "Member 'BGA_DudeBro_Mini_C_ExecuteUbergraph_BGA_DudeBro_Mini::CallFunc_MakeGameplayCueParameters_ReturnValue_3' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439D[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_DudeBro_Mini_C_BndEvt__S_FX_GeyserCone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BGA_DudeBro_Mini_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_DudeBro_Mini_C_UserConstructionScript) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_UserConstructionScript");
static_assert(sizeof(BGA_DudeBro_Mini_C_UserConstructionScript) == 0x000018, "Wrong size on BGA_DudeBro_Mini_C_UserConstructionScript");
static_assert(offsetof(BGA_DudeBro_Mini_C_UserConstructionScript, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BGA_DudeBro_Mini_C_UserConstructionScript::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000008, "Member 'BGA_DudeBro_Mini_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.ProjEnter
// 0x0018 (0x0018 - 0x0000)
struct BGA_DudeBro_Mini_C_ProjEnter final
{
public:
	class AFortProjectileBase*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_DudeBro_Mini_C_ProjEnter) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_ProjEnter");
static_assert(sizeof(BGA_DudeBro_Mini_C_ProjEnter) == 0x000018, "Wrong size on BGA_DudeBro_Mini_C_ProjEnter");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjEnter, Projectile) == 0x000000, "Member 'BGA_DudeBro_Mini_C_ProjEnter::Projectile' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjEnter, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'BGA_DudeBro_Mini_C_ProjEnter::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjEnter, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BGA_DudeBro_Mini_C_ProjEnter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjEnter, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BGA_DudeBro_Mini_C_ProjEnter::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.ProjExit
// 0x0018 (0x0018 - 0x0000)
struct BGA_DudeBro_Mini_C_ProjExit final
{
public:
	class AFortProjectileBase*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_DudeBro_Mini_C_ProjExit) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_ProjExit");
static_assert(sizeof(BGA_DudeBro_Mini_C_ProjExit) == 0x000018, "Wrong size on BGA_DudeBro_Mini_C_ProjExit");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjExit, Projectile) == 0x000000, "Member 'BGA_DudeBro_Mini_C_ProjExit::Projectile' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjExit, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BGA_DudeBro_Mini_C_ProjExit::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjExit, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BGA_DudeBro_Mini_C_ProjExit::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DudeBro_Mini_C_ProjExit, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BGA_DudeBro_Mini_C_ProjExit::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BGA_DudeBro_Mini.BGA_DudeBro_Mini_C.ToyEnter
// 0x0018 (0x0018 - 0x0000)
struct BGA_DudeBro_Mini_C_ToyEnter final
{
public:
	class APhysicsBall_Master_C*                  Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_DudeBro_Mini_C_ToyEnter) == 0x000008, "Wrong alignment on BGA_DudeBro_Mini_C_ToyEnter");
