#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SuperDingo_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BGA_Athena_WithGravity_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SuperDingo_Box.BGA_Athena_SuperDingo_Box_C
// 0x0108 (0x09E8 - 0x08E0)
class ABGA_Athena_SuperDingo_Box_C final : public ABGA_Athena_WithGravity_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_SuperDingo_Box_C;        // 0x08E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemsToDrop;                                       // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Rarity;                                            // 0x0900(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_736D[0x7];                                     // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EFortRarity, class FName>                RarityToItemsMap;                                  // 0x0908(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFortRarity, struct FColor>              RarityToColorMap;                                  // 0x0958(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FColor                                 ColorOfBox;                                        // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destroy;                                        // 0x09AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Tracer_Lifetime;                                   // 0x09B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x09B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_736E[0x4];                                     // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_AmmoTossTag;                                     // 0x09C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void FindRarityToItemsAndColor();
	void UserConstructionScript();
	void StopSim(const struct FHitResult& Hit);
	void Spawn_Items();
	void HideAndKill();
	void ExecuteUbergraph_BGA_Athena_SuperDingo_Box(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SuperDingo_Box_C">();
	}
	static class ABGA_Athena_SuperDingo_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SuperDingo_Box_C>();
	}
};
static_assert(alignof(ABGA_Athena_SuperDingo_Box_C) == 0x000008, "Wrong alignment on ABGA_Athena_SuperDingo_Box_C");
static_assert(sizeof(ABGA_Athena_SuperDingo_Box_C) == 0x0009E8, "Wrong size on ABGA_Athena_SuperDingo_Box_C");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, UberGraphFrame_BGA_Athena_SuperDingo_Box_C) == 0x0008E0, "Member 'ABGA_Athena_SuperDingo_Box_C::UberGraphFrame_BGA_Athena_SuperDingo_Box_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, Audio) == 0x0008E8, "Member 'ABGA_Athena_SuperDingo_Box_C::Audio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, Trail) == 0x0008F0, "Member 'ABGA_Athena_SuperDingo_Box_C::Trail' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, ItemsToDrop) == 0x0008F8, "Member 'ABGA_Athena_SuperDingo_Box_C::ItemsToDrop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, Rarity) == 0x000900, "Member 'ABGA_Athena_SuperDingo_Box_C::Rarity' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, RarityToItemsMap) == 0x000908, "Member 'ABGA_Athena_SuperDingo_Box_C::RarityToItemsMap' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, RarityToColorMap) == 0x000958, "Member 'ABGA_Athena_SuperDingo_Box_C::RarityToColorMap' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, ColorOfBox) == 0x0009A8, "Member 'ABGA_Athena_SuperDingo_Box_C::ColorOfBox' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, GC_Destroy) == 0x0009AC, "Member 'ABGA_Athena_SuperDingo_Box_C::GC_Destroy' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, Tracer_Lifetime) == 0x0009B4, "Member 'ABGA_Athena_SuperDingo_Box_C::Tracer_Lifetime' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, SpawnPositionOffset) == 0x0009B8, "Member 'ABGA_Athena_SuperDingo_Box_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SuperDingo_Box_C, T_AmmoTossTag) == 0x0009C8, "Member 'ABGA_Athena_SuperDingo_Box_C::T_AmmoTossTag' has a wrong offset!");

}

