#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Lock_Scanner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.ExecuteUbergraph_BGA_Athena_Lock_Scanner
// 0x0400 (0x0400 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_Interacting_Pawn;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_2;   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_3;   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawnToScan;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B9[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_ComponentBoundEvent_FactionTagOut;          // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76BA[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Canceled;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76BB[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00D8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_76BC[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76BD[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x01A0(0x0020)()
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x01D0(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_4;   // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0224(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76BE[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UI_ScannerScreen_C*                 K2Node_DynamicCast_AsBP_UI_Scanner_Screen;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76BF[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector4ToVector_ReturnValue;         // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_5;   // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSpyLTMPlaylist_ReturnValue;          // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C0[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InteractingPawn;                      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C1[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C2[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Passed;                         // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C3[0x3];                                     // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_1; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C4[0x3];                                     // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_2; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_3; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_4; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_5; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_6; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_7; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_8; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue_9; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C5[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput; // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue; // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C6[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1; // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1; // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C7[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2; // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2; // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C8[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x03DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76C9[0x3];                                     // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76CA[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner) == 0x000400, "Wrong size on BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, EntryPoint) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_Interacting_Pawn) == 0x000008, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_Interacting_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Add_VectorVector_ReturnValue) == 0x00001C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_X) == 0x000028, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Z) == 0x000030, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000040, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x00004C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue_2) == 0x000058, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue_3) == 0x000064, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000070, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_GetParentActor_ReturnValue) == 0x000080, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_PlayerPawnToScan) == 0x000088, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_PlayerPawnToScan' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_ComponentBoundEvent_FactionTagOut) == 0x000094, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_ComponentBoundEvent_FactionTagOut' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000A0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000B0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_Canceled) == 0x0000B1, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_Canceled' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Not_PreBool_ReturnValue) == 0x0000B2, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000CC, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000D8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CreateDelegate_OutputDelegate) == 0x000164, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000178, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, Temp_object_Variable) == 0x000190, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, Temp_object_Variable_1) == 0x000198, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, Temp_struct_Variable) == 0x0001A0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_GameState) == 0x0001C0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_Playlist) == 0x0001C8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_PlaylistContextTags) == 0x0001D0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue_4) == 0x000200, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_VLerp_ReturnValue) == 0x00020C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000218, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000224, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002B0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_DynamicCast_AsBP_UI_Scanner_Screen) == 0x0002B8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_DynamicCast_AsBP_UI_Scanner_Screen' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0002C4, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002D0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_Vector4ToVector_ReturnValue) == 0x0002DC, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_Vector4ToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_LinearColorToVector_ReturnValue_5) == 0x0002E8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_LinearColorToVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IsServer_ReturnValue) == 0x0002F4, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_CheckSpyLTMPlaylist_ReturnValue) == 0x0002F5, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_CheckSpyLTMPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_Event_InteractingPawn) == 0x0002F8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_X_1) == 0x000300, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Y_1) == 0x000304, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Z_1) == 0x000308, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000310, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000318, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000320, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x00032C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_VLerp_ReturnValue_1) == 0x000338, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_X_2) == 0x000344, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Y_2) == 0x000348, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_BreakVector_Z_2) == 0x00034C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IsServer_ReturnValue_1) == 0x000350, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x000354, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_Passed) == 0x000358, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_Passed' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_1) == 0x00035C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000360, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000370, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_2) == 0x000374, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_3) == 0x000378, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_4) == 0x00037C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_5) == 0x000380, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_6) == 0x000384, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_7) == 0x000388, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_8) == 0x00038C, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_IncrementAnalyticMatchCount_ReturnValue_9) == 0x000390, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_IncrementAnalyticMatchCount_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput) == 0x000398, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue) == 0x0003A8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1) == 0x0003B0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1) == 0x0003C0, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2) == 0x0003C8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2) == 0x0003D8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, K2Node_CustomEvent_Tag) == 0x0003DC, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0003E4, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003E8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003F8, "Member 'BGA_Athena_Lock_Scanner_C_ExecuteUbergraph_BGA_Athena_Lock_Scanner::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.SetFailText
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_SetFailText final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_SetFailText) == 0x000004, "Wrong alignment on BGA_Athena_Lock_Scanner_C_SetFailText");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_SetFailText) == 0x000008, "Wrong size on BGA_Athena_Lock_Scanner_C_SetFailText");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_SetFailText, Tag) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_SetFailText::Tag' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.HandleAnalytics
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_HandleAnalytics final
{
public:
	bool                                          Passed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_HandleAnalytics) == 0x000001, "Wrong alignment on BGA_Athena_Lock_Scanner_C_HandleAnalytics");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_HandleAnalytics) == 0x000001, "Wrong size on BGA_Athena_Lock_Scanner_C_HandleAnalytics");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_HandleAnalytics, Passed) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_HandleAnalytics::Passed' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.OnFirstInteract
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_OnFirstInteract final
{
public:
	class AFortPawn*                              InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_OnFirstInteract) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Scanner_C_OnFirstInteract");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_OnFirstInteract) == 0x000008, "Wrong size on BGA_Athena_Lock_Scanner_C_OnFirstInteract");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_OnFirstInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_OnFirstInteract::InteractingPawn' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.CE_AimEye
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_CE_AimEye final
{
public:
	class AFortPawn*                              Interacting_Pawn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_CE_AimEye) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Scanner_C_CE_AimEye");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_CE_AimEye) == 0x000008, "Wrong size on BGA_Athena_Lock_Scanner_C_CE_AimEye");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_CE_AimEye, Interacting_Pawn) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_CE_AimEye::Interacting_Pawn' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.StartScan
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_StartScan final
{
public:
	class AFortPlayerPawn*                        PlayerPawnToScan;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_StartScan) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Scanner_C_StartScan");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_StartScan) == 0x000008, "Wrong size on BGA_Athena_Lock_Scanner_C_StartScan");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_StartScan, PlayerPawnToScan) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_StartScan::PlayerPawnToScan' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature final
{
public:
	struct FGameplayTag                           FactionTagOut;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature) == 0x000004, "Wrong alignment on BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature) == 0x000008, "Wrong size on BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature, FactionTagOut) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_BndEvt__Athena_FactionSelection_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature::FactionTagOut' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.EndScan
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_EndScan final
{
public:
	bool                                          Canceled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_EndScan) == 0x000001, "Wrong alignment on BGA_Athena_Lock_Scanner_C_EndScan");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_EndScan) == 0x000001, "Wrong size on BGA_Athena_Lock_Scanner_C_EndScan");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_EndScan, Canceled) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_EndScan::Canceled' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.OnReady_52C7FB4347310A401D7AE8B7917A2DA0
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0) == 0x000030, "Wrong size on BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0, GameState) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0, Playlist) == 0x000008, "Member 'BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_Lock_Scanner_C_OnReady_52C7FB4347310A401D7AE8B7917A2DA0::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_Athena_Lock_Scanner_C_UserConstructionScript");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_UserConstructionScript) == 0x000048, "Wrong size on BGA_Athena_Lock_Scanner_C_UserConstructionScript");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x00000C, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_GetForwardVector_ReturnValue) == 0x000024, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x00003C, "Member 'BGA_Athena_Lock_Scanner_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.OnRep_EndType
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_OnRep_EndType final
{
public:
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Lock_Scanner_C_OnRep_EndType) == 0x000001, "Wrong alignment on BGA_Athena_Lock_Scanner_C_OnRep_EndType");
static_assert(sizeof(BGA_Athena_Lock_Scanner_C_OnRep_EndType) == 0x000001, "Wrong size on BGA_Athena_Lock_Scanner_C_OnRep_EndType");
static_assert(offsetof(BGA_Athena_Lock_Scanner_C_OnRep_EndType, K2Node_SwitchInteger_CmpSuccess) == 0x000000, "Member 'BGA_Athena_Lock_Scanner_C_OnRep_EndType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BGA_Athena_Lock_Scanner.BGA_Athena_Lock_Scanner_C.BlueprintCanInteract
// 0x0058 (0x0058 - 0x0000)
struct BGA_Athena_Lock_Scanner_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76CB[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           T_Falling;                                         // 0x000C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_InVehicle;                                       // 0x0014(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlueprintCanInteract_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76CC[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76CD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
