#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BigClock_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BigClock_01.BigClock_01_C
// 0x0018 (0x0B80 - 0x0B68)
class ABigClock_01_C final : public ABuildingDeco
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MinuteHandMesh;                                    // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HourHandMesh;                                      // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BigClock_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BigClock_01_C">();
	}
	static class ABigClock_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABigClock_01_C>();
	}
};
static_assert(alignof(ABigClock_01_C) == 0x000008, "Wrong alignment on ABigClock_01_C");
static_assert(sizeof(ABigClock_01_C) == 0x000B80, "Wrong size on ABigClock_01_C");
static_assert(offsetof(ABigClock_01_C, UberGraphFrame) == 0x000B68, "Member 'ABigClock_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABigClock_01_C, MinuteHandMesh) == 0x000B70, "Member 'ABigClock_01_C::MinuteHandMesh' has a wrong offset!");
static_assert(offsetof(ABigClock_01_C, HourHandMesh) == 0x000B78, "Member 'ABigClock_01_C::HourHandMesh' has a wrong offset!");

}

