#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BigClock_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BigClock_01.BigClock_01_C.ExecuteUbergraph_BigClock_01
// 0x0010 (0x0010 - 0x0000)
struct BigClock_01_C_ExecuteUbergraph_BigClock_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8776[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BigClock_01_C_ExecuteUbergraph_BigClock_01) == 0x000008, "Wrong alignment on BigClock_01_C_ExecuteUbergraph_BigClock_01");
static_assert(sizeof(BigClock_01_C_ExecuteUbergraph_BigClock_01) == 0x000010, "Wrong size on BigClock_01_C_ExecuteUbergraph_BigClock_01");
static_assert(offsetof(BigClock_01_C_ExecuteUbergraph_BigClock_01, EntryPoint) == 0x000000, "Member 'BigClock_01_C_ExecuteUbergraph_BigClock_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_ExecuteUbergraph_BigClock_01, CallFunc_IsMobilePlatform_ReturnValue) == 0x000004, "Member 'BigClock_01_C_ExecuteUbergraph_BigClock_01::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_ExecuteUbergraph_BigClock_01, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'BigClock_01_C_ExecuteUbergraph_BigClock_01::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_ExecuteUbergraph_BigClock_01, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BigClock_01_C_ExecuteUbergraph_BigClock_01::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BigClock_01.BigClock_01_C.UpdateTime
// 0x0154 (0x0154 - 0x0000)
struct BigClock_01_C_UpdateTime final
{
public:
	float                                         CallFunc_GetTimeOfDay_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeOfDay_ReturnValue_1;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x003C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00C8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BigClock_01_C_UpdateTime) == 0x000004, "Wrong alignment on BigClock_01_C_UpdateTime");
static_assert(sizeof(BigClock_01_C_UpdateTime) == 0x000154, "Wrong size on BigClock_01_C_UpdateTime");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_GetTimeOfDay_ReturnValue) == 0x000000, "Member 'BigClock_01_C_UpdateTime::CallFunc_GetTimeOfDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_GetTimeOfDay_ReturnValue_1) == 0x000004, "Member 'BigClock_01_C_UpdateTime::CallFunc_GetTimeOfDay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_FMod_Remainder) == 0x000008, "Member 'BigClock_01_C_UpdateTime::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_FMod_ReturnValue) == 0x00000C, "Member 'BigClock_01_C_UpdateTime::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'BigClock_01_C_UpdateTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BigClock_01_C_UpdateTime::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BigClock_01_C_UpdateTime::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BigClock_01_C_UpdateTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BigClock_01_C_UpdateTime::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_MakeRotator_ReturnValue) == 0x000024, "Member 'BigClock_01_C_UpdateTime::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_MakeRotator_ReturnValue_1) == 0x000030, "Member 'BigClock_01_C_UpdateTime::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00003C, "Member 'BigClock_01_C_UpdateTime::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BigClock_01_C_UpdateTime, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000C8, "Member 'BigClock_01_C_UpdateTime::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

}

