#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BladeMenu_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BladeMenu_MainMenu.BladeMenu_MainMenu_C
// 0x0330 (0x0658 - 0x0328)
class UBladeMenu_MainMenu_C final : public UFortBladeMenu_MainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnClose;                                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOpen;                                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaMainMenuLeaveButton_C*           AthenaMainMenuLeaveButton;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_Feedback;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_MyIsland;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_Store;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonBacchusHelp;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonCredits;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonHUDLayoutTool;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonNews;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonSupport;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ChallengesButton;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      CheatsButton;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      CodeOfConduct;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ExitButton;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ExportIslandButton;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MenuIcon_1;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Legal;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveStreamMenuButtonToggle_C*          LiveStreamMenuButtonToggle;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      LockerButton;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      LogoutButton;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinigameButtons_C*                     MinigameButtons;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      NewPlayerFeedback;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      NewSettingsButton;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ParentalControlsButton;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ReportPlayerButton;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      RespawnButton;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Content;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneRatingIcons;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      TeamSelectButton;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MenuTitle;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextLowPowerMode;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWindowchromebuttons_C*                 Windowchromebuttons;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenu_C*                         OptionsMenu;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   InGameChallengeScreenClass;                        // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreditsScreenClass;                                // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LegalInfoClass;                                    // 0x0490(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AthenaNewsClass;                                   // 0x04B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   RespawnClass;                                      // 0x04E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MobileControlsHelpClass;                           // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   HUDLayoutToolClass;                                // 0x0530(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AFortMinigameSettingsBuilding*          Machine;                                           // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   TeamSelectWidgetClass;                             // 0x0560(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ReportPlayerClass;                                 // 0x0588(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FeedbackWidgetClass;                               // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   SettingTabToOpen;                                  // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AthenaMOTDWidget;                                  // 0x05E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ParentalControlsClass_New;                         // 0x0608(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   HUDLayoutToolV2Class;                              // 0x0630(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BladeMenu_MainMenu(int32 EntryPoint);
	void BndEvt__NewPlayerFeedback_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ExportIslandButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LockerButton_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Store_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnOpenSettings(class FName TabNameID, const class FString& SettingToSelect);
	void BndEvt__Button_BackToHub_1_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CheatsButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void BndEvt__NewSettingsButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ParentalControlsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnCloseAnimationFinished();
	void OnClosed();
	void OnOpened();
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void Bind_To_State_Change_Delegate();
	void UpdateMinigameButtons();
	void BndEvt__MinigameButtons_K2Node_ComponentBoundEvent_4_EndButtonClicked__DelegateSignature();
	void BndEvt__MinigameButtons_K2Node_ComponentBoundEvent_3_StartButtonClicked__DelegateSignature();
	void BndEvt__ButtonHUDLayoutTool_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__ButtonBacchusHelp_K2Node_ComponentBoundEvent_294_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RespawnButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__TeamSelectButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonNews_K2Node_ComponentBoundEvent_376_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SettingsButton_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Challenges_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_30_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonSupport_K2Node_ComponentBoundEvent_281_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Feedback_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Legal_K2Node_ComponentBoundEvent_146_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LogoutButton_K2Node_ComponentBoundEvent_434_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonCredits_K2Node_ComponentBoundEvent_1184_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnComplete_1BFCCA9642A0481B2AC5C98C395D0901(class UUserWidget* UserWidget);
	void OnComplete_367A73034FD99CE63E29E3AE4D9152D9(class UUserWidget* UserWidget);
	void OnComplete_DBC095954402329D4BF52AB37EE431FE(class UUserWidget* UserWidget);
	void OnComplete_1B16FD0540EB01F71EE4CB9487DE008F(class UUserWidget* UserWidget);
	void OnComplete_9D58A4A2427B684258DCD2B74D16F33D(class UUserWidget* UserWidget);
	void OnComplete_3602692F4ADF61C0F3DB968BD3E6C0DB(class UUserWidget* UserWidget);
	void OnComplete_E1DA5E5449DFBCC127E4789768A15824(class UUserWidget* UserWidget);
	void OnComplete_C40B546F4D559C0DDE942C8D05981EC0(class UUserWidget* UserWidget);
	void OnComplete_5E4638054E1B5D43CC83EA89C54063C9(class UUserWidget* UserWidget);
	void OnComplete_5ACD562A46D3600D9E96DD93D9BA79CB(class UUserWidget* UserWidget);
	void OnComplete_713FC70C4ABDCB2B10F83992B0F2CFBA(class UUserWidget* UserWidget);
	void OnComplete_DB4AEC7B48BCA8595C98A8AD430E3ECC(class UUserWidget* UserWidget);
	void OnComplete_9705B2DA4E1935041A94D1BCE262B043(class UUserWidget* UserWidget);
	void OnComplete_06E498CF409465D990D12C97DC0A19FB(class UUserWidget* UserWidget);
	void OnComplete_68346168454CE4BD30A1459D7C362A80(class UUserWidget* UserWidget);
	void OnComplete_A6D8547844A6293BDF92C6BE7D0DFBD4(class UUserWidget* UserWidget);
	void DialogResult_249B76DB49778A79985F7E953CDD60BD(EFortDialogResult Result, class FName ResultName);
	void DialogResult_13A3B92E4AD04C85D3EBFCB4331D32CA(EFortDialogResult Result, class FName ResultName);
	void InitializeMainMenu();
	void UpdateLowPowerMessage(bool PassThrough);
	void Handle_Low_Power_Mode();
	void SetSupportButtonVisibility();
	void SetLegalButtonVisibility();
	void HandleOpened();
	void Update_Team_Select_Visibility();
	void UpdateRespawnWidgetVisibility();
	void UpdateCreativeButtonsVisibility();
	void ShowMinigameButtons(class AFortVolume* Volume, class AFortPlayerControllerAthena* Player, class AFortGameStateAthena* FortGameStateAthena, bool* bResult);
	void Close();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BladeMenu_MainMenu_C">();
	}
	static class UBladeMenu_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBladeMenu_MainMenu_C>();
	}
};
static_assert(alignof(UBladeMenu_MainMenu_C) == 0x000008, "Wrong alignment on UBladeMenu_MainMenu_C");
static_assert(sizeof(UBladeMenu_MainMenu_C) == 0x000658, "Wrong size on UBladeMenu_MainMenu_C");
static_assert(offsetof(UBladeMenu_MainMenu_C, UberGraphFrame) == 0x000328, "Member 'UBladeMenu_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, OnClose) == 0x000330, "Member 'UBladeMenu_MainMenu_C::OnClose' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, OnOpen) == 0x000338, "Member 'UBladeMenu_MainMenu_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, AthenaMainMenuLeaveButton) == 0x000340, "Member 'UBladeMenu_MainMenu_C::AthenaMainMenuLeaveButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Button_Feedback) == 0x000348, "Member 'UBladeMenu_MainMenu_C::Button_Feedback' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Button_MyIsland) == 0x000350, "Member 'UBladeMenu_MainMenu_C::Button_MyIsland' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Button_Store) == 0x000358, "Member 'UBladeMenu_MainMenu_C::Button_Store' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ButtonBacchusHelp) == 0x000360, "Member 'UBladeMenu_MainMenu_C::ButtonBacchusHelp' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ButtonCredits) == 0x000368, "Member 'UBladeMenu_MainMenu_C::ButtonCredits' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ButtonHUDLayoutTool) == 0x000370, "Member 'UBladeMenu_MainMenu_C::ButtonHUDLayoutTool' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ButtonNews) == 0x000378, "Member 'UBladeMenu_MainMenu_C::ButtonNews' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ButtonSupport) == 0x000380, "Member 'UBladeMenu_MainMenu_C::ButtonSupport' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ChallengesButton) == 0x000388, "Member 'UBladeMenu_MainMenu_C::ChallengesButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, CheatsButton) == 0x000390, "Member 'UBladeMenu_MainMenu_C::CheatsButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, CodeOfConduct) == 0x000398, "Member 'UBladeMenu_MainMenu_C::CodeOfConduct' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ExitButton) == 0x0003A0, "Member 'UBladeMenu_MainMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ExportIslandButton) == 0x0003A8, "Member 'UBladeMenu_MainMenu_C::ExportIslandButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Image_MenuIcon_1) == 0x0003B0, "Member 'UBladeMenu_MainMenu_C::Image_MenuIcon_1' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Legal) == 0x0003B8, "Member 'UBladeMenu_MainMenu_C::Legal' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, LiveStreamMenuButtonToggle) == 0x0003C0, "Member 'UBladeMenu_MainMenu_C::LiveStreamMenuButtonToggle' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, LockerButton) == 0x0003C8, "Member 'UBladeMenu_MainMenu_C::LockerButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, LogoutButton) == 0x0003D0, "Member 'UBladeMenu_MainMenu_C::LogoutButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, MinigameButtons) == 0x0003D8, "Member 'UBladeMenu_MainMenu_C::MinigameButtons' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, NewPlayerFeedback) == 0x0003E0, "Member 'UBladeMenu_MainMenu_C::NewPlayerFeedback' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, NewSettingsButton) == 0x0003E8, "Member 'UBladeMenu_MainMenu_C::NewSettingsButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ParentalControlsButton) == 0x0003F0, "Member 'UBladeMenu_MainMenu_C::ParentalControlsButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ReportPlayerButton) == 0x0003F8, "Member 'UBladeMenu_MainMenu_C::ReportPlayerButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, RespawnButton) == 0x000400, "Member 'UBladeMenu_MainMenu_C::RespawnButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, SafeZone_Content) == 0x000408, "Member 'UBladeMenu_MainMenu_C::SafeZone_Content' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, SafeZoneRatingIcons) == 0x000410, "Member 'UBladeMenu_MainMenu_C::SafeZoneRatingIcons' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, TeamSelectButton) == 0x000418, "Member 'UBladeMenu_MainMenu_C::TeamSelectButton' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Text_MenuTitle) == 0x000420, "Member 'UBladeMenu_MainMenu_C::Text_MenuTitle' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, TextLowPowerMode) == 0x000428, "Member 'UBladeMenu_MainMenu_C::TextLowPowerMode' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Windowchromebuttons) == 0x000430, "Member 'UBladeMenu_MainMenu_C::Windowchromebuttons' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, OptionsMenu) == 0x000438, "Member 'UBladeMenu_MainMenu_C::OptionsMenu' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, InGameChallengeScreenClass) == 0x000440, "Member 'UBladeMenu_MainMenu_C::InGameChallengeScreenClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, CreditsScreenClass) == 0x000468, "Member 'UBladeMenu_MainMenu_C::CreditsScreenClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, LegalInfoClass) == 0x000490, "Member 'UBladeMenu_MainMenu_C::LegalInfoClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, AthenaNewsClass) == 0x0004B8, "Member 'UBladeMenu_MainMenu_C::AthenaNewsClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, RespawnClass) == 0x0004E0, "Member 'UBladeMenu_MainMenu_C::RespawnClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, MobileControlsHelpClass) == 0x000508, "Member 'UBladeMenu_MainMenu_C::MobileControlsHelpClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, HUDLayoutToolClass) == 0x000530, "Member 'UBladeMenu_MainMenu_C::HUDLayoutToolClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, Machine) == 0x000558, "Member 'UBladeMenu_MainMenu_C::Machine' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, TeamSelectWidgetClass) == 0x000560, "Member 'UBladeMenu_MainMenu_C::TeamSelectWidgetClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ReportPlayerClass) == 0x000588, "Member 'UBladeMenu_MainMenu_C::ReportPlayerClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, FeedbackWidgetClass) == 0x0005B0, "Member 'UBladeMenu_MainMenu_C::FeedbackWidgetClass' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, SettingTabToOpen) == 0x0005D8, "Member 'UBladeMenu_MainMenu_C::SettingTabToOpen' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, AthenaMOTDWidget) == 0x0005E0, "Member 'UBladeMenu_MainMenu_C::AthenaMOTDWidget' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, ParentalControlsClass_New) == 0x000608, "Member 'UBladeMenu_MainMenu_C::ParentalControlsClass_New' has a wrong offset!");
static_assert(offsetof(UBladeMenu_MainMenu_C, HUDLayoutToolV2Class) == 0x000630, "Member 'UBladeMenu_MainMenu_C::HUDLayoutToolV2Class' has a wrong offset!");

}

