#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BladeMenu_SocialPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BladeMenu_SocialPanel.BladeMenu_SocialPanel_C.ExecuteUbergraph_BladeMenu_SocialPanel
// 0x0060 (0x0060 - 0x0000)
struct BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7397[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7398[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7399[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739A[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739B[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel) == 0x000008, "Wrong alignment on BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel");
static_assert(sizeof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel) == 0x000060, "Wrong size on BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, EntryPoint) == 0x000000, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PauseAnimation_ReturnValue) == 0x000024, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_GetEndTime_ReturnValue_1) == 0x000030, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000034, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PauseAnimation_ReturnValue_1) == 0x000048, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x00004C, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel, CallFunc_PlayAnimation_ReturnValue_3) == 0x000058, "Member 'BladeMenu_SocialPanel_C_ExecuteUbergraph_BladeMenu_SocialPanel::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

