#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP13_BuildABrella

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP13_BuildABrella.BP13_BuildABrella_C.UpdateTransitionVFX
// 0x0038 (0x0038 - 0x0000)
struct BP13_BuildABrella_C_UpdateTransitionVFX final
{
public:
	struct FGameplayTag                           Variant_Channel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_1;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_2;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_3;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_3;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_BuildABrella_C_UpdateTransitionVFX) == 0x000008, "Wrong alignment on BP13_BuildABrella_C_UpdateTransitionVFX");
static_assert(sizeof(BP13_BuildABrella_C_UpdateTransitionVFX) == 0x000038, "Wrong size on BP13_BuildABrella_C_UpdateTransitionVFX");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, Variant_Channel) == 0x000000, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::Variant_Channel' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_MatchesAnyTags_ReturnValue) == 0x000008, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_MatchesAnyTags_ReturnValue_1) == 0x000009, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_MatchesAnyTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_MatchesAnyTags_ReturnValue_2) == 0x00000A, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_MatchesAnyTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_MatchesAnyTags_ReturnValue_3) == 0x00000B, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_MatchesAnyTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_GetSocketLocation_ReturnValue) == 0x00000C, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000018, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000020, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000028, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateTransitionVFX, CallFunc_SpawnSystemAtLocation_ReturnValue_3) == 0x000030, "Member 'BP13_BuildABrella_C_UpdateTransitionVFX::CallFunc_SpawnSystemAtLocation_ReturnValue_3' has a wrong offset!");

// Function BP13_BuildABrella.BP13_BuildABrella_C.UpdateAudio
// 0x000C (0x000C - 0x0000)
struct BP13_BuildABrella_C_UpdateAudio final
{
public:
	struct FGameplayTag                           Variant_Channel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_1;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_2;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_3;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP13_BuildABrella_C_UpdateAudio) == 0x000004, "Wrong alignment on BP13_BuildABrella_C_UpdateAudio");
static_assert(sizeof(BP13_BuildABrella_C_UpdateAudio) == 0x00000C, "Wrong size on BP13_BuildABrella_C_UpdateAudio");
static_assert(offsetof(BP13_BuildABrella_C_UpdateAudio, Variant_Channel) == 0x000000, "Member 'BP13_BuildABrella_C_UpdateAudio::Variant_Channel' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateAudio, CallFunc_MatchesAnyTags_ReturnValue) == 0x000008, "Member 'BP13_BuildABrella_C_UpdateAudio::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateAudio, CallFunc_MatchesAnyTags_ReturnValue_1) == 0x000009, "Member 'BP13_BuildABrella_C_UpdateAudio::CallFunc_MatchesAnyTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateAudio, CallFunc_MatchesAnyTags_ReturnValue_2) == 0x00000A, "Member 'BP13_BuildABrella_C_UpdateAudio::CallFunc_MatchesAnyTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_UpdateAudio, CallFunc_MatchesAnyTags_ReturnValue_3) == 0x00000B, "Member 'BP13_BuildABrella_C_UpdateAudio::CallFunc_MatchesAnyTags_ReturnValue_3' has a wrong offset!");

// Function BP13_BuildABrella.BP13_BuildABrella_C.OnVariantChanged
// 0x0018 (0x0018 - 0x0000)
struct BP13_BuildABrella_C_OnVariantChanged final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OldVariantTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewVariantTag;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_BuildABrella_C_OnVariantChanged) == 0x000004, "Wrong alignment on BP13_BuildABrella_C_OnVariantChanged");
static_assert(sizeof(BP13_BuildABrella_C_OnVariantChanged) == 0x000018, "Wrong size on BP13_BuildABrella_C_OnVariantChanged");
static_assert(offsetof(BP13_BuildABrella_C_OnVariantChanged, VariantChannel) == 0x000000, "Member 'BP13_BuildABrella_C_OnVariantChanged::VariantChannel' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_OnVariantChanged, OldVariantTag) == 0x000008, "Member 'BP13_BuildABrella_C_OnVariantChanged::OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_OnVariantChanged, NewVariantTag) == 0x000010, "Member 'BP13_BuildABrella_C_OnVariantChanged::NewVariantTag' has a wrong offset!");

// Function BP13_BuildABrella.BP13_BuildABrella_C.ExecuteUbergraph_BP13_BuildABrella
// 0x001C (0x001C - 0x0000)
struct BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_VariantChannel;                       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_OldVariantTag;                        // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NewVariantTag;                        // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella) == 0x000004, "Wrong alignment on BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella");
static_assert(sizeof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella) == 0x00001C, "Wrong size on BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella");
static_assert(offsetof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella, EntryPoint) == 0x000000, "Member 'BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella, K2Node_Event_VariantChannel) == 0x000004, "Member 'BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella::K2Node_Event_VariantChannel' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella, K2Node_Event_OldVariantTag) == 0x00000C, "Member 'BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella::K2Node_Event_OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella, K2Node_Event_NewVariantTag) == 0x000014, "Member 'BP13_BuildABrella_C_ExecuteUbergraph_BP13_BuildABrella::K2Node_Event_NewVariantTag' has a wrong offset!");

}

