#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP13_StyleChallenge_Mannequin

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C.RacerZeroSetup
// 0x0048 (0x0048 - 0x0000)
struct BP13_StyleChallenge_Mannequin_C_RacerZeroSetup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_2;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup) == 0x000008, "Wrong alignment on BP13_StyleChallenge_Mannequin_C_RacerZeroSetup");
static_assert(sizeof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup) == 0x000048, "Wrong size on BP13_StyleChallenge_Mannequin_C_RacerZeroSetup");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000002, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000004, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue_3) == 0x000006, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue_4) == 0x000007, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_IsValid_ReturnValue_5) == 0x000008, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000018, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1) == 0x000020, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000028, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2) == 0x000030, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_SpawnEmitterAttached_ReturnValue_2) == 0x000038, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_SpawnEmitterAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_RacerZeroSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000040, "Member 'BP13_StyleChallenge_Mannequin_C_RacerZeroSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");

// Function BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C.ProfPupSetup
// 0x0050 (0x0050 - 0x0000)
struct BP13_StyleChallenge_Mannequin_C_ProfPupSetup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup) == 0x000008, "Wrong alignment on BP13_StyleChallenge_Mannequin_C_ProfPupSetup");
static_assert(sizeof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup) == 0x000050, "Wrong size on BP13_StyleChallenge_Mannequin_C_ProfPupSetup");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000010, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1) == 0x000020, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000028, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000030, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2) == 0x000038, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x000040, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ProfPupSetup, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000048, "Member 'BP13_StyleChallenge_Mannequin_C_ProfPupSetup::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");

// Function BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C.OnVariantChanged
// 0x0018 (0x0018 - 0x0000)
struct BP13_StyleChallenge_Mannequin_C_OnVariantChanged final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OldVariantTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewVariantTag;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_StyleChallenge_Mannequin_C_OnVariantChanged) == 0x000004, "Wrong alignment on BP13_StyleChallenge_Mannequin_C_OnVariantChanged");
static_assert(sizeof(BP13_StyleChallenge_Mannequin_C_OnVariantChanged) == 0x000018, "Wrong size on BP13_StyleChallenge_Mannequin_C_OnVariantChanged");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnVariantChanged, VariantChannel) == 0x000000, "Member 'BP13_StyleChallenge_Mannequin_C_OnVariantChanged::VariantChannel' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnVariantChanged, OldVariantTag) == 0x000008, "Member 'BP13_StyleChallenge_Mannequin_C_OnVariantChanged::OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnVariantChanged, NewVariantTag) == 0x000010, "Member 'BP13_StyleChallenge_Mannequin_C_OnVariantChanged::NewVariantTag' has a wrong offset!");

// Function BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C.OnPartChanged
// 0x0018 (0x0018 - 0x0000)
struct BP13_StyleChallenge_Mannequin_C_OnPartChanged final
{
public:
	const class UCustomCharacterPart*             OldPart;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCustomCharacterPart*             Param_NewPart;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomPartType                           PartType;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_StyleChallenge_Mannequin_C_OnPartChanged) == 0x000008, "Wrong alignment on BP13_StyleChallenge_Mannequin_C_OnPartChanged");
static_assert(sizeof(BP13_StyleChallenge_Mannequin_C_OnPartChanged) == 0x000018, "Wrong size on BP13_StyleChallenge_Mannequin_C_OnPartChanged");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnPartChanged, OldPart) == 0x000000, "Member 'BP13_StyleChallenge_Mannequin_C_OnPartChanged::OldPart' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnPartChanged, Param_NewPart) == 0x000008, "Member 'BP13_StyleChallenge_Mannequin_C_OnPartChanged::Param_NewPart' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_OnPartChanged, PartType) == 0x000010, "Member 'BP13_StyleChallenge_Mannequin_C_OnPartChanged::PartType' has a wrong offset!");

// Function BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C.ExecuteUbergraph_BP13_StyleChallenge_Mannequin
// 0x0048 (0x0048 - 0x0000)
struct BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_VariantChannel;                       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_OldVariantTag;                        // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NewVariantTag;                        // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCustomCharacterPart*             K2Node_Event_OldPart;                              // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCustomCharacterPart*             K2Node_Event_NewPart;                              // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomPartType                           K2Node_Event_PartType;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C20[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin) == 0x000008, "Wrong alignment on BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin");
static_assert(sizeof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin) == 0x000048, "Wrong size on BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, EntryPoint) == 0x000000, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_VariantChannel) == 0x000004, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_VariantChannel' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_OldVariantTag) == 0x00000C, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_NewVariantTag) == 0x000014, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_NewVariantTag' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_OldPart) == 0x000020, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_OldPart' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_NewPart) == 0x000028, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_NewPart' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, K2Node_Event_PartType) == 0x000030, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::K2Node_Event_PartType' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000034, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x000040, "Member 'BP13_StyleChallenge_Mannequin_C_ExecuteUbergraph_BP13_StyleChallenge_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");

}

