#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP13_StyleChallenge_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C
// 0x0038 (0x04D0 - 0x0498)
class ABP13_StyleChallenge_Mannequin_C final : public AFortPlayerMannequin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCustomCharacterPart*                   NewPart;                                           // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BodyVFX;                                           // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ProfPupVFXs;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RacerZeroBody1VFX;                                 // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Racer_Zero_Body2VFX;                               // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Racer_Zero_Head_VFX;                               // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RacerZeroSetup();
	void ProfPupSetup();
	void OnVariantChanged(const struct FGameplayTag& VariantChannel, const struct FGameplayTag& OldVariantTag, const struct FGameplayTag& NewVariantTag);
	void OnPartChanged(const class UCustomCharacterPart* OldPart, const class UCustomCharacterPart* Param_NewPart, EFortCustomPartType PartType);
	void ExecuteUbergraph_BP13_StyleChallenge_Mannequin(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP13_StyleChallenge_Mannequin_C">();
	}
	static class ABP13_StyleChallenge_Mannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP13_StyleChallenge_Mannequin_C>();
	}
};
static_assert(alignof(ABP13_StyleChallenge_Mannequin_C) == 0x000008, "Wrong alignment on ABP13_StyleChallenge_Mannequin_C");
static_assert(sizeof(ABP13_StyleChallenge_Mannequin_C) == 0x0004D0, "Wrong size on ABP13_StyleChallenge_Mannequin_C");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, UberGraphFrame) == 0x000498, "Member 'ABP13_StyleChallenge_Mannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, NewPart) == 0x0004A0, "Member 'ABP13_StyleChallenge_Mannequin_C::NewPart' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, BodyVFX) == 0x0004A8, "Member 'ABP13_StyleChallenge_Mannequin_C::BodyVFX' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, ProfPupVFXs) == 0x0004B0, "Member 'ABP13_StyleChallenge_Mannequin_C::ProfPupVFXs' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, RacerZeroBody1VFX) == 0x0004B8, "Member 'ABP13_StyleChallenge_Mannequin_C::RacerZeroBody1VFX' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, Racer_Zero_Body2VFX) == 0x0004C0, "Member 'ABP13_StyleChallenge_Mannequin_C::Racer_Zero_Body2VFX' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, Racer_Zero_Head_VFX) == 0x0004C8, "Member 'ABP13_StyleChallenge_Mannequin_C::Racer_Zero_Head_VFX' has a wrong offset!");

}

