#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_SpeedSign

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.ExecuteUbergraph_BP_Athena_SpeedSign
// 0x0348 (0x0348 - 0x0000)
struct BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81DA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetDriver_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DB[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_81DC[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DD[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DE[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0090(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DF[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0120(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0138(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E0[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetClosestActorFromArray_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E1[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E2[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E3[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue;           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81E4[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_2; // 0x01B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E5[0x2];                                     // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E6[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E7[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0230(0x0020)(ConstParm)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest; // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1; // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E8[0x5];                                     // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0260(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_2;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E9[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0298(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_3;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1; // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1; // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EA[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_2; // 0x02B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_4;                         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81EB[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EC[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81ED[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_3; // 0x0300(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_5;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EE[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EF[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign) == 0x000008, "Wrong alignment on BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign");
static_assert(sizeof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign) == 0x000348, "Wrong size on BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, EntryPoint) == 0x000000, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetAllPassengers_ReturnValue) == 0x000008, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetDriver_ReturnValue) == 0x000020, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000030, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Length_ReturnValue_2) == 0x000038, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_HasAuthority_ReturnValue) == 0x000068, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000070, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_OtherActor) == 0x000078, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_OtherComp) == 0x000080, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000088, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_bFromSweep) == 0x00008C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_ComponentBoundEvent_SweepResult) == 0x000090, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_IsValid_ReturnValue_1) == 0x00011C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000120, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_Event_OtherActor) == 0x000130, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000138, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Length_ReturnValue_3) == 0x000148, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00014C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetClosestActorFromArray_ReturnValue) == 0x000150, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetClosestActorFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000158, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x000168, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000178, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetForwardSpeedKmh_ReturnValue) == 0x00018C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetForwardSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Abs_ReturnValue) == 0x000190, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetVelocity_ReturnValue) == 0x000194, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001A0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_VSize_ReturnValue) == 0x0001A4, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001A8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetOverlappingActors_OverlappingActors_2) == 0x0001B0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetOverlappingActors_OverlappingActors_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, Temp_int_Array_Index_Variable) == 0x0001C0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Length_ReturnValue_4) == 0x0001C4, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001D0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001D1, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetVelocity_ReturnValue_1) == 0x0001D4, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_VSize_ReturnValue_1) == 0x0001E0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, Temp_int_Array_Index_Variable_1) == 0x0001E4, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001E8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0001F8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, Temp_int_Variable) == 0x000200, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_IsValid_ReturnValue_2) == 0x000204, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x000208, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_MakeArray_Array) == 0x000210, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetGameState_ReturnValue) == 0x000220, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_CustomEvent_PlaylistName) == 0x000228, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_CustomEvent_PlaylistContextTags) == 0x000230, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000250, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_DynamicCast_bSuccess_3) == 0x000258, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest) == 0x000259, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1) == 0x00025A, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000260, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item_2) == 0x000270, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000278, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000279, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00027A, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetQuestManager_ReturnValue) == 0x000280, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, K2Node_CreateDelegate_OutputDelegate_2) == 0x000288, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000298, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item_3) == 0x0002A8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1) == 0x0002B0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1) == 0x0002B1, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1) == 0x0002B2, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_BooleanOR_ReturnValue) == 0x0002B3, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetLocalFortPlayerControllers_ReturnValue_2) == 0x0002B8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetLocalFortPlayerControllers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item_4) == 0x0002C8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, Temp_int_Loop_Counter_Variable) == 0x0002D0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002D8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002E0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Less_IntInt_ReturnValue) == 0x0002EC, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Add_IntInt_ReturnValue) == 0x0002F0, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002F8, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GetLocalFortPlayerControllers_ReturnValue_3) == 0x000300, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GetLocalFortPlayerControllers_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_Get_Item_5) == 0x000310, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_AddUnique_ReturnValue) == 0x000318, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00031C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, Temp_int_Loop_Counter_Variable_1) == 0x000320, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Less_IntInt_ReturnValue_1) == 0x000324, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Add_IntInt_ReturnValue_1) == 0x000328, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00032C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000338, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_Add_IntInt_ReturnValue_2) == 0x00033C, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign, CallFunc_HasAuthority_ReturnValue_1) == 0x000340, "Member 'BP_Athena_SpeedSign_C_ExecuteUbergraph_BP_Athena_SpeedSign::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct BP_Athena_SpeedSign_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Athena_SpeedSign_C_PlaylistLoaded) == 0x000008, "Wrong alignment on BP_Athena_SpeedSign_C_PlaylistLoaded");
static_assert(sizeof(BP_Athena_SpeedSign_C_PlaylistLoaded) == 0x000028, "Wrong size on BP_Athena_SpeedSign_C_PlaylistLoaded");
static_assert(offsetof(BP_Athena_SpeedSign_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'BP_Athena_SpeedSign_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'BP_Athena_SpeedSign_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Athena_SpeedSign_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SpeedSign_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_Athena_SpeedSign_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_Athena_SpeedSign_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_Athena_SpeedSign_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_Athena_SpeedSign_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_Athena_SpeedSign_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81F0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Athena_SpeedSign_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Athena_SpeedSign_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_SpeedSign_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Athena_SpeedSign_C_UserConstructionScript");
static_assert(sizeof(BP_Athena_SpeedSign_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Athena_SpeedSign_C_UserConstructionScript");
static_assert(offsetof(BP_Athena_SpeedSign_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Athena_SpeedSign_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Athena_SpeedSign.BP_Athena_SpeedSign_C.OnRep_VehicleSpeed
// 0x0002 (0x0002 - 0x0000)
struct BP_Athena_SpeedSign_C_OnRep_VehicleSpeed final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_SpeedSign_C_OnRep_VehicleSpeed) == 0x000001, "Wrong alignment on BP_Athena_SpeedSign_C_OnRep_VehicleSpeed");
static_assert(sizeof(BP_Athena_SpeedSign_C_OnRep_VehicleSpeed) == 0x000002, "Wrong size on BP_Athena_SpeedSign_C_OnRep_VehicleSpeed");
static_assert(offsetof(BP_Athena_SpeedSign_C_OnRep_VehicleSpeed, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Athena_SpeedSign_C_OnRep_VehicleSpeed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_SpeedSign_C_OnRep_VehicleSpeed, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'BP_Athena_SpeedSign_C_OnRep_VehicleSpeed::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

