#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_CalendarEvent_PropHandler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CalendarEventPropInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_CalendarEvent_PropHandler.BP_Athena_CalendarEvent_PropHandler_C.ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler
// 0x0540 (0x0540 - 0x0000)
struct BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E42[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_5;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_5;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_5;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_5;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5E43[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_4;                    // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_4;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_4;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_4;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5E44[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_3;                    // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_3;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_3;               // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_3;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_2;                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_3;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E45[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5E46[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5E47[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_2;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_4;                            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_5;                            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_8;                    // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_8;                 // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_8;               // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_8;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E48[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E49[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4A[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SVLair_GeodeObject_C*               K2Node_DynamicCast_AsBP_SVLair_Geode_Object;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4B[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4C[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_6;                    // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_6;                 // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_6;               // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_6;                // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4D[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue_1;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4E[0x1];                                     // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4F[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_7;                    // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_7;                 // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_7;               // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_7;                // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E50[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxElement_ReturnValue;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E51[0x2];                                     // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0340(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E52[0x8];                                     // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarEventPropInfo                 K2Node_MakeStruct_CalendarEventPropInfo;           // 0x0380(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E53[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E54[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E55[0x3];                                     // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue_1;         // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxElement_ReturnValue_1;              // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E56[0x4];                                     // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E57[0x1];                                     // 0x0437(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E58[0x3];                                     // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E59[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SVLair_GeodeObject_C*               K2Node_DynamicCast_AsBP_SVLair_Geode_Object_1;     // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5A[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	class AFortGameModeZone*                      K2Node_DynamicCast_AsFort_Game_Mode_Zone;          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5B[0x5];                                     // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5C[0x7];                                     // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x04A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5D[0x4];                                     // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCalendarEventPropInfo                 K2Node_MakeStruct_CalendarEventPropInfo_1;         // 0x04E0(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5E[0x3];                                     // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x052E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5F[0x1];                                     // 0x052F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue_2;         // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler) == 0x000010, "Wrong alignment on BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler");
static_assert(sizeof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler) == 0x000540, "Wrong size on BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, EntryPoint) == 0x000000, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_float_Variable) == 0x000008, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable) == 0x000010, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable_1) == 0x000018, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_string_Variable) == 0x000020, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_5) == 0x000030, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_5) == 0x000040, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_5) == 0x000048, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_5) == 0x000050, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_4) == 0x000068, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_4) == 0x000078, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_4) == 0x000080, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_4) == 0x000088, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_3) == 0x0000A0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_3) == 0x0000B0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_3) == 0x0000B8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_3) == 0x0000C0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C4, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_float_Variable_1) == 0x0000D4, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable_2) == 0x0000D8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable_3) == 0x0000E0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_string_Variable_1) == 0x0000E8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000F8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_2) == 0x000100, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000110, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000118, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000120, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_3) == 0x000124, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_1) == 0x000138, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000148, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000150, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000158, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_4) == 0x00015C, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName) == 0x000170, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd) == 0x000180, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin) == 0x000188, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio) == 0x000190, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_5) == 0x000194, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_float_Variable_2) == 0x0001A4, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable_4) == 0x0001A8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_struct_Variable_5) == 0x0001B0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_string_Variable_2) == 0x0001B8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_8) == 0x0001C8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_8' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_8) == 0x0001D8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_8' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_8) == 0x0001E0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_8' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_8) == 0x0001E8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_8' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Array_Index_Variable) == 0x0001EC, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Loop_Counter_Variable) == 0x0001F0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Array_Index_Variable_1) == 0x0001F8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_bool_Has_Been_Initd_Variable) == 0x0001FC, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Loop_Counter_Variable_1) == 0x000200, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Less_IntInt_ReturnValue) == 0x000204, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Add_IntInt_ReturnValue_1) == 0x000208, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Array_Index_Variable_2) == 0x00020C, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Array_Get_Item) == 0x000210, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_6) == 0x000218, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_DynamicCast_AsBP_SVLair_Geode_Object) == 0x000230, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_DynamicCast_AsBP_SVLair_Geode_Object' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_bool_IsClosed_Variable) == 0x000239, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000240, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_IsValid_ReturnValue_1) == 0x000248, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000249, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_6) == 0x000250, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_6' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_6) == 0x000260, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_6' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_6) == 0x000268, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_6' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_6) == 0x000270, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_6' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_SwitchEnum_CmpSuccess) == 0x000274, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_WatchCalendarEvent_ReturnValue_1) == 0x000278, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_WatchCalendarEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000280, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_IsValid_ReturnValue_2) == 0x000281, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000282, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CreateDelegate_OutputDelegate_7) == 0x000284, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Loop_Counter_Variable_2) == 0x000294, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, Temp_int_Array_Index_Variable_3) == 0x000298, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Add_IntInt_ReturnValue_2) == 0x00029C, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002A0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_EventName_7) == 0x0002A8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_EventName_7' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeUntilEnd_7) == 0x0002B8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeUntilEnd_7' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSinceBegin_7) == 0x0002C0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSinceBegin_7' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, K2Node_CustomEvent_TimeSpanRatio_7) == 0x0002C8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::K2Node_CustomEvent_TimeSpanRatio_7' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_K2_SetTimer_ReturnValue) == 0x0002D0, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x0002D8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_GetMaxElement_ReturnValue) == 0x0002E4, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0002E8, "Member 'BP_Athena_CalendarEvent_PropHandler_C_ExecuteUbergraph_BP_Athena_CalendarEvent_PropHandler::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
