#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_SpeedSign

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Athena_SpeedSign.BP_Athena_SpeedSign_C
// 0x00B8 (0x0C78 - 0x0BC0)
class ABP_Athena_SpeedSign_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMat;                                        // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SpeedTimer;                                        // 0x0BD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         VehicleSpeed;                                      // 0x0BE0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D5[0x4];                                     // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsInRange;                                     // 0x0BE8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         SpeedLimit;                                        // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D6[0x4];                                     // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   MovingPlayer;                                      // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          PlayersInVehicle;                                  // 0x0C08(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          VehicleTriggersSign;                               // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D7[0x7];                                     // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CreativeMode;                                      // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          QuestLocallyActive;                                // 0x0C31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D8[0x6];                                     // 0x0C32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        QuestSuccessEmitter;                               // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             QuestSuccessSound;                                 // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   QuestSuccessForceFeedback;                         // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BreakSpeedLimitSound;                              // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlinkNum;                                          // 0x0C58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D9[0x4];                                     // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> MovingVehicleInterface;                            // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldGrantQuestReward;                            // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Athena_SpeedSign(int32 EntryPoint);
	void SpeedLimitExceeded();
	void PlayQuestSuccessFX();
	void QuestUpdated();
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	void GatherPlayersForQuestReward();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void UpdateSpeed();
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();
	void OnRep_VehicleSpeed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Athena_SpeedSign_C">();
	}
	static class ABP_Athena_SpeedSign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Athena_SpeedSign_C>();
	}
};
static_assert(alignof(ABP_Athena_SpeedSign_C) == 0x000008, "Wrong alignment on ABP_Athena_SpeedSign_C");
static_assert(sizeof(ABP_Athena_SpeedSign_C) == 0x000C78, "Wrong size on ABP_Athena_SpeedSign_C");
static_assert(offsetof(ABP_Athena_SpeedSign_C, UberGraphFrame) == 0x000BC0, "Member 'ABP_Athena_SpeedSign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, Box) == 0x000BC8, "Member 'ABP_Athena_SpeedSign_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, DynamicMat) == 0x000BD0, "Member 'ABP_Athena_SpeedSign_C::DynamicMat' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, SpeedTimer) == 0x000BD8, "Member 'ABP_Athena_SpeedSign_C::SpeedTimer' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, VehicleSpeed) == 0x000BE0, "Member 'ABP_Athena_SpeedSign_C::VehicleSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, ActorsInRange) == 0x000BE8, "Member 'ABP_Athena_SpeedSign_C::ActorsInRange' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, SpeedLimit) == 0x000BF8, "Member 'ABP_Athena_SpeedSign_C::SpeedLimit' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, MovingPlayer) == 0x000C00, "Member 'ABP_Athena_SpeedSign_C::MovingPlayer' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, PlayersInVehicle) == 0x000C08, "Member 'ABP_Athena_SpeedSign_C::PlayersInVehicle' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, VehicleTriggersSign) == 0x000C18, "Member 'ABP_Athena_SpeedSign_C::VehicleTriggersSign' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, QuestItem) == 0x000C20, "Member 'ABP_Athena_SpeedSign_C::QuestItem' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, ObjBackendName) == 0x000C28, "Member 'ABP_Athena_SpeedSign_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, CreativeMode) == 0x000C30, "Member 'ABP_Athena_SpeedSign_C::CreativeMode' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, QuestLocallyActive) == 0x000C31, "Member 'ABP_Athena_SpeedSign_C::QuestLocallyActive' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, QuestSuccessEmitter) == 0x000C38, "Member 'ABP_Athena_SpeedSign_C::QuestSuccessEmitter' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, QuestSuccessSound) == 0x000C40, "Member 'ABP_Athena_SpeedSign_C::QuestSuccessSound' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, QuestSuccessForceFeedback) == 0x000C48, "Member 'ABP_Athena_SpeedSign_C::QuestSuccessForceFeedback' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, BreakSpeedLimitSound) == 0x000C50, "Member 'ABP_Athena_SpeedSign_C::BreakSpeedLimitSound' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, BlinkNum) == 0x000C58, "Member 'ABP_Athena_SpeedSign_C::BlinkNum' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, MovingVehicleInterface) == 0x000C60, "Member 'ABP_Athena_SpeedSign_C::MovingVehicleInterface' has a wrong offset!");
static_assert(offsetof(ABP_Athena_SpeedSign_C, ShouldGrantQuestReward) == 0x000C70, "Member 'ABP_Athena_SpeedSign_C::ShouldGrantQuestReward' has a wrong offset!");

}

