#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ApolloSnowSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ApolloSnowSetup.BP_ApolloSnowSetup_C.ExecuteUbergraph_BP_ApolloSnowSetup
// 0x0398 (0x0398 - 0x0000)
struct BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0028(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8449[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844A[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844B[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_3;     // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844C[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_4;     // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_3;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844D[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_5;     // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Intensity_1;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844E[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_6;     // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844F[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_1; // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8450[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_1; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_1; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_2; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8451[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_2; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_2; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_2; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8452[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_GameStateReady*        CallFunc_GameStateReadyAsync_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8453[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         Temp_object_Variable_2;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8454[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8455[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_CustomEvent_GameState_1;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_3; // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8456[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_3; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_3; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_3; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_4; // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8457[0x2];                                     // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_4; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_4; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_4; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Intensity;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_7;     // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_4;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8458[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_8;     // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_5;    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8459[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_9;     // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_10;    // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_11;    // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGameStateBase* GameState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Month;                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Day;                            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Year;                           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Hour;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_1;               // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_2;               // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_3;               // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio;            // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength;  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo;        // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845A[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_1;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_1; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845B[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_1;      // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_1;    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845C[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_4;               // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_2;          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_2; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_2;      // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_2;    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845D[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_5;               // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_6;               // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_7;               // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_3;          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_3; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_3;      // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_3;    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845E[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_4;          // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_4; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845F[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_4;      // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_4;    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8460[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_6;    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8461[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_12;    // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_5; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8462[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_5; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_5; // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_5; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8463[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_8;               // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_9;               // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_5;          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_5; // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_5;      // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_5;    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_7;    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_6; // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8464[0x5];                                     // 0x0353(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_6; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_6; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_6; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8465[0x3];                                     // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_10;              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProxyCalendarEventRatio_Ratio_6;          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ProxyCalendarEventRatio_EventHourLength_6; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProxyCalendarEventRatio_EventInfo_6;      // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProxyCalendarEventRatio_EventActive_6;    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup) == 0x000008, "Wrong alignment on BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup");
static_assert(sizeof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup) == 0x000398, "Wrong size on BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, EntryPoint) == 0x000000, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_GameState) == 0x000018, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Playlist) == 0x000020, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_PlaylistContextTags) == 0x000028, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_struct_Variable) == 0x000048, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_object_Variable) == 0x000068, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_object_Variable_1) == 0x000070, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000084, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x00008C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_2) == 0x000098, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_3) == 0x0000A4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x0000AC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_4) == 0x0000B0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_3) == 0x0000B8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_5) == 0x0000BC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Intensity_1) == 0x0000C4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Intensity_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MatchReadyAsync_ReturnValue) == 0x0000C8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_6) == 0x0000E4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x0000EC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x0000F0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x0000F8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000100, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_1) == 0x000104, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_1) == 0x000108, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_1) == 0x000110, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_1) == 0x000118, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00011C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_2) == 0x000120, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_2) == 0x000128, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_2) == 0x000130, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_2) == 0x000138, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue) == 0x00013C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GameStateReadyAsync_ReturnValue) == 0x000140, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GameStateReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_1) == 0x000148, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_IsValid_ReturnValue_2) == 0x000149, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue) == 0x00014C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, Temp_object_Variable_2) == 0x000150, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_FClamp_ReturnValue) == 0x000158, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000160, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_GameState_1) == 0x000170, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_GameState_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_2) == 0x000178, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_3) == 0x000179, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_3) == 0x000180, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_3) == 0x000188, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_3) == 0x000190, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue_1) == 0x000194, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_FClamp_ReturnValue_1) == 0x000198, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_HasAuthority_ReturnValue_3) == 0x00019C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_4) == 0x00019D, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_4) == 0x0001A0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_4) == 0x0001A8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_4) == 0x0001B0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Intensity) == 0x0001B4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Intensity' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_7) == 0x0001B8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_4) == 0x0001C0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_8) == 0x0001C4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_5) == 0x0001CC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_9) == 0x0001D0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_10) == 0x0001D8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_11) == 0x0001E0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue) == 0x0001F8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Month) == 0x000200, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Month' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Day) == 0x000204, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Day' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Year) == 0x000208, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Year' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, K2Node_CustomEvent_Hour) == 0x00020C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::K2Node_CustomEvent_Hour' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_1) == 0x000210, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_2) == 0x000218, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_3) == 0x000220, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_Ratio) == 0x000228, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_Ratio' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventHourLength) == 0x00022C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventHourLength' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventInfo) == 0x000230, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventInfo' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventActive) == 0x000240, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventActive' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_Ratio_1) == 0x000244, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_Ratio_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventHourLength_1) == 0x000248, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventHourLength_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventInfo_1) == 0x000250, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventInfo_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventActive_1) == 0x000260, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventActive_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue_2) == 0x000264, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_4) == 0x000268, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_Ratio_2) == 0x000270, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_Ratio_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventHourLength_2) == 0x000274, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventHourLength_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventInfo_2) == 0x000278, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventInfo_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventActive_2) == 0x000288, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventActive_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00028C, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_5) == 0x000290, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_6) == 0x000298, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_7) == 0x0002A0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_Ratio_3) == 0x0002A8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_Ratio_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventHourLength_3) == 0x0002AC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventHourLength_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventInfo_3) == 0x0002B0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventInfo_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventActive_3) == 0x0002C0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventActive_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_Ratio_4) == 0x0002C4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_Ratio_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventHourLength_4) == 0x0002C8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventHourLength_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventInfo_4) == 0x0002D0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventInfo_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_ProxyCalendarEventRatio_EventActive_4) == 0x0002E0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_ProxyCalendarEventRatio_EventActive_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue_3) == 0x0002E4, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_FClamp_ReturnValue_2) == 0x0002E8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GreaterEqual_FloatFloat_ReturnValue_6) == 0x0002EC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GreaterEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeLiteralGameplayTag_ReturnValue_12) == 0x0002F0, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeLiteralGameplayTag_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetFloatValue_ReturnValue) == 0x0002F8, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue_4) == 0x0002FC, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetFloatValue_ReturnValue_1) == 0x000300, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_Lerp_ReturnValue_5) == 0x000304, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_bIsEventActive_5) == 0x000308, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_bIsEventActive_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSinceBegin_5) == 0x000310, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSinceBegin_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeUntilEnd_5) == 0x000318, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeUntilEnd_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_GetCalendarEventInformation_TimeSpanRatio_5) == 0x000320, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_GetCalendarEventInformation_TimeSpanRatio_5' has a wrong offset!");
static_assert(offsetof(BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup, CallFunc_MakeDateTime_ReturnValue_8) == 0x000328, "Member 'BP_ApolloSnowSetup_C_ExecuteUbergraph_BP_ApolloSnowSetup::CallFunc_MakeDateTime_ReturnValue_8' has a wrong offset!");
