#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_HiThere

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_HiThere.BP_Athena_HiThere_C.ExecuteUbergraph_BP_Athena_HiThere
// 0x0030 (0x0030 - 0x0000)
struct BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5124[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0008(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere) == 0x000008, "Wrong alignment on BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere");
static_assert(sizeof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere) == 0x000030, "Wrong size on BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere");
static_assert(offsetof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere, EntryPoint) == 0x000000, "Member 'BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000008, "Member 'BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_Athena_HiThere_C_ExecuteUbergraph_BP_Athena_HiThere::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

