#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainerTabButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AthenaMapScreenContainerTabButton.BP_AthenaMapScreenContainerTabButton_C.ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton
// 0x0028 (0x0028 - 0x0000)
struct BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton) == 0x000008, "Wrong alignment on BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton");
static_assert(sizeof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton) == 0x000028, "Wrong size on BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton");
static_assert(offsetof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton, EntryPoint) == 0x000000, "Member 'BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000018, "Member 'BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'BP_AthenaMapScreenContainerTabButton_C_ExecuteUbergraph_BP_AthenaMapScreenContainerTabButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

