#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionItemToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaCollectionItemToast.BP_AthenaCollectionItemToast_C
// 0x0080 (0x03C8 - 0x0348)
class UBP_AthenaCollectionItemToast_C final : public UAthenaCollectionItemToast
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewFish;                                           // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_spark1;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spark2;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_spark3;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Swoosh;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_textglow;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_textglow_1;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_textglow_2;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewType;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FirstCatch;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_New;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_New_1;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              VisibilitySwitcher_ToastType;                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnItemCollected(EFortCollectedState CollectedState, const class UFortItemDefinition* ItemDefinition, int32 NumCollected);
	void ExecuteUbergraph_BP_AthenaCollectionItemToast(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaCollectionItemToast_C">();
	}
	static class UBP_AthenaCollectionItemToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaCollectionItemToast_C>();
	}
};
static_assert(alignof(UBP_AthenaCollectionItemToast_C) == 0x000008, "Wrong alignment on UBP_AthenaCollectionItemToast_C");
static_assert(sizeof(UBP_AthenaCollectionItemToast_C) == 0x0003C8, "Wrong size on UBP_AthenaCollectionItemToast_C");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, UberGraphFrame) == 0x000348, "Member 'UBP_AthenaCollectionItemToast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, NewFish) == 0x000350, "Member 'UBP_AthenaCollectionItemToast_C::NewFish' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_spark1) == 0x000358, "Member 'UBP_AthenaCollectionItemToast_C::Image_spark1' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_spark2) == 0x000360, "Member 'UBP_AthenaCollectionItemToast_C::Image_spark2' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_spark3) == 0x000368, "Member 'UBP_AthenaCollectionItemToast_C::Image_spark3' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_Sparks) == 0x000370, "Member 'UBP_AthenaCollectionItemToast_C::Image_Sparks' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_star) == 0x000378, "Member 'UBP_AthenaCollectionItemToast_C::Image_star' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_Swoosh) == 0x000380, "Member 'UBP_AthenaCollectionItemToast_C::Image_Swoosh' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_textglow) == 0x000388, "Member 'UBP_AthenaCollectionItemToast_C::Image_textglow' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_textglow_1) == 0x000390, "Member 'UBP_AthenaCollectionItemToast_C::Image_textglow_1' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Image_textglow_2) == 0x000398, "Member 'UBP_AthenaCollectionItemToast_C::Image_textglow_2' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Overlay_NewType) == 0x0003A0, "Member 'UBP_AthenaCollectionItemToast_C::Overlay_NewType' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Text_FirstCatch) == 0x0003A8, "Member 'UBP_AthenaCollectionItemToast_C::Text_FirstCatch' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Text_New) == 0x0003B0, "Member 'UBP_AthenaCollectionItemToast_C::Text_New' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, Text_New_1) == 0x0003B8, "Member 'UBP_AthenaCollectionItemToast_C::Text_New_1' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionItemToast_C, VisibilitySwitcher_ToastType) == 0x0003C0, "Member 'UBP_AthenaCollectionItemToast_C::VisibilitySwitcher_ToastType' has a wrong offset!");

}

