#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_Jukebox

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_Jukebox.BP_Athena_Jukebox_C.ExecuteUbergraph_BP_Athena_Jukebox
// 0x0108 (0x0108 - 0x0000)
struct BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86CF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x003C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D8(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox) == 0x000008, "Wrong alignment on BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox");
static_assert(sizeof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox) == 0x000108, "Wrong size on BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, EntryPoint) == 0x000000, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_Damage) == 0x00000C, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_DamageTags) == 0x000010, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_Momentum) == 0x000030, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_HitInfo) == 0x00003C, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_InstigatedBy) == 0x0000C8, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_DamageCauser) == 0x0000D0, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, K2Node_Event_EffectContext) == 0x0000D8, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F0, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F4, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000100, "Member 'BP_Athena_Jukebox_C_ExecuteUbergraph_BP_Athena_Jukebox::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");

// Function BP_Athena_Jukebox.BP_Athena_Jukebox_C.OnDamagePlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Athena_Jukebox_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86D0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Athena_Jukebox_C_OnDamagePlayEffects) == 0x000008, "Wrong alignment on BP_Athena_Jukebox_C_OnDamagePlayEffects");
static_assert(sizeof(BP_Athena_Jukebox_C_OnDamagePlayEffects) == 0x0000E8, "Wrong size on BP_Athena_Jukebox_C_OnDamagePlayEffects");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, DamageTags) == 0x000008, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, Momentum) == 0x000028, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, HitInfo) == 0x000034, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, InstigatedBy) == 0x0000C0, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, DamageCauser) == 0x0000C8, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_OnDamagePlayEffects, EffectContext) == 0x0000D0, "Member 'BP_Athena_Jukebox_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function BP_Athena_Jukebox.BP_Athena_Jukebox_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct BP_Athena_Jukebox_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86D1[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_Athena_Jukebox_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on BP_Athena_Jukebox_C_BlueprintGetInteractionString");
static_assert(sizeof(BP_Athena_Jukebox_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on BP_Athena_Jukebox_C_BlueprintGetInteractionString");
static_assert(offsetof(BP_Athena_Jukebox_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'BP_Athena_Jukebox_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'BP_Athena_Jukebox_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_Athena_Jukebox_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'BP_Athena_Jukebox_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

}

