#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaMapScreenContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_PreConstruct) == 0x000001, "Wrong size on BP_AthenaMapScreenContainer_C_PreConstruct");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C.ExecuteUbergraph_BP_AthenaMapScreenContainer
// 0x000C (0x000C - 0x0000)
struct BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x000004, "Wrong alignment on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(sizeof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer) == 0x00000C, "Wrong size on BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, EntryPoint) == 0x000000, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_bool_Variable) == 0x000004, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable) == 0x000005, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, Temp_byte_Variable_1) == 0x000006, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Event_IsDesignTime) == 0x000007, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer, K2Node_Select_Default) == 0x000008, "Member 'BP_AthenaMapScreenContainer_C_ExecuteUbergraph_BP_AthenaMapScreenContainer::K2Node_Select_Default' has a wrong offset!");

}

