#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientAudioController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AmbientAudioController.BP_AmbientAudioController_C
// 0x0068 (0x0270 - 0x0208)
class UBP_AmbientAudioController_C final : public UFortAmbientAudioController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientMixA;                                       // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientMixB;                                       // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckFrequency;                                    // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInsidePrevious;                                 // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInsideCurrent;                                  // 0x0225(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_604D[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AmbientMixIndoor;                                  // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetLPFFreq;                                     // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentLPFFreq;                                    // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InsideLPFFreq;                                     // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutsideLPFFreq;                                    // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMPCValueInterp;                             // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAboveSnowAltitude;                                // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_604E[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               WinterAudioBank;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSnowAltitudeEnabled;                              // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_604F[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               StormAudioBank;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AmbientAudioInsideTag;                             // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioDataAsset*                 CurieAudioBank;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AmbientAudioController(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Evaluate_Inside_State();
	void OnCheckIfSurrounded();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	bool Trace(const struct FVector& Start, const struct FVector& Direction);
	void SetTargetLPFFreq(float Target);
	void UpdateSnowSetupBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AmbientAudioController_C">();
	}
	static class UBP_AmbientAudioController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AmbientAudioController_C>();
	}
};
static_assert(alignof(UBP_AmbientAudioController_C) == 0x000008, "Wrong alignment on UBP_AmbientAudioController_C");
static_assert(sizeof(UBP_AmbientAudioController_C) == 0x000270, "Wrong size on UBP_AmbientAudioController_C");
static_assert(offsetof(UBP_AmbientAudioController_C, UberGraphFrame) == 0x000208, "Member 'UBP_AmbientAudioController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixA) == 0x000210, "Member 'UBP_AmbientAudioController_C::AmbientMixA' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixB) == 0x000218, "Member 'UBP_AmbientAudioController_C::AmbientMixB' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CheckFrequency) == 0x000220, "Member 'UBP_AmbientAudioController_C::CheckFrequency' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bIsInsidePrevious) == 0x000224, "Member 'UBP_AmbientAudioController_C::bIsInsidePrevious' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bIsInsideCurrent) == 0x000225, "Member 'UBP_AmbientAudioController_C::bIsInsideCurrent' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixIndoor) == 0x000228, "Member 'UBP_AmbientAudioController_C::AmbientMixIndoor' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, TargetLPFFreq) == 0x000230, "Member 'UBP_AmbientAudioController_C::TargetLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurrentLPFFreq) == 0x000234, "Member 'UBP_AmbientAudioController_C::CurrentLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, InsideLPFFreq) == 0x000238, "Member 'UBP_AmbientAudioController_C::InsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, OutsideLPFFreq) == 0x00023C, "Member 'UBP_AmbientAudioController_C::OutsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurrentMPCValueInterp) == 0x000240, "Member 'UBP_AmbientAudioController_C::CurrentMPCValueInterp' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bAboveSnowAltitude) == 0x000244, "Member 'UBP_AmbientAudioController_C::bAboveSnowAltitude' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, WinterAudioBank) == 0x000248, "Member 'UBP_AmbientAudioController_C::WinterAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bSnowAltitudeEnabled) == 0x000250, "Member 'UBP_AmbientAudioController_C::bSnowAltitudeEnabled' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, StormAudioBank) == 0x000258, "Member 'UBP_AmbientAudioController_C::StormAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientAudioInsideTag) == 0x000260, "Member 'UBP_AmbientAudioController_C::AmbientAudioInsideTag' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurieAudioBank) == 0x000268, "Member 'UBP_AmbientAudioController_C::CurieAudioBank' has a wrong offset!");

}

