#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bus_Lobby_SoundController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bus_Lobby_SoundController.BP_Bus_Lobby_SoundController_C
// 0x0058 (0x0278 - 0x0220)
class ABP_Bus_Lobby_SoundController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    EditorSprite;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IgnitionTime;                                      // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8431[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             IgnitionSound;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LoopingSound;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LoopingMusic;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingMusic_Inst;                                 // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingSound_Inst;                                 // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConfiguredSounds;                                 // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8432[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACar_DEFAULT_C*                         BusActor;                                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Bus_Lobby_SoundController(int32 EntryPoint);
	void On_Car_Play_Death_Effects();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void On_Game_Phase_Step_Changed(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, const EAthenaGamePhaseStep GamePhaseStep);
	void ReceiveBeginPlay();
	void GetBattleBusAsset(class UAthenaBattleBusItemDefinition** BattleBus);
	void GetLocalPlayer(class AFortPlayerControllerAthena** FirstLocalPC);
	void ConfigureSounds();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bus_Lobby_SoundController_C">();
	}
	static class ABP_Bus_Lobby_SoundController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bus_Lobby_SoundController_C>();
	}
};
static_assert(alignof(ABP_Bus_Lobby_SoundController_C) == 0x000008, "Wrong alignment on ABP_Bus_Lobby_SoundController_C");
static_assert(sizeof(ABP_Bus_Lobby_SoundController_C) == 0x000278, "Wrong size on ABP_Bus_Lobby_SoundController_C");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, UberGraphFrame) == 0x000220, "Member 'ABP_Bus_Lobby_SoundController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, EditorSprite) == 0x000228, "Member 'ABP_Bus_Lobby_SoundController_C::EditorSprite' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_Bus_Lobby_SoundController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, IgnitionTime) == 0x000238, "Member 'ABP_Bus_Lobby_SoundController_C::IgnitionTime' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, IgnitionSound) == 0x000240, "Member 'ABP_Bus_Lobby_SoundController_C::IgnitionSound' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, LoopingSound) == 0x000248, "Member 'ABP_Bus_Lobby_SoundController_C::LoopingSound' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, LoopingMusic) == 0x000250, "Member 'ABP_Bus_Lobby_SoundController_C::LoopingMusic' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, LoopingMusic_Inst) == 0x000258, "Member 'ABP_Bus_Lobby_SoundController_C::LoopingMusic_Inst' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, LoopingSound_Inst) == 0x000260, "Member 'ABP_Bus_Lobby_SoundController_C::LoopingSound_Inst' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, bConfiguredSounds) == 0x000268, "Member 'ABP_Bus_Lobby_SoundController_C::bConfiguredSounds' has a wrong offset!");
static_assert(offsetof(ABP_Bus_Lobby_SoundController_C, BusActor) == 0x000270, "Member 'ABP_Bus_Lobby_SoundController_C::BusActor' has a wrong offset!");

}

