#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BoltActionSniperRifleNoScope

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BoltActionSniperRifleNoScope.BP_BoltActionSniperRifleNoScope_C.ExecuteUbergraph_BP_BoltActionSniperRifleNoScope
// 0x0004 (0x0004 - 0x0000)
struct BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope) == 0x000004, "Wrong alignment on BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope");
static_assert(sizeof(BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope) == 0x000004, "Wrong size on BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope");
static_assert(offsetof(BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope, EntryPoint) == 0x000000, "Member 'BP_BoltActionSniperRifleNoScope_C_ExecuteUbergraph_BP_BoltActionSniperRifleNoScope::EntryPoint' has a wrong offset!");

// Function BP_BoltActionSniperRifleNoScope.BP_BoltActionSniperRifleNoScope_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_BoltActionSniperRifleNoScope_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_BoltActionSniperRifleNoScope_C_AnimGraph) == 0x000008, "Wrong alignment on BP_BoltActionSniperRifleNoScope_C_AnimGraph");
static_assert(sizeof(BP_BoltActionSniperRifleNoScope_C_AnimGraph) == 0x000010, "Wrong size on BP_BoltActionSniperRifleNoScope_C_AnimGraph");
static_assert(offsetof(BP_BoltActionSniperRifleNoScope_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'BP_BoltActionSniperRifleNoScope_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

