#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattlePassUnlockAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattlePassUnlockAnim.BP_BattlePassUnlockAnim_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'BP_BattlePassUnlockAnim_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function BP_BattlePassUnlockAnim.BP_BattlePassUnlockAnim_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_BattlePassUnlockAnim_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattlePassUnlockAnim_C_PreConstruct) == 0x000001, "Wrong alignment on BP_BattlePassUnlockAnim_C_PreConstruct");
static_assert(sizeof(BP_BattlePassUnlockAnim_C_PreConstruct) == 0x000001, "Wrong size on BP_BattlePassUnlockAnim_C_PreConstruct");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_BattlePassUnlockAnim_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_BattlePassUnlockAnim.BP_BattlePassUnlockAnim_C.ExecuteUbergraph_BP_BattlePassUnlockAnim
// 0x0040 (0x0040 - 0x0000)
struct BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58A6[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemPresentationScreen_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim) == 0x000008, "Wrong alignment on BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim");
static_assert(sizeof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim) == 0x000040, "Wrong size on BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, EntryPoint) == 0x000000, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, K2Node_Event_IsDesignTime) == 0x000005, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_BattlePassUnlockAnim_C_ExecuteUbergraph_BP_BattlePassUnlockAnim::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

