#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BP12_TransitionDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BP12_TransitionDoor.BP_BP12_TransitionDoor_C
// 0x0100 (0x0320 - 0x0220)
class ABP_BP12_TransitionDoor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   S_BattlePassDoor_Frame_BP12;                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Neo_Residential_Wall_02;                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Neo_Residential_Wall_01;                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ceiling;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_02;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_07;                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_06;                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_05;                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_04;                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Floor_03;                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_BattlePassDoor_Animate_me;                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_BattlePassStar_BP12;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_BattlePassDoor_BP12;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_218A733847BB90432FB9D6AB5C251752; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_218A733847BB90432FB9D6AB5C251752; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1A[0x3];                                     // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform_for_Copy;                                // 0x02C0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             Transform_For_Door;                                // 0x02F0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_BP12_TransitionDoor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BP12_TransitionDoor_C">();
	}
	static class ABP_BP12_TransitionDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BP12_TransitionDoor_C>();
	}
};
static_assert(alignof(ABP_BP12_TransitionDoor_C) == 0x000010, "Wrong alignment on ABP_BP12_TransitionDoor_C");
static_assert(sizeof(ABP_BP12_TransitionDoor_C) == 0x000320, "Wrong size on ABP_BP12_TransitionDoor_C");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, UberGraphFrame) == 0x000220, "Member 'ABP_BP12_TransitionDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_BattlePassDoor_Frame_BP12) == 0x000228, "Member 'ABP_BP12_TransitionDoor_C::S_BattlePassDoor_Frame_BP12' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, SpotLight1) == 0x000230, "Member 'ABP_BP12_TransitionDoor_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, SpotLight) == 0x000238, "Member 'ABP_BP12_TransitionDoor_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Neo_Residential_Wall_02) == 0x000240, "Member 'ABP_BP12_TransitionDoor_C::Neo_Residential_Wall_02' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Neo_Residential_Wall_01) == 0x000248, "Member 'ABP_BP12_TransitionDoor_C::Neo_Residential_Wall_01' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Ceiling) == 0x000250, "Member 'ABP_BP12_TransitionDoor_C::Ceiling' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_02) == 0x000258, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_02' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_07) == 0x000260, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_07' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_06) == 0x000268, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_06' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_05) == 0x000270, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_05' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_04) == 0x000278, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_04' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_MilitaryBase_Floor_03) == 0x000280, "Member 'ABP_BP12_TransitionDoor_C::S_MilitaryBase_Floor_03' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Camera) == 0x000288, "Member 'ABP_BP12_TransitionDoor_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_BattlePassDoor_Animate_me) == 0x000290, "Member 'ABP_BP12_TransitionDoor_C::S_BattlePassDoor_Animate_me' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_BattlePassStar_BP12) == 0x000298, "Member 'ABP_BP12_TransitionDoor_C::S_BattlePassStar_BP12' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, S_BattlePassDoor_BP12) == 0x0002A0, "Member 'ABP_BP12_TransitionDoor_C::S_BattlePassDoor_BP12' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_BP12_TransitionDoor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Timeline_0_NewTrack_0_218A733847BB90432FB9D6AB5C251752) == 0x0002B0, "Member 'ABP_BP12_TransitionDoor_C::Timeline_0_NewTrack_0_218A733847BB90432FB9D6AB5C251752' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Timeline_0__Direction_218A733847BB90432FB9D6AB5C251752) == 0x0002B4, "Member 'ABP_BP12_TransitionDoor_C::Timeline_0__Direction_218A733847BB90432FB9D6AB5C251752' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Timeline_0) == 0x0002B8, "Member 'ABP_BP12_TransitionDoor_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Transform_for_Copy) == 0x0002C0, "Member 'ABP_BP12_TransitionDoor_C::Transform_for_Copy' has a wrong offset!");
static_assert(offsetof(ABP_BP12_TransitionDoor_C, Transform_For_Door) == 0x0002F0, "Member 'ABP_BP12_TransitionDoor_C::Transform_For_Door' has a wrong offset!");

}

