#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Battlepass_LightSwitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Battlepass_LightSwitcher.BP_Battlepass_LightSwitcher_C.SetVisiblityofDetailSpecificMeshes
// 0x0070 (0x0070 - 0x0000)
struct BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4A[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DetailLevelMesh_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DetailLevelMesh_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DetailLevelMesh_C*                  K2Node_DynamicCast_AsBP_Detail_Level_Mesh;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes) == 0x000008, "Wrong alignment on BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes");
static_assert(sizeof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes) == 0x000070, "Wrong size on BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_IsMobileGame_ReturnValue) == 0x00000C, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetGameUserSettings_ReturnValue) == 0x000028, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetShadowQuality_ReturnValue) == 0x000040, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, K2Node_DynamicCast_AsBP_Detail_Level_Mesh) == 0x000058, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::K2Node_DynamicCast_AsBP_Detail_Level_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanOR_ReturnValue) == 0x000061, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanOR_ReturnValue_1) == 0x000062, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanAND_ReturnValue) == 0x000063, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Battlepass_LightSwitcher.BP_Battlepass_LightSwitcher_C.SetVisiblityofSceneLighting
// 0x0098 (0x0098 - 0x0000)
struct BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ConstructionScript;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4F[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F50[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F51[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F52[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F53[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F54[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F55[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F56[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F57[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_31;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting) == 0x000008, "Wrong alignment on BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(sizeof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting) == 0x000098, "Wrong size on BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, Activate) == 0x000000, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::Activate' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, ConstructionScript) == 0x000001, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::ConstructionScript' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue_1) == 0x000011, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue_2) == 0x000012, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue) == 0x000013, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_2) == 0x00001C, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_3) == 0x00001D, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_4) == 0x00001E, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_5) == 0x00001F, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_6) == 0x000020, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_7) == 0x000021, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_8) == 0x000022, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_9) == 0x000023, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_10) == 0x000024, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_11) == 0x000025, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_12) == 0x000026, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_13) == 0x00002C, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue) == 0x000038, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_14) == 0x000040, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_15) == 0x000041, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_16) == 0x000042, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_17) == 0x000043, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_18) == 0x000044, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_1) == 0x000045, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_1) == 0x000046, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000048, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_19) == 0x000050, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_20) == 0x000051, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_21) == 0x000052, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_22) == 0x000053, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_2) == 0x000054, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_2) == 0x000055, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_23) == 0x000056, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_24) == 0x000057, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_25) == 0x000058, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_26) == 0x000059, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000060, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_27) == 0x000070, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_28) == 0x000071, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_29) == 0x000088, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_30) == 0x000091, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_31) == 0x000092, "Member 'BP_Battlepass_LightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_31' has a wrong offset!");

// Function BP_Battlepass_LightSwitcher.BP_Battlepass_LightSwitcher_C.ExecuteUbergraph_BP_Battlepass_LightSwitcher
// 0x0060 (0x0060 - 0x0000)
struct BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F58[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortnitePartyBackdrop_Camera_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F59[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5A[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortnitePartyBackdrop_Camera_C*        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher) == 0x000008, "Wrong alignment on BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher");
static_assert(sizeof(BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher) == 0x000060, "Wrong size on BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher");
static_assert(offsetof(BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher, EntryPoint) == 0x000000, "Member 'BP_Battlepass_LightSwitcher_C_ExecuteUbergraph_BP_Battlepass_LightSwitcher::EntryPoint' has a wrong offset!");
