#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalendarDynamicPOISelect

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "MeshNetwork_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.ExecuteUbergraph_BP_CalendarDynamicPOISelect
// 0x0320 (0x0320 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitialNavigationLockActive_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMeshNetworkNodeType                          K2Node_CustomEvent_NodeType;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshNetworkNodeType                          Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4C[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_MeshNetworkReady*      CallFunc_MeshNetworkReadyAsync_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4D[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C4E[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C4F[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMeshNetworkNodeType NodeType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C50[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C51[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C52[0x2];                                     // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C53[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0130(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C54[0x2];                                     // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C55[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C56[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingFoundation*                    CallFunc_Map_Find_Value;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C57[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x0190(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarMultiEventWatcher* CallFunc_WatchCalendarEvents_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C58[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C59[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x01D0(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5A[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Key_1;                          // 0x0200(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class ABuildingFoundation*                    CallFunc_Map_Find_Value_1;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5B[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys_2;                          // 0x0220(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5C[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_A;                              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0258(0x0020)()
	class FString                                 K2Node_CustomEvent_Key;                            // 0x0278(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys_3;                          // 0x0288(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABuildingFoundation*                    CallFunc_Map_Find_Value_2;                         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5D[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5E[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x02C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x02D0(0x0020)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5F[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	class AAthena_GameMode_C*                     K2Node_DynamicCast_AsAthena_Game_Mode;             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlaylistEnableBots_ReturnValue;        // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect) == 0x000320, "Wrong size on BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, EntryPoint) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_IsInitialNavigationLockActive_ReturnValue) == 0x000004, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_IsInitialNavigationLockActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_NodeType) == 0x000005, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_NodeType' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_byte_Variable) == 0x000006, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_MeshNetworkReadyAsync_ReturnValue) == 0x000008, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_MeshNetworkReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_EventName_2) == 0x000018, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000028, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000030, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000038, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_EventName_1) == 0x000050, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000060, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000068, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000070, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_EventName) == 0x000088, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeUntilEnd) == 0x000098, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSinceBegin) == 0x0000A0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_TimeSpanRatio) == 0x0000A8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_float_Variable) == 0x0000BC, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_struct_Variable) == 0x0000C0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_struct_Variable_1) == 0x0000C8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_string_Variable) == 0x0000D0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Array_Index_Variable) == 0x0000E0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Loop_Counter_Variable_1) == 0x0000EC, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Array_Index_Variable_1) == 0x0000F4, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Loop_Counter_Variable_2) == 0x000108, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_bool_IsClosed_Variable) == 0x00010C, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Add_IntInt_ReturnValue_2) == 0x000110, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_bool_Has_Been_Initd_Variable) == 0x000114, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Array_Index_Variable_2) == 0x000118, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_bool_True_if_break_was_hit_Variable) == 0x00011C, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Not_PreBool_ReturnValue) == 0x00011D, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Loop_Counter_Variable_3) == 0x000120, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Add_IntInt_ReturnValue_3) == 0x000124, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_int_Array_Index_Variable_3) == 0x000128, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Keys_Keys) == 0x000130, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000155, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000158, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000160, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000168, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_BooleanAND_ReturnValue) == 0x00016C, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000170, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_IsValid_ReturnValue_1) == 0x000178, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000179, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_Value) == 0x000180, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_ReturnValue) == 0x000188, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Keys_Keys_1) == 0x000190, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_WatchCalendarEvents_ReturnValue) == 0x0001B0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_WatchCalendarEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_IsValid_ReturnValue_2) == 0x0001B8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Length_ReturnValue_1) == 0x0001BC, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_object_Variable) == 0x0001C8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x0001D0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_HasTag_ReturnValue) == 0x0001F0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_object_Variable_1) == 0x0001F8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_Key_1) == 0x000200, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_Value_1) == 0x000210, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_ReturnValue_1) == 0x000218, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_HasAuthority_ReturnValue) == 0x000219, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Keys_Keys_2) == 0x000220, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Get_Item_2) == 0x000230, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Length_ReturnValue_2) == 0x000240, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Less_IntInt_ReturnValue_2) == 0x000244, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_A) == 0x000248, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_A' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, Temp_struct_Variable_2) == 0x000258, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_Key) == 0x000278, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Keys_Keys_3) == 0x000288, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Keys_Keys_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_Value_2) == 0x000298, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Map_Find_ReturnValue_2) == 0x0002A0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Get_Item_3) == 0x0002A8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Array_Length_ReturnValue_3) == 0x0002B8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_GameState) == 0x0002C0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_Playlist) == 0x0002C8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CustomEvent_PlaylistContextTags) == 0x0002D0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_Less_IntInt_ReturnValue_3) == 0x0002F0, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetGameMode_ReturnValue) == 0x0002F8, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x000300, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_DynamicCast_AsAthena_Game_Mode) == 0x000310, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_DynamicCast_AsAthena_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_GetPlaylistEnableBots_ReturnValue) == 0x000319, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_GetPlaylistEnableBots_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect, CallFunc_BooleanAND_ReturnValue_1) == 0x00031A, "Member 'BP_CalendarDynamicPOISelect_C_ExecuteUbergraph_BP_CalendarDynamicPOISelect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.UnloadDynamicLevel
// 0x0010 (0x0010 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel) == 0x000010, "Wrong size on BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel, Key) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_UnloadDynamicLevel::Key' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.DebugCalenderEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_DebugCalenderEvent final
{
public:
	class FString                                 A;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_DebugCalenderEvent) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_DebugCalenderEvent");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_DebugCalenderEvent) == 0x000010, "Wrong size on BP_CalendarDynamicPOISelect_C_DebugCalenderEvent");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_DebugCalenderEvent, A) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_DebugCalenderEvent::A' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.TryLoadMap
// 0x0010 (0x0010 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_TryLoadMap final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_TryLoadMap) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_TryLoadMap");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_TryLoadMap) == 0x000010, "Wrong size on BP_CalendarDynamicPOISelect_C_TryLoadMap");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_TryLoadMap, Key) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_TryLoadMap::Key' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837
// 0x0028 (0x0028 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000028, "Wrong size on BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837, EventName) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837::EventName' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837, TimeUntilEnd) == 0x000010, "Member 'BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837, TimeSinceBegin) == 0x000018, "Member 'BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837, TimespanRatio) == 0x000020, "Member 'BP_CalendarDynamicPOISelect_C_OnEventActive_EBEEA8B44B6FE62EEE2F37B32715E837::TimespanRatio' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837
// 0x0028 (0x0028 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000028, "Wrong size on BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837, EventName) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837::EventName' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837, TimeUntilEnd) == 0x000010, "Member 'BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837, TimeSinceBegin) == 0x000018, "Member 'BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837, TimespanRatio) == 0x000020, "Member 'BP_CalendarDynamicPOISelect_C_OnEventUpdated_EBEEA8B44B6FE62EEE2F37B32715E837::TimespanRatio' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837
// 0x0028 (0x0028 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837) == 0x000028, "Wrong size on BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837, EventName) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837::EventName' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837, TimeUntilEnd) == 0x000010, "Member 'BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837, TimeSinceBegin) == 0x000018, "Member 'BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837, TimespanRatio) == 0x000020, "Member 'BP_CalendarDynamicPOISelect_C_OnEventEnded_EBEEA8B44B6FE62EEE2F37B32715E837::TimespanRatio' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.OnReady_10FF4E234049809523083F9F922BAF96
// 0x0001 (0x0001 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96 final
{
public:
	EMeshNetworkNodeType                          NodeType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96) == 0x000001, "Wrong alignment on BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96) == 0x000001, "Wrong size on BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96, NodeType) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_OnReady_10FF4E234049809523083F9F922BAF96::NodeType' has a wrong offset!");

// Function BP_CalendarDynamicPOISelect.BP_CalendarDynamicPOISelect_C.OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2
// 0x0030 (0x0030 - 0x0000)
struct BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2) == 0x000008, "Wrong alignment on BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2");
static_assert(sizeof(BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2) == 0x000030, "Wrong size on BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2, GameState) == 0x000000, "Member 'BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2::GameState' has a wrong offset!");
static_assert(offsetof(BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2, Playlist) == 0x000008, "Member 'BP_CalendarDynamicPOISelect_C_OnReady_9041F2234DD8761E9FEDAA8CC7F22DF2::Playlist' has a wrong offset!");
