#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Creative_Billboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "EBillboardshadowDirection_structs.hpp"
#include "EVisibleInGameState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Creative_Billboard.BP_Creative_Billboard_C
// 0x00D0 (0x0C90 - 0x0BC0)
class ABP_Creative_Billboard_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        WidgetAnchor;                                      // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCreative_Enabled_Component_C*          Creative_Enabled_Component;                        // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCreative_VisibleInGame_Component_C*    VisibleInGameComponent;                            // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMinigameLogicComponent*            FortMinigameLogic;                                 // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayReceiverMessageComponent*  HideTextReceiverComponent;                         // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayReceiverMessageComponent*  ShowTextReceiverComponent;                         // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ToolPickingBox;                                    // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UToyOptionsComponent_C*                 ToyOptionsComponent;                               // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 UserDefinedText;                                   // 0x0C08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bShowBorder;                                       // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ADA[0x3];                                     // 0x0C19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BackgroundColor;                                   // 0x0C1C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  HorizontalTextAlignment;                           // 0x0C2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADB[0x3];                                     // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TextSize;                                          // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewDistance;                                      // 0x0C34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnabledIndex;                                      // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextFont;                                          // 0x0C4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Debug_Text;                                   // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ADC[0x3];                                     // 0x0C51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BackgroundRelativeRotationWithBorder;              // 0x0C54(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               BackgroundRelativeRotationWithoutBorder;           // 0x0C60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         OutlineStrength;                                   // 0x0C6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBillboardshadowDirection                     DropShadow;                                        // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ADD[0x3];                                     // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shadow_Divisor;                                    // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       WidgetComponent;                                   // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreative_Background_Widget_C*          Widget;                                            // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTextSize;                                       // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            Last_State_Updated;                                // 0x0C8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Creative_Billboard(int32 EntryPoint);
	void Initialize_Minigame_Options(class AFortMinigame* Minigame);
	void BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature(class AFortMinigame* Minigame, EFortMinigameState NewMinigameState);
	void ReceiveBeginPlay();
	void BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature(bool Enabled);
	void Initialize_Device();
	void OnWorldReady();
	void BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature(bool Visible);
	void Update_Static_Mesh_Component_Visibility_Options();
	void Play_Mode_Changed(class AFortMinigame* Minigame, bool bIsInPlayMode);
	void BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature(class AFortMinigame* Minigame);
	void BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature(class AController* TriggerInstigator);
	void BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature(class AController* TriggerInstigator);
	void BndEvt__ToyOptionsComponent_K2Node_ComponentBoundEvent_1_AnyPropertyChangedDelegate__DelegateSignature();
	void BndEvt__ToyOptionsComponent_K2Node_ComponentBoundEvent_0_AnyPropertyChangedDelegate__DelegateSignature();
	void PostUpdateProperties();
	void SetBackgroundColor();
	void SetTextSize();
	void SetTextAlignment();
	void SetDisplayText();
	void UpdateProperties();
	void SetTextColor();
	void SetViewDistance();
	void SetTextFont();
	void SetShadow();
	void Create_Widget();
	void Text_Visibility_On_Game_State(EFortMinigameState New_State);
	void Update_Last_Game_State_Enable_Changed();
	void GetCreativeActorBounds(bool* Override_Bounds, struct FVector* Bounds);
	void GetCreativeActorOrigin(bool* Override, struct FVector* Center);

	TArray<class UMeshComponent*> GetMeshComponents() const;
	class UStaticMesh* GetCollisionStaticMesh() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Creative_Billboard_C">();
	}
	static class ABP_Creative_Billboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Creative_Billboard_C>();
	}
};
static_assert(alignof(ABP_Creative_Billboard_C) == 0x000008, "Wrong alignment on ABP_Creative_Billboard_C");
static_assert(sizeof(ABP_Creative_Billboard_C) == 0x000C90, "Wrong size on ABP_Creative_Billboard_C");
static_assert(offsetof(ABP_Creative_Billboard_C, UberGraphFrame) == 0x000BC0, "Member 'ABP_Creative_Billboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, WidgetAnchor) == 0x000BC8, "Member 'ABP_Creative_Billboard_C::WidgetAnchor' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, Creative_Enabled_Component) == 0x000BD0, "Member 'ABP_Creative_Billboard_C::Creative_Enabled_Component' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, VisibleInGameComponent) == 0x000BD8, "Member 'ABP_Creative_Billboard_C::VisibleInGameComponent' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, FortMinigameLogic) == 0x000BE0, "Member 'ABP_Creative_Billboard_C::FortMinigameLogic' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, HideTextReceiverComponent) == 0x000BE8, "Member 'ABP_Creative_Billboard_C::HideTextReceiverComponent' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, ShowTextReceiverComponent) == 0x000BF0, "Member 'ABP_Creative_Billboard_C::ShowTextReceiverComponent' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, ToolPickingBox) == 0x000BF8, "Member 'ABP_Creative_Billboard_C::ToolPickingBox' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, ToyOptionsComponent) == 0x000C00, "Member 'ABP_Creative_Billboard_C::ToyOptionsComponent' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, UserDefinedText) == 0x000C08, "Member 'ABP_Creative_Billboard_C::UserDefinedText' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, bShowBorder) == 0x000C18, "Member 'ABP_Creative_Billboard_C::bShowBorder' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, BackgroundColor) == 0x000C1C, "Member 'ABP_Creative_Billboard_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, HorizontalTextAlignment) == 0x000C2C, "Member 'ABP_Creative_Billboard_C::HorizontalTextAlignment' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, TextSize) == 0x000C30, "Member 'ABP_Creative_Billboard_C::TextSize' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, ViewDistance) == 0x000C34, "Member 'ABP_Creative_Billboard_C::ViewDistance' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, TextColor) == 0x000C38, "Member 'ABP_Creative_Billboard_C::TextColor' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, EnabledIndex) == 0x000C48, "Member 'ABP_Creative_Billboard_C::EnabledIndex' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, TextFont) == 0x000C4C, "Member 'ABP_Creative_Billboard_C::TextFont' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, Show_Debug_Text) == 0x000C50, "Member 'ABP_Creative_Billboard_C::Show_Debug_Text' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, BackgroundRelativeRotationWithBorder) == 0x000C54, "Member 'ABP_Creative_Billboard_C::BackgroundRelativeRotationWithBorder' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, BackgroundRelativeRotationWithoutBorder) == 0x000C60, "Member 'ABP_Creative_Billboard_C::BackgroundRelativeRotationWithoutBorder' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, OutlineStrength) == 0x000C6C, "Member 'ABP_Creative_Billboard_C::OutlineStrength' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, DropShadow) == 0x000C70, "Member 'ABP_Creative_Billboard_C::DropShadow' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, Shadow_Divisor) == 0x000C74, "Member 'ABP_Creative_Billboard_C::Shadow_Divisor' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, WidgetComponent) == 0x000C78, "Member 'ABP_Creative_Billboard_C::WidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, Widget) == 0x000C80, "Member 'ABP_Creative_Billboard_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, MinTextSize) == 0x000C88, "Member 'ABP_Creative_Billboard_C::MinTextSize' has a wrong offset!");
static_assert(offsetof(ABP_Creative_Billboard_C, Last_State_Updated) == 0x000C8C, "Member 'ABP_Creative_Billboard_C::Last_State_Updated' has a wrong offset!");

}

