#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Creative_Billboard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "EVisibleInGameState_structs.hpp"


namespace SDK::Params
{

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.ExecuteUbergraph_BP_Creative_Billboard
// 0x0138 (0x0138 - 0x0000)
struct BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVisibleInGameState                           Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ADE[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ADF[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame, bool bIsInPlayMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE0[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_TriggerInstigator_1;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_TriggerInstigator;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          K2Node_ComponentBoundEvent_Minigame_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_6;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE1[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_CustomEvent_Minigame_1;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsInPlayMode;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE2[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Visible;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            K2Node_Select_Default_1;                           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           K2Node_Select_Default_2;                           // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default_3;                           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0088(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_4;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             K2Node_Select_Default_4;                           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Enabled;                // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE3[0x1];                                     // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_ComponentBoundEvent_Minigame;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            K2Node_ComponentBoundEvent_NewMinigameState;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AE4[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_CustomEvent_Minigame;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard");
static_assert(sizeof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard) == 0x000138, "Wrong size on BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, EntryPoint) == 0x000000, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable) == 0x000004, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_bool_Variable) == 0x000005, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_1) == 0x000006, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_bool_Variable_1) == 0x000007, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_2) == 0x000008, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_3) == 0x000009, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_bool_Variable_2) == 0x00000A, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_4) == 0x00000B, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_5) == 0x00000C, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_bool_Variable_3) == 0x00000D, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsValid_ReturnValue) == 0x00000E, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsDedicatedServer_ReturnValue) == 0x000020, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_HasAuthority_ReturnValue) == 0x000034, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_TriggerInstigator_1) == 0x000038, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_TriggerInstigator_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_TriggerInstigator) == 0x000040, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_TriggerInstigator' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_Minigame_1) == 0x000048, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_Minigame_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_byte_Variable_6) == 0x000050, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_CustomEvent_Minigame_1) == 0x000058, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_CustomEvent_Minigame_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_CustomEvent_bIsInPlayMode) == 0x000060, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_CustomEvent_bIsInPlayMode' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsValid_ReturnValue_2) == 0x000062, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsValid_ReturnValue_3) == 0x000063, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_Select_Default) == 0x000078, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_Visible) == 0x000079, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_Visible' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_Select_Default_1) == 0x00007A, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_Select_Default_2) == 0x00007B, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_Select_Default_3) == 0x00007C, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000088, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, Temp_bool_Variable_4) == 0x000114, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_Select_Default_4) == 0x000115, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_Enabled) == 0x000116, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_Enabled' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_Minigame) == 0x000118, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_Minigame' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_ComponentBoundEvent_NewMinigameState) == 0x000120, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_ComponentBoundEvent_NewMinigameState' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, K2Node_CustomEvent_Minigame) == 0x000128, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::K2Node_CustomEvent_Minigame' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard, CallFunc_IsInPlayMode_ReturnValue) == 0x000130, "Member 'BP_Creative_Billboard_C_ExecuteUbergraph_BP_Creative_Billboard::CallFunc_IsInPlayMode_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.Initialize Minigame Options
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_Initialize_Minigame_Options final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_Initialize_Minigame_Options) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_Initialize_Minigame_Options");
static_assert(sizeof(BP_Creative_Billboard_C_Initialize_Minigame_Options) == 0x000008, "Wrong size on BP_Creative_Billboard_C_Initialize_Minigame_Options");
static_assert(offsetof(BP_Creative_Billboard_C_Initialize_Minigame_Options, Minigame) == 0x000000, "Member 'BP_Creative_Billboard_C_Initialize_Minigame_Options::Minigame' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            NewMinigameState;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature) == 0x000010, "Wrong size on BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature, Minigame) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature::Minigame' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature, NewMinigameState) == 0x000008, "Member 'BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_4_OnMinigameStateChanged__DelegateSignature::NewMinigameState' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On Enabled State Changed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature) == 0x000001, "Wrong size on BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature, Enabled) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__Creative_Enabled_Component_K2Node_ComponentBoundEvent_7_On_Enabled_State_Changed__DelegateSignature::Enabled' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On Visibility Changed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature) == 0x000001, "Wrong size on BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature, Visible) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__VisibleInGameComponent_K2Node_ComponentBoundEvent_6_On_Visibility_Changed__DelegateSignature::Visible' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.Play Mode Changed
// 0x0010 (0x0010 - 0x0000)
struct BP_Creative_Billboard_C_Play_Mode_Changed final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInPlayMode;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_Play_Mode_Changed) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_Play_Mode_Changed");
static_assert(sizeof(BP_Creative_Billboard_C_Play_Mode_Changed) == 0x000010, "Wrong size on BP_Creative_Billboard_C_Play_Mode_Changed");
static_assert(offsetof(BP_Creative_Billboard_C_Play_Mode_Changed, Minigame) == 0x000000, "Member 'BP_Creative_Billboard_C_Play_Mode_Changed::Minigame' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Play_Mode_Changed, bIsInPlayMode) == 0x000008, "Member 'BP_Creative_Billboard_C_Play_Mode_Changed::bIsInPlayMode' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong size on BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature, Minigame) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__FortMinigameLogic_K2Node_ComponentBoundEvent_5_OnMinigameAssignmentChanged__DelegateSignature::Minigame' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature final
{
public:
	class AController*                            TriggerInstigator;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature) == 0x000008, "Wrong size on BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature, TriggerInstigator) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__HideTextReceiverComponent_K2Node_ComponentBoundEvent_3_OnGameplayMessageReceived__DelegateSignature::TriggerInstigator' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature final
{
public:
	class AController*                            TriggerInstigator;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature");
static_assert(sizeof(BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature) == 0x000008, "Wrong size on BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature");
static_assert(offsetof(BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature, TriggerInstigator) == 0x000000, "Member 'BP_Creative_Billboard_C_BndEvt__ShowTextReceiverComponent_K2Node_ComponentBoundEvent_2_OnGameplayMessageReceived__DelegateSignature::TriggerInstigator' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetBackgroundColor
// 0x0014 (0x0014 - 0x0000)
struct BP_Creative_Billboard_C_SetBackgroundColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_SetBackgroundColor) == 0x000004, "Wrong alignment on BP_Creative_Billboard_C_SetBackgroundColor");
static_assert(sizeof(BP_Creative_Billboard_C_SetBackgroundColor) == 0x000014, "Wrong size on BP_Creative_Billboard_C_SetBackgroundColor");
static_assert(offsetof(BP_Creative_Billboard_C_SetBackgroundColor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetBackgroundColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetBackgroundColor, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'BP_Creative_Billboard_C_SetBackgroundColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetTextSize
// 0x0001 (0x0001 - 0x0000)
struct BP_Creative_Billboard_C_SetTextSize final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_SetTextSize) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_SetTextSize");
static_assert(sizeof(BP_Creative_Billboard_C_SetTextSize) == 0x000001, "Wrong size on BP_Creative_Billboard_C_SetTextSize");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextSize, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetTextSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetTextAlignment
// 0x0001 (0x0001 - 0x0000)
struct BP_Creative_Billboard_C_SetTextAlignment final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_SetTextAlignment) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_SetTextAlignment");
static_assert(sizeof(BP_Creative_Billboard_C_SetTextAlignment) == 0x000001, "Wrong size on BP_Creative_Billboard_C_SetTextAlignment");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextAlignment, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetTextAlignment::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetDisplayText
// 0x0030 (0x0030 - 0x0000)
struct BP_Creative_Billboard_C_SetDisplayText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE6[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_Enabled;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_SetDisplayText) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_SetDisplayText");
static_assert(sizeof(BP_Creative_Billboard_C_SetDisplayText) == 0x000030, "Wrong size on BP_Creative_Billboard_C_SetDisplayText");
static_assert(offsetof(BP_Creative_Billboard_C_SetDisplayText, Temp_bool_Variable) == 0x000000, "Member 'BP_Creative_Billboard_C_SetDisplayText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetDisplayText, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Creative_Billboard_C_SetDisplayText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetDisplayText, Temp_string_Variable) == 0x000008, "Member 'BP_Creative_Billboard_C_SetDisplayText::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetDisplayText, CallFunc_IsEnabled_Enabled) == 0x000018, "Member 'BP_Creative_Billboard_C_SetDisplayText::CallFunc_IsEnabled_Enabled' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetDisplayText, K2Node_Select_Default) == 0x000020, "Member 'BP_Creative_Billboard_C_SetDisplayText::K2Node_Select_Default' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.UpdateProperties
// 0x0288 (0x0288 - 0x0000)
struct BP_Creative_Billboard_C_UpdateProperties final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ColorToText_ReturnValue;             // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00B0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0108(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ColorToText_ReturnValue_1;           // 0x0148(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0160(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x01B8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0210(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0260(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_UpdateProperties) == 0x000008, "Wrong alignment on BP_Creative_Billboard_C_UpdateProperties");
static_assert(sizeof(BP_Creative_Billboard_C_UpdateProperties) == 0x000288, "Wrong size on BP_Creative_Billboard_C_UpdateProperties");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_ColorToText_ReturnValue) == 0x000088, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_ColorToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_ByteToString_ReturnValue) == 0x0000A0, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000B0, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_3) == 0x000108, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_ColorToText_ReturnValue_1) == 0x000148, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_ColorToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_4) == 0x000160, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_BoolToText_ReturnValue) == 0x0001A0, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_5) == 0x0001B8, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001F8, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeStruct_FormatArgumentData_6) == 0x000210, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, K2Node_MakeArray_Array) == 0x000250, "Member 'BP_Creative_Billboard_C_UpdateProperties::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Format_ReturnValue) == 0x000260, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_UpdateProperties, CallFunc_Conv_TextToString_ReturnValue) == 0x000278, "Member 'BP_Creative_Billboard_C_UpdateProperties::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetTextColor
// 0x0001 (0x0001 - 0x0000)
struct BP_Creative_Billboard_C_SetTextColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_SetTextColor) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_SetTextColor");
static_assert(sizeof(BP_Creative_Billboard_C_SetTextColor) == 0x000001, "Wrong size on BP_Creative_Billboard_C_SetTextColor");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextColor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetTextColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetViewDistance
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_SetViewDistance final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_SetViewDistance) == 0x000004, "Wrong alignment on BP_Creative_Billboard_C_SetViewDistance");
static_assert(sizeof(BP_Creative_Billboard_C_SetViewDistance) == 0x000008, "Wrong size on BP_Creative_Billboard_C_SetViewDistance");
static_assert(offsetof(BP_Creative_Billboard_C_SetViewDistance, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetViewDistance::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetViewDistance, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Creative_Billboard_C_SetViewDistance::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetTextFont
// 0x0014 (0x0014 - 0x0000)
struct BP_Creative_Billboard_C_SetTextFont final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_SetTextFont) == 0x000004, "Wrong alignment on BP_Creative_Billboard_C_SetTextFont");
static_assert(sizeof(BP_Creative_Billboard_C_SetTextFont) == 0x000014, "Wrong size on BP_Creative_Billboard_C_SetTextFont");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextFont, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetTextFont::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextFont, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_Creative_Billboard_C_SetTextFont::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextFont, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Creative_Billboard_C_SetTextFont::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextFont, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'BP_Creative_Billboard_C_SetTextFont::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetTextFont, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'BP_Creative_Billboard_C_SetTextFont::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.SetShadow
// 0x000C (0x000C - 0x0000)
struct BP_Creative_Billboard_C_SetShadow final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AEA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Creative_Billboard_C_SetShadow) == 0x000004, "Wrong alignment on BP_Creative_Billboard_C_SetShadow");
static_assert(sizeof(BP_Creative_Billboard_C_SetShadow) == 0x00000C, "Wrong size on BP_Creative_Billboard_C_SetShadow");
static_assert(offsetof(BP_Creative_Billboard_C_SetShadow, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_SetShadow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetShadow, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_Creative_Billboard_C_SetShadow::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_SetShadow, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Creative_Billboard_C_SetShadow::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.Create Widget
// 0x0060 (0x0060 - 0x0000)
struct BP_Creative_Billboard_C_Create_Widget final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AEB[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AEC[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreative_Background_Widget_C*          CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_Create_Widget) == 0x000010, "Wrong alignment on BP_Creative_Billboard_C_Create_Widget");
static_assert(sizeof(BP_Creative_Billboard_C_Create_Widget) == 0x000060, "Wrong size on BP_Creative_Billboard_C_Create_Widget");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, Temp_struct_Variable) == 0x000000, "Member 'BP_Creative_Billboard_C_Create_Widget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000040, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000048, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_Create_ReturnValue) == 0x000050, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Create_Widget, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000058, "Member 'BP_Creative_Billboard_C_Create_Widget::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.Text Visibility On Game State
// 0x0008 (0x0008 - 0x0000)
struct BP_Creative_Billboard_C_Text_Visibility_On_Game_State final
{
public:
	EFortMinigameState                            New_State;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTextVisible;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_Text_Visibility_On_Game_State");
static_assert(sizeof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State) == 0x000008, "Wrong size on BP_Creative_Billboard_C_Text_Visibility_On_Game_State");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, New_State) == 0x000000, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::New_State' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, bIsTextVisible) == 0x000001, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::bIsTextVisible' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000005, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, CallFunc_HasAuthority_ReturnValue) == 0x000006, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Text_Visibility_On_Game_State, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000007, "Member 'BP_Creative_Billboard_C_Text_Visibility_On_Game_State::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Creative_Billboard.BP_Creative_Billboard_C.Update Last Game State Enable Changed
// 0x0003 (0x0003 - 0x0000)
struct BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed) == 0x000001, "Wrong alignment on BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed");
static_assert(sizeof(BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed) == 0x000003, "Wrong size on BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed");
static_assert(offsetof(BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BP_Creative_Billboard_C_Update_Last_Game_State_Enable_Changed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

