#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams.BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C
// 0x0038 (0x0BF8 - 0x0BC0)
class ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FresnelBeam_A2;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FresnelBeam_A1;                                    // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Cone_Length;                                       // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Start_Radius;                                      // 0x0BDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cone_Angle;                                        // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Light_Color_rgb__and_Brightness_a_;                // 0x0BE4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_Shift;                                       // 0x0BF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeMaterialParams();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C">();
	}
	static class ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C>();
	}
};
static_assert(alignof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C) == 0x000008, "Wrong alignment on ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C");
static_assert(sizeof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C) == 0x000BF8, "Wrong size on ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, UberGraphFrame) == 0x000BC0, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, FresnelBeam_A2) == 0x000BC8, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::FresnelBeam_A2' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, FresnelBeam_A1) == 0x000BD0, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::FresnelBeam_A1' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Cone_Length) == 0x000BD8, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Cone_Length' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Start_Radius) == 0x000BDC, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Start_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Cone_Angle) == 0x000BE0, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Cone_Angle' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Light_Color_rgb__and_Brightness_a_) == 0x000BE4, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Light_Color_rgb__and_Brightness_a_' has a wrong offset!");
static_assert(offsetof(ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C, Light_Shift) == 0x000BF4, "Member 'ABP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C::Light_Shift' has a wrong offset!");

}

