#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DJBoothMeshTrigger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MeshNetwork_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DJBoothMeshTrigger.BP_DJBoothMeshTrigger_C
// 0x0088 (0x02A8 - 0x0220)
class ABP_DJBoothMeshTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMeshNetworkComponent*                  MeshNetwork;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              PlayUTCTime;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         PlayServerTimeSeconds;                             // 0x0240(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         VideoPlayStartTime;                                // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnReadyToPlay;                                     // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStopPlayback;                                    // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDateTime                              StopUTCTime;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MinutesBetweenPlays;                               // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514F[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinBetweenPlays;                                   // 0x0278(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 AudioUID;                                          // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnReadyToPlay__DelegateSignature(float PlayStartTime, const class FString& Param_AudioUID);
	void OnStopPlayback__DelegateSignature();
	void ExecuteUbergraph_BP_DJBoothMeshTrigger(int32 EntryPoint);
	void RootStopYachtDJBooth();
	void RootPlayYachtDJBooth(const class FString& Param_AudioUID);
	void ReceiveBeginPlay();
	void OnRep_PlayUTCTime();
	void OnRep_PlayServerTimeSeconds();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DJBoothMeshTrigger_C">();
	}
	static class ABP_DJBoothMeshTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DJBoothMeshTrigger_C>();
	}
};
static_assert(alignof(ABP_DJBoothMeshTrigger_C) == 0x000008, "Wrong alignment on ABP_DJBoothMeshTrigger_C");
static_assert(sizeof(ABP_DJBoothMeshTrigger_C) == 0x0002A8, "Wrong size on ABP_DJBoothMeshTrigger_C");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, UberGraphFrame) == 0x000220, "Member 'ABP_DJBoothMeshTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, MeshNetwork) == 0x000228, "Member 'ABP_DJBoothMeshTrigger_C::MeshNetwork' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_DJBoothMeshTrigger_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, PlayUTCTime) == 0x000238, "Member 'ABP_DJBoothMeshTrigger_C::PlayUTCTime' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, PlayServerTimeSeconds) == 0x000240, "Member 'ABP_DJBoothMeshTrigger_C::PlayServerTimeSeconds' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, VideoPlayStartTime) == 0x000244, "Member 'ABP_DJBoothMeshTrigger_C::VideoPlayStartTime' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, OnReadyToPlay) == 0x000248, "Member 'ABP_DJBoothMeshTrigger_C::OnReadyToPlay' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, OnStopPlayback) == 0x000258, "Member 'ABP_DJBoothMeshTrigger_C::OnStopPlayback' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, StopUTCTime) == 0x000268, "Member 'ABP_DJBoothMeshTrigger_C::StopUTCTime' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, MinutesBetweenPlays) == 0x000270, "Member 'ABP_DJBoothMeshTrigger_C::MinutesBetweenPlays' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, MinBetweenPlays) == 0x000278, "Member 'ABP_DJBoothMeshTrigger_C::MinBetweenPlays' has a wrong offset!");
static_assert(offsetof(ABP_DJBoothMeshTrigger_C, AudioUID) == 0x000298, "Member 'ABP_DJBoothMeshTrigger_C::AudioUID' has a wrong offset!");

}

