#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_SprayDecorator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Decal_SprayDecorator.BP_Decal_SprayDecorator_C.ExecuteUbergraph_BP_Decal_SprayDecorator
// 0x0030 (0x0030 - 0x0000)
struct BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8731[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8732[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator) == 0x000008, "Wrong alignment on BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator");
static_assert(sizeof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator) == 0x000030, "Wrong size on BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, EntryPoint) == 0x000000, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, K2Node_DynamicCast_AsBuilding_Actor) == 0x000008, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, K2Node_CustomEvent_DestroyedActor) == 0x000018, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_Decal_SprayDecorator_C_ExecuteUbergraph_BP_Decal_SprayDecorator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_Decal_SprayDecorator.BP_Decal_SprayDecorator_C.OnAttachedPropDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed) == 0x000008, "Wrong alignment on BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed");
static_assert(sizeof(BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed) == 0x000008, "Wrong size on BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed");
static_assert(offsetof(BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed, DestroyedActor) == 0x000000, "Member 'BP_Decal_SprayDecorator_C_OnAttachedPropDestroyed::DestroyedActor' has a wrong offset!");

// Function BP_Decal_SprayDecorator.BP_Decal_SprayDecorator_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Decal_SprayDecorator_C_UserConstructionScript final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8733[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8734[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_SprayDecorator_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Decal_SprayDecorator_C_UserConstructionScript");
static_assert(sizeof(BP_Decal_SprayDecorator_C_UserConstructionScript) == 0x000020, "Wrong size on BP_Decal_SprayDecorator_C_UserConstructionScript");
static_assert(offsetof(BP_Decal_SprayDecorator_C_UserConstructionScript, Temp_float_Variable) == 0x000000, "Member 'BP_Decal_SprayDecorator_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Decal_SprayDecorator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_UserConstructionScript, Temp_float_Variable_1) == 0x000010, "Member 'BP_Decal_SprayDecorator_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_UserConstructionScript, Temp_bool_Variable) == 0x000014, "Member 'BP_Decal_SprayDecorator_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decal_SprayDecorator_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_Decal_SprayDecorator_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

