#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DancePlatformSingleTimed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C
// 0x00A8 (0x0C68 - 0x0BC0)
class ABP_DancePlatformSingleTimed_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Success;                                           // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Disco_puzzle_ShepardTone_Cue;                      // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Platform;                                          // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DanceFloor;                                        // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DancerActive;                                      // 0x0BE8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_820B[0x7];                                     // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Audio_FinishFireworks;                             // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ConfettiEmitter;                                   // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          PlatformPlayerList;                                // 0x0C00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DancerCheckTimer;                                  // 0x0C10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_DanceFloorOn;                             // 0x0C18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_DanceFloorOff;                            // 0x0C20(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_DanceFloorWaiting;                        // 0x0C28(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                QuestId;                                           // 0x0C30(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  QuestTag;                                          // 0x0C38(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<class UStaticMeshComponent*>           DanceFloors;                                       // 0x0C58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DancePlatformSingleTimed(int32 EntryPoint);
	void QuestsCompleted(const TArray<class UFortQuestItem*>& Quests);
	void DanceCompleted();
	void BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CheckForPlayersDancing();
	void BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();
	void OnRep_DancerActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DancePlatformSingleTimed_C">();
	}
	static class ABP_DancePlatformSingleTimed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DancePlatformSingleTimed_C>();
	}
};
static_assert(alignof(ABP_DancePlatformSingleTimed_C) == 0x000008, "Wrong alignment on ABP_DancePlatformSingleTimed_C");
static_assert(sizeof(ABP_DancePlatformSingleTimed_C) == 0x000C68, "Wrong size on ABP_DancePlatformSingleTimed_C");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, UberGraphFrame) == 0x000BC0, "Member 'ABP_DancePlatformSingleTimed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Success) == 0x000BC8, "Member 'ABP_DancePlatformSingleTimed_C::Success' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Disco_puzzle_ShepardTone_Cue) == 0x000BD0, "Member 'ABP_DancePlatformSingleTimed_C::Disco_puzzle_ShepardTone_Cue' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Platform) == 0x000BD8, "Member 'ABP_DancePlatformSingleTimed_C::Platform' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, DanceFloor) == 0x000BE0, "Member 'ABP_DancePlatformSingleTimed_C::DanceFloor' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, DancerActive) == 0x000BE8, "Member 'ABP_DancePlatformSingleTimed_C::DancerActive' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Audio_FinishFireworks) == 0x000BF0, "Member 'ABP_DancePlatformSingleTimed_C::Audio_FinishFireworks' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, ConfettiEmitter) == 0x000BF8, "Member 'ABP_DancePlatformSingleTimed_C::ConfettiEmitter' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, PlatformPlayerList) == 0x000C00, "Member 'ABP_DancePlatformSingleTimed_C::PlatformPlayerList' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, DancerCheckTimer) == 0x000C10, "Member 'ABP_DancePlatformSingleTimed_C::DancerCheckTimer' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Material_DanceFloorOn) == 0x000C18, "Member 'ABP_DancePlatformSingleTimed_C::Material_DanceFloorOn' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Material_DanceFloorOff) == 0x000C20, "Member 'ABP_DancePlatformSingleTimed_C::Material_DanceFloorOff' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, Material_DanceFloorWaiting) == 0x000C28, "Member 'ABP_DancePlatformSingleTimed_C::Material_DanceFloorWaiting' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, QuestId) == 0x000C30, "Member 'ABP_DancePlatformSingleTimed_C::QuestId' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, QuestTag) == 0x000C38, "Member 'ABP_DancePlatformSingleTimed_C::QuestTag' has a wrong offset!");
static_assert(offsetof(ABP_DancePlatformSingleTimed_C, DanceFloors) == 0x000C58, "Member 'ABP_DancePlatformSingleTimed_C::DanceFloors' has a wrong offset!");

}

