#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DancePlatformSingleTimed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.ExecuteUbergraph_BP_DancePlatformSingleTimed
// 0x0260 (0x0260 - 0x0000)
struct BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class UFortQuestItem*>& Quests)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_820C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_820D[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_820E[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_820F[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8210[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8211[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8212[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8213[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8214[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8215[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8216[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8217[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8218[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8219[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821A[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 K2Node_CustomEvent_Quests;                         // 0x01E0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821B[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821C[0x2];                                     // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821D[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821E[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item_1;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_2;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingEmote_ReturnValue;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821F[0x1];                                     // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8220[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8221[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed) == 0x000008, "Wrong alignment on BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed) == 0x000260, "Wrong size on BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, EntryPoint) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_HasAuthority_ReturnValue) == 0x00001D, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_HasAuthority_ReturnValue_1) == 0x00001E, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000020, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000028, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000030, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000038, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0000E0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0000F0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0000F8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetQuestManager_ReturnValue) == 0x000100, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_AddUnique_ReturnValue) == 0x000108, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Find_ReturnValue) == 0x00010C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000118, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Not_PreBool_ReturnValue_1) == 0x000119, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x000140, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x000150, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_DynamicCast_bSuccess_3) == 0x000158, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x000160, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3) == 0x000168, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetQuestManager_ReturnValue_1) == 0x000170, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Find_ReturnValue_1) == 0x000178, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00017C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Length_ReturnValue_1) == 0x000180, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000184, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Length_ReturnValue_2) == 0x000188, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Greater_IntInt_ReturnValue) == 0x00018C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000190, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00019C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001A8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001BC, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0001C8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0001D8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_CustomEvent_Quests) == 0x0001E0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_CustomEvent_Quests' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Length_ReturnValue_3) == 0x0001F8, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000200, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_int_Loop_Counter_Variable) == 0x000208, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00020C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Less_IntInt_ReturnValue) == 0x00020D, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Add_IntInt_ReturnValue) == 0x000210, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_BooleanAND_ReturnValue) == 0x000214, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_int_Array_Index_Variable_1) == 0x000218, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Array_Get_Item_1) == 0x000220, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_GetQuestManager_ReturnValue_2) == 0x000228, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_GetQuestManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_IsPlayingEmote_ReturnValue) == 0x000230, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_IsPlayingEmote_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000231, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000232, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, Temp_int_Loop_Counter_Variable_1) == 0x000234, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, K2Node_CreateDelegate_OutputDelegate_1) == 0x000238, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Less_IntInt_ReturnValue_1) == 0x000248, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000250, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_BooleanAND_ReturnValue_1) == 0x000258, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed, CallFunc_Add_IntInt_ReturnValue_1) == 0x00025C, "Member 'BP_DancePlatformSingleTimed_C_ExecuteUbergraph_BP_DancePlatformSingleTimed::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.QuestsCompleted
// 0x0010 (0x0010 - 0x0000)
struct BP_DancePlatformSingleTimed_C_QuestsCompleted final
{
public:
	TArray<class UFortQuestItem*>                 Quests;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_QuestsCompleted) == 0x000008, "Wrong alignment on BP_DancePlatformSingleTimed_C_QuestsCompleted");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_QuestsCompleted) == 0x000010, "Wrong size on BP_DancePlatformSingleTimed_C_QuestsCompleted");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_QuestsCompleted, Quests) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_QuestsCompleted::Quests' has a wrong offset!");

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8222[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DancePlatformSingleTimed_C_BndEvt__Platform1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_DancePlatformSingleTimed_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_DancePlatformSingleTimed_C_UserConstructionScript");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_UserConstructionScript) == 0x000004, "Wrong size on BP_DancePlatformSingleTimed_C_UserConstructionScript");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_DancePlatformSingleTimed.BP_DancePlatformSingleTimed_C.OnRep_DancerActive
// 0x0030 (0x0030 - 0x0000)
struct BP_DancePlatformSingleTimed_C_OnRep_DancerActive final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DancePlatformSingleTimed_C_OnRep_DancerActive) == 0x000008, "Wrong alignment on BP_DancePlatformSingleTimed_C_OnRep_DancerActive");
static_assert(sizeof(BP_DancePlatformSingleTimed_C_OnRep_DancerActive) == 0x000030, "Wrong size on BP_DancePlatformSingleTimed_C_OnRep_DancerActive");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_OnRep_DancerActive, Temp_int_Variable) == 0x000000, "Member 'BP_DancePlatformSingleTimed_C_OnRep_DancerActive::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DancePlatformSingleTimed_C_OnRep_DancerActive, Temp_int_Variable_1) == 0x000004, "Member 'BP_DancePlatformSingleTimed_C_OnRep_DancerActive::Temp_int_Variable_1' has a wrong offset!");
