#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams.BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C.ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams
// 0x0030 (0x0030 - 0x0000)
struct BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7823[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams) == 0x000008, "Wrong alignment on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams");
static_assert(sizeof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams) == 0x000030, "Wrong size on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams, EntryPoint) == 0x000000, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000028, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_ExecuteUbergraph_BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

// Function BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams.BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7824[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7825[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript");
static_assert(sizeof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript) == 0x000030, "Wrong size on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000018, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams.BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C.initializeMaterialParams
// 0x0058 (0x0058 - 0x0000)
struct BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams final
{
public:
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue_1;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue_2;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams) == 0x000004, "Wrong alignment on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams");
static_assert(sizeof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams) == 0x000058, "Wrong size on BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_FMax_ReturnValue) == 0x000000, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_BreakColor_R) == 0x000004, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_BreakColor_G) == 0x000008, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_BreakColor_B) == 0x00000C, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_BreakColor_A) == 0x000010, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_DegTan_ReturnValue) == 0x00001C, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_MakeColor_ReturnValue) == 0x000020, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000030, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_DegTan_ReturnValue_1) == 0x00003C, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_DegTan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_DegTan_ReturnValue_2) == 0x000040, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_DegTan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000044, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_Demeter_Lighthouse_Prototype_Spinny_LightBeams_C_InitializeMaterialParams::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

}

