#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortniteLobbyLightSwitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FortniteLobbyLightSwitcher.BP_FortniteLobbyLightSwitcher_C.SetVisiblityofDetailSpecificMeshes
// 0x0070 (0x0070 - 0x0000)
struct BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D27[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D28[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DetailLevelMesh_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D29[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DetailLevelMesh_C*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DetailLevelMesh_C*                  K2Node_DynamicCast_AsBP_Detail_Level_Mesh;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes) == 0x000008, "Wrong alignment on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes");
static_assert(sizeof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes) == 0x000070, "Wrong size on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_IsMobileGame_ReturnValue) == 0x00000C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetGameUserSettings_ReturnValue) == 0x000028, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_GetShadowQuality_ReturnValue) == 0x000040, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, K2Node_DynamicCast_AsBP_Detail_Level_Mesh) == 0x000058, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::K2Node_DynamicCast_AsBP_Detail_Level_Mesh' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanOR_ReturnValue) == 0x000061, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanOR_ReturnValue_1) == 0x000062, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_BooleanAND_ReturnValue) == 0x000063, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofDetailSpecificMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FortniteLobbyLightSwitcher.BP_FortniteLobbyLightSwitcher_C.SetVisiblityofSceneLighting
// 0x00A8 (0x00A8 - 0x0000)
struct BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2C[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue_1;     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue_1;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2E[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue_2;     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2F[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitter*                               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D30[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D31[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShadowQuality_ReturnValue_2;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D32[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting) == 0x000008, "Wrong alignment on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(sizeof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting) == 0x0000A8, "Wrong size on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Activate) == 0x000000, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Activate' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue) == 0x00001C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue_1) == 0x00001D, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsMobileGame_ReturnValue_2) == 0x00001E, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue) == 0x00001F, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_3) == 0x000022, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue) == 0x000028, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_4) == 0x000030, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000034, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetShadowQuality_ReturnValue) == 0x000038, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003D, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue) == 0x00003F, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_1) == 0x000040, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_5) == 0x000041, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_1) == 0x000042, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_2) == 0x000043, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_6) == 0x000044, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_7) == 0x000045, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_8) == 0x000046, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_9) == 0x000047, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000048, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetVisualEffectQuality_ReturnValue_1) == 0x000050, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetVisualEffectQuality_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetShadowQuality_ReturnValue_1) == 0x000054, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetShadowQuality_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000058, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000059, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_2) == 0x00005A, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_3) == 0x00005B, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_4) == 0x00005C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_10) == 0x00005D, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_3) == 0x00005E, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_5) == 0x00005F, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_11) == 0x000060, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_12) == 0x000061, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_13) == 0x000062, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_14) == 0x000063, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_15) == 0x000064, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_16) == 0x000065, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_17) == 0x000066, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000068, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetVisualEffectQuality_ReturnValue_2) == 0x000070, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetVisualEffectQuality_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000080, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_18) == 0x000081, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_4) == 0x000082, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetShadowQuality_ReturnValue_2) == 0x00008C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetShadowQuality_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000090, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_19) == 0x000091, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_6) == 0x000092, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_7) == 0x000093, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue_5) == 0x000094, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanOR_ReturnValue_8) == 0x000095, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_20) == 0x0000A4, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A5, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_21) == 0x0000A6, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue_22) == 0x0000A7, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue_22' has a wrong offset!");

// Function BP_FortniteLobbyLightSwitcher.BP_FortniteLobbyLightSwitcher_C.ExecuteUbergraph_BP_FortniteLobbyLightSwitcher
// 0x0068 (0x0068 - 0x0000)
struct BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D33[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D34[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortnitePartyBackdrop_Camera_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D35[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortnitePartyBackdrop_Camera_C*        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher) == 0x000008, "Wrong alignment on BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher");
static_assert(sizeof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher) == 0x000068, "Wrong size on BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, EntryPoint) == 0x000000, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::EntryPoint' has a wrong offset!");
