#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloorPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloorPad.BP_FloorPad_C
// 0x0048 (0x0268 - 0x0220)
class ABP_FloorPad_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Spybase_Skydiving_In_Place_FX;                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_MilitaryBase_Solid_Vent_01;                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_OpenFloor_DBEB5C3946316A77F4A16EA38CEB8F99; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_DBEB5C3946316A77F4A16EA38CEB8F99; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C24[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void On_Item_Spawned(bool Should_Show_Floor);
	void ExecuteUbergraph_BP_FloorPad(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FloorPad_C">();
	}
	static class ABP_FloorPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloorPad_C>();
	}
};
static_assert(alignof(ABP_FloorPad_C) == 0x000008, "Wrong alignment on ABP_FloorPad_C");
static_assert(sizeof(ABP_FloorPad_C) == 0x000268, "Wrong size on ABP_FloorPad_C");
static_assert(offsetof(ABP_FloorPad_C, UberGraphFrame) == 0x000220, "Member 'ABP_FloorPad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, P_Spybase_Skydiving_In_Place_FX) == 0x000228, "Member 'ABP_FloorPad_C::P_Spybase_Skydiving_In_Place_FX' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, S_MilitaryBase_Solid_Vent_01) == 0x000230, "Member 'ABP_FloorPad_C::S_MilitaryBase_Solid_Vent_01' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, StaticMeshComponent1) == 0x000238, "Member 'ABP_FloorPad_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, StaticMeshComponent0) == 0x000240, "Member 'ABP_FloorPad_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, SharedRoot) == 0x000248, "Member 'ABP_FloorPad_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_FloorPad_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, Timeline_0_OpenFloor_DBEB5C3946316A77F4A16EA38CEB8F99) == 0x000258, "Member 'ABP_FloorPad_C::Timeline_0_OpenFloor_DBEB5C3946316A77F4A16EA38CEB8F99' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, Timeline_0__Direction_DBEB5C3946316A77F4A16EA38CEB8F99) == 0x00025C, "Member 'ABP_FloorPad_C::Timeline_0__Direction_DBEB5C3946316A77F4A16EA38CEB8F99' has a wrong offset!");
static_assert(offsetof(ABP_FloorPad_C, Timeline_0) == 0x000260, "Member 'ABP_FloorPad_C::Timeline_0' has a wrong offset!");

}

