#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloorPad

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FloorPad.BP_FloorPad_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_FloorPad_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FloorPad_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_FloorPad_C_UserConstructionScript");
static_assert(sizeof(BP_FloorPad_C_UserConstructionScript) == 0x000001, "Wrong size on BP_FloorPad_C_UserConstructionScript");
static_assert(offsetof(BP_FloorPad_C_UserConstructionScript, CallFunc_IsMobileGame_ReturnValue) == 0x000000, "Member 'BP_FloorPad_C_UserConstructionScript::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

// Function BP_FloorPad.BP_FloorPad_C.On Item Spawned
// 0x0001 (0x0001 - 0x0000)
struct BP_FloorPad_C_On_Item_Spawned final
{
public:
	bool                                          Should_Show_Floor;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FloorPad_C_On_Item_Spawned) == 0x000001, "Wrong alignment on BP_FloorPad_C_On_Item_Spawned");
static_assert(sizeof(BP_FloorPad_C_On_Item_Spawned) == 0x000001, "Wrong size on BP_FloorPad_C_On_Item_Spawned");
static_assert(offsetof(BP_FloorPad_C_On_Item_Spawned, Should_Show_Floor) == 0x000000, "Member 'BP_FloorPad_C_On_Item_Spawned::Should_Show_Floor' has a wrong offset!");

// Function BP_FloorPad.BP_FloorPad_C.ExecuteUbergraph_BP_FloorPad
// 0x0078 (0x0078 - 0x0000)
struct BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Should_Show_Floor)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C25[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C26[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItemPreviewSideSwap_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Should_Show_Floor;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C27[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AItemPreviewSideSwap_C*                 K2Node_DynamicCast_AsItem_Preview_Side_Swap;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C28[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C29[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad) == 0x000008, "Wrong alignment on BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad");
static_assert(sizeof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad) == 0x000078, "Wrong size on BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, EntryPoint) == 0x000000, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, K2Node_CustomEvent_Should_Show_Floor) == 0x000038, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::K2Node_CustomEvent_Should_Show_Floor' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, K2Node_DynamicCast_AsItem_Preview_Side_Swap) == 0x000048, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::K2Node_DynamicCast_AsItem_Preview_Side_Swap' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000068, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad, CallFunc_IsMobileGame_ReturnValue) == 0x000070, "Member 'BP_FloorPad_C_ExecuteUbergraph_BP_FloorPad::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

}

