#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_BPDoors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Frontend_EventLevel_NavObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_EventLevel_NavObject_BPDoors.BP_Frontend_EventLevel_NavObject_BPDoors_C
// 0x00D8 (0x05A8 - 0x04D0)
class ABP_Frontend_EventLevel_NavObject_BPDoors_C final : public ABP_Frontend_EventLevel_NavObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sm_spybase_door_linear_glint;                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Glint;                                        // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Vent_Light2;                                    // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Vent_Light;                                     // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_BattlePassDoor_Frame_BP12;                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_BattlePassStar_BP12;                             // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Elevator_Door_BP12;                              // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeGlint_NewTrack_0_96A1924F476395226DD71EA4C31929F9; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeGlint__Direction_96A1924F476395226DD71EA4C31929F9; // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_500B[0x3];                                     // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeGlint;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_TimeInxeconds_188FD4164E7BC462F444AE8B99154617; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_188FD4164E7BC462F444AE8B99154617; // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_188FD4164E7BC462F444AE8B99154617; // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_500C[0x7];                                     // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid_1;                                             // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid_2;                                             // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ElevatorMaterial_override;                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Battle_1;                                      // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Lights;                                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OpeningSound;                                      // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeInSeconds;                                     // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_500D[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ClosingSound;                                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugPurchased;                                    // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_500E[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Frame;                                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetBattlePassVisualState(bool Purchased);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void FadeGlint__FinishedFunc();
	void FadeGlint__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveActorBeginCursorOver();
	void ReceiveActorEndCursorOver();
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void UpdateVisuals();
	void Open_Door_Sound();
	void Close_Door_Sound();
	void OnInitializeForPlayer();
	void ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_EventLevel_NavObject_BPDoors_C">();
	}
	static class ABP_Frontend_EventLevel_NavObject_BPDoors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_EventLevel_NavObject_BPDoors_C>();
	}
};
static_assert(alignof(ABP_Frontend_EventLevel_NavObject_BPDoors_C) == 0x000008, "Wrong alignment on ABP_Frontend_EventLevel_NavObject_BPDoors_C");
static_assert(sizeof(ABP_Frontend_EventLevel_NavObject_BPDoors_C) == 0x0005A8, "Wrong size on ABP_Frontend_EventLevel_NavObject_BPDoors_C");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, UberGraphFrame) == 0x0004D0, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Sm_spybase_door_linear_glint) == 0x0004D8, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Sm_spybase_door_linear_glint' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Door_Glint) == 0x0004E0, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Door_Glint' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SpotLight3) == 0x0004E8, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SpotLight2) == 0x0004F0, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SpotLight1) == 0x0004F8, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SpotLight) == 0x000500, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SM_Vent_Light2) == 0x000508, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SM_Vent_Light2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, SM_Vent_Light) == 0x000510, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::SM_Vent_Light' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, S_BattlePassDoor_Frame_BP12) == 0x000518, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::S_BattlePassDoor_Frame_BP12' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, S_BattlePassStar_BP12) == 0x000520, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::S_BattlePassStar_BP12' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, S_Elevator_Door_BP12) == 0x000528, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::S_Elevator_Door_BP12' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, FadeGlint_NewTrack_0_96A1924F476395226DD71EA4C31929F9) == 0x000530, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::FadeGlint_NewTrack_0_96A1924F476395226DD71EA4C31929F9' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, FadeGlint__Direction_96A1924F476395226DD71EA4C31929F9) == 0x000534, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::FadeGlint__Direction_96A1924F476395226DD71EA4C31929F9' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, FadeGlint) == 0x000538, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::FadeGlint' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Timeline_0_TimeInxeconds_188FD4164E7BC462F444AE8B99154617) == 0x000540, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Timeline_0_TimeInxeconds_188FD4164E7BC462F444AE8B99154617' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Timeline_0_NewTrack_0_188FD4164E7BC462F444AE8B99154617) == 0x000544, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Timeline_0_NewTrack_0_188FD4164E7BC462F444AE8B99154617' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Timeline_0__Direction_188FD4164E7BC462F444AE8B99154617) == 0x000548, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Timeline_0__Direction_188FD4164E7BC462F444AE8B99154617' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Timeline_0) == 0x000550, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Mid_1) == 0x000558, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Mid_1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, Mid_2) == 0x000560, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::Mid_2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, ElevatorMaterial_override) == 0x000568, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::ElevatorMaterial_override' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, MID_Battle_1) == 0x000570, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::MID_Battle_1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, MID_Lights) == 0x000578, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::MID_Lights' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, OpeningSound) == 0x000580, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::OpeningSound' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, TimeInSeconds) == 0x000588, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::TimeInSeconds' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, ClosingSound) == 0x000590, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::ClosingSound' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, DebugPurchased) == 0x000598, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::DebugPurchased' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_BPDoors_C, MID_Frame) == 0x0005A0, "Member 'ABP_Frontend_EventLevel_NavObject_BPDoors_C::MID_Frame' has a wrong offset!");

}

