#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_MapTable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.Update Water Level
// 0x0048 (0x0048 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2B[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2C[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level) == 0x000048, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000029, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000030, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000038, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000040, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_Update_Water_Level::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.GetMinimapIndex
// 0x0008 (0x0008 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex) == 0x000004, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex) == 0x000008, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex, Param_Index) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.GetMinimapTextures
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures final
{
public:
	TSoftObjectPtr<class UTexture2D>              MinimapTexture;                                    // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              MinimapDiscoveryMask;                              // 0x0028(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         MinimapIndex;                                      // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinimapIndex_Index;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0070(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_1;                         // 0x0098(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures) == 0x0000C0, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, MinimapTexture) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::MinimapTexture' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, MinimapDiscoveryMask) == 0x000028, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::MinimapDiscoveryMask' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, MinimapIndex) == 0x000050, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::MinimapIndex' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_GetMinimapIndex_Index) == 0x000054, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_GetMinimapIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Clamp_ReturnValue) == 0x000068, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Clamp_ReturnValue_1) == 0x00006C, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_GetMinimapTextures::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0
// 0x0008 (0x0008 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0) == 0x000008, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0, Loaded) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0::Loaded' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.OnLoaded_A68B6D734D1ACDA59664A699214A131F
// 0x0008 (0x0008 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F) == 0x000008, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F, Loaded) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_OnLoaded_A68B6D734D1ACDA59664A699214A131F::Loaded' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C.ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C2D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2F[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C30[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMinimapTextures_MinimapTexture;        // 0x0058(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetMinimapTextures_MinimapDiscoveryMask;  // 0x0080(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_GetMinimapTextures_MinimapIndex;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C31[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C32[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable) == 0x0000D0, "Wrong size on BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, EntryPoint) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, Temp_object_Variable) == 0x000008, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, Temp_object_Variable_1) == 0x000028, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_DynamicCast_AsTexture_2D_1) == 0x000030, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, Temp_bool_A_Execution_Happened_Variable) == 0x000039, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, Temp_bool_B_Execution_Happened_Variable) == 0x00004C, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_GetMinimapTextures_MinimapTexture) == 0x000058, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_GetMinimapTextures_MinimapTexture' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_GetMinimapTextures_MinimapDiscoveryMask) == 0x000080, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_GetMinimapTextures_MinimapDiscoveryMask' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_GetMinimapTextures_MinimapIndex) == 0x0000A8, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_GetMinimapTextures_MinimapIndex' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000AC, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable, K2Node_CustomEvent_Loaded_1) == 0x0000C8, "Member 'BP_Frontend_EventLevel_NavObject_MapTable_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable::K2Node_CustomEvent_Loaded_1' has a wrong offset!");

}

