#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_BPDoors

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_EventLevel_NavObject_BPDoors.BP_Frontend_EventLevel_NavObject_BPDoors_C.SetBattlePassVisualState
// 0x0001 (0x0001 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState final
{
public:
	bool                                          Purchased;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState) == 0x000001, "Wrong alignment on BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState) == 0x000001, "Wrong size on BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState, Purchased) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_SetBattlePassVisualState::Purchased' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_BPDoors.BP_Frontend_EventLevel_NavObject_BPDoors_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript) == 0x000028, "Wrong size on BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x000020, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_BPDoors.BP_Frontend_EventLevel_NavObject_BPDoors_C.ReceiveActorOnClicked
// 0x0018 (0x0018 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked final
{
public:
	struct FKey                                   ButtonPressed;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked) == 0x000018, "Wrong size on BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked, ButtonPressed) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ReceiveActorOnClicked::ButtonPressed' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_BPDoors.BP_Frontend_EventLevel_NavObject_BPDoors_C.ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors
// 0x0038 (0x0038 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_500F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_ButtonPressed;                        // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors) == 0x000038, "Wrong size on BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, EntryPoint) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, K2Node_Event_ButtonPressed) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::K2Node_Event_ButtonPressed' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, CallFunc_HasPurchasedSeasonBook_ReturnValue) == 0x000030, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::CallFunc_HasPurchasedSeasonBook_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000031, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, Temp_bool_Has_Been_Initd_Variable) == 0x000032, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors, Temp_bool_IsClosed_Variable) == 0x000033, "Member 'BP_Frontend_EventLevel_NavObject_BPDoors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BPDoors::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

