#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_VisibilityMannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Frontend_EventLevel_NavObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_EventLevel_NavObject_VisibilityMannequin.BP_Frontend_EventLevel_NavObject_VisibilityMannequin_C
// 0x0020 (0x04F0 - 0x04D0)
class ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C final : public ABP_Frontend_EventLevel_NavObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortNavigationVisibilityComponent*     FortNavigationVisibility;                          // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Mannequin;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VisTimerHandle;                                    // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void BndEvt__FortNavigationVisibility_K2Node_ComponentBoundEvent_0_SimpleVisibilityResponseDelegate__DelegateSignature();
	void BndEvt__FortNavigationVisibility_K2Node_ComponentBoundEvent_1_SimpleVisibilityResponseDelegate__DelegateSignature();
	void HideMannequin();
	void ShowMannequin();
	void ClearVisTimer();
	void ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_VisibilityMannequin(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_EventLevel_NavObject_VisibilityMannequin_C">();
	}
	static class ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C>();
	}
};
static_assert(alignof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C) == 0x000008, "Wrong alignment on ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C");
static_assert(sizeof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C) == 0x0004F0, "Wrong size on ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C, UberGraphFrame) == 0x0004D0, "Member 'ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C, FortNavigationVisibility) == 0x0004D8, "Member 'ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C::FortNavigationVisibility' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C, Mannequin) == 0x0004E0, "Member 'ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C::Mannequin' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C, VisTimerHandle) == 0x0004E8, "Member 'ABP_Frontend_EventLevel_NavObject_VisibilityMannequin_C::VisTimerHandle' has a wrong offset!");

}

