#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Galileo_VideoPreBuffer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MeshNetwork_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Galileo_VideoPreBuffer.BP_Galileo_VideoPreBuffer_C
// 0x0030 (0x0250 - 0x0220)
class ABP_Galileo_VideoPreBuffer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int64                                         CurrentPiPCounter;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentHiddenPiPHF;                                // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CurrentPiPLiveByDefault;                           // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CurrentLiveStreamInMatch;                          // 0x023A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715F[0x5];                                     // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CounterBuffer;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tmp;                                               // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Galileo_VideoPreBuffer(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Galileo_VideoPreBuffer_C">();
	}
	static class ABP_Galileo_VideoPreBuffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Galileo_VideoPreBuffer_C>();
	}
};
static_assert(alignof(ABP_Galileo_VideoPreBuffer_C) == 0x000008, "Wrong alignment on ABP_Galileo_VideoPreBuffer_C");
static_assert(sizeof(ABP_Galileo_VideoPreBuffer_C) == 0x000250, "Wrong size on ABP_Galileo_VideoPreBuffer_C");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, UberGraphFrame) == 0x000220, "Member 'ABP_Galileo_VideoPreBuffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_Galileo_VideoPreBuffer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, CurrentPiPCounter) == 0x000230, "Member 'ABP_Galileo_VideoPreBuffer_C::CurrentPiPCounter' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, CurrentHiddenPiPHF) == 0x000238, "Member 'ABP_Galileo_VideoPreBuffer_C::CurrentHiddenPiPHF' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, CurrentPiPLiveByDefault) == 0x000239, "Member 'ABP_Galileo_VideoPreBuffer_C::CurrentPiPLiveByDefault' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, CurrentLiveStreamInMatch) == 0x00023A, "Member 'ABP_Galileo_VideoPreBuffer_C::CurrentLiveStreamInMatch' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, CounterBuffer) == 0x000240, "Member 'ABP_Galileo_VideoPreBuffer_C::CounterBuffer' has a wrong offset!");
static_assert(offsetof(ABP_Galileo_VideoPreBuffer_C, Tmp) == 0x000248, "Member 'ABP_Galileo_VideoPreBuffer_C::Tmp' has a wrong offset!");

}

