#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.ExecuteUbergraph_BP_Generic_TimerManager
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_48C9[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48CA[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0100(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0120(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48CB[0x1];                                     // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_48CC[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48CD[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48CE[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48CF[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D0[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_2;  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48D1[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D2[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeconds_ReturnValue;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D3[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue;                      // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_1;                    // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_2;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_3;         // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_2;                    // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_3;                    // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_4;               // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_5;               // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_4;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_5;         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_6;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_7;               // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_6;         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_7;         // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48D4[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_3;  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(sizeof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x0003A8, "Wrong size on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, EntryPoint) == 0x000000, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName_1) == 0x000030, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000040, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000048, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000050, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName) == 0x000068, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd) == 0x000078, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin) == 0x000080, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio) == 0x000088, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_float_Variable) == 0x00009C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable) == 0x0000A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_1) == 0x0000A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_string_Variable) == 0x0000B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MatchReadyAsync_ReturnValue) == 0x0000D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_GameState) == 0x0000F0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_Playlist) == 0x0000F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_PlaylistContextTags) == 0x000100, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_2) == 0x000120, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable) == 0x000140, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable_1) == 0x000148, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000150, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000159, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable) == 0x00015A, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x00015C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable) == 0x000178, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable_1) == 0x000179, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue) == 0x000180, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000188, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x00018C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00019C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue) == 0x0001A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable_1) == 0x0001A4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue) == 0x0001AC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001B4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FClamp_ReturnValue) == 0x0001C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0001D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_1) == 0x0001E0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x0001E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue) == 0x0001EC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001F0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_2) == 0x0001F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_2) == 0x000200, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000204, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000208, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue_1) == 0x00020C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000210, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MakeTimespan_ReturnValue) == 0x000218, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue_1) == 0x000220, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSeconds_ReturnValue) == 0x000224, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetMinutes_ReturnValue) == 0x000228, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue) == 0x000230, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000240, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue) == 0x000250, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_1) == 0x000260, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue) == 0x000270, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_1) == 0x000280, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000290, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_1) == 0x000294, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_2) == 0x000298, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_3) == 0x0002A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_2) == 0x0002B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_3) == 0x0002BC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetHours_ReturnValue) == 0x0002C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetDays_ReturnValue) == 0x0002C4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0002C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0002D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_2) == 0x0002E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_3) == 0x0002F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_4) == 0x000308, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_5) == 0x000318, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_4) == 0x000328, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_5) == 0x00032C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_6) == 0x000330, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_7) == 0x000340, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_6) == 0x000350, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_7) == 0x000354, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_7) == 0x000358, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_3) == 0x000368, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000370, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000378, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000380, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000388, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_3) == 0x00038C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x000390, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000394, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000398, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_2) == 0x0003A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0003A1, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnReady_B337321A443C013690B7869DF30E5BCC
// 0x0030 (0x0030 - 0x0000)
struct BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC");
static_assert(sizeof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC) == 0x000030, "Wrong size on BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, GameState) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::GameState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, Playlist) == 0x000008, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::Playlist' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, PlaylistContextTags) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::PlaylistContextTags' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventActive_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C");
static_assert(sizeof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C) == 0x000028, "Wrong size on BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimespanRatio) == 0x000020, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimespanRatio' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventUpdated_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C");
static_assert(sizeof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C) == 0x000028, "Wrong size on BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimespanRatio) == 0x000020, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimespanRatio' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventEnded_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C");
static_assert(sizeof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C) == 0x000028, "Wrong size on BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C, TimespanRatio) == 0x000020, "Member 'BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C::TimespanRatio' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnRep_ServerWorldSecondsAtEvent
// 0x0040 (0x0040 - 0x0000)
struct BP_Generic_TimerManager_C_OnRep_ServerWorldSecondsAtEvent final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48D5[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
