#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_GrenadeLauncher.BP_GrenadeLauncher_C
// 0x0920 (0x0B90 - 0x0270)
class UBP_GrenadeLauncher_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5F34[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0278(0x0078)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02F0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0310(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0418(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0438(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0480(0x0030)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x04B0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x05F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0668(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0690(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0708(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0738(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x07B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x07E0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0858(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0888(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0900(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0930(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x09A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x09D8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0A50(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0A80(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A98(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0AC8(0x00B0)()
	float                                         CylinderROT;                                       // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastFrameRotCurveValue;                            // 0x0B7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DrumPositionCount;                                 // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRotateToPos1;                                // 0x0B84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos2;                                // 0x0B85(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos3;                                // 0x0B86(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos4;                                // 0x0B87(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos5;                                // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos6;                                // 0x0B89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_GrenadeLauncher(int32 EntryPoint);
	void AnimNotify_RotateDrum();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GrenadeLauncher_AnimGraphNode_ModifyBone_EA2975074BE60949C2769EB733D75B15();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrenadeLauncher_C">();
	}
	static class UBP_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GrenadeLauncher_C>();
	}
};
static_assert(alignof(UBP_GrenadeLauncher_C) == 0x000010, "Wrong alignment on UBP_GrenadeLauncher_C");
static_assert(sizeof(UBP_GrenadeLauncher_C) == 0x000B90, "Wrong size on UBP_GrenadeLauncher_C");
static_assert(offsetof(UBP_GrenadeLauncher_C, UberGraphFrame) == 0x000270, "Member 'UBP_GrenadeLauncher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_6) == 0x000278, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_LocalToComponentSpace) == 0x0002F0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_ModifyBone) == 0x000310, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_ComponentToLocalSpace) == 0x000418, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_Slot) == 0x000438, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_Root) == 0x000480, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_ApplyAdditive) == 0x0004B0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_6) == 0x000578, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_5) == 0x0005A0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_4) == 0x0005C8, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_3) == 0x0005F0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_2) == 0x000618, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult_1) == 0x000640, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_TransitionResult) == 0x000668, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_5) == 0x000690, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_6) == 0x000708, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_4) == 0x000738, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_5) == 0x0007B0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_3) == 0x0007E0, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_4) == 0x000858, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_2) == 0x000888, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_3) == 0x000900, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_1) == 0x000930, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_2) == 0x0009A8, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_SequencePlayer) == 0x0009D8, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult_1) == 0x000A50, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_IdentityPose) == 0x000A80, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateResult) == 0x000A98, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, AnimGraphNode_StateMachine) == 0x000AC8, "Member 'UBP_GrenadeLauncher_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, CylinderROT) == 0x000B78, "Member 'UBP_GrenadeLauncher_C::CylinderROT' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, LastFrameRotCurveValue) == 0x000B7C, "Member 'UBP_GrenadeLauncher_C::LastFrameRotCurveValue' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, DrumPositionCount) == 0x000B80, "Member 'UBP_GrenadeLauncher_C::DrumPositionCount' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos1) == 0x000B84, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos1' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos2) == 0x000B85, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos2' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos3) == 0x000B86, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos3' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos4) == 0x000B87, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos4' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos5) == 0x000B88, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos5' has a wrong offset!");
static_assert(offsetof(UBP_GrenadeLauncher_C, ShouldRotateToPos6) == 0x000B89, "Member 'UBP_GrenadeLauncher_C::ShouldRotateToPos6' has a wrong offset!");

}

