#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GrenadeLauncher.BP_GrenadeLauncher_C.ExecuteUbergraph_BP_GrenadeLauncher
// 0x0018 (0x0018 - 0x0000)
struct BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F35[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher) == 0x000004, "Wrong alignment on BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher");
static_assert(sizeof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher) == 0x000018, "Wrong size on BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, EntryPoint) == 0x000000, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, Temp_int_Variable) == 0x000008, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_GrenadeLauncher_C_ExecuteUbergraph_BP_GrenadeLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GrenadeLauncher.BP_GrenadeLauncher_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_GrenadeLauncher_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_GrenadeLauncher_C_AnimGraph) == 0x000008, "Wrong alignment on BP_GrenadeLauncher_C_AnimGraph");
static_assert(sizeof(BP_GrenadeLauncher_C_AnimGraph) == 0x000010, "Wrong size on BP_GrenadeLauncher_C_AnimGraph");
static_assert(offsetof(BP_GrenadeLauncher_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'BP_GrenadeLauncher_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

