#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hoagie_AudioController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.ExecuteUbergraph_BP_Hoagie_AudioController
// 0x0190 (0x0190 - 0x0000)
struct BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsRotorWashActive_Active;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A68[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotorSpeedPercent_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A69[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDesiredForwardSpeedKmh_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasDriver_self_CastInput;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDriver_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScrapingBottom_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6B[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6C[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Manually_Stopped;               // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6D[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6E[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x00A4(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal_Impulse;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6F[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A70[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHoagieVehicle_C*                       K2Node_CustomEvent_HoagieVehicle;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A71[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHoagieVehicle_C*                       K2Node_CustomEvent_Vehicle;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A72[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue_1;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A73[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A74[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00FC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue_2;           // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController) == 0x000008, "Wrong alignment on BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController");
static_assert(sizeof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController) == 0x000190, "Wrong size on BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, EntryPoint) == 0x000000, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_GetIsRotorWashActive_Active) == 0x000005, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_GetIsRotorWashActive_Active' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_GetRotorSpeedPercent_ReturnValue) == 0x00000C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_GetRotorSpeedPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_Damage) == 0x000014, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BreakVector_X) == 0x00001C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BreakVector_Z) == 0x000024, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00002A, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x00002B, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_GetDesiredForwardSpeedKmh_ReturnValue) == 0x000030, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_GetDesiredForwardSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_MapRangeClamped_ReturnValue) == 0x000038, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_HasDriver_self_CastInput) == 0x000040, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_HasDriver_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_HasDriver_ReturnValue) == 0x000050, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_HasDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000054, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsScrapingBottom_ReturnValue) == 0x000058, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsScrapingBottom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x00005C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsBoosting_self_CastInput) == 0x000060, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsBoosting_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsBoosting_ReturnValue) == 0x000070, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsBoosting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x000074, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x000078, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x00007C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_float_Variable) == 0x000080, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_Has_Been_Initd_Variable_1) == 0x000084, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_Manually_Stopped) == 0x000085, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_Manually_Stopped' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000094, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_IsClosed_Variable_1) == 0x0000A0, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_HitLocation) == 0x0000A4, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_Normal_Impulse) == 0x0000B0, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_Normal_Impulse' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsPlaying_ReturnValue) == 0x0000BC, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_OnCollision_OutResult) == 0x0000BD, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_OnCollision_OutMagnitude) == 0x0000C0, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_HoagieVehicle) == 0x0000C8, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_HoagieVehicle' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsMobilePlatform_ReturnValue) == 0x0000D0, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Not_PreBool_ReturnValue) == 0x0000D1, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BooleanOR_ReturnValue) == 0x0000D2, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_Has_Been_Initd_Variable_2) == 0x0000D3, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_CustomEvent_Vehicle) == 0x0000D8, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_Variable) == 0x0000E0, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, K2Node_Select_Default) == 0x0000E4, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsMobilePlatform_ReturnValue_1) == 0x0000E8, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsMobilePlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_MakeVector_ReturnValue) == 0x0000EC, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F8, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000FC, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BooleanOR_ReturnValue_1) == 0x000188, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, Temp_bool_IsClosed_Variable_2) == 0x000189, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_IsMobilePlatform_ReturnValue_2) == 0x00018A, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_IsMobilePlatform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_Not_PreBool_ReturnValue_2) == 0x00018B, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController, CallFunc_BooleanOR_ReturnValue_2) == 0x00018C, "Member 'BP_Hoagie_AudioController_C_ExecuteUbergraph_BP_Hoagie_AudioController::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.Cache References
// 0x0008 (0x0008 - 0x0000)
struct BP_Hoagie_AudioController_C_Cache_References final
{
public:
	class AHoagieVehicle_C*                       Param_Vehicle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hoagie_AudioController_C_Cache_References) == 0x000008, "Wrong alignment on BP_Hoagie_AudioController_C_Cache_References");
static_assert(sizeof(BP_Hoagie_AudioController_C_Cache_References) == 0x000008, "Wrong size on BP_Hoagie_AudioController_C_Cache_References");
static_assert(offsetof(BP_Hoagie_AudioController_C_Cache_References, Param_Vehicle) == 0x000000, "Member 'BP_Hoagie_AudioController_C_Cache_References::Param_Vehicle' has a wrong offset!");

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.On Update Audio
// 0x0008 (0x0008 - 0x0000)
struct BP_Hoagie_AudioController_C_On_Update_Audio final
{
public:
	class AHoagieVehicle_C*                       Param_HoagieVehicle;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hoagie_AudioController_C_On_Update_Audio) == 0x000008, "Wrong alignment on BP_Hoagie_AudioController_C_On_Update_Audio");
static_assert(sizeof(BP_Hoagie_AudioController_C_On_Update_Audio) == 0x000008, "Wrong size on BP_Hoagie_AudioController_C_On_Update_Audio");
static_assert(offsetof(BP_Hoagie_AudioController_C_On_Update_Audio, Param_HoagieVehicle) == 0x000000, "Member 'BP_Hoagie_AudioController_C_On_Update_Audio::Param_HoagieVehicle' has a wrong offset!");

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.On Notify Collision Hit
// 0x0018 (0x0018 - 0x0000)
struct BP_Hoagie_AudioController_C_On_Notify_Collision_Hit final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal_Impulse;                                    // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hoagie_AudioController_C_On_Notify_Collision_Hit) == 0x000004, "Wrong alignment on BP_Hoagie_AudioController_C_On_Notify_Collision_Hit");
static_assert(sizeof(BP_Hoagie_AudioController_C_On_Notify_Collision_Hit) == 0x000018, "Wrong size on BP_Hoagie_AudioController_C_On_Notify_Collision_Hit");
static_assert(offsetof(BP_Hoagie_AudioController_C_On_Notify_Collision_Hit, HitLocation) == 0x000000, "Member 'BP_Hoagie_AudioController_C_On_Notify_Collision_Hit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Hoagie_AudioController_C_On_Notify_Collision_Hit, Normal_Impulse) == 0x00000C, "Member 'BP_Hoagie_AudioController_C_On_Notify_Collision_Hit::Normal_Impulse' has a wrong offset!");

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.Stop Horn
// 0x0001 (0x0001 - 0x0000)
struct BP_Hoagie_AudioController_C_Stop_Horn final
{
public:
	bool                                          Manually_Stopped;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hoagie_AudioController_C_Stop_Horn) == 0x000001, "Wrong alignment on BP_Hoagie_AudioController_C_Stop_Horn");
static_assert(sizeof(BP_Hoagie_AudioController_C_Stop_Horn) == 0x000001, "Wrong size on BP_Hoagie_AudioController_C_Stop_Horn");
static_assert(offsetof(BP_Hoagie_AudioController_C_Stop_Horn, Manually_Stopped) == 0x000000, "Member 'BP_Hoagie_AudioController_C_Stop_Horn::Manually_Stopped' has a wrong offset!");

// Function BP_Hoagie_AudioController.BP_Hoagie_AudioController_C.Update Damage State
// 0x0004 (0x0004 - 0x0000)
struct BP_Hoagie_AudioController_C_Update_Damage_State final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hoagie_AudioController_C_Update_Damage_State) == 0x000004, "Wrong alignment on BP_Hoagie_AudioController_C_Update_Damage_State");
static_assert(sizeof(BP_Hoagie_AudioController_C_Update_Damage_State) == 0x000004, "Wrong size on BP_Hoagie_AudioController_C_Update_Damage_State");
static_assert(offsetof(BP_Hoagie_AudioController_C_Update_Damage_State, Damage) == 0x000000, "Member 'BP_Hoagie_AudioController_C_Update_Damage_State::Damage' has a wrong offset!");

}

