#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemCollection_Cluster_Fragment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment
// 0x0578 (0x0578 - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0004(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78B1[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_78B2[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78B3[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x00C8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78B4[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78B5[0x2];                                     // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x017C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78B6[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78B7[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78B8[0x1];                                     // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x01B4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0294(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x034C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78B9[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_Select_Default;                             // 0x040C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_78BA[0x4];                                     // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0420(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0440(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x04E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x04F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78BB[0x4];                                     // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78BC[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_CustomEvent_ReplicatedSound;                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78BD[0x3];                                     // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_Array_Get_Item;                           // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78BE[0x3];                                     // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0550(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive_1; // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted_1; // 0x055A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78BF[0x1];                                     // 0x055B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x055C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_78C0[0x4];                                     // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0570(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment) == 0x000008, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment) == 0x000578, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, EntryPoint) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_MakeHitResult_ReturnValue) == 0x000004, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, Temp_byte_Variable) == 0x000090, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_OverlappedComponent) == 0x0000A8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_OtherActor) == 0x0000B0, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_OtherComp) == 0x0000B8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_OtherBodyIndex) == 0x0000C0, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_bFromSweep) == 0x0000C4, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_SweepResult) == 0x0000C8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, Temp_bool_Has_Been_Initd_Variable) == 0x000154, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate_1) == 0x000158, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetOwner_ReturnValue) == 0x000168, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000170, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000179, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x00017C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000188, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x000190, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetQuestManager_ReturnValue) == 0x000198, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0001A1, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0001A2, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A4, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_ComponentBoundEvent_ImpactResult) == 0x0001B4, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000240, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00024C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000258, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000264, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetSocketLocation_ReturnValue) == 0x000270, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_VLerp_ReturnValue) == 0x00027C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Add_VectorVector_ReturnValue) == 0x000288, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000294, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate_3) == 0x000320, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_BreakRotator_Roll) == 0x000330, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_BreakRotator_Pitch) == 0x000334, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_BreakRotator_Yaw) == 0x000338, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Add_FloatFloat_ReturnValue) == 0x00033C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_MakeRotator_ReturnValue) == 0x000340, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x00034C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003D8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0003E0, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_LinearColorLerp_ReturnValue) == 0x0003E8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_LinearColorLerp_ReturnValue_1) == 0x0003F8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_SwitchEnum_CmpSuccess) == 0x000408, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_Select_Default) == 0x00040C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000420, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000428, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_MakeRotator_ReturnValue_1) == 0x00042C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000438, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000440, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_VLerp_ReturnValue_1) == 0x0004CC, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0004D8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0004E0, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate_4) == 0x0004E8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0004F8, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000508, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, Temp_bool_IsClosed_Variable) == 0x000510, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CustomEvent_ReplicatedSound) == 0x000518, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CustomEvent_ReplicatedSound' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000520, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Subtract_IntInt_ReturnValue) == 0x000524, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_Array_Get_Item) == 0x000528, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000530, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000534, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000540, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_ComponentBoundEvent_WaterBody) == 0x000548, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000550, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000558, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SendComplexCustomStatEvent_QuestActive_1) == 0x000559, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SendComplexCustomStatEvent_QuestActive_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_SendComplexCustomStatEvent_QuestCompleted_1) == 0x00055A, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_SendComplexCustomStatEvent_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, K2Node_CreateDelegate_OutputDelegate_5) == 0x00055C, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000570, "Member 'BP_ItemCollection_Cluster_Fragment_C_ExecuteUbergraph_BP_ItemCollection_Cluster_Fragment::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent) == 0x000008, "Member 'BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortWaterInteraction_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.ReplicateSound
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_ReplicateSound final
{
public:
	class USoundBase*                             ReplicatedSound;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_ReplicateSound) == 0x000008, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_ReplicateSound");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_ReplicateSound) == 0x000008, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_ReplicateSound");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_ReplicateSound, ReplicatedSound) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_ReplicateSound::ReplicatedSound' has a wrong offset!");

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature
// 0x008C (0x008C - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature) == 0x00008C, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_BndEvt__FortProjectileMovement_K2Node_ComponentBoundEvent_7_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.Collected
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_Collected final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78C1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_Collected) == 0x000008, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_Collected");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_Collected) == 0x0000B0, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_Collected");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, OverlappedComponent) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, OtherActor) == 0x000008, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, OtherComp) == 0x000010, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, OtherBodyIndex) == 0x000018, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, bFromSweep) == 0x00001C, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_Collected, SweepResult) == 0x000020, "Member 'BP_ItemCollection_Cluster_Fragment_C_Collected::SweepResult' has a wrong offset!");

// Function BP_ItemCollection_Cluster_Fragment.BP_ItemCollection_Cluster_Fragment_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript");
static_assert(sizeof(BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript) == 0x000028, "Wrong size on BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_ItemCollection_Cluster_Fragment_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
