#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Collection_Cluster_FragmentSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_Collection_Cluster_FragmentSpawner.BP_Item_Collection_Cluster_FragmentSpawner_C
// 0x0030 (0x0250 - 0x0220)
class ABP_Item_Collection_Cluster_FragmentSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Spread;                                            // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClusterFragmentSpeed_Min;                          // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClusterFragmentSpeed_Max;                          // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FragmentsRemaining;                                // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CollectingActor;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FragmentSpawnTimer;                                // 0x0248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Item_Collection_Cluster_FragmentSpawner(int32 EntryPoint);
	void DestroyCleanup();
	void DetonateCluster(float SpawnDelay, int32 TotalFragments, class AActor* Param_CollectingActor);
	void LaunchFragment();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Item_Collection_Cluster_FragmentSpawner_C">();
	}
	static class ABP_Item_Collection_Cluster_FragmentSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_Collection_Cluster_FragmentSpawner_C>();
	}
};
static_assert(alignof(ABP_Item_Collection_Cluster_FragmentSpawner_C) == 0x000008, "Wrong alignment on ABP_Item_Collection_Cluster_FragmentSpawner_C");
static_assert(sizeof(ABP_Item_Collection_Cluster_FragmentSpawner_C) == 0x000250, "Wrong size on ABP_Item_Collection_Cluster_FragmentSpawner_C");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, UberGraphFrame) == 0x000220, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, Spread) == 0x000230, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::Spread' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, ClusterFragmentSpeed_Min) == 0x000234, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::ClusterFragmentSpeed_Min' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, ClusterFragmentSpeed_Max) == 0x000238, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::ClusterFragmentSpeed_Max' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, FragmentsRemaining) == 0x00023C, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::FragmentsRemaining' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, CollectingActor) == 0x000240, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::CollectingActor' has a wrong offset!");
static_assert(offsetof(ABP_Item_Collection_Cluster_FragmentSpawner_C, FragmentSpawnTimer) == 0x000248, "Member 'ABP_Item_Collection_Cluster_FragmentSpawner_C::FragmentSpawnTimer' has a wrong offset!");

}

