#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemCollection_Touch_Hidden

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemCollection_Touch_Hidden.BP_ItemCollection_Touch_Hidden_C.ExecuteUbergraph_BP_ItemCollection_Touch_Hidden
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQuestVisual*                           K2Node_ComponentBoundEvent_QuestVisual;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_866C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQuestVisual_XPCoin_Hidden_C*           K2Node_DynamicCast_AsQuest_Visual_XPCoin_Hidden;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_866D[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_866E[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_866F[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQuestVisual_XPCoin_Hidden_C*           CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden) == 0x000008, "Wrong alignment on BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden");
static_assert(sizeof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden) == 0x0000B0, "Wrong size on BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, EntryPoint) == 0x000000, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_ComponentBoundEvent_QuestVisual) == 0x000028, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_ComponentBoundEvent_QuestVisual' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_DynamicCast_AsQuest_Visual_XPCoin_Hidden) == 0x000038, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_DynamicCast_AsQuest_Visual_XPCoin_Hidden' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_DamagedActor) == 0x000050, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_Damage) == 0x000058, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_InstigatedBy) == 0x000060, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_DamageCauser) == 0x000068, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_HitLocation) == 0x000070, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_FHitComponent) == 0x000080, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_BoneName) == 0x000088, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, K2Node_CustomEvent_Momentum) == 0x000090, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_Array_AddUnique_ReturnValue) == 0x00009C, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_ItemCollection_Touch_Hidden_C_ExecuteUbergraph_BP_ItemCollection_Touch_Hidden::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ItemCollection_Touch_Hidden.BP_ItemCollection_Touch_Hidden_C.OnHidingPropDestroyed
// 0x0050 (0x0050 - 0x0000)
struct BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8670[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8671[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed) == 0x000008, "Wrong alignment on BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed");
static_assert(sizeof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed) == 0x000050, "Wrong size on BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, DamagedActor) == 0x000000, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::DamagedActor' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, Damage) == 0x000008, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::Damage' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, InstigatedBy) == 0x000010, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, DamageCauser) == 0x000018, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, HitLocation) == 0x000020, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, FHitComponent) == 0x000030, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::FHitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, BoneName) == 0x000038, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::BoneName' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed, Momentum) == 0x000040, "Member 'BP_ItemCollection_Touch_Hidden_C_OnHidingPropDestroyed::Momentum' has a wrong offset!");

// Function BP_ItemCollection_Touch_Hidden.BP_ItemCollection_Touch_Hidden_C.BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature final
{
public:
	class AQuestVisual*                           QuestVisual;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature");
static_assert(sizeof(BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature, QuestVisual) == 0x000000, "Member 'BP_ItemCollection_Touch_Hidden_C_BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_QuestVisualDynamicMulticastDelegate__DelegateSignature::QuestVisual' has a wrong offset!");

// Function BP_ItemCollection_Touch_Hidden.BP_ItemCollection_Touch_Hidden_C.set Niagara System User Variable (Color)
// 0x0038 (0x0038 - 0x0000)
struct BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Linear_Color;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0018(0x0020)()
};
static_assert(alignof(BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_) == 0x000008, "Wrong alignment on BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_");
static_assert(sizeof(BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_) == 0x000038, "Wrong size on BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_, Param_Name) == 0x000000, "Member 'BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_::Param_Name' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_, Linear_Color) == 0x000008, "Member 'BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_::Linear_Color' has a wrong offset!");
static_assert(offsetof(BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000018, "Member 'BP_ItemCollection_Touch_Hidden_C_Set_Niagara_System_User_Variable__Color_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

}

