#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MANG_Spawner

#include "Basic.hpp"

#include "Enum_MANG_Security_ID_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Structure_MANG_Spawner_AmmoCount_structs.hpp"
#include "Structure_MANG_Spawner_FinalSpawnData_structs.hpp"
#include "Structure_MANG_Spawner_SpawnGroupBuckets_structs.hpp"
#include "Structure_MANG_Spawner_PatrolsAndBotData_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MANG_Spawner.BP_MANG_Spawner_C.ExecuteUbergraph_BP_MANG_Spawner
// 0x0470 (0x0470 - 0x0000)
struct BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DAB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0008(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DAC[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0050(0x0020)(ConstParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DAD[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6DAE[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DAF[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6DB0[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB1[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB2[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB3[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB4[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB5[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB6[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB7[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB8[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DB9[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBA[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBB[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             CallFunc_Array_Get_Item_1;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBC[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MangPlayerPawn_Parent_C*            K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent;   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBD[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DBE[0x6];                                     // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Camera;                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MANG_Security_ID                         K2Node_CustomEvent_Camera_ID;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBF[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TrackingPawn;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC0[0x2];                                     // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC1[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC2[0x3];                                     // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameMode_C*                     K2Node_DynamicCast_AsAthena_Game_Mode;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlaylistEnableBots_ReturnValue;        // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInitialNavigationLockActive_ReturnValue; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC3[0x2];                                     // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CallFunc_Map_Find_Value;                           // 0x02B0(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC4[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC5[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CallFunc_Map_Find_Value_1;                         // 0x02E0(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC6[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CallFunc_Map_Find_Value_2;                         // 0x0308(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC7[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC8[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC9[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_2;           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCA[0x2];                                     // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_2;                     // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCB[0x3];                                     // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaAIBotController*             CallFunc_Array_Get_Item_2;                         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCC[0x2];                                     // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRunning_ReturnValue;                    // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCD[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaAIBotController*             CallFunc_Array_Get_Item_3;                         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCE[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MangPlayerPawn_Parent_C*            K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent_1; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCF[0x1];                                     // 0x03FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0400(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UInfiltrationStatusComponent*           CallFunc_AddComponent_ReturnValue;                 // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD0[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD1[0x6];                                     // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner) == 0x000010, "Wrong alignment on BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner");
static_assert(sizeof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner) == 0x000470, "Wrong size on BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, EntryPoint) == 0x000000, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_struct_Variable) == 0x000008, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_GameState) == 0x000040, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_Playlist) == 0x000048, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_PlaylistContextTags) == 0x000050, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_HasAuthority_ReturnValue_1) == 0x000070, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000088, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_OtherActor) == 0x000090, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_OtherComp) == 0x000098, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000A0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000A4, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_ComponentBoundEvent_SweepResult) == 0x0000A8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000138, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetController_ReturnValue) == 0x000148, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000150, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000160, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_DamagedActor) == 0x000170, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_Damage) == 0x000178, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_InstigatedBy) == 0x000180, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_DamageCauser) == 0x000188, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_HitLocation) == 0x000190, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_FHitComponent) == 0x0001A0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_BoneName) == 0x0001A8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_Momentum) == 0x0001B0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsFort_Pawn) == 0x0001C0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_3) == 0x0001C8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Length_ReturnValue_1) == 0x0001CC, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetController_ReturnValue_1) == 0x0001D0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x0001E0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_4) == 0x0001E8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001E9, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_object_Variable) == 0x0001F0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_BooleanOR_ReturnValue) == 0x0001F8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Length_ReturnValue_2) == 0x0001FC, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_bool_Has_Been_Initd_Variable) == 0x000200, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Less_IntInt_ReturnValue) == 0x000201, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_MakeVector_ReturnValue) == 0x000204, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Array_Index_Variable_1) == 0x000210, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Array_Index_Variable_2) == 0x000214, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Get_Item) == 0x000218, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Get_Item_1) == 0x000220, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_K2_GetPawn_ReturnValue) == 0x000228, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000230, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000238, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_5) == 0x000240, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent) == 0x000248, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_6) == 0x000250, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000254, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000258, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000259, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_Camera) == 0x000260, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_Camera' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_Camera_ID) == 0x000268, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_Camera_ID' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CustomEvent_TrackingPawn) == 0x000270, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CustomEvent_TrackingPawn' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000278, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_IsValid_ReturnValue) == 0x000284, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000285, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_int_Loop_Counter_Variable_2) == 0x000288, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Less_IntInt_ReturnValue_1) == 0x00028C, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Add_IntInt_ReturnValue_2) == 0x000290, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, Temp_bool_True_if_break_was_hit_Variable) == 0x000294, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetGameMode_ReturnValue) == 0x000298, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_AsAthena_Game_Mode) == 0x0002A0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_AsAthena_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_DynamicCast_bSuccess_7) == 0x0002A8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Not_PreBool_ReturnValue) == 0x0002A9, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetPlaylistEnableBots_ReturnValue) == 0x0002AA, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetPlaylistEnableBots_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_BooleanAND_ReturnValue) == 0x0002AB, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_IsInitialNavigationLockActive_ReturnValue) == 0x0002AC, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_IsInitialNavigationLockActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_BooleanAND_ReturnValue_1) == 0x0002AD, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_Value) == 0x0002B0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_ReturnValue) == 0x0002D0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetValueAtLevel_ReturnValue) == 0x0002D4, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_FFloor_ReturnValue) == 0x0002D8, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_HasTag_ReturnValue) == 0x0002DC, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_Value_1) == 0x0002E0, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_ReturnValue_1) == 0x000300, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000304, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_Value_2) == 0x000308, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Map_Find_ReturnValue_2) == 0x000328, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_FFloor_ReturnValue_1) == 0x00032C, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000330, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Greater_IntInt_ReturnValue) == 0x000334, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Length_ReturnValue_3) == 0x000338, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00033C, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000340, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000344, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000348, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000350, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000354, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_MakeLiteralFloat_ReturnValue_2) == 0x000360, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_MakeLiteralFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000364, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000368, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_LastIndex_ReturnValue) == 0x000378, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Array_Length_ReturnValue_4) == 0x00037C, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000380, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000384, "Member 'BP_MANG_Spawner_C_ExecuteUbergraph_BP_MANG_Spawner::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
