#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Meatball_AudioController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Meatball_AudioController.BP_Meatball_AudioController_C
// 0x0070 (0x0290 - 0x0220)
class ABP_Meatball_AudioController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortVehicleAudioVoice*                 Audio_Wake_Turn;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Audio_Wake_Speed;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Audio_Scrape;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionAudioComponent*           FortBoatPontoonImpacts;                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionAudioComponent*           FortBoatCollisionImpacts;                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Audio_Engine_Down;                                 // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Audio_Engine_Up;                                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Initialize_ThrottleRamp_A1FE51804D819E27AE4E5B892CD784B5; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Initialize__Direction_A1FE51804D819E27AE4E5B892CD784B5; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88F7[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Initialize;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMeatballVehicle_L_C*                   Vehicle;                                           // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentEngineExtDown;                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentEngineExtUp;                                // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Meatball_AudioController(int32 EntryPoint);
	void BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature(class UAudioComponent* AudioComponent, int32 Param_Index);
	void BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature(class UAudioComponent* AudioComponent, int32 Param_Index);
	void Update_Scrape();
	void Update_Oneshots();
	void ReceiveBeginPlay();
	void Stop_All_Audio();
	void Update_Wake();
	void Update_Engine();
	void Audio_Tick_Update(class AMeatballVehicle_L_C* Param_Vehicle);
	void Initialize__UpdateFunc();
	void Initialize__FinishedFunc();
	void OnCollision(const struct FVector& HitLocation, const struct FVector& HitNormalImpulse, bool* OutResult, float* OutMagnitude);
	void OnPontoonEnterWater(const struct FSphericalPontoon& Pontoon);
	void CacheAudio(class AFortMeatballVehicle* Meatball);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Meatball_AudioController_C">();
	}
	static class ABP_Meatball_AudioController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Meatball_AudioController_C>();
	}
};
static_assert(alignof(ABP_Meatball_AudioController_C) == 0x000008, "Wrong alignment on ABP_Meatball_AudioController_C");
static_assert(sizeof(ABP_Meatball_AudioController_C) == 0x000290, "Wrong size on ABP_Meatball_AudioController_C");
static_assert(offsetof(ABP_Meatball_AudioController_C, UberGraphFrame) == 0x000220, "Member 'ABP_Meatball_AudioController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Audio_Wake_Turn) == 0x000228, "Member 'ABP_Meatball_AudioController_C::Audio_Wake_Turn' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Audio_Wake_Speed) == 0x000230, "Member 'ABP_Meatball_AudioController_C::Audio_Wake_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Audio_Scrape) == 0x000238, "Member 'ABP_Meatball_AudioController_C::Audio_Scrape' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, FortBoatPontoonImpacts) == 0x000240, "Member 'ABP_Meatball_AudioController_C::FortBoatPontoonImpacts' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, FortBoatCollisionImpacts) == 0x000248, "Member 'ABP_Meatball_AudioController_C::FortBoatCollisionImpacts' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Audio_Engine_Down) == 0x000250, "Member 'ABP_Meatball_AudioController_C::Audio_Engine_Down' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Audio_Engine_Up) == 0x000258, "Member 'ABP_Meatball_AudioController_C::Audio_Engine_Up' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_Meatball_AudioController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Initialize_ThrottleRamp_A1FE51804D819E27AE4E5B892CD784B5) == 0x000268, "Member 'ABP_Meatball_AudioController_C::Initialize_ThrottleRamp_A1FE51804D819E27AE4E5B892CD784B5' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Initialize__Direction_A1FE51804D819E27AE4E5B892CD784B5) == 0x00026C, "Member 'ABP_Meatball_AudioController_C::Initialize__Direction_A1FE51804D819E27AE4E5B892CD784B5' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Initialize) == 0x000270, "Member 'ABP_Meatball_AudioController_C::Initialize' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, Vehicle) == 0x000278, "Member 'ABP_Meatball_AudioController_C::Vehicle' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, CurrentEngineExtDown) == 0x000280, "Member 'ABP_Meatball_AudioController_C::CurrentEngineExtDown' has a wrong offset!");
static_assert(offsetof(ABP_Meatball_AudioController_C, CurrentEngineExtUp) == 0x000288, "Member 'ABP_Meatball_AudioController_C::CurrentEngineExtUp' has a wrong offset!");

}

