#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Meatball_AudioController

#include "Basic.hpp"

#include "Water_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.ExecuteUbergraph_BP_Meatball_AudioController
// 0x01A8 (0x01A8 - 0x0000)
struct BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F8[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AMeatballVehicle_L_C*                   K2Node_CustomEvent_Vehicle;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerIsTryingToMoveForward_ReturnValue;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F9[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput_1;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue_1;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FB[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSteeringAngle_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FC[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FD[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FE[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FF[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSteeringAngle_ReturnValue_1;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8900[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput;                 // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8901[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasDriver_self_CastInput;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDriver_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8902[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsBoosting_self_CastInput_2;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue_2;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8903[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_VehicleIsInAir_self_CastInput;            // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_VehicleIsInAir_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8904[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_1;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInWater_ReturnValue_1;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8905[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_6;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_2;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInWater_ReturnValue_2;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8906[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8907[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_VehicleIsInAir_self_CastInput_1;          // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_VehicleIsInAir_ReturnValue_1;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8908[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_1;         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_3;               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInWater_ReturnValue_3;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8909[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890A[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890B[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_7;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_2;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue_3;         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_4;                        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_5;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent_1;       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890C[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_IsInWater_self_CastInput_4;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInWater_ReturnValue_4;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890D[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController");
static_assert(sizeof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController) == 0x0001A8, "Wrong size on BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, EntryPoint) == 0x000000, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_CustomEvent_Vehicle) == 0x000008, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_ReturnValue) == 0x000010, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput) == 0x000018, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue) == 0x000028, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput_1) == 0x000030, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue_1) == 0x000040, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetSteeringAngle_ReturnValue) == 0x000044, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetSteeringAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000050, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue) == 0x000054, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1) == 0x000058, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_PlayerIsTryingToMoveForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue) == 0x00005C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanOR_ReturnValue) == 0x000060, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000064, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_1) == 0x000068, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x00006C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetSteeringAngle_ReturnValue_1) == 0x000070, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetSteeringAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_1) == 0x000074, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000078, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput) == 0x000080, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue) == 0x000090, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000094, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_HasDriver_self_CastInput) == 0x000098, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_HasDriver_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_HasDriver_ReturnValue) == 0x0000A8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_HasDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x0000AC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_self_CastInput_2) == 0x0000B0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsBoosting_ReturnValue_2) == 0x0000C0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsBoosting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x0000C4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_self_CastInput) == 0x0000C8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_ReturnValue) == 0x0000D8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x0000DC, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_1) == 0x0000E0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_1) == 0x0000F0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_6) == 0x0000F4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_2) == 0x0000F8, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_2) == 0x000108, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00010C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsDedicatedServer_ReturnValue) == 0x000110, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_self_CastInput_1) == 0x000118, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_VehicleIsInAir_ReturnValue_1) == 0x000128, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_VehicleIsInAir_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_2) == 0x000129, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_1) == 0x00012C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_3) == 0x000130, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_3) == 0x000140, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_2) == 0x000144, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Not_PreBool_ReturnValue_3) == 0x000148, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_3) == 0x00014C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_BooleanAND_ReturnValue_1) == 0x000150, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToFloat_ReturnValue_7) == 0x000154, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_2) == 0x000158, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_3) == 0x00015C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_4) == 0x000160, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_GetForwardSpeedKmh_ReturnValue_3) == 0x000164, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_GetForwardSpeedKmh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Abs_ReturnValue_4) == 0x000168, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Abs_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_MapRangeClamped_ReturnValue_5) == 0x00016C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_AudioComponent_1) == 0x000170, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_AudioComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_Index_1) == 0x000178, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00017C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_AudioComponent) == 0x000180, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, K2Node_ComponentBoundEvent_Index) == 0x000188, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue_2) == 0x00018C, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsValid_ReturnValue_3) == 0x00018D, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_self_CastInput_4) == 0x000190, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_IsInWater_ReturnValue_4) == 0x0001A0, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_IsInWater_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController, CallFunc_Conv_BoolToInt_ReturnValue_1) == 0x0001A4, "Member 'BP_Meatball_AudioController_C_ExecuteUbergraph_BP_Meatball_AudioController::CallFunc_Conv_BoolToInt_ReturnValue_1' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(sizeof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000010, "Wrong size on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature, AudioComponent) == 0x000000, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature::AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature, Param_Index) == 0x000008, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Down_K2Node_ComponentBoundEvent_3_OnVehicleAudioVoiceOneShot__DelegateSignature::Param_Index' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(sizeof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature) == 0x000010, "Wrong size on BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature, AudioComponent) == 0x000000, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature::AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature, Param_Index) == 0x000008, "Member 'BP_Meatball_AudioController_C_BndEvt__Audio_Engine_Up_K2Node_ComponentBoundEvent_2_OnVehicleAudioVoiceOneShot__DelegateSignature::Param_Index' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.Audio Tick Update
// 0x0008 (0x0008 - 0x0000)
struct BP_Meatball_AudioController_C_Audio_Tick_Update final
{
public:
	class AMeatballVehicle_L_C*                   Param_Vehicle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_Audio_Tick_Update) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_Audio_Tick_Update");
static_assert(sizeof(BP_Meatball_AudioController_C_Audio_Tick_Update) == 0x000008, "Wrong size on BP_Meatball_AudioController_C_Audio_Tick_Update");
static_assert(offsetof(BP_Meatball_AudioController_C_Audio_Tick_Update, Param_Vehicle) == 0x000000, "Member 'BP_Meatball_AudioController_C_Audio_Tick_Update::Param_Vehicle' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.OnCollision
// 0x0028 (0x0028 - 0x0000)
struct BP_Meatball_AudioController_C_OnCollision final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormalImpulse;                                  // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutMagnitude;                                      // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_890F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_OnCollision) == 0x000004, "Wrong alignment on BP_Meatball_AudioController_C_OnCollision");
static_assert(sizeof(BP_Meatball_AudioController_C_OnCollision) == 0x000028, "Wrong size on BP_Meatball_AudioController_C_OnCollision");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, HitLocation) == 0x000000, "Member 'BP_Meatball_AudioController_C_OnCollision::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, HitNormalImpulse) == 0x00000C, "Member 'BP_Meatball_AudioController_C_OnCollision::HitNormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, OutResult) == 0x000018, "Member 'BP_Meatball_AudioController_C_OnCollision::OutResult' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, OutMagnitude) == 0x00001C, "Member 'BP_Meatball_AudioController_C_OnCollision::OutMagnitude' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, CallFunc_OnCollision_OutResult) == 0x000020, "Member 'BP_Meatball_AudioController_C_OnCollision::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnCollision, CallFunc_OnCollision_OutMagnitude) == 0x000024, "Member 'BP_Meatball_AudioController_C_OnCollision::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.OnPontoonEnterWater
// 0x0140 (0x0140 - 0x0000)
struct BP_Meatball_AudioController_C_OnPontoonEnterWater final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8910[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_OnPontoonEnterWater) == 0x000010, "Wrong alignment on BP_Meatball_AudioController_C_OnPontoonEnterWater");
static_assert(sizeof(BP_Meatball_AudioController_C_OnPontoonEnterWater) == 0x000140, "Wrong size on BP_Meatball_AudioController_C_OnPontoonEnterWater");
static_assert(offsetof(BP_Meatball_AudioController_C_OnPontoonEnterWater, Pontoon) == 0x000000, "Member 'BP_Meatball_AudioController_C_OnPontoonEnterWater::Pontoon' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnPontoonEnterWater, CallFunc_OnCollision_OutResult) == 0x000130, "Member 'BP_Meatball_AudioController_C_OnPontoonEnterWater::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_OnPontoonEnterWater, CallFunc_OnCollision_OutMagnitude) == 0x000134, "Member 'BP_Meatball_AudioController_C_OnPontoonEnterWater::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");

// Function BP_Meatball_AudioController.BP_Meatball_AudioController_C.CacheAudio
// 0x0020 (0x0020 - 0x0000)
struct BP_Meatball_AudioController_C_CacheAudio final
{
public:
	class AFortMeatballVehicle*                   Meatball;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAudioVoice*                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8911[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleAudioVoice*                 K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Meatball_AudioController_C_CacheAudio) == 0x000008, "Wrong alignment on BP_Meatball_AudioController_C_CacheAudio");
static_assert(sizeof(BP_Meatball_AudioController_C_CacheAudio) == 0x000020, "Wrong size on BP_Meatball_AudioController_C_CacheAudio");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Meatball) == 0x000000, "Member 'BP_Meatball_AudioController_C_CacheAudio::Meatball' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Temp_object_Variable) == 0x000008, "Member 'BP_Meatball_AudioController_C_CacheAudio::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Meatball_AudioController_C_CacheAudio, Temp_bool_Variable) == 0x000010, "Member 'BP_Meatball_AudioController_C_CacheAudio::Temp_bool_Variable' has a wrong offset!");
