#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeshNetwork_Speaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeshNetwork_Speaker.BP_MeshNetwork_Speaker_C
// 0x0018 (0x07C8 - 0x07B0)
class ABP_MeshNetwork_Speaker_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MeshNetwork_Speaker(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MeshNetwork_Speaker_C">();
	}
	static class ABP_MeshNetwork_Speaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeshNetwork_Speaker_C>();
	}
};
static_assert(alignof(ABP_MeshNetwork_Speaker_C) == 0x000008, "Wrong alignment on ABP_MeshNetwork_Speaker_C");
static_assert(sizeof(ABP_MeshNetwork_Speaker_C) == 0x0007C8, "Wrong size on ABP_MeshNetwork_Speaker_C");
static_assert(offsetof(ABP_MeshNetwork_Speaker_C, UberGraphFrame) == 0x0007B0, "Member 'ABP_MeshNetwork_Speaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MeshNetwork_Speaker_C, Audio) == 0x0007B8, "Member 'ABP_MeshNetwork_Speaker_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_MeshNetwork_Speaker_C, DefaultSceneRoot) == 0x0007C0, "Member 'ABP_MeshNetwork_Speaker_C::DefaultSceneRoot' has a wrong offset!");

}

