#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoTickHaze

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NoTickHaze.BP_NoTickHaze_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_NoTickHaze_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NoTickHaze_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_NoTickHaze_C_UserConstructionScript");
static_assert(sizeof(BP_NoTickHaze_C_UserConstructionScript) == 0x000018, "Wrong size on BP_NoTickHaze_C_UserConstructionScript");
static_assert(offsetof(BP_NoTickHaze_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_NoTickHaze_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NoTickHaze_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_NoTickHaze_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NoTickHaze_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_NoTickHaze_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

