#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_ExplosiveBow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ProjectileTrajectory_ExplosiveBow.BP_ProjectileTrajectory_ExplosiveBow_C.ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66E4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66E5[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66E6[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E7[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E8[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_Event_SplinePoints;                         // 0x0090(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_Event_SplineTangents;                       // 0x00A0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow) == 0x000010, "Wrong alignment on BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow");
static_assert(sizeof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow) == 0x0000B0, "Wrong size on BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, EntryPoint) == 0x000000, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, Temp_int_Variable) == 0x000020, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, Temp_struct_Variable) == 0x000040, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_GetMaterial_ReturnValue) == 0x000078, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000088, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, K2Node_Event_SplinePoints) == 0x000090, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::K2Node_Event_SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow, K2Node_Event_SplineTangents) == 0x0000A0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_ExecuteUbergraph_BP_ProjectileTrajectory_ExplosiveBow::K2Node_Event_SplineTangents' has a wrong offset!");

// Function BP_ProjectileTrajectory_ExplosiveBow.BP_ProjectileTrajectory_ExplosiveBow_C.SetTrajectorySpline
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline final
{
public:
	TArray<struct FVector>                        SplinePoints;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FVector>                        SplineTangents;                                    // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline");
static_assert(sizeof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline) == 0x000020, "Wrong size on BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline, SplinePoints) == 0x000000, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline::SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline, SplineTangents) == 0x000010, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySpline::SplineTangents' has a wrong offset!");

// Function BP_ProjectileTrajectory_ExplosiveBow.BP_ProjectileTrajectory_ExplosiveBow_C.SetTrajectorySplineInternal
// 0x0330 (0x0330 - 0x0000)
struct BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal final
{
public:
	TArray<struct FVector>                        SplinePoints;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FVector>                        SplineTangents;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	float                                         LastPointDist;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66E9[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66EA[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetStartPosition_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66EB[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_4;                         // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_1;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_2;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_5;                         // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66EC[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66ED[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_4;      // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_3;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66EE[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66EF[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_6;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F0[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F1[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_4;                     // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2; // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_5;      // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F2[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0294(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F3[0x2];                                     // 0x0326(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal");
static_assert(sizeof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal) == 0x000330, "Wrong size on BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, SplinePoints) == 0x000000, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, SplineTangents) == 0x000010, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::SplineTangents' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, LastPointDist) == 0x000020, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::LastPointDist' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Length_ReturnValue_2) == 0x00002C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Length_ReturnValue_3) == 0x000030, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_LastIndex_ReturnValue) == 0x000038, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Length_ReturnValue_4) == 0x00003C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetMuzzleLocation_ReturnValue) == 0x000044, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000068, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetStartPosition_ReturnValue) == 0x000074, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetStartPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00008C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_VSize_ReturnValue) == 0x00009C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_2) == 0x0000C4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_3) == 0x0000D0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0000DC, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Normal_ReturnValue) == 0x0000E8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_VSize_ReturnValue_1) == 0x0000F4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000108, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_4) == 0x00010C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Normal_ReturnValue_1) == 0x000118, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000124, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetSplineLength_ReturnValue) == 0x000130, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetSplineLength_ReturnValue_1) == 0x000134, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetSplineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000138, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetSplineLength_ReturnValue_2) == 0x00013C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetSplineLength_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_FClamp_ReturnValue) == 0x000140, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000144, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000150, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Array_Index_Variable_1) == 0x000164, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_5) == 0x000168, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x000178, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_VSize_ReturnValue_2) == 0x000184, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000188, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Less_IntInt_ReturnValue_1) == 0x00018C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_FClamp_ReturnValue_1) == 0x000190, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000194, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001A0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue_4) == 0x0001A4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetSplineLength_ReturnValue_3) == 0x0001B0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetSplineLength_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Loop_Counter_Variable_1) == 0x0001B4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001B8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001BC, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Array_Index_Variable_2) == 0x0001C0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Array_Get_Item_6) == 0x0001C8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001D0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001D4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001D8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0001DC, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001E4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x0001E8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001F4, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Normal_ReturnValue_2) == 0x0001F8, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000204, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Normal_ReturnValue_3) == 0x000210, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Normal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x00021C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000228, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Normal_ReturnValue_4) == 0x000234, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Normal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2) == 0x000240, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x00024C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_VectorVector_ReturnValue_5) == 0x000258, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_VSize_ReturnValue_3) == 0x000264, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_VSize_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Less_FloatFloat_ReturnValue) == 0x000268, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00026C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000270, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_VectorVector_ReturnValue) == 0x00027C, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_SelectVector_ReturnValue) == 0x000288, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000294, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, Temp_int_Loop_Counter_Variable_2) == 0x000320, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_IsValid_ReturnValue) == 0x000324, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Less_IntInt_ReturnValue_3) == 0x000325, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal, CallFunc_Add_IntInt_ReturnValue_5) == 0x000328, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetTrajectorySplineInternal::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");

// Function BP_ProjectileTrajectory_ExplosiveBow.BP_ProjectileTrajectory_ExplosiveBow_C.UpdateFromTrajectoryOwner
// 0x0018 (0x0018 - 0x0000)
struct BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner final
{
public:
	TScriptInterface<class IFortTrajectoryAbilityInterface> K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner");
static_assert(sizeof(BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner) == 0x000018, "Wrong size on BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner, K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface) == 0x000000, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner::K2Node_DynamicCast_AsFort_Trajectory_Ability_Interface' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_UpdateFromTrajectoryOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ProjectileTrajectory_ExplosiveBow.BP_ProjectileTrajectory_ExplosiveBow_C.SetShouldUpdateFromOwner
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner final
{
public:
	bool                                          ShouldUpdate;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interval;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66F5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner");
static_assert(sizeof(BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner) == 0x000020, "Wrong size on BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner, ShouldUpdate) == 0x000000, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner::ShouldUpdate' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner, Param_Owner) == 0x000008, "Member 'BP_ProjectileTrajectory_ExplosiveBow_C_SetShouldUpdateFromOwner::Param_Owner' has a wrong offset!");
