#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pistol_Grip_Clip_TopAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Pistol_Grip_Clip_TopAction.BP_Pistol_Grip_Clip_TopAction_C
// 0x00A0 (0x0310 - 0x0270)
class UBP_Pistol_Grip_Clip_TopAction_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5EAA[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x02F0(0x0018)()

public:
	void ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pistol_Grip_Clip_TopAction_C">();
	}
	static class UBP_Pistol_Grip_Clip_TopAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pistol_Grip_Clip_TopAction_C>();
	}
};
static_assert(alignof(UBP_Pistol_Grip_Clip_TopAction_C) == 0x000010, "Wrong alignment on UBP_Pistol_Grip_Clip_TopAction_C");
static_assert(sizeof(UBP_Pistol_Grip_Clip_TopAction_C) == 0x000310, "Wrong size on UBP_Pistol_Grip_Clip_TopAction_C");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, UberGraphFrame) == 0x000270, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_Root) == 0x000278, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_Slot) == 0x0002A8, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_Grip_Clip_TopAction_C, AnimGraphNode_LocalRefPose) == 0x0002F0, "Member 'UBP_Pistol_Grip_Clip_TopAction_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

