#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00C0 (0x3790 - 0x36D0)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x36D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x36D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUnderwaterAudioComponent_C*            UnderwaterAudioComponent;                          // 0x36E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x36E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x3738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x373C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693F[0x3];                                     // 0x373D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x3740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x3748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x3750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6940[0x7];                                     // 0x3751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x3758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x3760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x3768(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetParachuting;                              // 0x3769(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetSkydiving;                                // 0x376A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6941[0x5];                                     // 0x376B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x3770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x3778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6942[0x7];                                     // 0x3779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x3780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	void Looping_Audio_Update();
	void Handle_Parachute_Audio_State();
	void On_Pause_State_Changed(bool bPaused);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void _Speedup_Loops(float Playback_Multiplier);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class USoundBase* GetSkydivingSound();
	void SetSkydivingAudioEnabled(bool Enabled);
	void IsGameplayCamera(bool* Param_IsGameplayCamera);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplayPC_Athena_C">();
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};
static_assert(alignof(ABP_ReplayPC_Athena_C) == 0x000010, "Wrong alignment on ABP_ReplayPC_Athena_C");
static_assert(sizeof(ABP_ReplayPC_Athena_C) == 0x003790, "Wrong size on ABP_ReplayPC_Athena_C");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UberGraphFrame) == 0x0036D0, "Member 'ABP_ReplayPC_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PostProcess) == 0x0036D8, "Member 'ABP_ReplayPC_Athena_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, UnderwaterAudioComponent) == 0x0036E0, "Member 'ABP_ReplayPC_Athena_C::UnderwaterAudioComponent' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, PlaybackRateMap) == 0x0036E8, "Member 'ABP_ReplayPC_Athena_C::PlaybackRateMap' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentPlayRate) == 0x003738, "Member 'ABP_ReplayPC_Athena_C::CurrentPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsFast) == 0x00373C, "Member 'ABP_ReplayPC_Athena_C::bIsFast' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SpeedupLoop) == 0x003740, "Member 'ABP_ReplayPC_Athena_C::SpeedupLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SlowdownLoop) == 0x003748, "Member 'ABP_ReplayPC_Athena_C::SlowdownLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsHudVisible) == 0x003750, "Member 'ABP_ReplayPC_Athena_C::bIsHudVisible' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomOutLoop) == 0x003758, "Member 'ABP_ReplayPC_Athena_C::ZoomOutLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, ZoomInLoop) == 0x003760, "Member 'ABP_ReplayPC_Athena_C::ZoomInLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsSkydivingAudioEnabled) == 0x003768, "Member 'ABP_ReplayPC_Athena_C::bIsSkydivingAudioEnabled' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetParachuting) == 0x003769, "Member 'ABP_ReplayPC_Athena_C::bIsTargetParachuting' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsTargetSkydiving) == 0x00376A, "Member 'ABP_ReplayPC_Athena_C::bIsTargetSkydiving' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, SkydivingAudioLoop) == 0x003770, "Member 'ABP_ReplayPC_Athena_C::SkydivingAudioLoop' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, bIsPaused) == 0x003778, "Member 'ABP_ReplayPC_Athena_C::bIsPaused' has a wrong offset!");
static_assert(offsetof(ABP_ReplayPC_Athena_C, CurrentSkydivingSound) == 0x003780, "Member 'ABP_ReplayPC_Athena_C::CurrentSkydivingSound' has a wrong offset!");

}

