#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StormMeshRotator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.ExecuteUbergraph_BP_StormMeshRotator
// 0x0008 (0x0008 - 0x0000)
struct BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator) == 0x000004, "Wrong alignment on BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator");
static_assert(sizeof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator) == 0x000008, "Wrong size on BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, EntryPoint) == 0x000000, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator, K2Node_Event_bEnabled) == 0x000004, "Member 'BP_StormMeshRotator_C_ExecuteUbergraph_BP_StormMeshRotator::K2Node_Event_bEnabled' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.OnStormEffectsEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_StormMeshRotator_C_OnStormEffectsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StormMeshRotator_C_OnStormEffectsEnabled) == 0x000001, "Wrong alignment on BP_StormMeshRotator_C_OnStormEffectsEnabled");
static_assert(sizeof(BP_StormMeshRotator_C_OnStormEffectsEnabled) == 0x000001, "Wrong size on BP_StormMeshRotator_C_OnStormEffectsEnabled");
static_assert(offsetof(BP_StormMeshRotator_C_OnStormEffectsEnabled, bEnabled) == 0x000000, "Member 'BP_StormMeshRotator_C_OnStormEffectsEnabled::bEnabled' has a wrong offset!");

// Function BP_StormMeshRotator.BP_StormMeshRotator_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_StormMeshRotator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693D[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SafeZoneStorm_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693E[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormMeshRotator_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_StormMeshRotator_C_UserConstructionScript");
static_assert(sizeof(BP_StormMeshRotator_C_UserConstructionScript) == 0x000050, "Wrong size on BP_StormMeshRotator_C_UserConstructionScript");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsConsolePlatform_ReturnValue) == 0x000000, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsMobilePlatform_ReturnValue) == 0x000010, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000014, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x00001B, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000028, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_GetActorOfClass_ReturnValue) == 0x000030, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000040, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StormMeshRotator_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000048, "Member 'BP_StormMeshRotator_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

}

