#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SwitchPlatformLIghtOptimization

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SwitchPlatformLIghtOptimization.BP_SwitchPlatformLIghtOptimization_C.SwitchLights
// 0x0080 (0x0080 - 0x0000)
struct BP_SwitchPlatformLIghtOptimization_C_SwitchLights final
{
public:
	bool                                          EnableSwitchPlatform;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5112[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5113[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5114[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            K2Node_DynamicCast_AsPoint_Light;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5115[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpotLight*                             K2Node_DynamicCast_AsSpot_Light;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5116[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5117[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            K2Node_DynamicCast_AsPoint_Light_1;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5118[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpotLight*                             K2Node_DynamicCast_AsSpot_Light_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights) == 0x000008, "Wrong alignment on BP_SwitchPlatformLIghtOptimization_C_SwitchLights");
static_assert(sizeof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights) == 0x000080, "Wrong size on BP_SwitchPlatformLIghtOptimization_C_SwitchLights");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, EnableSwitchPlatform) == 0x000000, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::EnableSwitchPlatform' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_AsPoint_Light) == 0x000030, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_AsPoint_Light' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_AsSpot_Light) == 0x000040, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_AsSpot_Light' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_Less_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_AsPoint_Light_1) == 0x000060, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_AsPoint_Light_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_AsSpot_Light_1) == 0x000070, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_AsSpot_Light_1' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_SwitchLights, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_SwitchPlatformLIghtOptimization_C_SwitchLights::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_SwitchPlatformLIghtOptimization.BP_SwitchPlatformLIghtOptimization_C.ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization
// 0x0008 (0x0008 - 0x0000)
struct BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization) == 0x000004, "Wrong alignment on BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization");
static_assert(sizeof(BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization) == 0x000008, "Wrong size on BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization, EntryPoint) == 0x000000, "Member 'BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization, CallFunc_IsErebus_ReturnValue) == 0x000004, "Member 'BP_SwitchPlatformLIghtOptimization_C_ExecuteUbergraph_BP_SwitchPlatformLIghtOptimization::CallFunc_IsErebus_ReturnValue' has a wrong offset!");

}

