#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StormMeshRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StormMeshRotator.BP_StormMeshRotator_C
// 0x0040 (0x0260 - 0x0220)
class ABP_StormMeshRotator_C final : public AFortStormRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StormCircleLowerSheet;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_stormCircleTopRim;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_stormCircleNew;                                 // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSpeed;                                     // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoundsScale;                                       // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StormMeshRotator(int32 EntryPoint);
	void OnStormEffectsEnabled(bool bEnabled);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StormMeshRotator_C">();
	}
	static class ABP_StormMeshRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StormMeshRotator_C>();
	}
};
static_assert(alignof(ABP_StormMeshRotator_C) == 0x000008, "Wrong alignment on ABP_StormMeshRotator_C");
static_assert(sizeof(ABP_StormMeshRotator_C) == 0x000260, "Wrong size on ABP_StormMeshRotator_C");
static_assert(offsetof(ABP_StormMeshRotator_C, UberGraphFrame) == 0x000220, "Member 'ABP_StormMeshRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, Sphere) == 0x000228, "Member 'ABP_StormMeshRotator_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, StormCircleLowerSheet) == 0x000230, "Member 'ABP_StormMeshRotator_C::StormCircleLowerSheet' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, SM_stormCircleTopRim) == 0x000238, "Member 'ABP_StormMeshRotator_C::SM_stormCircleTopRim' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, RotatingMovement) == 0x000240, "Member 'ABP_StormMeshRotator_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, SM_stormCircleNew) == 0x000248, "Member 'ABP_StormMeshRotator_C::SM_stormCircleNew' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_StormMeshRotator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, RotationSpeed) == 0x000258, "Member 'ABP_StormMeshRotator_C::RotationSpeed' has a wrong offset!");
static_assert(offsetof(ABP_StormMeshRotator_C, BoundsScale) == 0x00025C, "Member 'ABP_StormMeshRotator_C::BoundsScale' has a wrong offset!");

}

