#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeasonalFireworkLauncher_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SeasonalFireworkLauncher_Parent.BP_SeasonalFireworkLauncher_Parent_C.ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent
// 0x0148 (0x0148 - 0x0000)
struct BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x005C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E1[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78E2[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0110(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78E3[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0120(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent) == 0x000008, "Wrong alignment on BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent");
static_assert(sizeof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent) == 0x000148, "Wrong size on BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, EntryPoint) == 0x000000, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000004, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000008, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_VLerp_ReturnValue) == 0x000010, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_BreakVector_X) == 0x000034, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_BreakVector_Z) == 0x00003C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_MakeVector_ReturnValue) == 0x000044, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_VLerp_ReturnValue_1) == 0x000050, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00005C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x0000E8, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, K2Node_SwitchInteger_CmpSuccess) == 0x0000F4, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000F8, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, K2Node_Event_InteractingPawn) == 0x000108, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000110, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_SpawnProjectile_ReturnValue) == 0x000118, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000120, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_GetController_ReturnValue) == 0x000130, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'BP_SeasonalFireworkLauncher_Parent_C_ExecuteUbergraph_BP_SeasonalFireworkLauncher_Parent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_SeasonalFireworkLauncher_Parent.BP_SeasonalFireworkLauncher_Parent_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract");
static_assert(sizeof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract) == 0x000010, "Wrong size on BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract, Param_InteractingPawn) == 0x000000, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function BP_SeasonalFireworkLauncher_Parent.BP_SeasonalFireworkLauncher_Parent_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E4[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript");
static_assert(sizeof(BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript) == 0x000050, "Wrong size on BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00000C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_SeasonalFireworkLauncher_Parent_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_SeasonalFireworkLauncher_Parent.BP_SeasonalFireworkLauncher_Parent_C.BlueprintCanInteract
// 0x0030 (0x0030 - 0x0000)
struct BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78E6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract");
static_assert(sizeof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract) == 0x000030, "Wrong size on BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, Param_InteractingPawn) == 0x000000, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue) == 0x00000B, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_GetInstigatorController_ReturnValue) == 0x000010, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000020, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000029, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x00002A, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00002B, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002D, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_1) == 0x00002F, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_SeasonalFireworkLauncher_Parent.BP_SeasonalFireworkLauncher_Parent_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78E7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString");
static_assert(sizeof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString, Param_InteractingPawn) == 0x000000, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'BP_SeasonalFireworkLauncher_Parent_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

}

