#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMesh_BP12

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMesh_BP12.BP_SplineMesh_BP12_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct BP_SplineMesh_BP12_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632B[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632C[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632D[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_2; // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2; // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_3; // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_3; // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               CallFunc_GetForwardAxis_ReturnValue;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMesh_BP12_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SplineMesh_BP12_C_UserConstructionScript");
static_assert(sizeof(BP_SplineMesh_BP12_C_UserConstructionScript) == 0x000160, "Wrong size on BP_SplineMesh_BP12_C_UserConstructionScript");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue_1) == 0x000040, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue_2) == 0x000048, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue_3) == 0x000050, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, Temp_int_Variable) == 0x000064, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000068, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000074, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000080, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Normal_ReturnValue) == 0x00008C, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000098, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x0000A4, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000B0, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Normal_ReturnValue_1) == 0x0000B4, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C4, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_VSize_ReturnValue) == 0x0000D4, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000DC, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000E8, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_VSize_ReturnValue_1) == 0x0000F4, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_SelectVector_ReturnValue) == 0x0000F8, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000104, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000108, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000114, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_SelectVector_ReturnValue_1) == 0x000118, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_2) == 0x000124, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2) == 0x000130, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_3) == 0x00013C, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_3) == 0x000148, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_UserConstructionScript, CallFunc_GetForwardAxis_ReturnValue) == 0x000154, "Member 'BP_SplineMesh_BP12_C_UserConstructionScript::CallFunc_GetForwardAxis_ReturnValue' has a wrong offset!");

// Function BP_SplineMesh_BP12.BP_SplineMesh_BP12_C.ExecuteUbergraph_BP_SplineMesh_BP12
// 0x0030 (0x0030 - 0x0000)
struct BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12) == 0x000008, "Wrong alignment on BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12");
static_assert(sizeof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12) == 0x000030, "Wrong size on BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, EntryPoint) == 0x000000, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_IsPlaying_ReturnValue) == 0x00002D, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12, CallFunc_IsPlaying_ReturnValue_1) == 0x00002E, "Member 'BP_SplineMesh_BP12_C_ExecuteUbergraph_BP_SplineMesh_BP12::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");

}

