#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthTrackComponent_Gibson

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TimeSynthTrackComponent_Gibson.BP_TimeSynthTrackComponent_Gibson_C.OnDataTrackerUpdate
// 0x0040 (0x0040 - 0x0000)
struct BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7353[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponent*      CallFunc_GetDataTrackerComponent_DataTrackerComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccumulationValue_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccumulationValue_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7354[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccumulationValue_ReturnValue_2;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7355[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate");
static_assert(sizeof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate) == 0x000040, "Wrong size on BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_GetDataTrackerComponent_DataTrackerComponent) == 0x000008, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_GetDataTrackerComponent_DataTrackerComponent' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_GetAccumulationValue_ReturnValue) == 0x000010, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_GetAccumulationValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_GetAccumulationValue_ReturnValue_1) == 0x000014, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_GetAccumulationValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000019, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_SelectFloat_ReturnValue_1) == 0x000020, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_FInterpTo_ReturnValue) == 0x000024, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_FInterpTo_ReturnValue_1) == 0x000028, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_GetAccumulationValue_ReturnValue_2) == 0x00002C, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_GetAccumulationValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000030, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_SelectFloat_ReturnValue_2) == 0x000034, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate, CallFunc_FInterpTo_ReturnValue_2) == 0x000038, "Member 'BP_TimeSynthTrackComponent_Gibson_C_OnDataTrackerUpdate::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_Gibson.BP_TimeSynthTrackComponent_Gibson_C.GetRemainingEventCooldown
// 0x000C (0x000C - 0x0000)
struct BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown final
{
public:
	float                                         Cooldown;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown) == 0x000004, "Wrong alignment on BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown");
static_assert(sizeof(BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown) == 0x00000C, "Wrong size on BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown, Cooldown) == 0x000000, "Member 'BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown::Cooldown' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BP_TimeSynthTrackComponent_Gibson_C_GetRemainingEventCooldown::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_Gibson.BP_TimeSynthTrackComponent_Gibson_C.HandleMixState
// 0x001C (0x001C - 0x0000)
struct BP_TimeSynthTrackComponent_Gibson_C_HandleMixState final
{
public:
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState) == 0x000004, "Wrong alignment on BP_TimeSynthTrackComponent_Gibson_C_HandleMixState");
static_assert(sizeof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState) == 0x00001C, "Wrong size on BP_TimeSynthTrackComponent_Gibson_C_HandleMixState");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_MapRangeClamped_ReturnValue) == 0x000000, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000004, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000010, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_MapRangeClamped_ReturnValue_3) == 0x000014, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_Gibson_C_HandleMixState, CallFunc_MapRangeClamped_ReturnValue_4) == 0x000018, "Member 'BP_TimeSynthTrackComponent_Gibson_C_HandleMixState::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");

}

