#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthController_MANG_Parent

#include "Basic.hpp"

#include "TimeSynth_structs.hpp"
#include "Engine_structs.hpp"
#include "TimeSynth_VolumeGroupState_structs.hpp"
#include "TimeSynth_MANG_MixStates_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "TimeSynth_TrackMixState_Mang_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.ExecuteUbergraph_BP_TimeSynthController_MANG_Parent
// 0x0018 (0x0018 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxActiveClipLimit_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TimeSynthTrackComponent_C*          K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent) == 0x000018, "Wrong size on BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent, EntryPoint) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent, Temp_bool_Variable) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent, CallFunc_GetMaxActiveClipLimit_ReturnValue) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent::CallFunc_GetMaxActiveClipLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent, K2Node_Select_Default) == 0x000010, "Member 'BP_TimeSynthController_MANG_Parent_C_ExecuteUbergraph_BP_TimeSynthController_MANG_Parent::K2Node_Select_Default' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.RegisterForAccumulationDataWithRanges
// 0x0048 (0x0048 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges final
{
public:
	struct FGameplayTag                           Event;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   RangeTag;                                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> Event_Delegate;                                    // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EBE[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterForAccumulationRangeEvents_ReturnValue; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges) == 0x000048, "Wrong size on BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, Event) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::Event' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, RangeTag) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::RangeTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, Event_Delegate) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::Event_Delegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, CallFunc_Array_Get_Item) == 0x000034, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges, CallFunc_RegisterForAccumulationRangeEvents_ReturnValue) == 0x000044, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForAccumulationDataWithRanges::CallFunc_RegisterForAccumulationRangeEvents_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.RegisterForEventDataWithRanges
// 0x00E8 (0x00E8 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges final
{
public:
	struct FGameplayTag                           Event;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortGameplayDataTrackedRange>  Ranges;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> Event_Delegate;                                    // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EBF[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayDataTrackedRange          CallFunc_Array_Get_Item;                           // 0x0038(0x00A0)(ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC0[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterForEventValueRange_ReturnValue;   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges) == 0x0000E8, "Wrong size on BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, Event) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::Event' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, Ranges) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::Ranges' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, Event_Delegate) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::Event_Delegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges, CallFunc_RegisterForEventValueRange_ReturnValue) == 0x0000E0, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterForEventDataWithRanges::CallFunc_RegisterForEventValueRange_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.RegisterWithDataTracker
// 0x0050 (0x0050 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker final
{
public:
	class UFortGameplayDataTrackerComponent*      Data_Tracker;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RegisterForEventValueRange_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsInRange, struct FGameplayTag& AccumulationTag, struct FGameplayTag& RangeTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker) == 0x000050, "Wrong size on BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, Data_Tracker) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::Data_Tracker' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, CallFunc_RegisterForEventValueRange_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::CallFunc_RegisterForEventValueRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'BP_TimeSynthController_MANG_Parent_C_RegisterWithDataTracker::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.OnThreatenedLevelChanged
// 0x0014 (0x0014 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged final
{
public:
	bool                                          bIsInRange;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AccumulationTag;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RangeTag;                                          // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged) == 0x000004, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged) == 0x000014, "Wrong size on BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged, bIsInRange) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged::bIsInRange' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged, AccumulationTag) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged::AccumulationTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged, RangeTag) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnThreatenedLevelChanged::RangeTag' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.OnAlertedLevelChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged final
{
public:
	bool                                          bIsInRange;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AccumulationTag;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RangeTag;                                          // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlaying_IsPlaying;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC4[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC5[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeSynthClip*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynthClipHandle                   CallFunc_PlayClip_ReturnValue;                     // 0x0030(0x000C)(NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged) == 0x000040, "Wrong size on BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, bIsInRange) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::bIsInRange' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, AccumulationTag) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::AccumulationTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, RangeTag) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::RangeTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_GetIsPlaying_IsPlaying) == 0x000014, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_GetIsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000016, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x00001C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_BooleanAND_ReturnValue_2) == 0x000024, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged, CallFunc_PlayClip_ReturnValue) == 0x000030, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAlertedLevelChanged::CallFunc_PlayClip_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.OnUnawareLevelChanged
// 0x002C (0x002C - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged final
{
public:
	bool                                          bIsInRange;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AccumulationTag;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RangeTag;                                          // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC7[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged) == 0x000004, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged) == 0x00002C, "Wrong size on BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, bIsInRange) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::bIsInRange' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, AccumulationTag) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::AccumulationTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, RangeTag) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::RangeTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, Temp_bool_Variable) == 0x000014, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, Temp_int_Variable) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, Temp_int_Variable_1) == 0x00001C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, K2Node_Select_Default) == 0x000024, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000029, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'BP_TimeSynthController_MANG_Parent_C_OnUnawareLevelChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.OnTargetedBotThreatenedChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged final
{
public:
	bool                                          bIsInRange;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AccumulationTag;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RangeTag;                                          // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsPlaying_IsPlaying;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ECA[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ECB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeSynthClip*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynthClipHandle                   CallFunc_PlayClip_ReturnValue;                     // 0x0030(0x000C)(NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged) == 0x000040, "Wrong size on BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, bIsInRange) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::bIsInRange' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, AccumulationTag) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::AccumulationTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, RangeTag) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::RangeTag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_GetIsPlaying_IsPlaying) == 0x000015, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_GetIsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000016, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x000017, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_BooleanAND_ReturnValue_2) == 0x00001C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged, CallFunc_PlayClip_ReturnValue) == 0x000030, "Member 'BP_TimeSynthController_MANG_Parent_C_OnTargetedBotThreatenedChanged::CallFunc_PlayClip_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.UpdateMusicTrack
// 0x000C (0x000C - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack final
{
public:
	struct FGameplayTag                           Range_Tag;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack) == 0x000004, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack) == 0x00000C, "Wrong size on BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack, Range_Tag) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack::Range_Tag' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000009, "Member 'BP_TimeSynthController_MANG_Parent_C_UpdateMusicTrack::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.UpdateStems
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_UpdateStems final
{
public:
	struct FGameplayTag                           Threat_Level;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_UpdateStems) == 0x000004, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_UpdateStems");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_UpdateStems) == 0x000008, "Wrong size on BP_TimeSynthController_MANG_Parent_C_UpdateStems");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_UpdateStems, Threat_Level) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_UpdateStems::Threat_Level' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.SetAccumulationCheckTimerEnabled
// 0x0028 (0x0028 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ECC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6ECD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled) == 0x000028, "Wrong size on BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled, Enabled) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000020, "Member 'BP_TimeSynthController_MANG_Parent_C_SetAccumulationCheckTimerEnabled::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.OnAccumulationCheckTimer
// 0x001C (0x001C - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ECE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAccumulationValue_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_7;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_8;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_9;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ECF[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAccumulationValue_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_10;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer) == 0x000004, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer) == 0x00001C, "Wrong size on BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000001, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000002, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000003, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000004, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_GetAccumulationValue_ReturnValue) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_GetAccumulationValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x00000C, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x00000D, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x00000E, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_7) == 0x00000F, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_8) == 0x000010, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_9) == 0x000011, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_GetAccumulationValue_ReturnValue_1) == 0x000014, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_GetAccumulationValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer, CallFunc_Greater_FloatFloat_ReturnValue_10) == 0x000018, "Member 'BP_TimeSynthController_MANG_Parent_C_OnAccumulationCheckTimer::CallFunc_Greater_FloatFloat_ReturnValue_10' has a wrong offset!");

// Function BP_TimeSynthController_MANG_Parent.BP_TimeSynthController_MANG_Parent_C.SetMixStateEnabled
// 0x00D0 (0x00D0 - 0x0000)
struct BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled final
{
public:
	ETimeSynth_MANG_MixStates                     MixState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED0[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynth_TrackMixState_Mang          LocalMixStateStruct;                               // 0x0008(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ETimeSynth_MANG_MixStates                     LocalMixState;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynth_TrackMixState_Mang          CurrentMixState;                                   // 0x0050(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          LocalEnabled;                                      // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED2[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocalFadeTime;                                     // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynth_VolumeGroupState            CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlaying_IsPlaying;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED3[0x1];                                     // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED4[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled) == 0x000008, "Wrong alignment on BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled");
static_assert(sizeof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled) == 0x0000D0, "Wrong size on BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, MixState) == 0x000000, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::MixState' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, Enabled) == 0x000001, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, LocalMixStateStruct) == 0x000008, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::LocalMixStateStruct' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, LocalMixState) == 0x000048, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::LocalMixState' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, CurrentMixState) == 0x000050, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::CurrentMixState' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, LocalEnabled) == 0x000090, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::LocalEnabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, LocalFadeTime) == 0x000094, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::LocalFadeTime' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, Temp_int_Array_Index_Variable) == 0x000098, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00009C, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000A8, "Member 'BP_TimeSynthController_MANG_Parent_C_SetMixStateEnabled::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
