#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthTrackComponent_DataTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TimeSynth_TrackMixState_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker
// 0x00D0 (0x00D0 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CF6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CF7[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_Enabled;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CF8[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CF9[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CallFunc_Array_Get_Item;                           // 0x00A0(0x0020)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker) == 0x0000D0, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, EntryPoint) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, K2Node_CustomEvent_GameState) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, Temp_struct_Variable) == 0x000048, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, Temp_object_Variable) == 0x000068, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, Temp_object_Variable_1) == 0x000070, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, Temp_int_Array_Index_Variable) == 0x000084, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_GetIsEnabled_Enabled) == 0x000090, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_GetIsEnabled_Enabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000C0, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Array_Length_ReturnValue_2) == 0x0000C4, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnReady_FFC0E068479278E143D010AF8EB81D0D
// 0x0030 (0x0030 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D) == 0x000030, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D, GameState) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D::GameState' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D, Playlist) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D::Playlist' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D, PlaylistContextTags) == 0x000010, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnReady_FFC0E068479278E143D010AF8EB81D0D::PlaylistContextTags' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnDataTrackerStart
// 0x0010 (0x0010 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart final
{
public:
	class ABP_TimeSynthController_Base_C*         CallFunc_GetTimeSynthController_TimeSynthController; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestTrackChange_CanChangeTrack;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart) == 0x000010, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart, CallFunc_GetTimeSynthController_TimeSynthController) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart::CallFunc_GetTimeSynthController_TimeSynthController' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart, CallFunc_RequestTrackChange_CanChangeTrack) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerStart::CallFunc_RequestTrackChange_CanChangeTrack' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnDataTrackerUpdate
// 0x0030 (0x0030 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate final
{
public:
	class ABP_TimeSynthController_Base_C*         CallFunc_GetTimeSynthController_TimeSynthController; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlaystate_Result;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestTrackChange_CanChangeTrack;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CFA[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5CFB[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainingEventCooldown_Cooldown;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate) == 0x000030, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_GetTimeSynthController_TimeSynthController) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_GetTimeSynthController_TimeSynthController' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_CheckPlaystate_Result) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_CheckPlaystate_Result' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_RequestTrackChange_CanChangeTrack) == 0x000009, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_RequestTrackChange_CanChangeTrack' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_GetRemainingEventCooldown_Cooldown) == 0x000028, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_GetRemainingEventCooldown_Cooldown' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerUpdate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnDataTrackerEnd
// 0x0048 (0x0048 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlaystate_Result;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CFC[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TimeSynthController_Base_C*         CallFunc_GetTimeSynthController_TimeSynthController; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynth_TrackMixState               CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd) == 0x000048, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_CheckPlaystate_Result) == 0x00000C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_CheckPlaystate_Result' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_GetTimeSynthController_TimeSynthController) == 0x000010, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_GetTimeSynthController_TimeSynthController' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerEnd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.GetDataTrackerComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent final
{
public:
	class UFortGameplayDataTrackerComponent*      Param_DataTrackerComponent;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent) == 0x000008, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent, Param_DataTrackerComponent) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponent::Param_DataTrackerComponent' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.AssignDataTrackerComponent
// 0x0030 (0x0030 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent final
{
public:
	class UFortGameplayDataTrackerComponent*      Param_DataTrackerComponent;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CFD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CFE[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortGameplayDataTrackerComponent* DataTrackerComponent, bool bHasEventValues)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent) == 0x000030, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, Param_DataTrackerComponent) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::Param_DataTrackerComponent' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000018, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_AssignDataTrackerComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.GetDataTrackerComponentManager
// 0x0070 (0x0070 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortGameplayDataTrackerComponent* UnRegisteredDataTracker)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CFF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGameplayDataTrackerComponent*> CallFunc_GetRegisteredDataTrackerComponents_OutDataTrackerComponents; // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UFortGameplayDataTrackerComponent* RegisteredDataTracker)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGameplayDataTrackerComponent*      CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D00[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager) == 0x000070, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_GetRegisteredDataTrackerComponents_OutDataTrackerComponents) == 0x000020, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_GetRegisteredDataTrackerComponents_OutDataTrackerComponents' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager, CallFunc_GetCurrent_ReturnValue) == 0x000068, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetDataTrackerComponentManager::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnDataTrackerComponentRegistered
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered final
{
public:
	class UFortGameplayDataTrackerComponent*      Data_Tracker_Component;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered) == 0x000008, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered, Data_Tracker_Component) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentRegistered::Data_Tracker_Component' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnDataTrackerComponentUnRegistered
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered final
{
public:
	class UFortGameplayDataTrackerComponent*      Data_Tracker_Component;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered) == 0x000008, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered, Data_Tracker_Component) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnDataTrackerComponentUnRegistered::Data_Tracker_Component' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.OnAnyEventValueChanged
// 0x0028 (0x0028 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged final
{
public:
	class UFortGameplayDataTrackerComponent*      Data_Tracker_Component;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Event_Values;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D01[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5D02[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged) == 0x000008, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged) == 0x000028, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged, Data_Tracker_Component) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged::Data_Tracker_Component' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged, Has_Event_Values) == 0x000008, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged::Has_Event_Values' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_OnAnyEventValueChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.GetRemainingEventCooldown
// 0x0004 (0x0004 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown final
{
public:
	float                                         Cooldown;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown) == 0x000004, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown) == 0x000004, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown, Cooldown) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetRemainingEventCooldown::Cooldown' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.GetIsEnabled
// 0x0004 (0x0004 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled final
{
public:
	bool                                          Param_Enabled;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_Enabled;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled) == 0x000001, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled) == 0x000004, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled, Param_Enabled) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled::Param_Enabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled, CallFunc_GetIsEnabled_Enabled) == 0x000001, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled::CallFunc_GetIsEnabled_Enabled' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled, CallFunc_RowToBool_ReturnValue) == 0x000002, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_GetIsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C.QueueTrackStop
// 0x0001 (0x0001 - 0x0000)
struct BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop final
{
public:
	bool                                          Play_Outro;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop) == 0x000001, "Wrong alignment on BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop");
static_assert(sizeof(BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop) == 0x000001, "Wrong size on BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop");
static_assert(offsetof(BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop, Play_Outro) == 0x000000, "Member 'BP_TimeSynthTrackComponent_DataTracker_C_QueueTrackStop::Play_Outro' has a wrong offset!");

}

