#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoiceComponent_MANG

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VoiceComponent_MANG.BP_VoiceComponent_MANG_C
// 0x0028 (0x00D8 - 0x00B0)
class UBP_VoiceComponent_MANG_C final : public UActorComponent
{
public:
	class UFortTaggedSoundBank*                   SoundBank;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComponent;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerTimeThreshold;                              // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastTriggerTime;                                   // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAttachComponent(class USceneComponent* Param_AttachComponent);
	void PlayVoiceAudioInternal(class USoundBase* NewSound);
	void PlayVoiceAudio(const struct FGameplayTag& Gameplay_Tag);
	void PlayVoiceAudioExternalComponent(const struct FGameplayTag& Gameplay_Tag, class UAudioComponent* Param_AudioComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VoiceComponent_MANG_C">();
	}
	static class UBP_VoiceComponent_MANG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoiceComponent_MANG_C>();
	}
};
static_assert(alignof(UBP_VoiceComponent_MANG_C) == 0x000008, "Wrong alignment on UBP_VoiceComponent_MANG_C");
static_assert(sizeof(UBP_VoiceComponent_MANG_C) == 0x0000D8, "Wrong size on UBP_VoiceComponent_MANG_C");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, SoundBank) == 0x0000B0, "Member 'UBP_VoiceComponent_MANG_C::SoundBank' has a wrong offset!");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, AudioComponent) == 0x0000B8, "Member 'UBP_VoiceComponent_MANG_C::AudioComponent' has a wrong offset!");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, AttachComponent) == 0x0000C0, "Member 'UBP_VoiceComponent_MANG_C::AttachComponent' has a wrong offset!");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, AttachSocket) == 0x0000C8, "Member 'UBP_VoiceComponent_MANG_C::AttachSocket' has a wrong offset!");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, TriggerTimeThreshold) == 0x0000D0, "Member 'UBP_VoiceComponent_MANG_C::TriggerTimeThreshold' has a wrong offset!");
static_assert(offsetof(UBP_VoiceComponent_MANG_C, LastTriggerTime) == 0x0000D4, "Member 'UBP_VoiceComponent_MANG_C::LastTriggerTime' has a wrong offset!");

}

