#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Valet_AudioController_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Valet_AudioController_Parent.BP_Valet_AudioController_Parent_C.ExecuteUbergraph_BP_Valet_AudioController_Parent
// 0x02F8 (0x02F8 - 0x0000)
struct BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LocalPlayerInVehicleBP_Result;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D18[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D19[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1B[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1C[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1E[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1F[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D20[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_Event_Vehicle;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ParameterName;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OneshotIndex;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVehicleSurfaceType_Surface_ID;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Start;                                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enter;                                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D21[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_UpShift;                        // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D22[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUpshift)>                K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Is_Entering_Water;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D23[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_CalculateRPMWobbleRange_ReturnValue;      // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D24[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_Bone_Name_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Bone_Name;                            // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_Value;                         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D25[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D26[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_1;                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D27[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D28[0x5];                                     // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D29[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_2;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2A[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2B[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Impact_Point;                         // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2C[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2D[0x1];                                     // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2E[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult_1;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2F[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude_1;               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D30[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D31[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Awake;                                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D32[0x1];                                     // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasDriver_self_CastInput;                 // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDriver_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D33[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_2;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_SurfaceTypeVehicleIsOn;         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D34[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPhysicalSurface SurfaceTypeVehicleIsOn)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_3;                 // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent) == 0x000008, "Wrong alignment on BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent");
static_assert(sizeof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent) == 0x0002F8, "Wrong size on BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, EntryPoint) == 0x000000, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_LocalPlayerInVehicleBP_Result) == 0x000004, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_LocalPlayerInVehicleBP_Result' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000010, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_int_Variable) == 0x000018, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_2) == 0x00001C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded_2) == 0x000028, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000030, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000038, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000040, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_4) == 0x000041, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x000048, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000050, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable) == 0x000058, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave) == 0x000060, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000069, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_5) == 0x00006A, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000070, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded_3) == 0x000078, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000090, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000091, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_6) == 0x0000A4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSkeletalMeshComponent_ReturnValue_1) == 0x0000A8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Vehicle) == 0x0000B0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000BC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_AudioComponent) == 0x0000C0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_ParameterName) == 0x0000C8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_ParameterName' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_OneshotIndex) == 0x0000D0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_OneshotIndex' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetVehicleSurfaceType_Surface_ID) == 0x0000D4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetVehicleSurfaceType_Surface_ID' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_SwitchName_CmpSuccess) == 0x0000D8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Start) == 0x0000D9, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Enter) == 0x0000DA, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Enter' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000DC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsPlaying_ReturnValue) == 0x0000E0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsPlaying_ReturnValue_1) == 0x0000E1, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x0000E2, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_7) == 0x0000E3, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_8) == 0x0000F4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_UpShift) == 0x0000F5, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_UpShift' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000108, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X) == 0x000118, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y) == 0x00011C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Is_Entering_Water) == 0x000120, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Is_Entering_Water' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_9) == 0x000121, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_CalculateRPMWobbleRange_ReturnValue) == 0x000124, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_CalculateRPMWobbleRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X_1) == 0x00012C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y_1) == 0x000130, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X_2) == 0x000134, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y_2) == 0x000138, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00013C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000140, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_10) == 0x000144, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Bone_Name_1) == 0x000148, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Bone_Name_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSocketLocation_ReturnValue) == 0x000150, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Bone_Name) == 0x00015C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Bone_Name' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000164, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Damage_Value) == 0x000170, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Damage_Value' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000178, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000180, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000190, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable_1) == 0x000198, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave_1) == 0x0001A0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0001B0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded) == 0x0001B8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0001C0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001CC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_11) == 0x0001D0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001D1, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0001D2, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x0001D8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable_2) == 0x0001E8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded_1) == 0x0001F0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave_2) == 0x0001F8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000204, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_ImpactPoint) == 0x000208, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_bool_Variable) == 0x000214, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Impact_Point) == 0x000218, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Impact_Point' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000224, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000228, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_BoolToInt_ReturnValue_1) == 0x00022C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_BoolToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Not_PreBool_ReturnValue_2) == 0x000230, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000231, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x000232, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000234, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_MakeVector_ReturnValue) == 0x000238, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_MakeVector_ReturnValue_1) == 0x000244, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_OnCollision_OutResult) == 0x000250, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_OnCollision_OutMagnitude) == 0x000254, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_OnCollision_OutResult_1) == 0x000258, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_OnCollision_OutResult_1' has a wrong offset!");
