#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoiceComponent_MANG

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_VoiceComponent_MANG.BP_VoiceComponent_MANG_C.SetAttachComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_VoiceComponent_MANG_C_SetAttachComponent final
{
public:
	class USceneComponent*                        Param_AttachComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VoiceComponent_MANG_C_SetAttachComponent) == 0x000008, "Wrong alignment on BP_VoiceComponent_MANG_C_SetAttachComponent");
static_assert(sizeof(BP_VoiceComponent_MANG_C_SetAttachComponent) == 0x000008, "Wrong size on BP_VoiceComponent_MANG_C_SetAttachComponent");
static_assert(offsetof(BP_VoiceComponent_MANG_C_SetAttachComponent, Param_AttachComponent) == 0x000000, "Member 'BP_VoiceComponent_MANG_C_SetAttachComponent::Param_AttachComponent' has a wrong offset!");

// Function BP_VoiceComponent_MANG.BP_VoiceComponent_MANG_C.PlayVoiceAudioInternal
// 0x0020 (0x0020 - 0x0000)
struct BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal final
{
public:
	class USoundBase*                             NewSound;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal) == 0x000008, "Wrong alignment on BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal");
static_assert(sizeof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal) == 0x000020, "Wrong size on BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal, NewSound) == 0x000000, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal::NewSound' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000010, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioInternal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_VoiceComponent_MANG.BP_VoiceComponent_MANG_C.PlayVoiceAudio
// 0x0040 (0x0040 - 0x0000)
struct BP_VoiceComponent_MANG_C_PlayVoiceAudio final
{
public:
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundToPlay_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VoiceComponent_MANG_C_PlayVoiceAudio) == 0x000008, "Wrong alignment on BP_VoiceComponent_MANG_C_PlayVoiceAudio");
static_assert(sizeof(BP_VoiceComponent_MANG_C_PlayVoiceAudio) == 0x000040, "Wrong size on BP_VoiceComponent_MANG_C_PlayVoiceAudio");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudio, Gameplay_Tag) == 0x000000, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudio::Gameplay_Tag' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudio, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudio::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudio, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudio, CallFunc_GetSoundToPlay_ReturnValue) == 0x000030, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudio::CallFunc_GetSoundToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudio, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_VoiceComponent_MANG.BP_VoiceComponent_MANG_C.PlayVoiceAudioExternalComponent
// 0x0058 (0x0058 - 0x0000)
struct BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent final
{
public:
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Param_AudioComponent;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0018(0x0020)()
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1F[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundToPlay_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent) == 0x000008, "Wrong alignment on BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent");
static_assert(sizeof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent) == 0x000058, "Wrong size on BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, Gameplay_Tag) == 0x000000, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::Gameplay_Tag' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, Param_AudioComponent) == 0x000008, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::Param_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_GetTimeSeconds_ReturnValue) == 0x000010, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000018, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000038, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_GetSoundToPlay_ReturnValue) == 0x000048, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_GetSoundToPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'BP_VoiceComponent_MANG_C_PlayVoiceAudioExternalComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

