#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterSpline_AudioOnly

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterSpline_AudioOnly.BP_WaterSpline_AudioOnly_C
// 0x0018 (0x0238 - 0x0220)
class ABP_WaterSpline_AudioOnly_C final : public AActor
{
public:
	class UFortSplineWaterAudioComponent*         FortSplineWaterAudio;                              // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterSpline_AudioOnly_C">();
	}
	static class ABP_WaterSpline_AudioOnly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterSpline_AudioOnly_C>();
	}
};
static_assert(alignof(ABP_WaterSpline_AudioOnly_C) == 0x000008, "Wrong alignment on ABP_WaterSpline_AudioOnly_C");
static_assert(sizeof(ABP_WaterSpline_AudioOnly_C) == 0x000238, "Wrong size on ABP_WaterSpline_AudioOnly_C");
static_assert(offsetof(ABP_WaterSpline_AudioOnly_C, FortSplineWaterAudio) == 0x000220, "Member 'ABP_WaterSpline_AudioOnly_C::FortSplineWaterAudio' has a wrong offset!");
static_assert(offsetof(ABP_WaterSpline_AudioOnly_C, Spline) == 0x000228, "Member 'ABP_WaterSpline_AudioOnly_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_WaterSpline_AudioOnly_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_WaterSpline_AudioOnly_C::DefaultSceneRoot' has a wrong offset!");

}

