#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12MainRoomPOITag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS12MainRoomPOITag.BPS12MainRoomPOITag_C
// 0x0058 (0x02B0 - 0x0258)
class UBPS12MainRoomPOITag_C final : public UFortEventLevelNavigationDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BackingFadeOff;                                    // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BackingFadeOn;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               All;                                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameGlow;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       POI_Name;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           LocationNames;                                     // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Animate_POI_Title(const class FText& Param_POI_Name);
	void Construct();
	void CollapseWidget();
	void ExecuteUbergraph_BPS12MainRoomPOITag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS12MainRoomPOITag_C">();
	}
	static class UBPS12MainRoomPOITag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS12MainRoomPOITag_C>();
	}
};
static_assert(alignof(UBPS12MainRoomPOITag_C) == 0x000008, "Wrong alignment on UBPS12MainRoomPOITag_C");
static_assert(sizeof(UBPS12MainRoomPOITag_C) == 0x0002B0, "Wrong size on UBPS12MainRoomPOITag_C");
static_assert(offsetof(UBPS12MainRoomPOITag_C, UberGraphFrame) == 0x000258, "Member 'UBPS12MainRoomPOITag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, BackingFadeOff) == 0x000260, "Member 'UBPS12MainRoomPOITag_C::BackingFadeOff' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, BackingFadeOn) == 0x000268, "Member 'UBPS12MainRoomPOITag_C::BackingFadeOn' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, Outro) == 0x000270, "Member 'UBPS12MainRoomPOITag_C::Outro' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, Intro) == 0x000278, "Member 'UBPS12MainRoomPOITag_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, All) == 0x000280, "Member 'UBPS12MainRoomPOITag_C::All' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, Backing) == 0x000288, "Member 'UBPS12MainRoomPOITag_C::Backing' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, NameGlow) == 0x000290, "Member 'UBPS12MainRoomPOITag_C::NameGlow' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, POI_Name) == 0x000298, "Member 'UBPS12MainRoomPOITag_C::POI_Name' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomPOITag_C, LocationNames) == 0x0002A0, "Member 'UBPS12MainRoomPOITag_C::LocationNames' has a wrong offset!");

}

