#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12MainRoomPOITag

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPS12MainRoomPOITag.BPS12MainRoomPOITag_C.Animate POI Title
// 0x0018 (0x0018 - 0x0000)
struct BPS12MainRoomPOITag_C_Animate_POI_Title final
{
public:
	class FText                                   Param_POI_Name;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPS12MainRoomPOITag_C_Animate_POI_Title) == 0x000008, "Wrong alignment on BPS12MainRoomPOITag_C_Animate_POI_Title");
static_assert(sizeof(BPS12MainRoomPOITag_C_Animate_POI_Title) == 0x000018, "Wrong size on BPS12MainRoomPOITag_C_Animate_POI_Title");
static_assert(offsetof(BPS12MainRoomPOITag_C_Animate_POI_Title, Param_POI_Name) == 0x000000, "Member 'BPS12MainRoomPOITag_C_Animate_POI_Title::Param_POI_Name' has a wrong offset!");

// Function BPS12MainRoomPOITag.BPS12MainRoomPOITag_C.ExecuteUbergraph_BPS12MainRoomPOITag
// 0x0020 (0x0020 - 0x0000)
struct BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_POI_Name;                       // 0x0008(0x0018)()
};
static_assert(alignof(BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag) == 0x000008, "Wrong alignment on BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag");
static_assert(sizeof(BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag) == 0x000020, "Wrong size on BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag");
static_assert(offsetof(BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag, EntryPoint) == 0x000000, "Member 'BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag, K2Node_CustomEvent_POI_Name) == 0x000008, "Member 'BPS12MainRoomPOITag_C_ExecuteUbergraph_BPS12MainRoomPOITag::K2Node_CustomEvent_POI_Name' has a wrong offset!");

}

