#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingActorCBGASpawnComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BuildingActorCBGASpawnComponent.BuildingActorCBGASpawnComponent_C
// 0x00F0 (0x01A0 - 0x00B0)
class UBuildingActorCBGASpawnComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_GlobalEnabled;                                 // 0x00B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SubtypeEnabled;                                // 0x00D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_DropChance;                                    // 0x00F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   CBGA_SoftRef;                                      // 0x0118(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CBGA_ClassRef;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<float>                                 ThesholdAmounts;                                   // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                RelativeSpawnOffset;                               // 0x0158(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRotationMin;                                  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRotationMax;                                  // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnXYForwardOffset;                              // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldImpulse;                                     // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84BE[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeImpulse;                                // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseAmount;                                     // 0x0178(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollisionAfterImpulse;                             // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84BF[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeCollisionAfterImpulse;                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollisionOnSpawn;                                  // 0x018C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CBGAsBounceOffSpawner;                             // 0x018D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C0[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         OwningBuildingActor;                               // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          RollSpawnOnDeath;                                  // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C1[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBetweenSpawnAttempts;                         // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BuildingActorCBGASpawnComponent(int32 EntryPoint);
	void Died(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void DynamicallySpawn(bool UsesThresholdChecks);
	void Damaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void OnLoaded_A81F30C841A9FB0CB871A296A47EB549(class UClass* Loaded);
	void OnReady_AA2D046F4776EA6FF0EAB28E9459A5EF(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ThreshHoldCheck(bool* ValidDrop);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuildingActorCBGASpawnComponent_C">();
	}
	static class UBuildingActorCBGASpawnComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingActorCBGASpawnComponent_C>();
	}
};
static_assert(alignof(UBuildingActorCBGASpawnComponent_C) == 0x000008, "Wrong alignment on UBuildingActorCBGASpawnComponent_C");
static_assert(sizeof(UBuildingActorCBGASpawnComponent_C) == 0x0001A0, "Wrong size on UBuildingActorCBGASpawnComponent_C");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UBuildingActorCBGASpawnComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, Row_GlobalEnabled) == 0x0000B8, "Member 'UBuildingActorCBGASpawnComponent_C::Row_GlobalEnabled' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, Row_SubtypeEnabled) == 0x0000D8, "Member 'UBuildingActorCBGASpawnComponent_C::Row_SubtypeEnabled' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, Row_DropChance) == 0x0000F8, "Member 'UBuildingActorCBGASpawnComponent_C::Row_DropChance' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, CBGA_SoftRef) == 0x000118, "Member 'UBuildingActorCBGASpawnComponent_C::CBGA_SoftRef' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, CBGA_ClassRef) == 0x000140, "Member 'UBuildingActorCBGASpawnComponent_C::CBGA_ClassRef' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, ThesholdAmounts) == 0x000148, "Member 'UBuildingActorCBGASpawnComponent_C::ThesholdAmounts' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, RelativeSpawnOffset) == 0x000158, "Member 'UBuildingActorCBGASpawnComponent_C::RelativeSpawnOffset' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, SpawnRotationMin) == 0x000164, "Member 'UBuildingActorCBGASpawnComponent_C::SpawnRotationMin' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, SpawnRotationMax) == 0x000168, "Member 'UBuildingActorCBGASpawnComponent_C::SpawnRotationMax' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, SpawnXYForwardOffset) == 0x00016C, "Member 'UBuildingActorCBGASpawnComponent_C::SpawnXYForwardOffset' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, ShouldImpulse) == 0x000170, "Member 'UBuildingActorCBGASpawnComponent_C::ShouldImpulse' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, DelayBeforeImpulse) == 0x000174, "Member 'UBuildingActorCBGASpawnComponent_C::DelayBeforeImpulse' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, ImpulseAmount) == 0x000178, "Member 'UBuildingActorCBGASpawnComponent_C::ImpulseAmount' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, CollisionAfterImpulse) == 0x000184, "Member 'UBuildingActorCBGASpawnComponent_C::CollisionAfterImpulse' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, DelayBeforeCollisionAfterImpulse) == 0x000188, "Member 'UBuildingActorCBGASpawnComponent_C::DelayBeforeCollisionAfterImpulse' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, CollisionOnSpawn) == 0x00018C, "Member 'UBuildingActorCBGASpawnComponent_C::CollisionOnSpawn' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, CBGAsBounceOffSpawner) == 0x00018D, "Member 'UBuildingActorCBGASpawnComponent_C::CBGAsBounceOffSpawner' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, OwningBuildingActor) == 0x000190, "Member 'UBuildingActorCBGASpawnComponent_C::OwningBuildingActor' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, RollSpawnOnDeath) == 0x000198, "Member 'UBuildingActorCBGASpawnComponent_C::RollSpawnOnDeath' has a wrong offset!");
static_assert(offsetof(UBuildingActorCBGASpawnComponent_C, DelayBetweenSpawnAttempts) == 0x00019C, "Member 'UBuildingActorCBGASpawnComponent_C::DelayBetweenSpawnAttempts' has a wrong offset!");

}

