#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BundleItemMiniCardWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BundleItemMiniCardWidget.BundleItemMiniCardWidget_C.ExecuteUbergraph_BundleItemMiniCardWidget
// 0x0010 (0x0010 - 0x0000)
struct BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget) == 0x000008, "Wrong alignment on BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget");
static_assert(sizeof(BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget) == 0x000010, "Wrong size on BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget");
static_assert(offsetof(BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget, EntryPoint) == 0x000000, "Member 'BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BundleItemMiniCardWidget_C_ExecuteUbergraph_BundleItemMiniCardWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BundleItemMiniCardWidget.BundleItemMiniCardWidget_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct BundleItemMiniCardWidget_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BundleItemMiniCardWidget_C_GetListItemObject) == 0x000008, "Wrong alignment on BundleItemMiniCardWidget_C_GetListItemObject");
static_assert(sizeof(BundleItemMiniCardWidget_C_GetListItemObject) == 0x000008, "Wrong size on BundleItemMiniCardWidget_C_GetListItemObject");
static_assert(offsetof(BundleItemMiniCardWidget_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'BundleItemMiniCardWidget_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

