#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_PushToTalk

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Button_PushToTalk.Button_PushToTalk_C.ExecuteUbergraph_Button_PushToTalk
// 0x0070 (0x0070 - 0x0000)
struct Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_3;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774E[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_774F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_4;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     Temp_byte_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     CallFunc_GetPTTState_ReturnValue_2;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7750[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPTTState NewPushToTalkState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	EPTTState                                     Temp_byte_Variable_3;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPTTState                                     K2Node_Select_Default;                             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7751[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHUDState                          K2Node_Event_NewState;                             // 0x0068(0x0004)(ConstParm, NoDestructor)
};
static_assert(alignof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk) == 0x000008, "Wrong alignment on Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk");
static_assert(sizeof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk) == 0x000070, "Wrong size on Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, EntryPoint) == 0x000000, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::EntryPoint' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, Temp_byte_Variable) == 0x000004, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, Temp_byte_Variable_1) == 0x000005, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetContext_ReturnValue_2) == 0x000018, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetPTTState_ReturnValue) == 0x000020, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetPTTState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetContext_ReturnValue_3) == 0x000028, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetPTTState_ReturnValue_1) == 0x000030, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetPTTState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetContext_ReturnValue_4) == 0x000048, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, Temp_byte_Variable_2) == 0x000050, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, CallFunc_GetPTTState_ReturnValue_2) == 0x000051, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::CallFunc_GetPTTState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, Temp_byte_Variable_3) == 0x000064, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, K2Node_Select_Default) == 0x000065, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk, K2Node_Event_NewState) == 0x000068, "Member 'Button_PushToTalk_C_ExecuteUbergraph_Button_PushToTalk::K2Node_Event_NewState' has a wrong offset!");

// Function Button_PushToTalk.Button_PushToTalk_C.OnHUDStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct Button_PushToTalk_C_OnHUDStateUpdate final
{
public:
	struct FFortHUDState                          NewState;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Button_PushToTalk_C_OnHUDStateUpdate) == 0x000004, "Wrong alignment on Button_PushToTalk_C_OnHUDStateUpdate");
static_assert(sizeof(Button_PushToTalk_C_OnHUDStateUpdate) == 0x000004, "Wrong size on Button_PushToTalk_C_OnHUDStateUpdate");
static_assert(offsetof(Button_PushToTalk_C_OnHUDStateUpdate, NewState) == 0x000000, "Member 'Button_PushToTalk_C_OnHUDStateUpdate::NewState' has a wrong offset!");

// Function Button_PushToTalk.Button_PushToTalk_C.Update Visibility
// 0x0038 (0x0038 - 0x0000)
struct Button_PushToTalk_C_Update_Visibility final
{
public:
	EPTTState                                     PTT_State;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7752[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanPTT_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPTTState                                     Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7753[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Button_PushToTalk_C_Update_Visibility) == 0x000008, "Wrong alignment on Button_PushToTalk_C_Update_Visibility");
static_assert(sizeof(Button_PushToTalk_C_Update_Visibility) == 0x000038, "Wrong size on Button_PushToTalk_C_Update_Visibility");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, PTT_State) == 0x000000, "Member 'Button_PushToTalk_C_Update_Visibility::PTT_State' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, Temp_object_Variable) == 0x000008, "Member 'Button_PushToTalk_C_Update_Visibility::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, Temp_object_Variable_1) == 0x000010, "Member 'Button_PushToTalk_C_Update_Visibility::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, Temp_object_Variable_2) == 0x000018, "Member 'Button_PushToTalk_C_Update_Visibility::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_GetCanPTT_ReturnValue) == 0x000028, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_GetCanPTT_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_IsMobileGame_ReturnValue) == 0x000029, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_GetSubGame_ReturnValue) == 0x00002A, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, Temp_byte_Variable) == 0x00002D, "Member 'Button_PushToTalk_C_Update_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, CallFunc_BooleanAND_ReturnValue_1) == 0x00002E, "Member 'Button_PushToTalk_C_Update_Visibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_Update_Visibility, K2Node_Select_Default) == 0x000030, "Member 'Button_PushToTalk_C_Update_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function Button_PushToTalk.Button_PushToTalk_C.OnTouchStarted
// 0x0398 (0x0398 - 0x0000)
struct Button_PushToTalk_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	bool                                          CallFunc_HasMouseCapture_ReturnValue;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7754[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_CaptureMouse_ReturnValue;                 // 0x0220(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7755[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02E0(0x00B8)()
};
static_assert(alignof(Button_PushToTalk_C_OnTouchStarted) == 0x000008, "Wrong alignment on Button_PushToTalk_C_OnTouchStarted");
static_assert(sizeof(Button_PushToTalk_C_OnTouchStarted) == 0x000398, "Wrong size on Button_PushToTalk_C_OnTouchStarted");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, MyGeometry) == 0x000000, "Member 'Button_PushToTalk_C_OnTouchStarted::MyGeometry' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, InTouchEvent) == 0x000038, "Member 'Button_PushToTalk_C_OnTouchStarted::InTouchEvent' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, ReturnValue) == 0x0000A8, "Member 'Button_PushToTalk_C_OnTouchStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'Button_PushToTalk_C_OnTouchStarted::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, CallFunc_HasMouseCapture_ReturnValue) == 0x000218, "Member 'Button_PushToTalk_C_OnTouchStarted::CallFunc_HasMouseCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, CallFunc_CaptureMouse_ReturnValue) == 0x000220, "Member 'Button_PushToTalk_C_OnTouchStarted::CallFunc_CaptureMouse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, CallFunc_Not_PreBool_ReturnValue) == 0x0002D8, "Member 'Button_PushToTalk_C_OnTouchStarted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchStarted, CallFunc_Unhandled_ReturnValue) == 0x0002E0, "Member 'Button_PushToTalk_C_OnTouchStarted::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function Button_PushToTalk.Button_PushToTalk_C.OnTouchEnded
// 0x0390 (0x0390 - 0x0000)
struct Button_PushToTalk_C_OnTouchEnded final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	bool                                          CallFunc_HasMouseCapture_ReturnValue;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7756[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
	struct FEventReply                            CallFunc_ReleaseMouseCapture_ReturnValue;          // 0x02D8(0x00B8)()
};
static_assert(alignof(Button_PushToTalk_C_OnTouchEnded) == 0x000008, "Wrong alignment on Button_PushToTalk_C_OnTouchEnded");
static_assert(sizeof(Button_PushToTalk_C_OnTouchEnded) == 0x000390, "Wrong size on Button_PushToTalk_C_OnTouchEnded");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, MyGeometry) == 0x000000, "Member 'Button_PushToTalk_C_OnTouchEnded::MyGeometry' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, InTouchEvent) == 0x000038, "Member 'Button_PushToTalk_C_OnTouchEnded::InTouchEvent' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, ReturnValue) == 0x0000A8, "Member 'Button_PushToTalk_C_OnTouchEnded::ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'Button_PushToTalk_C_OnTouchEnded::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, CallFunc_HasMouseCapture_ReturnValue) == 0x000218, "Member 'Button_PushToTalk_C_OnTouchEnded::CallFunc_HasMouseCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, CallFunc_Handled_ReturnValue) == 0x000220, "Member 'Button_PushToTalk_C_OnTouchEnded::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Button_PushToTalk_C_OnTouchEnded, CallFunc_ReleaseMouseCapture_ReturnValue) == 0x0002D8, "Member 'Button_PushToTalk_C_OnTouchEnded::CallFunc_ReleaseMouseCapture_ReturnValue' has a wrong offset!");

}

