#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonReplay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ButtonReplay.ButtonReplay_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct ButtonReplay_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ButtonReplay_C_SetText) == 0x000008, "Wrong alignment on ButtonReplay_C_SetText");
static_assert(sizeof(ButtonReplay_C_SetText) == 0x000018, "Wrong size on ButtonReplay_C_SetText");
static_assert(offsetof(ButtonReplay_C_SetText, Text) == 0x000000, "Member 'ButtonReplay_C_SetText::Text' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.ExecuteUbergraph_ButtonReplay
// 0x0118 (0x0118 - 0x0000)
struct ButtonReplay_C_ExecuteUbergraph_ButtonReplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F13[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F14[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F15[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0030(0x00A0)(ConstParm)
	bool                                          K2Node_ComponentBoundEvent_bUsingGamepad;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F16[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Event_NewTriggeredAction;                   // 0x00D8(0x0010)(ConstParm, NoDestructor)
	float                                         K2Node_Event_HeldPercent;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SlateBrush_ReturnValue;        // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F17[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x00F8(0x0018)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay) == 0x000008, "Wrong alignment on ButtonReplay_C_ExecuteUbergraph_ButtonReplay");
static_assert(sizeof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay) == 0x000118, "Wrong size on ButtonReplay_C_ExecuteUbergraph_ButtonReplay");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, EntryPoint) == 0x000000, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_bool_Variable) == 0x000004, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_bool_Variable_1) == 0x000005, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable) == 0x000006, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable_1) == 0x000007, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Event_IsDesignTime) == 0x000008, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_HasAnyChildren_ReturnValue) == 0x000018, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_GetCurrentInputType_ReturnValue) == 0x000019, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_GetContext_ReturnValue_1) == 0x000020, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000028, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable_2) == 0x000029, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Event_TabLabelInfo) == 0x000030, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_ComponentBoundEvent_bUsingGamepad) == 0x0000D0, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_ComponentBoundEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Event_NewTriggeredAction) == 0x0000D8, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Event_NewTriggeredAction' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Event_HeldPercent) == 0x0000E8, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Event_HeldPercent' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable_3) == 0x0000EC, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_EqualEqual_SlateBrush_ReturnValue) == 0x0000ED, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_EqualEqual_SlateBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_bool_Variable_2) == 0x0000EE, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Select_Default) == 0x0000EF, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable_4) == 0x0000F0, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, Temp_byte_Variable_5) == 0x0000F1, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Event_Text) == 0x0000F8, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Select_Default_1) == 0x000110, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, CallFunc_TextIsEmpty_ReturnValue) == 0x000111, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_ExecuteUbergraph_ButtonReplay, K2Node_Select_Default_2) == 0x000112, "Member 'ButtonReplay_C_ExecuteUbergraph_ButtonReplay::K2Node_Select_Default_2' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct ButtonReplay_C_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButtonReplay_C_OnActionProgress) == 0x000004, "Wrong alignment on ButtonReplay_C_OnActionProgress");
static_assert(sizeof(ButtonReplay_C_OnActionProgress) == 0x000004, "Wrong size on ButtonReplay_C_OnActionProgress");
static_assert(offsetof(ButtonReplay_C_OnActionProgress, HeldPercent) == 0x000000, "Member 'ButtonReplay_C_OnActionProgress::HeldPercent' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.OnTriggeredInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct ButtonReplay_C_OnTriggeredInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_OnTriggeredInputActionChanged) == 0x000008, "Wrong alignment on ButtonReplay_C_OnTriggeredInputActionChanged");
static_assert(sizeof(ButtonReplay_C_OnTriggeredInputActionChanged) == 0x000010, "Wrong size on ButtonReplay_C_OnTriggeredInputActionChanged");
static_assert(offsetof(ButtonReplay_C_OnTriggeredInputActionChanged, NewTriggeredAction) == 0x000000, "Member 'ButtonReplay_C_OnTriggeredInputActionChanged::NewTriggeredAction' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong alignment on ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature");
static_assert(sizeof(ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature) == 0x000001, "Wrong size on ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature");
static_assert(offsetof(ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature, bUsingGamepad) == 0x000000, "Member 'ButtonReplay_C_BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature::bUsingGamepad' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.SetTabLabelInfo
// 0x00A0 (0x00A0 - 0x0000)
struct ButtonReplay_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ButtonReplay_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on ButtonReplay_C_SetTabLabelInfo");
static_assert(sizeof(ButtonReplay_C_SetTabLabelInfo) == 0x0000A0, "Wrong size on ButtonReplay_C_SetTabLabelInfo");
static_assert(offsetof(ButtonReplay_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'ButtonReplay_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ButtonReplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_PreConstruct) == 0x000001, "Wrong alignment on ButtonReplay_C_PreConstruct");
static_assert(sizeof(ButtonReplay_C_PreConstruct) == 0x000001, "Wrong size on ButtonReplay_C_PreConstruct");
static_assert(offsetof(ButtonReplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ButtonReplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.Set Icon
// 0x0088 (0x0088 - 0x0000)
struct ButtonReplay_C_Set_Icon final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ButtonReplay_C_Set_Icon) == 0x000008, "Wrong alignment on ButtonReplay_C_Set_Icon");
static_assert(sizeof(ButtonReplay_C_Set_Icon) == 0x000088, "Wrong size on ButtonReplay_C_Set_Icon");
static_assert(offsetof(ButtonReplay_C_Set_Icon, Param_IconBrush) == 0x000000, "Member 'ButtonReplay_C_Set_Icon::Param_IconBrush' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.InitializeButton
// 0x0010 (0x0010 - 0x0000)
struct ButtonReplay_C_InitializeButton final
{
public:
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_InitializeButton) == 0x000008, "Wrong alignment on ButtonReplay_C_InitializeButton");
static_assert(sizeof(ButtonReplay_C_InitializeButton) == 0x000010, "Wrong size on ButtonReplay_C_InitializeButton");
static_assert(offsetof(ButtonReplay_C_InitializeButton, CallFunc_GetBrushResource_ReturnValue) == 0x000000, "Member 'ButtonReplay_C_InitializeButton::CallFunc_GetBrushResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_InitializeButton, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ButtonReplay_C_InitializeButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.UpdateTextAndStyle
// 0x0001 (0x0001 - 0x0000)
struct ButtonReplay_C_UpdateTextAndStyle final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_UpdateTextAndStyle) == 0x000001, "Wrong alignment on ButtonReplay_C_UpdateTextAndStyle");
static_assert(sizeof(ButtonReplay_C_UpdateTextAndStyle) == 0x000001, "Wrong size on ButtonReplay_C_UpdateTextAndStyle");
static_assert(offsetof(ButtonReplay_C_UpdateTextAndStyle, bUsingGamepad) == 0x000000, "Member 'ButtonReplay_C_UpdateTextAndStyle::bUsingGamepad' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.SetControllerStyle
// 0x0018 (0x0018 - 0x0000)
struct ButtonReplay_C_SetControllerStyle final
{
public:
	class UClass*                                 Param_ControllerInputStyle;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_SetControllerStyle) == 0x000008, "Wrong alignment on ButtonReplay_C_SetControllerStyle");
static_assert(sizeof(ButtonReplay_C_SetControllerStyle) == 0x000018, "Wrong size on ButtonReplay_C_SetControllerStyle");
static_assert(offsetof(ButtonReplay_C_SetControllerStyle, Param_ControllerInputStyle) == 0x000000, "Member 'ButtonReplay_C_SetControllerStyle::Param_ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetControllerStyle, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ButtonReplay_C_SetControllerStyle::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetControllerStyle, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'ButtonReplay_C_SetControllerStyle::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetControllerStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'ButtonReplay_C_SetControllerStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.UpdateText
// 0x0040 (0x0040 - 0x0000)
struct ButtonReplay_C_UpdateText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F18[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F19[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0018)()
};
static_assert(alignof(ButtonReplay_C_UpdateText) == 0x000008, "Wrong alignment on ButtonReplay_C_UpdateText");
static_assert(sizeof(ButtonReplay_C_UpdateText) == 0x000040, "Wrong size on ButtonReplay_C_UpdateText");
static_assert(offsetof(ButtonReplay_C_UpdateText, Temp_bool_Variable) == 0x000000, "Member 'ButtonReplay_C_UpdateText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateText, CallFunc_GetDisplayText_ReturnValue) == 0x000008, "Member 'ButtonReplay_C_UpdateText::CallFunc_GetDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateText, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'ButtonReplay_C_UpdateText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateText, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'ButtonReplay_C_UpdateText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateText, K2Node_Select_Default) == 0x000028, "Member 'ButtonReplay_C_UpdateText::K2Node_Select_Default' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.UpdateStyle
// 0x0001 (0x0001 - 0x0000)
struct ButtonReplay_C_UpdateStyle final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_UpdateStyle) == 0x000001, "Wrong alignment on ButtonReplay_C_UpdateStyle");
static_assert(sizeof(ButtonReplay_C_UpdateStyle) == 0x000001, "Wrong size on ButtonReplay_C_UpdateStyle");
static_assert(offsetof(ButtonReplay_C_UpdateStyle, UsingGamepad) == 0x000000, "Member 'ButtonReplay_C_UpdateStyle::UsingGamepad' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.SetMouseKeyboardStyle
// 0x0018 (0x0018 - 0x0000)
struct ButtonReplay_C_SetMouseKeyboardStyle final
{
public:
	class UClass*                                 Param_ControllerInputStyle;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_SetMouseKeyboardStyle) == 0x000008, "Wrong alignment on ButtonReplay_C_SetMouseKeyboardStyle");
static_assert(sizeof(ButtonReplay_C_SetMouseKeyboardStyle) == 0x000018, "Wrong size on ButtonReplay_C_SetMouseKeyboardStyle");
static_assert(offsetof(ButtonReplay_C_SetMouseKeyboardStyle, Param_ControllerInputStyle) == 0x000000, "Member 'ButtonReplay_C_SetMouseKeyboardStyle::Param_ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetMouseKeyboardStyle, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ButtonReplay_C_SetMouseKeyboardStyle::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetMouseKeyboardStyle, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'ButtonReplay_C_SetMouseKeyboardStyle::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_SetMouseKeyboardStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'ButtonReplay_C_SetMouseKeyboardStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.UpdateContentAlignment
// 0x0018 (0x0018 - 0x0000)
struct ButtonReplay_C_UpdateContentAlignment final
{
public:
	class UPanelSlot*                             CallFunc_GetContentSlot_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonReplay_C_UpdateContentAlignment) == 0x000008, "Wrong alignment on ButtonReplay_C_UpdateContentAlignment");
static_assert(sizeof(ButtonReplay_C_UpdateContentAlignment) == 0x000018, "Wrong size on ButtonReplay_C_UpdateContentAlignment");
static_assert(offsetof(ButtonReplay_C_UpdateContentAlignment, CallFunc_GetContentSlot_ReturnValue) == 0x000000, "Member 'ButtonReplay_C_UpdateContentAlignment::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateContentAlignment, K2Node_DynamicCast_AsBorder_Slot) == 0x000008, "Member 'ButtonReplay_C_UpdateContentAlignment::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(ButtonReplay_C_UpdateContentAlignment, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ButtonReplay_C_UpdateContentAlignment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.SetContentAlignment
// 0x0001 (0x0001 - 0x0000)
struct ButtonReplay_C_SetContentAlignment final
{
public:
	EHorizontalAlignment                          Param_ContentAlignment;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButtonReplay_C_SetContentAlignment) == 0x000001, "Wrong alignment on ButtonReplay_C_SetContentAlignment");
static_assert(sizeof(ButtonReplay_C_SetContentAlignment) == 0x000001, "Wrong size on ButtonReplay_C_SetContentAlignment");
static_assert(offsetof(ButtonReplay_C_SetContentAlignment, Param_ContentAlignment) == 0x000000, "Member 'ButtonReplay_C_SetContentAlignment::Param_ContentAlignment' has a wrong offset!");

// Function ButtonReplay.ButtonReplay_C.UpdateTextStyle
// 0x0008 (0x0008 - 0x0000)
struct ButtonReplay_C_UpdateTextStyle final
{
public:
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButtonReplay_C_UpdateTextStyle) == 0x000008, "Wrong alignment on ButtonReplay_C_UpdateTextStyle");
static_assert(sizeof(ButtonReplay_C_UpdateTextStyle) == 0x000008, "Wrong size on ButtonReplay_C_UpdateTextStyle");
static_assert(offsetof(ButtonReplay_C_UpdateTextStyle, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000000, "Member 'ButtonReplay_C_UpdateTextStyle::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");

}

