#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CandlegGlow

#include "Basic.hpp"

#include "Parent_BuildingPropActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CandlegGlow.CandlegGlow_C
// 0x0028 (0x0CC8 - 0x0CA0)
class ACandlegGlow_C final : public AParent_BuildingPropActor_C
{
public:
	class UPointLightComponent*                   FillLight_HighOnly_;                               // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FlameShape;                                     // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CandlegGlow_C">();
	}
	static class ACandlegGlow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACandlegGlow_C>();
	}
};
static_assert(alignof(ACandlegGlow_C) == 0x000008, "Wrong alignment on ACandlegGlow_C");
static_assert(sizeof(ACandlegGlow_C) == 0x000CC8, "Wrong size on ACandlegGlow_C");
static_assert(offsetof(ACandlegGlow_C, FillLight_HighOnly_) == 0x000CA0, "Member 'ACandlegGlow_C::FillLight_HighOnly_' has a wrong offset!");
static_assert(offsetof(ACandlegGlow_C, StaticMesh2) == 0x000CA8, "Member 'ACandlegGlow_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ACandlegGlow_C, StaticMesh1) == 0x000CB0, "Member 'ACandlegGlow_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ACandlegGlow_C, SM_FlameShape) == 0x000CB8, "Member 'ACandlegGlow_C::SM_FlameShape' has a wrong offset!");
static_assert(offsetof(ACandlegGlow_C, PointLight) == 0x000CC0, "Member 'ACandlegGlow_C::PointLight' has a wrong offset!");

}

