#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Car_FoodTruck_Burger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Car_FoodTruck_Burger.Car_FoodTruck_Burger_C.ExecuteUbergraph_Car_FoodTruck_Burger
// 0x0030 (0x0030 - 0x0000)
struct Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8774[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewVisibility;                       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8775[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger) == 0x000004, "Wrong alignment on Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger");
static_assert(sizeof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger) == 0x000030, "Wrong size on Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, EntryPoint) == 0x000000, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, Temp_bool_Variable) == 0x000004, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000008, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, Temp_bool_Variable_1) == 0x000014, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, K2Node_Event_bNewVisibility) == 0x000016, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::K2Node_Event_bNewVisibility' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x000018, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger, K2Node_Select_Default) == 0x000024, "Member 'Car_FoodTruck_Burger_C_ExecuteUbergraph_Car_FoodTruck_Burger::K2Node_Select_Default' has a wrong offset!");

// Function Car_FoodTruck_Burger.Car_FoodTruck_Burger_C.toggle light visibility
// 0x0001 (0x0001 - 0x0000)
struct Car_FoodTruck_Burger_C_Toggle_light_visibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Car_FoodTruck_Burger_C_Toggle_light_visibility) == 0x000001, "Wrong alignment on Car_FoodTruck_Burger_C_Toggle_light_visibility");
static_assert(sizeof(Car_FoodTruck_Burger_C_Toggle_light_visibility) == 0x000001, "Wrong size on Car_FoodTruck_Burger_C_Toggle_light_visibility");
static_assert(offsetof(Car_FoodTruck_Burger_C_Toggle_light_visibility, bNewVisibility) == 0x000000, "Member 'Car_FoodTruck_Burger_C_Toggle_light_visibility::bNewVisibility' has a wrong offset!");

}

