#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Spawner_Bud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CBGA_Parent_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBGA_Spawner_Bud.CBGA_Spawner_Bud_C
// 0x0030 (0x0980 - 0x0950)
class ACBGA_Spawner_Bud_C final : public ACBGA_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CBGA_Spawner_Bud_C;                 // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SKM_Bud;                                           // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FortAIPawn;                                        // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ManagerSpawned;                                    // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CBGA_Spawner_Bud(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnReady_D1E854534B1E8189ED7EB88B2DCF17A5(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void SpawnAI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CBGA_Spawner_Bud_C">();
	}
	static class ACBGA_Spawner_Bud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_Spawner_Bud_C>();
	}
};
static_assert(alignof(ACBGA_Spawner_Bud_C) == 0x000010, "Wrong alignment on ACBGA_Spawner_Bud_C");
static_assert(sizeof(ACBGA_Spawner_Bud_C) == 0x000980, "Wrong size on ACBGA_Spawner_Bud_C");
static_assert(offsetof(ACBGA_Spawner_Bud_C, UberGraphFrame_CBGA_Spawner_Bud_C) == 0x000950, "Member 'ACBGA_Spawner_Bud_C::UberGraphFrame_CBGA_Spawner_Bud_C' has a wrong offset!");
static_assert(offsetof(ACBGA_Spawner_Bud_C, SKM_Bud) == 0x000958, "Member 'ACBGA_Spawner_Bud_C::SKM_Bud' has a wrong offset!");
static_assert(offsetof(ACBGA_Spawner_Bud_C, FortAIPawn) == 0x000960, "Member 'ACBGA_Spawner_Bud_C::FortAIPawn' has a wrong offset!");
static_assert(offsetof(ACBGA_Spawner_Bud_C, BehaviorTree) == 0x000968, "Member 'ACBGA_Spawner_Bud_C::BehaviorTree' has a wrong offset!");
static_assert(offsetof(ACBGA_Spawner_Bud_C, ManagerSpawned) == 0x000970, "Member 'ACBGA_Spawner_Bud_C::ManagerSpawned' has a wrong offset!");

}

