#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CBGA_Parent.CBGA_Parent_C.ExecuteUbergraph_CBGA_Parent
// 0x03A0 (0x03A0 - 0x0000)
struct CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_InteractingPawn_1;                    // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted_1;          // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5452[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5453[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5454[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemEntry>                 CallFunc_PickLootDrops_OutLootToDrop;              // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_PickLootDrops_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5455[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0060(0x0020)()
	struct FFortItemEntry                         CallFunc_Array_Get_Item;                           // 0x0080(0x0160)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5456[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5457[0x6];                                     // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5458[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0210(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5459[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545A[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545B[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02C0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545C[0x1];                                     // 0x02F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545D[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0308(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0310(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545E[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0320(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0328(0x0020)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545F[0x6];                                     // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0370(0x0020)()
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5460[0x2];                                     // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5461[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent) == 0x000010, "Wrong alignment on CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent");
static_assert(sizeof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent) == 0x0003A0, "Wrong size on CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, EntryPoint) == 0x000000, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_Event_InteractingPawn_1) == 0x000008, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_Event_InteractingPawn_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_Event_InteractionBeingAttempted_1) == 0x000010, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_Event_InteractionBeingAttempted_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000018, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000028, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_RowToBool_ReturnValue) == 0x000030, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, Temp_object_Variable) == 0x000038, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, Temp_object_Variable_1) == 0x000040, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_PickLootDrops_OutLootToDrop) == 0x000048, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_PickLootDrops_OutLootToDrop' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_PickLootDrops_ReturnValue) == 0x000058, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_PickLootDrops_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, Temp_struct_Variable) == 0x000060, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Array_Get_Item) == 0x000080, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_DynamicCast_AsFort_World_Item_Definition) == 0x0001E8, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_DynamicCast_AsFort_World_Item_Definition' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001F1, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x0001F8, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000208, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetTransform_ReturnValue) == 0x000210, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_IsValidClass_ReturnValue) == 0x000240, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Location) == 0x000244, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Rotation) == 0x000250, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Scale) == 0x00025C, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Location_1) == 0x000268, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Rotation_1) == 0x000274, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BreakTransform_Scale_1) == 0x000280, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x00028C, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000298, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_ComposeRotators_ReturnValue) == 0x00029C, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0002A8, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002AC, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_MakeTransform_ReturnValue) == 0x0002C0, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002F0, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_IsServer_ReturnValue) == 0x0002F4, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x0002F5, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BooleanAND_ReturnValue_2) == 0x0002F6, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x0002F8, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000300, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_RowToBool_ReturnValue_1) == 0x000304, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_RowToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_Event_InteractingPawn) == 0x000308, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000310, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_CustomEvent_GameState) == 0x000318, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_CustomEvent_Playlist) == 0x000320, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000328, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000348, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_BooleanAND_ReturnValue_3) == 0x000349, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000350, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x000358, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000360, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000370, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000390, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000391, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, Temp_int_Loop_Counter_Variable) == 0x000394, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x000398, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x00039C, "Member 'CBGA_Parent_C_ExecuteUbergraph_CBGA_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.OnGatherOrInteract
// 0x0010 (0x0010 - 0x0000)
struct CBGA_Parent_C_OnGatherOrInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_C_OnGatherOrInteract) == 0x000008, "Wrong alignment on CBGA_Parent_C_OnGatherOrInteract");
static_assert(sizeof(CBGA_Parent_C_OnGatherOrInteract) == 0x000010, "Wrong size on CBGA_Parent_C_OnGatherOrInteract");
static_assert(offsetof(CBGA_Parent_C_OnGatherOrInteract, InteractingPawn) == 0x000000, "Member 'CBGA_Parent_C_OnGatherOrInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_OnGatherOrInteract, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_Parent_C_OnGatherOrInteract::InteractionBeingAttempted' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct CBGA_Parent_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on CBGA_Parent_C_BlueprintOnInteract");
static_assert(sizeof(CBGA_Parent_C_BlueprintOnInteract) == 0x000010, "Wrong size on CBGA_Parent_C_BlueprintOnInteract");
static_assert(offsetof(CBGA_Parent_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'CBGA_Parent_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_Parent_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.OnReady_20953428413833809C18FBAEA984C70A
// 0x0030 (0x0030 - 0x0000)
struct CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A) == 0x000008, "Wrong alignment on CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A");
static_assert(sizeof(CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A) == 0x000030, "Wrong size on CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A");
static_assert(offsetof(CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A, GameState) == 0x000000, "Member 'CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A::GameState' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A, Playlist) == 0x000008, "Member 'CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A::Playlist' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A, PlaylistContextTags) == 0x000010, "Member 'CBGA_Parent_C_OnReady_20953428413833809C18FBAEA984C70A::PlaylistContextTags' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.SetDrawDistance
// 0x0068 (0x0068 - 0x0000)
struct CBGA_Parent_C_SetDrawDistance final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5462[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5463[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5464[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5465[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5466[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_C_SetDrawDistance) == 0x000008, "Wrong alignment on CBGA_Parent_C_SetDrawDistance");
static_assert(sizeof(CBGA_Parent_C_SetDrawDistance) == 0x000068, "Wrong size on CBGA_Parent_C_SetDrawDistance");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CBGA_Parent_C_SetDrawDistance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CBGA_Parent_C_SetDrawDistance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, Temp_bool_Variable) == 0x00000C, "Member 'CBGA_Parent_C_SetDrawDistance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_GetNumericCVar_OutValue) == 0x000020, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_GetNumericCVar_ReturnValue) == 0x000024, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Array_Get_Item) == 0x000028, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000050, "Member 'CBGA_Parent_C_SetDrawDistance::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CBGA_Parent_C_SetDrawDistance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, K2Node_Select_Default) == 0x00005C, "Member 'CBGA_Parent_C_SetDrawDistance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_SetDrawDistance, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'CBGA_Parent_C_SetDrawDistance::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.BlueprintGetInteractionString
// 0x0060 (0x0060 - 0x0000)
struct CBGA_Parent_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5467[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5468[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
};
static_assert(alignof(CBGA_Parent_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on CBGA_Parent_C_BlueprintGetInteractionString");
static_assert(sizeof(CBGA_Parent_C_BlueprintGetInteractionString) == 0x000060, "Wrong size on CBGA_Parent_C_BlueprintGetInteractionString");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, ReturnValue) == 0x000010, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, Temp_byte_Variable) == 0x000028, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, Temp_text_Variable) == 0x000030, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionString, K2Node_Select_Default) == 0x000048, "Member 'CBGA_Parent_C_BlueprintGetInteractionString::K2Node_Select_Default' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.BlueprintCanInteract
// 0x0010 (0x0010 - 0x0000)
struct CBGA_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on CBGA_Parent_C_BlueprintCanInteract");
static_assert(sizeof(CBGA_Parent_C_BlueprintCanInteract) == 0x000010, "Wrong size on CBGA_Parent_C_BlueprintCanInteract");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'CBGA_Parent_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'CBGA_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'CBGA_Parent_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, Temp_byte_Variable) == 0x00000B, "Member 'CBGA_Parent_C_BlueprintCanInteract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, Temp_bool_Variable) == 0x00000C, "Member 'CBGA_Parent_C_BlueprintCanInteract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, CallFunc_RowToBool_ReturnValue) == 0x00000D, "Member 'CBGA_Parent_C_BlueprintCanInteract::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'CBGA_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintCanInteract, K2Node_Select_Default) == 0x00000F, "Member 'CBGA_Parent_C_BlueprintCanInteract::K2Node_Select_Default' has a wrong offset!");

// Function CBGA_Parent.CBGA_Parent_C.BlueprintGetInteractionTime
// 0x0020 (0x0020 - 0x0000)
struct CBGA_Parent_C_BlueprintGetInteractionTime final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInteractionTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EInteractionBeingAttempted                    Temp_byte_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5469[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Parent_C_BlueprintGetInteractionTime) == 0x000008, "Wrong alignment on CBGA_Parent_C_BlueprintGetInteractionTime");
static_assert(sizeof(CBGA_Parent_C_BlueprintGetInteractionTime) == 0x000020, "Wrong size on CBGA_Parent_C_BlueprintGetInteractionTime");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionTime, InteractingPawn) == 0x000000, "Member 'CBGA_Parent_C_BlueprintGetInteractionTime::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionTime, OutInteractionTime) == 0x000008, "Member 'CBGA_Parent_C_BlueprintGetInteractionTime::OutInteractionTime' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_C_BlueprintGetInteractionTime, InteractionBeingAttempted) == 0x00000C, "Member 'CBGA_Parent_C_BlueprintGetInteractionTime::InteractionBeingAttempted' has a wrong offset!");
