#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_HealthSmall

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CBGA_HealthSmall.CBGA_HealthSmall_C.OnInteractAllowedToConsume
// 0x0020 (0x0020 - 0x0000)
struct CBGA_HealthSmall_C_OnInteractAllowedToConsume final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BlueprintCanInteract_ReturnValue;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_HealthSmall_C_OnInteractAllowedToConsume) == 0x000008, "Wrong alignment on CBGA_HealthSmall_C_OnInteractAllowedToConsume");
static_assert(sizeof(CBGA_HealthSmall_C_OnInteractAllowedToConsume) == 0x000020, "Wrong size on CBGA_HealthSmall_C_OnInteractAllowedToConsume");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, InteractingPawn) == 0x000000, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, ReturnValue) == 0x000009, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_BlueprintCanInteract_ReturnValue) == 0x00000B, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_BlueprintCanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_GetMaxHealth_ReturnValue) == 0x00000C, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_GetHealth_ReturnValue) == 0x000010, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_Not_PreBool_ReturnValue) == 0x000016, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_OnInteractAllowedToConsume, CallFunc_RowToBool_ReturnValue) == 0x000018, "Member 'CBGA_HealthSmall_C_OnInteractAllowedToConsume::CallFunc_RowToBool_ReturnValue' has a wrong offset!");

// Function CBGA_HealthSmall.CBGA_HealthSmall_C.BlueprintCanInteract
// 0x0010 (0x0010 - 0x0000)
struct CBGA_HealthSmall_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_HealthSmall_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on CBGA_HealthSmall_C_BlueprintCanInteract");
static_assert(sizeof(CBGA_HealthSmall_C_BlueprintCanInteract) == 0x000010, "Wrong size on CBGA_HealthSmall_C_BlueprintCanInteract");
static_assert(offsetof(CBGA_HealthSmall_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'CBGA_HealthSmall_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'CBGA_HealthSmall_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'CBGA_HealthSmall_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(CBGA_HealthSmall_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'CBGA_HealthSmall_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");

}

