#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Parent_Physics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.ExecuteUbergraph_CBGA_Parent_Physics
// 0x0500 (0x0500 - 0x0000)
struct CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84A7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84A8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84A9[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AA[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AB[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AC[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal_1;                          // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x00B8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AD[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AE[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue_1;        // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84AF[0x2];                                     // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_SimulatingComponent;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsAwake;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B0[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue_2;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B1[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DelayBeforeImpulse;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayBeforeCollision;           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpulseOrigin;                  // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpulseAmount;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetCollisionAfterImpulse;       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B2[0x2];                                     // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01DC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B3[0x2];                                     // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84B4[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B5[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x033C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B6[0x2];                                     // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84B7[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_CustomEvent_ImpactResult;                   // 0x044C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& ImpactResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x04D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue_3;        // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B8[0x3];                                     // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x04EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics");
static_assert(sizeof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics) == 0x000500, "Wrong size on CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, EntryPoint) == 0x000000, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::EntryPoint' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_Location) == 0x000018, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_Rotation) == 0x000024, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00003C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000048, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000058, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_3) == 0x000061, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000068, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_4) == 0x000070, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_5) == 0x000071, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_6) == 0x000072, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue) == 0x000073, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue_1) == 0x000074, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_MyComp) == 0x000078, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_Other) == 0x000080, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_OtherComp) == 0x000088, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_bSelfMoved) == 0x000090, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_HitLocation) == 0x000094, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_HitNormal_1) == 0x0000A0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_HitNormal_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_NormalImpulse) == 0x0000AC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_Hit_1) == 0x0000B8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue_2) == 0x000144, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000148, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_7) == 0x000154, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_VSize_ReturnValue) == 0x000158, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_PerformLinkingCheck_ReturnValue) == 0x00015C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_PerformLinkingCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_PerformLinkingCheck_ReturnValue_1) == 0x00015D, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_PerformLinkingCheck_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_SimulatingComponent) == 0x000160, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_SimulatingComponent' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_bIsAwake) == 0x000168, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_bIsAwake' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x00016C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_PerformLinkingCheck_ReturnValue_2) == 0x000178, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_PerformLinkingCheck_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_DelayBeforeImpulse) == 0x00017C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_DelayBeforeImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_DelayBeforeCollision) == 0x000180, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_DelayBeforeCollision' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_ImpulseOrigin) == 0x000184, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_ImpulseOrigin' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_ImpulseAmount) == 0x000190, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_ImpulseAmount' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_SetCollisionAfterImpulse) == 0x00019C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_SetCollisionAfterImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_8) == 0x00019D, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Normal_ReturnValue) == 0x0001AC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001B8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C4, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_HitNormal) == 0x0001D0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_Event_Hit) == 0x0001DC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_bBlockingHit) == 0x000268, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_bInitialOverlap) == 0x000269, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Time) == 0x00026C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Distance) == 0x000270, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Location) == 0x000274, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_ImpactPoint) == 0x000280, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Normal) == 0x00028C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_ImpactNormal) == 0x000298, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_PhysMat) == 0x0002A8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitActor) == 0x0002B0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitComponent) == 0x0002B8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitBoneName) == 0x0002C0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitItem) == 0x0002C8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_FaceIndex) == 0x0002CC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_TraceStart) == 0x0002D0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_TraceEnd) == 0x0002DC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakVector_X) == 0x0002E8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakVector_Y) == 0x0002EC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakVector_Z) == 0x0002F0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_ComponentHasTag_ReturnValue) == 0x0002F4, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002F5, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002F8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_DynamicCast_bSuccess) == 0x000300, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_ActorHasTag_ReturnValue) == 0x000301, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BooleanOR_ReturnValue) == 0x000302, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BooleanOR_ReturnValue_1) == 0x000303, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_VSize_ReturnValue_1) == 0x000304, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000308, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00030C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_MakeVector_ReturnValue) == 0x000318, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000324, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Add_VectorVector_ReturnValue) == 0x000330, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_Hit) == 0x00033C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0003C8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0003C9, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Time_1) == 0x0003CC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Distance_1) == 0x0003D0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Location_1) == 0x0003D4, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003E0, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_Normal_1) == 0x0003EC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003F8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_PhysMat_1) == 0x000408, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitActor_1) == 0x000410, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitComponent_1) == 0x000418, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitBoneName_1) == 0x000420, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_HitItem_1) == 0x000428, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_FaceIndex_1) == 0x00042C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_TraceStart_1) == 0x000430, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_BreakHitResult_TraceEnd_1) == 0x00043C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_9) == 0x000448, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000449, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_10) == 0x00044A, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsServer_ReturnValue_3) == 0x00044B, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CustomEvent_ImpactResult) == 0x00044C, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CustomEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CreateDelegate_OutputDelegate) == 0x0004D8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_PerformLinkingCheck_ReturnValue_3) == 0x0004E8, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_PerformLinkingCheck_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004EC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics, CallFunc_IsValid_ReturnValue_11) == 0x0004FC, "Member 'CBGA_Parent_Physics_C_ExecuteUbergraph_CBGA_Parent_Physics::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.OnProjStop
// 0x008C (0x008C - 0x0000)
struct CBGA_Parent_Physics_C_OnProjStop final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CBGA_Parent_Physics_C_OnProjStop) == 0x000004, "Wrong alignment on CBGA_Parent_Physics_C_OnProjStop");
static_assert(sizeof(CBGA_Parent_Physics_C_OnProjStop) == 0x00008C, "Wrong size on CBGA_Parent_Physics_C_OnProjStop");
static_assert(offsetof(CBGA_Parent_Physics_C_OnProjStop, ImpactResult) == 0x000000, "Member 'CBGA_Parent_Physics_C_OnProjStop::ImpactResult' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.HandleProjHit
// 0x0098 (0x0098 - 0x0000)
struct CBGA_Parent_Physics_C_HandleProjHit final
{
public:
	struct FVector                                HitNormal;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CBGA_Parent_Physics_C_HandleProjHit) == 0x000004, "Wrong alignment on CBGA_Parent_Physics_C_HandleProjHit");
static_assert(sizeof(CBGA_Parent_Physics_C_HandleProjHit) == 0x000098, "Wrong size on CBGA_Parent_Physics_C_HandleProjHit");
static_assert(offsetof(CBGA_Parent_Physics_C_HandleProjHit, HitNormal) == 0x000000, "Member 'CBGA_Parent_Physics_C_HandleProjHit::HitNormal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_HandleProjHit, Hit) == 0x00000C, "Member 'CBGA_Parent_Physics_C_HandleProjHit::Hit' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.OnAwakeChanged
// 0x0010 (0x0010 - 0x0000)
struct CBGA_Parent_Physics_C_OnAwakeChanged final
{
public:
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAwake;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_Physics_C_OnAwakeChanged) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_OnAwakeChanged");
static_assert(sizeof(CBGA_Parent_Physics_C_OnAwakeChanged) == 0x000010, "Wrong size on CBGA_Parent_Physics_C_OnAwakeChanged");
static_assert(offsetof(CBGA_Parent_Physics_C_OnAwakeChanged, SimulatingComponent) == 0x000000, "Member 'CBGA_Parent_Physics_C_OnAwakeChanged::SimulatingComponent' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_OnAwakeChanged, bIsAwake) == 0x000008, "Member 'CBGA_Parent_Physics_C_OnAwakeChanged::bIsAwake' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct CBGA_Parent_Physics_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B9[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CBGA_Parent_Physics_C_ReceiveHit) == 0x000008, "Wrong alignment on CBGA_Parent_Physics_C_ReceiveHit");
static_assert(sizeof(CBGA_Parent_Physics_C_ReceiveHit) == 0x0000D0, "Wrong size on CBGA_Parent_Physics_C_ReceiveHit");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, MyComp) == 0x000000, "Member 'CBGA_Parent_Physics_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, Other) == 0x000008, "Member 'CBGA_Parent_Physics_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, OtherComp) == 0x000010, "Member 'CBGA_Parent_Physics_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'CBGA_Parent_Physics_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'CBGA_Parent_Physics_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, HitNormal) == 0x000028, "Member 'CBGA_Parent_Physics_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'CBGA_Parent_Physics_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_ReceiveHit, Hit) == 0x000040, "Member 'CBGA_Parent_Physics_C_ReceiveHit::Hit' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.PlayHitFX
// 0x0018 (0x0018 - 0x0000)
struct CBGA_Parent_Physics_C_PlayHitFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_Physics_C_PlayHitFX) == 0x000004, "Wrong alignment on CBGA_Parent_Physics_C_PlayHitFX");
static_assert(sizeof(CBGA_Parent_Physics_C_PlayHitFX) == 0x000018, "Wrong size on CBGA_Parent_Physics_C_PlayHitFX");
static_assert(offsetof(CBGA_Parent_Physics_C_PlayHitFX, Location) == 0x000000, "Member 'CBGA_Parent_Physics_C_PlayHitFX::Location' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_PlayHitFX, Rotation) == 0x00000C, "Member 'CBGA_Parent_Physics_C_PlayHitFX::Rotation' has a wrong offset!");

// Function CBGA_Parent_Physics.CBGA_Parent_Physics_C.Impulse
// 0x0024 (0x0024 - 0x0000)
struct CBGA_Parent_Physics_C_Impulse final
{
public:
	float                                         DelayBeforeImpulse;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeCollision;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseOrigin;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseAmount;                                     // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCollisionAfterImpulse;                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Parent_Physics_C_Impulse) == 0x000004, "Wrong alignment on CBGA_Parent_Physics_C_Impulse");
static_assert(sizeof(CBGA_Parent_Physics_C_Impulse) == 0x000024, "Wrong size on CBGA_Parent_Physics_C_Impulse");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, DelayBeforeImpulse) == 0x000000, "Member 'CBGA_Parent_Physics_C_Impulse::DelayBeforeImpulse' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, DelayBeforeCollision) == 0x000004, "Member 'CBGA_Parent_Physics_C_Impulse::DelayBeforeCollision' has a wrong offset!");
static_assert(offsetof(CBGA_Parent_Physics_C_Impulse, ImpulseOrigin) == 0x000008, "Member 'CBGA_Parent_Physics_C_Impulse::ImpulseOrigin' has a wrong offset!");
