#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_F_BlackKnight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_F_BlackKnight.CCPM_F_BlackKnight_C
// 0x0038 (0x0418 - 0x03E0)
class ACCPM_F_BlackKnight_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_F_BlackKnight_C;               // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   LastPawn;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_LastValue;                                      // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8C[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SL_RefreshTimeHandler;                             // 0x03F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_StartLevel;                                     // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_EndLevel;                                       // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndRadius;                                         // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8D[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      SpawnedNiagara;                                    // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyLevelParam(int32 Level);
	void GetAssociatedAthenaController(class AFortPlayerControllerAthena** AsFort_Player_Controller_Athena);
	void Death_Check();
	void UserConstructionScript();
	void OnStatChanged_3C7EC5CC4132EA954E634EB904347363(class FName StatName, int32 StatValue);
	void OnPawnAndPartChanged();
	void OnActualStatChange();
	void HackyWorkaroundRefreshTimerGuy();
	void OnPostResIn();
	void ResetSafetyGate();
	void InitializeVariabels();
	void Open_Niagara_Gate();
	void ExecuteUbergraph_CCPM_F_BlackKnight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_F_BlackKnight_C">();
	}
	static class ACCPM_F_BlackKnight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_F_BlackKnight_C>();
	}
};
static_assert(alignof(ACCPM_F_BlackKnight_C) == 0x000008, "Wrong alignment on ACCPM_F_BlackKnight_C");
static_assert(sizeof(ACCPM_F_BlackKnight_C) == 0x000418, "Wrong size on ACCPM_F_BlackKnight_C");
static_assert(offsetof(ACCPM_F_BlackKnight_C, UberGraphFrame_CCPM_F_BlackKnight_C) == 0x0003E0, "Member 'ACCPM_F_BlackKnight_C::UberGraphFrame_CCPM_F_BlackKnight_C' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, LastPawn) == 0x0003E8, "Member 'ACCPM_F_BlackKnight_C::LastPawn' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, SL_LastValue) == 0x0003F0, "Member 'ACCPM_F_BlackKnight_C::SL_LastValue' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, SL_RefreshTimeHandler) == 0x0003F8, "Member 'ACCPM_F_BlackKnight_C::SL_RefreshTimeHandler' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, SL_StartLevel) == 0x000400, "Member 'ACCPM_F_BlackKnight_C::SL_StartLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, SL_EndLevel) == 0x000404, "Member 'ACCPM_F_BlackKnight_C::SL_EndLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, EndRadius) == 0x000408, "Member 'ACCPM_F_BlackKnight_C::EndRadius' has a wrong offset!");
static_assert(offsetof(ACCPM_F_BlackKnight_C, SpawnedNiagara) == 0x000410, "Member 'ACCPM_F_BlackKnight_C::SpawnedNiagara' has a wrong offset!");

}

