#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Base.CCPM_Base_C
// 0x0070 (0x03E0 - 0x0370)
class ACCPM_Base_C : public ACustomCharacterPartModifier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           StaticMeshComponents;                              // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CascadeComponents;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Last_Pawn;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Particles_during_Skydive;                  // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_during_First_Person;             // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_in_Vehicle;                      // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDriving;                                        // 0x03AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Event_Log_Color;                                   // 0x03AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C05[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Hidding_prefixes;                                  // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMeshComponent*                         Character_Part_Type;                               // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Debug_Printing;                             // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OverrideCharacterPartType(EFortCustomPartType Part_Type);
	void AttachParticleSystem(class UParticleSystemComponent* Particle_System_Component, class FName Socket_Name);
	void UserConstructionScript();
	void Reset_Exit_Vehicle();
	void Reset_Enter_Vehicle();
	void OnBeginSkydiving();
	void OnEndSkydiving();
	void Close();
	void OnTargetingOrFirstPersonCameraChanged();
	void EnteringHidingProp();
	void ExitingHidingProp();
	void Open();
	void EnterVehicle();
	void ExitVehicle();
	void PlayerMovementTick(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void IsHiddingInProp(bool IsHidden);
	void OnPawnAndPartChanged();
	void Attachment();
	void ExecuteUbergraph_CCPM_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Base_C">();
	}
	static class ACCPM_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Base_C>();
	}
};
static_assert(alignof(ACCPM_Base_C) == 0x000008, "Wrong alignment on ACCPM_Base_C");
static_assert(sizeof(ACCPM_Base_C) == 0x0003E0, "Wrong size on ACCPM_Base_C");
static_assert(offsetof(ACCPM_Base_C, UberGraphFrame) == 0x000370, "Member 'ACCPM_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, DefaultSceneRoot) == 0x000378, "Member 'ACCPM_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, StaticMeshComponents) == 0x000380, "Member 'ACCPM_Base_C::StaticMeshComponents' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, CascadeComponents) == 0x000390, "Member 'ACCPM_Base_C::CascadeComponents' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Last_Pawn) == 0x0003A0, "Member 'ACCPM_Base_C::Last_Pawn' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Disable_Particles_during_Skydive) == 0x0003A8, "Member 'ACCPM_Base_C::Disable_Particles_during_Skydive' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Disable_Particles_during_First_Person) == 0x0003A9, "Member 'ACCPM_Base_C::Disable_Particles_during_First_Person' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Disable_Particles_in_Vehicle) == 0x0003AA, "Member 'ACCPM_Base_C::Disable_Particles_in_Vehicle' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, bIsDriving) == 0x0003AB, "Member 'ACCPM_Base_C::bIsDriving' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Event_Log_Color) == 0x0003AC, "Member 'ACCPM_Base_C::Event_Log_Color' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Hidding_prefixes) == 0x0003C0, "Member 'ACCPM_Base_C::Hidding_prefixes' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Character_Part_Type) == 0x0003D0, "Member 'ACCPM_Base_C::Character_Part_Type' has a wrong offset!");
static_assert(offsetof(ACCPM_Base_C, Enable_Debug_Printing) == 0x0003D8, "Member 'ACCPM_Base_C::Enable_Debug_Printing' has a wrong offset!");

}

