#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicMinusTeamMics

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Cinematic-TeamMics.Cinematic-TeamMics_C.ExecuteUbergraph_Cinematic-TeamMics
// 0x0004 (0x0004 - 0x0000)
struct CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics) == 0x000004, "Wrong alignment on CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics");
static_assert(sizeof(CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics) == 0x000004, "Wrong size on CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics");
static_assert(offsetof(CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics, EntryPoint) == 0x000000, "Member 'CinematicMinusTeamMics_C_ExecuteUbergraph_CinematicMinusTeamMics::EntryPoint' has a wrong offset!");

// Function Cinematic-TeamMics.Cinematic-TeamMics_C.Update
// 0x0278 (0x0278 - 0x0000)
struct CinematicMinusTeamMics_C_Update final
{
public:
	struct FFortTeamMemberInfo                    UpdatedMemberInfo;                                 // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       PlayerNetId;                                       // 0x0200(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_546D[0x3];                                     // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_546E[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_546F[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select_Default_2;                           // 0x0250(0x0028)(ConstParm, HasGetValueTypeHash)
};
static_assert(alignof(CinematicMinusTeamMics_C_Update) == 0x000008, "Wrong alignment on CinematicMinusTeamMics_C_Update");
static_assert(sizeof(CinematicMinusTeamMics_C_Update) == 0x000278, "Wrong size on CinematicMinusTeamMics_C_Update");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, UpdatedMemberInfo) == 0x000000, "Member 'CinematicMinusTeamMics_C_Update::UpdatedMemberInfo' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, PlayerNetId) == 0x000200, "Member 'CinematicMinusTeamMics_C_Update::PlayerNetId' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_bool_Variable) == 0x000228, "Member 'CinematicMinusTeamMics_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_bool_Variable_1) == 0x000229, "Member 'CinematicMinusTeamMics_C_Update::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_byte_Variable) == 0x00022A, "Member 'CinematicMinusTeamMics_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_byte_Variable_1) == 0x00022B, "Member 'CinematicMinusTeamMics_C_Update::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_bool_Variable_2) == 0x00022C, "Member 'CinematicMinusTeamMics_C_Update::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_int_Variable) == 0x000230, "Member 'CinematicMinusTeamMics_C_Update::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, Temp_int_Variable_1) == 0x000234, "Member 'CinematicMinusTeamMics_C_Update::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, CallFunc_GetContext_ReturnValue) == 0x000238, "Member 'CinematicMinusTeamMics_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, CallFunc_IsValid_ReturnValue) == 0x000240, "Member 'CinematicMinusTeamMics_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, K2Node_Select_Default) == 0x000241, "Member 'CinematicMinusTeamMics_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, K2Node_Select_Default_1) == 0x000244, "Member 'CinematicMinusTeamMics_C_Update::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue) == 0x000248, "Member 'CinematicMinusTeamMics_C_Update::CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CinematicMinusTeamMics_C_Update, K2Node_Select_Default_2) == 0x000250, "Member 'CinematicMinusTeamMics_C_Update::K2Node_Select_Default_2' has a wrong offset!");

}

