#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_ThanksForVotingMessage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Com_ThanksForVotingMessage.Com_ThanksForVotingMessage_C.TapToClose
// 0x03B0 (0x03B0 - 0x0000)
struct Com_ThanksForVotingMessage_C_TapToClose final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsTouchEvent_ReturnValue;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67DE[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67DF[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F8(0x00B8)()
};
static_assert(alignof(Com_ThanksForVotingMessage_C_TapToClose) == 0x000008, "Wrong alignment on Com_ThanksForVotingMessage_C_TapToClose");
static_assert(sizeof(Com_ThanksForVotingMessage_C_TapToClose) == 0x0003B0, "Wrong size on Com_ThanksForVotingMessage_C_TapToClose");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, MyGeometry) == 0x000000, "Member 'Com_ThanksForVotingMessage_C_TapToClose::MyGeometry' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, MouseEvent) == 0x000038, "Member 'Com_ThanksForVotingMessage_C_TapToClose::MouseEvent' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, ReturnValue) == 0x0000A8, "Member 'Com_ThanksForVotingMessage_C_TapToClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_PointerEvent_IsTouchEvent_ReturnValue) == 0x000178, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_PointerEvent_IsTouchEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000179, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, Temp_bool_Variable) == 0x00017A, "Member 'Com_ThanksForVotingMessage_C_TapToClose::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_BooleanOR_ReturnValue) == 0x00017B, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_Not_PreBool_ReturnValue) == 0x000238, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'Com_ThanksForVotingMessage_C_TapToClose::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_TapToClose, K2Node_Select_Default) == 0x0002F8, "Member 'Com_ThanksForVotingMessage_C_TapToClose::K2Node_Select_Default' has a wrong offset!");

// Function Com_ThanksForVotingMessage.Com_ThanksForVotingMessage_C.ExecuteUbergraph_Com_ThanksForVotingMessage
// 0x0028 (0x0028 - 0x0000)
struct Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_67E0[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage) == 0x000008, "Wrong alignment on Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage");
static_assert(sizeof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage) == 0x000028, "Wrong size on Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage");
static_assert(offsetof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage, EntryPoint) == 0x000000, "Member 'Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'Com_ThanksForVotingMessage_C_ExecuteUbergraph_Com_ThanksForVotingMessage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

