#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComVoteFeedback

#include "Basic.hpp"


namespace SDK::Params
{

// Function ComVoteFeedback.ComVoteFeedback_C.ExecuteUbergraph_ComVoteFeedback
// 0x0020 (0x0020 - 0x0000)
struct ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7631[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback) == 0x000008, "Wrong alignment on ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback");
static_assert(sizeof(ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback) == 0x000020, "Wrong size on ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback");
static_assert(offsetof(ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback, EntryPoint) == 0x000000, "Member 'ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ComVoteFeedback_C_ExecuteUbergraph_ComVoteFeedback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

