#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Context_WorldOrigin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Context_WorldOrigin.Context_WorldOrigin_C.ProvideSingleLocation
// 0x0020 (0x0020 - 0x0000)
struct Context_WorldOrigin_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Context_WorldOrigin_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on Context_WorldOrigin_C_ProvideSingleLocation");
static_assert(sizeof(Context_WorldOrigin_C_ProvideSingleLocation) == 0x000020, "Wrong size on Context_WorldOrigin_C_ProvideSingleLocation");
static_assert(offsetof(Context_WorldOrigin_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'Context_WorldOrigin_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(Context_WorldOrigin_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'Context_WorldOrigin_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(Context_WorldOrigin_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'Context_WorldOrigin_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");

}

