#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "RigVM_structs.hpp"
#include "MovieSceneTracks_structs.hpp"


namespace SDK
{

// Enum ControlRig.ERigExecutionType
// NumValues: 0x0003
enum class ERigExecutionType : uint8
{
	Runtime                                  = 0,
	Editing                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EBoneGetterSetterMode
// NumValues: 0x0003
enum class EBoneGetterSetterMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	Max                                      = 2,
};

// Enum ControlRig.ETransformGetterType
// NumValues: 0x0003
enum class ETransformGetterType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigClampSpatialMode
// NumValues: 0x0004
enum class EControlRigClampSpatialMode : uint8
{
	Plane                                    = 0,
	Cylinder                                 = 1,
	Sphere                                   = 2,
	EControlRigClampSpatialMode_MAX          = 3,
};

// Enum ControlRig.ETransformSpaceMode
// NumValues: 0x0005
enum class ETransformSpaceMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	BaseSpace                                = 2,
	BaseJoint                                = 3,
	Max                                      = 4,
};

// Enum ControlRig.EControlRigDrawSettings
// NumValues: 0x0004
enum class EControlRigDrawSettings : uint8
{
	Points                                   = 0,
	Lines                                    = 1,
	LineStrip                                = 2,
	EControlRigDrawSettings_MAX              = 3,
};

// Enum ControlRig.EControlRigDrawHierarchyMode
// NumValues: 0x0002
enum class EControlRigDrawHierarchyMode : uint8
{
	Axes                                     = 0,
	Max                                      = 1,
};

// Enum ControlRig.EControlRigAnimEasingType
// NumValues: 0x0020
enum class EControlRigAnimEasingType : uint8
{
	Linear                                   = 0,
	QuadraticEaseIn                          = 1,
	QuadraticEaseOut                         = 2,
	QuadraticEaseInOut                       = 3,
	CubicEaseIn                              = 4,
	CubicEaseOut                             = 5,
	CubicEaseInOut                           = 6,
	QuarticEaseIn                            = 7,
	QuarticEaseOut                           = 8,
	QuarticEaseInOut                         = 9,
	QuinticEaseIn                            = 10,
	QuinticEaseOut                           = 11,
	QuinticEaseInOut                         = 12,
	SineEaseIn                               = 13,
	SineEaseOut                              = 14,
	SineEaseInOut                            = 15,
	CircularEaseIn                           = 16,
	CircularEaseOut                          = 17,
	CircularEaseInOut                        = 18,
	ExponentialEaseIn                        = 19,
	ExponentialEaseOut                       = 20,
	ExponentialEaseInOut                     = 21,
	ElasticEaseIn                            = 22,
	ElasticEaseOut                           = 23,
	ElasticEaseInOut                         = 24,
	BackEaseIn                               = 25,
	BackEaseOut                              = 26,
	BackEaseInOut                            = 27,
	BounceEaseIn                             = 28,
	BounceEaseOut                            = 29,
	BounceEaseInOut                          = 30,
	EControlRigAnimEasingType_MAX            = 31,
};

// Enum ControlRig.EControlRigRotationOrder
// NumValues: 0x0007
enum class EControlRigRotationOrder : uint8
{
	XYZ                                      = 0,
	XZY                                      = 1,
	YXZ                                      = 2,
	YZX                                      = 3,
	ZXY                                      = 4,
	ZYX                                      = 5,
	EControlRigRotationOrder_MAX             = 6,
};

// Enum ControlRig.ECRSimPointIntegrateType
// NumValues: 0x0003
enum class ECRSimPointIntegrateType : uint8
{
	Verlet                                   = 0,
	SemiExplicitEuler                        = 1,
	ECRSimPointIntegrateType_MAX             = 2,
};

// Enum ControlRig.ECRSimConstraintType
// NumValues: 0x0005
enum class ECRSimConstraintType : uint8
{
	Distance                                 = 0,
	DistanceFromA                            = 1,
	DistanceFromB                            = 2,
	Plane                                    = 3,
	ECRSimConstraintType_MAX                 = 4,
};

// Enum ControlRig.ECRSimPointForceType
// NumValues: 0x0002
enum class ECRSimPointForceType : uint8
{
	Direction                                = 0,
	ECRSimPointForceType_MAX                 = 1,
};

// Enum ControlRig.ECRSimSoftCollisionType
// NumValues: 0x0004
enum class ECRSimSoftCollisionType : uint8
{
	Plane                                    = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	ECRSimSoftCollisionType_MAX              = 3,
};

// Enum ControlRig.ERigBoneType
// NumValues: 0x0003
enum class ERigBoneType : uint8
{
	Imported                                 = 0,
	User                                     = 1,
	ERigBoneType_MAX                         = 2,
};

// Enum ControlRig.ERigControlAxis
// NumValues: 0x0004
enum class ERigControlAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	ERigControlAxis_MAX                      = 3,
};

// Enum ControlRig.ERigControlValueType
// NumValues: 0x0005
enum class ERigControlValueType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Minimum                                  = 2,
	Maximum                                  = 3,
	ERigControlValueType_MAX                 = 4,
};

// Enum ControlRig.ERigControlType
// NumValues: 0x0009
enum class ERigControlType : uint8
{
	Bool                                     = 0,
	Float                                    = 1,
	Vector2D                                 = 2,
	Position                                 = 3,
	Scale                                    = 4,
	Rotator                                  = 5,
	Transform                                = 6,
	TransformNoScale                         = 7,
	ERigControlType_MAX                      = 8,
};

// Enum ControlRig.ERigHierarchyImportMode
// NumValues: 0x0005
enum class ERigHierarchyImportMode : uint8
{
	Append                                   = 0,
	Replace                                  = 1,
	ReplaceLocalTransform                    = 2,
	ReplaceGlobalTransform                   = 3,
	Max                                      = 4,
};

// Enum ControlRig.ERigElementType
// NumValues: 0x0007
enum class ERigElementType : uint8
{
	None                                     = 0,
	Bone                                     = 1,
	Space                                    = 2,
	Control                                  = 4,
	Curve                                    = 8,
	All                                      = 15,
	ERigElementType_MAX                      = 16,
};

// Enum ControlRig.ERigSpaceType
// NumValues: 0x0005
enum class ERigSpaceType : uint8
{
	Global                                   = 0,
	Bone                                     = 1,
	Control                                  = 2,
	Space                                    = 3,
	ERigSpaceType_MAX                        = 4,
};

// Enum ControlRig.EAimMode
// NumValues: 0x0003
enum class EAimMode : uint8
{
	AimAtTarget                              = 0,
	OrientToTarget                           = 1,
	MAX                                      = 2,
};

// Enum ControlRig.EApplyTransformMode
// NumValues: 0x0003
enum class EApplyTransformMode : uint8
{
	Override                                 = 0,
	Additive                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugPointMode
// NumValues: 0x0003
enum class ERigUnitDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugTransformMode
// NumValues: 0x0004
enum class ERigUnitDebugTransformMode : uint8
{
	Point                                    = 0,
	Axes                                     = 1,
	Box                                      = 2,
	Max                                      = 3,
};

// Enum ControlRig.EControlRigCurveAlignment
// NumValues: 0x0003
enum class EControlRigCurveAlignment : uint8
{
	Front                                    = 0,
	Stretched                                = 1,
	EControlRigCurveAlignment_MAX            = 2,
};

// Enum ControlRig.EControlRigVectorKind
// NumValues: 0x0003
enum class EControlRigVectorKind : uint8
{
	Direction                                = 0,
	Location                                 = 1,
	EControlRigVectorKind_MAX                = 2,
};

// Enum ControlRig.EControlRigModifyBoneMode
// NumValues: 0x0005
enum class EControlRigModifyBoneMode : uint8
{
	OverrideLocal                            = 0,
	OverrideGlobal                           = 1,
	AdditiveLocal                            = 2,
	AdditiveGlobal                           = 3,
	Max                                      = 4,
};

// Enum ControlRig.ERigUnitVisualDebugPointMode
// NumValues: 0x0003
enum class ERigUnitVisualDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigState
// NumValues: 0x0004
enum class EControlRigState : uint8
{
	Init                                     = 0,
	Update                                   = 1,
	Invalid                                  = 2,
	EControlRigState_MAX                     = 3,
};

// ScriptStruct ControlRig.RigUnit
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit : public FRigVMStruct
{
};
static_assert(alignof(FRigUnit) == 0x000008, "Wrong alignment on FRigUnit");
static_assert(sizeof(FRigUnit) == 0x000008, "Wrong size on FRigUnit");

// ScriptStruct ControlRig.CRSimPoint
// 0x0028 (0x0028 - 0x0000)
struct FCRSimPoint final
{
public:
	float                                         Mass;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDamping;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InheritMotion;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCRSimPoint) == 0x000004, "Wrong alignment on FCRSimPoint");
static_assert(sizeof(FCRSimPoint) == 0x000028, "Wrong size on FCRSimPoint");
static_assert(offsetof(FCRSimPoint, Mass) == 0x000000, "Member 'FCRSimPoint::Mass' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, Size) == 0x000004, "Member 'FCRSimPoint::Size' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, LinearDamping) == 0x000008, "Member 'FCRSimPoint::LinearDamping' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, InheritMotion) == 0x00000C, "Member 'FCRSimPoint::InheritMotion' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, Position) == 0x000010, "Member 'FCRSimPoint::Position' has a wrong offset!");
static_assert(offsetof(FCRSimPoint, LinearVelocity) == 0x00001C, "Member 'FCRSimPoint::LinearVelocity' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SimBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_SimBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_SimBase) == 0x000008, "Wrong alignment on FRigUnit_SimBase");
static_assert(sizeof(FRigUnit_SimBase) == 0x000008, "Wrong size on FRigUnit_SimBase");

// ScriptStruct ControlRig.RigUnit_VerletIntegrateVector
// 0x0068 (0x0070 - 0x0008)
struct FRigUnit_VerletIntegrateVector final : public FRigUnit_SimBase
{
public:
	struct FVector                                Target;                                            // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damp;                                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Blend;                                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Acceleration;                                      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCRSimPoint                            Point;                                             // 0x0044(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4563[0x4];                                     // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_VerletIntegrateVector) == 0x000008, "Wrong alignment on FRigUnit_VerletIntegrateVector");
static_assert(sizeof(FRigUnit_VerletIntegrateVector) == 0x000070, "Wrong size on FRigUnit_VerletIntegrateVector");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Target) == 0x000008, "Member 'FRigUnit_VerletIntegrateVector::Target' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Strength) == 0x000014, "Member 'FRigUnit_VerletIntegrateVector::Strength' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Damp) == 0x000018, "Member 'FRigUnit_VerletIntegrateVector::Damp' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Blend) == 0x00001C, "Member 'FRigUnit_VerletIntegrateVector::Blend' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Position) == 0x000020, "Member 'FRigUnit_VerletIntegrateVector::Position' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Velocity) == 0x00002C, "Member 'FRigUnit_VerletIntegrateVector::Velocity' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Acceleration) == 0x000038, "Member 'FRigUnit_VerletIntegrateVector::Acceleration' has a wrong offset!");
static_assert(offsetof(FRigUnit_VerletIntegrateVector, Point) == 0x000044, "Member 'FRigUnit_VerletIntegrateVector::Point' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigIOSettings
// 0x0002 (0x0002 - 0x0000)
struct FControlRigIOSettings final
{
public:
	bool                                          bUpdatePose;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateCurves;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigIOSettings) == 0x000001, "Wrong alignment on FControlRigIOSettings");
static_assert(sizeof(FControlRigIOSettings) == 0x000002, "Wrong size on FControlRigIOSettings");
static_assert(offsetof(FControlRigIOSettings, bUpdatePose) == 0x000000, "Member 'FControlRigIOSettings::bUpdatePose' has a wrong offset!");
static_assert(offsetof(FControlRigIOSettings, bUpdateCurves) == 0x000001, "Member 'FControlRigIOSettings::bUpdateCurves' has a wrong offset!");

// ScriptStruct ControlRig.RigElement
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRigElement
{
public:
	uint8                                         Pad_4564[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4565[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigElement) == 0x000008, "Wrong alignment on FRigElement");
static_assert(sizeof(FRigElement) == 0x000018, "Wrong size on FRigElement");
static_assert(offsetof(FRigElement, Name) == 0x000008, "Member 'FRigElement::Name' has a wrong offset!");
static_assert(offsetof(FRigElement, Index) == 0x000010, "Member 'FRigElement::Index' has a wrong offset!");

// ScriptStruct ControlRig.RigCurve
// 0x0008 (0x0020 - 0x0018)
struct FRigCurve final : public FRigElement
{
public:
	float                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4566[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigCurve) == 0x000008, "Wrong alignment on FRigCurve");
static_assert(sizeof(FRigCurve) == 0x000020, "Wrong size on FRigCurve");
static_assert(offsetof(FRigCurve, Value) == 0x000018, "Member 'FRigCurve::Value' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_TwoBoneIKSimple_DebugSettings
// 0x0040 (0x0040 - 0x0000)
struct FRigUnit_TwoBoneIKSimple_DebugSettings final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4567[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4568[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldOffset;                                       // 0x0010(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_TwoBoneIKSimple_DebugSettings) == 0x000010, "Wrong alignment on FRigUnit_TwoBoneIKSimple_DebugSettings");
static_assert(sizeof(FRigUnit_TwoBoneIKSimple_DebugSettings) == 0x000040, "Wrong size on FRigUnit_TwoBoneIKSimple_DebugSettings");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple_DebugSettings, bEnabled) == 0x000000, "Member 'FRigUnit_TwoBoneIKSimple_DebugSettings::bEnabled' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple_DebugSettings, Scale) == 0x000004, "Member 'FRigUnit_TwoBoneIKSimple_DebugSettings::Scale' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple_DebugSettings, WorldOffset) == 0x000010, "Member 'FRigUnit_TwoBoneIKSimple_DebugSettings::WorldOffset' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0008 (0x0018 - 0x0010)
struct FControlRigExecuteContext final : public FRigVMExecuteContext
{
public:
	uint8                                         Pad_4569[0x8];                                     // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FControlRigExecuteContext) == 0x000008, "Wrong alignment on FControlRigExecuteContext");
static_assert(sizeof(FControlRigExecuteContext) == 0x000018, "Wrong size on FControlRigExecuteContext");

// ScriptStruct ControlRig.RigUnitMutable
// 0x0018 (0x0020 - 0x0008)
struct FRigUnitMutable : public FRigUnit
{
public:
	struct FControlRigExecuteContext              ExecuteContext;                                    // 0x0008(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnitMutable) == 0x000008, "Wrong alignment on FRigUnitMutable");
static_assert(sizeof(FRigUnitMutable) == 0x000020, "Wrong size on FRigUnitMutable");
static_assert(offsetof(FRigUnitMutable, ExecuteContext) == 0x000008, "Member 'FRigUnitMutable::ExecuteContext' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_HighlevelBaseMutable : public FRigUnitMutable
{
};
static_assert(alignof(FRigUnit_HighlevelBaseMutable) == 0x000008, "Wrong alignment on FRigUnit_HighlevelBaseMutable");
static_assert(sizeof(FRigUnit_HighlevelBaseMutable) == 0x000020, "Wrong size on FRigUnit_HighlevelBaseMutable");

// ScriptStruct ControlRig.RigUnit_TwoBoneIKSimple
// 0x00F0 (0x0110 - 0x0020)
struct FRigUnit_TwoBoneIKSimple final : public FRigUnit_HighlevelBaseMutable
{
public:
	class FName                                   BoneA;                                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneB;                                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EffectorBone;                                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_456A[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Effector;                                          // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PrimaryAxis;                                       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SecondaryAxis;                                     // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondaryAxisWeight;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PoleVector;                                        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlRigVectorKind                         PoleVectorKind;                                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_456B[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PoleVectorSpace;                                   // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStretch;                                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_456C[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StretchStartRatio;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StretchMaximumRatio;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoneALength;                                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoneBLength;                                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_456D[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings DebugSettings;                                     // 0x00C0(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BoneAIndex;                                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneBIndex;                                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectorBoneIndex;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PoleVectorSpaceIndex;                              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_TwoBoneIKSimple) == 0x000010, "Wrong alignment on FRigUnit_TwoBoneIKSimple");
static_assert(sizeof(FRigUnit_TwoBoneIKSimple) == 0x000110, "Wrong size on FRigUnit_TwoBoneIKSimple");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneA) == 0x000020, "Member 'FRigUnit_TwoBoneIKSimple::BoneA' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneB) == 0x000028, "Member 'FRigUnit_TwoBoneIKSimple::BoneB' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, EffectorBone) == 0x000030, "Member 'FRigUnit_TwoBoneIKSimple::EffectorBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, Effector) == 0x000040, "Member 'FRigUnit_TwoBoneIKSimple::Effector' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, PrimaryAxis) == 0x000070, "Member 'FRigUnit_TwoBoneIKSimple::PrimaryAxis' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, SecondaryAxis) == 0x00007C, "Member 'FRigUnit_TwoBoneIKSimple::SecondaryAxis' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, SecondaryAxisWeight) == 0x000088, "Member 'FRigUnit_TwoBoneIKSimple::SecondaryAxisWeight' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, PoleVector) == 0x00008C, "Member 'FRigUnit_TwoBoneIKSimple::PoleVector' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, PoleVectorKind) == 0x000098, "Member 'FRigUnit_TwoBoneIKSimple::PoleVectorKind' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, PoleVectorSpace) == 0x00009C, "Member 'FRigUnit_TwoBoneIKSimple::PoleVectorSpace' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, bEnableStretch) == 0x0000A4, "Member 'FRigUnit_TwoBoneIKSimple::bEnableStretch' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, StretchStartRatio) == 0x0000A8, "Member 'FRigUnit_TwoBoneIKSimple::StretchStartRatio' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, StretchMaximumRatio) == 0x0000AC, "Member 'FRigUnit_TwoBoneIKSimple::StretchMaximumRatio' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, Weight) == 0x0000B0, "Member 'FRigUnit_TwoBoneIKSimple::Weight' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneALength) == 0x0000B4, "Member 'FRigUnit_TwoBoneIKSimple::BoneALength' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneBLength) == 0x0000B8, "Member 'FRigUnit_TwoBoneIKSimple::BoneBLength' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, bPropagateToChildren) == 0x0000BC, "Member 'FRigUnit_TwoBoneIKSimple::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, DebugSettings) == 0x0000C0, "Member 'FRigUnit_TwoBoneIKSimple::DebugSettings' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneAIndex) == 0x000100, "Member 'FRigUnit_TwoBoneIKSimple::BoneAIndex' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, BoneBIndex) == 0x000104, "Member 'FRigUnit_TwoBoneIKSimple::BoneBIndex' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, EffectorBoneIndex) == 0x000108, "Member 'FRigUnit_TwoBoneIKSimple::EffectorBoneIndex' has a wrong offset!");
static_assert(offsetof(FRigUnit_TwoBoneIKSimple, PoleVectorSpaceIndex) == 0x00010C, "Member 'FRigUnit_TwoBoneIKSimple::PoleVectorSpaceIndex' has a wrong offset!");

// ScriptStruct ControlRig.ConstraintNodeData
// 0x00B0 (0x00B0 - 0x0000)
struct FConstraintNodeData final
{
public:
	struct FTransform                             RelativeParent;                                    // 0x0000(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintOffset                      ConstraintOffset;                                  // 0x0030(0x0060)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   LinkedNode;                                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransformConstraint>           Constraints;                                       // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_456E[0x8];                                     // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConstraintNodeData) == 0x000010, "Wrong alignment on FConstraintNodeData");
static_assert(sizeof(FConstraintNodeData) == 0x0000B0, "Wrong size on FConstraintNodeData");
static_assert(offsetof(FConstraintNodeData, RelativeParent) == 0x000000, "Member 'FConstraintNodeData::RelativeParent' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, ConstraintOffset) == 0x000030, "Member 'FConstraintNodeData::ConstraintOffset' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, LinkedNode) == 0x000090, "Member 'FConstraintNodeData::LinkedNode' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, Constraints) == 0x000098, "Member 'FConstraintNodeData::Constraints' has a wrong offset!");

// ScriptStruct ControlRig.AnimationHierarchy
// 0x0010 (0x0088 - 0x0078)
struct FAnimationHierarchy final : public FNodeHierarchyWithUserData
{
public:
	TArray<struct FConstraintNodeData>            UserData;                                          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimationHierarchy) == 0x000008, "Wrong alignment on FAnimationHierarchy");
static_assert(sizeof(FAnimationHierarchy) == 0x000088, "Wrong size on FAnimationHierarchy");
static_assert(offsetof(FAnimationHierarchy, UserData) == 0x000078, "Member 'FAnimationHierarchy::UserData' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AccumulateTransformMul
// 0x00D8 (0x00E0 - 0x0008)
struct FRigUnit_AccumulateTransformMul final : public FRigUnit_SimBase
{
public:
	uint8                                         Pad_456F[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Multiplier;                                        // 0x0010(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             InitialValue;                                      // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bFlipOrder;                                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4570[0xE];                                     // 0x0072(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Result;                                            // 0x0080(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             AccumulatedValue;                                  // 0x00B0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AccumulateTransformMul) == 0x000010, "Wrong alignment on FRigUnit_AccumulateTransformMul");
static_assert(sizeof(FRigUnit_AccumulateTransformMul) == 0x0000E0, "Wrong size on FRigUnit_AccumulateTransformMul");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, Multiplier) == 0x000010, "Member 'FRigUnit_AccumulateTransformMul::Multiplier' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, InitialValue) == 0x000040, "Member 'FRigUnit_AccumulateTransformMul::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, bFlipOrder) == 0x000070, "Member 'FRigUnit_AccumulateTransformMul::bFlipOrder' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, bIntegrateDeltaTime) == 0x000071, "Member 'FRigUnit_AccumulateTransformMul::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, Result) == 0x000080, "Member 'FRigUnit_AccumulateTransformMul::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateTransformMul, AccumulatedValue) == 0x0000B0, "Member 'FRigUnit_AccumulateTransformMul::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigBindingTemplate
// 0x0000 (0x00B0 - 0x00B0)
struct FControlRigBindingTemplate final : public FMovieSceneSpawnSectionTemplate
{
};
static_assert(alignof(FControlRigBindingTemplate) == 0x000008, "Wrong alignment on FControlRigBindingTemplate");
static_assert(sizeof(FControlRigBindingTemplate) == 0x0000B0, "Wrong size on FControlRigBindingTemplate");

// ScriptStruct ControlRig.AnimNode_ControlRigBase
// 0x0118 (0x0170 - 0x0058)
struct FAnimNode_ControlRigBase : public FAnimNode_CustomProperty
{
public:
	struct FPoseLink                              Source;                                            // 0x0058(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, uint16>                     ControlRigBoneMapping;                             // 0x0068(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, uint16>                     ControlRigCurveMapping;                            // 0x00B8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, uint16>                     InputToCurveMappingUIDs;                           // 0x0108(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UNodeMappingContainer>   NodeMappingContainer;                              // 0x0158(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FControlRigIOSettings                  InputSettings;                                     // 0x0160(0x0002)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FControlRigIOSettings                  OutputSettings;                                    // 0x0162(0x0002)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bExecute;                                          // 0x0164(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4571[0xB];                                     // 0x0165(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ControlRigBase) == 0x000008, "Wrong alignment on FAnimNode_ControlRigBase");
static_assert(sizeof(FAnimNode_ControlRigBase) == 0x000170, "Wrong size on FAnimNode_ControlRigBase");
static_assert(offsetof(FAnimNode_ControlRigBase, Source) == 0x000058, "Member 'FAnimNode_ControlRigBase::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, ControlRigBoneMapping) == 0x000068, "Member 'FAnimNode_ControlRigBase::ControlRigBoneMapping' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, ControlRigCurveMapping) == 0x0000B8, "Member 'FAnimNode_ControlRigBase::ControlRigCurveMapping' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, InputToCurveMappingUIDs) == 0x000108, "Member 'FAnimNode_ControlRigBase::InputToCurveMappingUIDs' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, NodeMappingContainer) == 0x000158, "Member 'FAnimNode_ControlRigBase::NodeMappingContainer' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, InputSettings) == 0x000160, "Member 'FAnimNode_ControlRigBase::InputSettings' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, OutputSettings) == 0x000162, "Member 'FAnimNode_ControlRigBase::OutputSettings' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bExecute) == 0x000164, "Member 'FAnimNode_ControlRigBase::bExecute' has a wrong offset!");

// ScriptStruct ControlRig.AnimNode_ControlRig
// 0x01F0 (0x0360 - 0x0170)
struct FAnimNode_ControlRig final : public FAnimNode_ControlRigBase
{
public:
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x0170(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UControlRig*                            ControlRig;                                        // 0x0178(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Alpha;                                             // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAnimAlphaInputType                           AlphaInputType;                                    // 0x0184(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bAlphaBoolEnabled : 1;                             // 0x0185(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_4572[0x2];                                     // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x0188(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FInputAlphaBoolBlend                   AlphaBoolBlend;                                    // 0x0190(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class FName                                   AlphaCurveName;                                    // 0x01D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInputScaleBiasClamp                   AlphaScaleBiasClamp;                               // 0x01E0(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                InputMapping;                                      // 0x0210(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                OutputMapping;                                     // 0x0260(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_4573[0xB0];                                    // 0x02B0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ControlRig) == 0x000008, "Wrong alignment on FAnimNode_ControlRig");
static_assert(sizeof(FAnimNode_ControlRig) == 0x000360, "Wrong size on FAnimNode_ControlRig");
static_assert(offsetof(FAnimNode_ControlRig, ControlRigClass) == 0x000170, "Member 'FAnimNode_ControlRig::ControlRigClass' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, ControlRig) == 0x000178, "Member 'FAnimNode_ControlRig::ControlRig' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, Alpha) == 0x000180, "Member 'FAnimNode_ControlRig::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, AlphaInputType) == 0x000184, "Member 'FAnimNode_ControlRig::AlphaInputType' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, AlphaScaleBias) == 0x000188, "Member 'FAnimNode_ControlRig::AlphaScaleBias' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, AlphaBoolBlend) == 0x000190, "Member 'FAnimNode_ControlRig::AlphaBoolBlend' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, AlphaCurveName) == 0x0001D8, "Member 'FAnimNode_ControlRig::AlphaCurveName' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, AlphaScaleBiasClamp) == 0x0001E0, "Member 'FAnimNode_ControlRig::AlphaScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, InputMapping) == 0x000210, "Member 'FAnimNode_ControlRig::InputMapping' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRig, OutputMapping) == 0x000260, "Member 'FAnimNode_ControlRig::OutputMapping' has a wrong offset!");

// ScriptStruct ControlRig.RigHierarchyRef
// 0x0001 (0x0001 - 0x0000)
struct FRigHierarchyRef final
{
public:
	uint8                                         Pad_4574[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigHierarchyRef) == 0x000001, "Wrong alignment on FRigHierarchyRef");
static_assert(sizeof(FRigHierarchyRef) == 0x000001, "Wrong size on FRigHierarchyRef");

// ScriptStruct ControlRig.RigUnit_AccumulateVectorLerp
// 0x0038 (0x0040 - 0x0008)
struct FRigUnit_AccumulateVectorLerp final : public FRigUnit_SimBase
{
public:
	struct FVector                                TargetValue;                                       // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitialValue;                                      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Blend;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4575[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Result;                                            // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AccumulatedValue;                                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AccumulateVectorLerp) == 0x000008, "Wrong alignment on FRigUnit_AccumulateVectorLerp");
static_assert(sizeof(FRigUnit_AccumulateVectorLerp) == 0x000040, "Wrong size on FRigUnit_AccumulateVectorLerp");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, TargetValue) == 0x000008, "Member 'FRigUnit_AccumulateVectorLerp::TargetValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, InitialValue) == 0x000014, "Member 'FRigUnit_AccumulateVectorLerp::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, Blend) == 0x000020, "Member 'FRigUnit_AccumulateVectorLerp::Blend' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, bIntegrateDeltaTime) == 0x000024, "Member 'FRigUnit_AccumulateVectorLerp::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, Result) == 0x000028, "Member 'FRigUnit_AccumulateVectorLerp::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateVectorLerp, AccumulatedValue) == 0x000034, "Member 'FRigUnit_AccumulateVectorLerp::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.AnimNode_ControlRig_ExternalSource
// 0x0008 (0x0178 - 0x0170)
struct FAnimNode_ControlRig_ExternalSource final : public FAnimNode_ControlRigBase
{
public:
	TWeakObjectPtr<class UControlRig>             ControlRig;                                        // 0x0170(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FAnimNode_ControlRig_ExternalSource) == 0x000008, "Wrong alignment on FAnimNode_ControlRig_ExternalSource");
static_assert(sizeof(FAnimNode_ControlRig_ExternalSource) == 0x000178, "Wrong size on FAnimNode_ControlRig_ExternalSource");
static_assert(offsetof(FAnimNode_ControlRig_ExternalSource, ControlRig) == 0x000170, "Member 'FAnimNode_ControlRig_ExternalSource::ControlRig' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AccumulateFloatMul
// 0x0018 (0x0020 - 0x0008)
struct FRigUnit_AccumulateFloatMul final : public FRigUnit_SimBase
{
public:
	float                                         Multiplier;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialValue;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4576[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Result;                                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedValue;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4577[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_AccumulateFloatMul) == 0x000008, "Wrong alignment on FRigUnit_AccumulateFloatMul");
static_assert(sizeof(FRigUnit_AccumulateFloatMul) == 0x000020, "Wrong size on FRigUnit_AccumulateFloatMul");
static_assert(offsetof(FRigUnit_AccumulateFloatMul, Multiplier) == 0x000008, "Member 'FRigUnit_AccumulateFloatMul::Multiplier' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatMul, InitialValue) == 0x00000C, "Member 'FRigUnit_AccumulateFloatMul::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatMul, bIntegrateDeltaTime) == 0x000010, "Member 'FRigUnit_AccumulateFloatMul::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatMul, Result) == 0x000014, "Member 'FRigUnit_AccumulateFloatMul::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatMul, AccumulatedValue) == 0x000018, "Member 'FRigUnit_AccumulateFloatMul::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_BinaryVectorOp
// 0x0028 (0x0030 - 0x0008)
struct FRigUnit_BinaryVectorOp : public FRigUnit
{
public:
	struct FVector                                Argument0;                                         // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Argument1;                                         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Result;                                            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4578[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_BinaryVectorOp) == 0x000008, "Wrong alignment on FRigUnit_BinaryVectorOp");
static_assert(sizeof(FRigUnit_BinaryVectorOp) == 0x000030, "Wrong size on FRigUnit_BinaryVectorOp");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Argument0) == 0x000008, "Member 'FRigUnit_BinaryVectorOp::Argument0' has a wrong offset!");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Argument1) == 0x000014, "Member 'FRigUnit_BinaryVectorOp::Argument1' has a wrong offset!");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Result) == 0x000020, "Member 'FRigUnit_BinaryVectorOp::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_Divide_VectorVector
// 0x0000 (0x0030 - 0x0030)
struct FRigUnit_Divide_VectorVector final : public FRigUnit_BinaryVectorOp
{
};
static_assert(alignof(FRigUnit_Divide_VectorVector) == 0x000008, "Wrong alignment on FRigUnit_Divide_VectorVector");
static_assert(sizeof(FRigUnit_Divide_VectorVector) == 0x000030, "Wrong size on FRigUnit_Divide_VectorVector");

// ScriptStruct ControlRig.ControlRigComponentInstanceData
// 0x0008 (0x0060 - 0x0058)
struct FControlRigComponentInstanceData final : public FActorComponentInstanceData
{
public:
	class UControlRig*                            AnimControlRig;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigComponentInstanceData) == 0x000008, "Wrong alignment on FControlRigComponentInstanceData");
static_assert(sizeof(FControlRigComponentInstanceData) == 0x000060, "Wrong size on FControlRigComponentInstanceData");
static_assert(offsetof(FControlRigComponentInstanceData, AnimControlRig) == 0x000058, "Member 'FControlRigComponentInstanceData::AnimControlRig' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AccumulateFloatAdd
// 0x0018 (0x0020 - 0x0008)
struct FRigUnit_AccumulateFloatAdd final : public FRigUnit_SimBase
{
public:
	float                                         Increment;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialValue;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4579[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Result;                                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedValue;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_457A[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_AccumulateFloatAdd) == 0x000008, "Wrong alignment on FRigUnit_AccumulateFloatAdd");
static_assert(sizeof(FRigUnit_AccumulateFloatAdd) == 0x000020, "Wrong size on FRigUnit_AccumulateFloatAdd");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, Increment) == 0x000008, "Member 'FRigUnit_AccumulateFloatAdd::Increment' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, InitialValue) == 0x00000C, "Member 'FRigUnit_AccumulateFloatAdd::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, bIntegrateDeltaTime) == 0x000010, "Member 'FRigUnit_AccumulateFloatAdd::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, Result) == 0x000014, "Member 'FRigUnit_AccumulateFloatAdd::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateFloatAdd, AccumulatedValue) == 0x000018, "Member 'FRigUnit_AccumulateFloatAdd::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_MultiFABRIK_EndEffector
// 0x0014 (0x0014 - 0x0000)
struct FRigUnit_MultiFABRIK_EndEffector final
{
public:
	class FName                                   Bone;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_MultiFABRIK_EndEffector) == 0x000004, "Wrong alignment on FRigUnit_MultiFABRIK_EndEffector");
static_assert(sizeof(FRigUnit_MultiFABRIK_EndEffector) == 0x000014, "Wrong size on FRigUnit_MultiFABRIK_EndEffector");
static_assert(offsetof(FRigUnit_MultiFABRIK_EndEffector, Bone) == 0x000000, "Member 'FRigUnit_MultiFABRIK_EndEffector::Bone' has a wrong offset!");
static_assert(offsetof(FRigUnit_MultiFABRIK_EndEffector, Location) == 0x000008, "Member 'FRigUnit_MultiFABRIK_EndEffector::Location' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_AddBoneTransform
// 0x0050 (0x0070 - 0x0020)
struct FRigUnit_AddBoneTransform final : public FRigUnitMutable
{
public:
	class FName                                   Bone;                                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_457B[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0030(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPostMultiply;                                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_457C[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
