#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticLoadoutScreen

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.InitLayout
// 0x0080 (0x0080 - 0x0000)
struct CosmeticLoadoutScreen_C_InitLayout final
{
public:
	ECommonInputType                              InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77F6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77F7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77F8[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_4;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_5;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77F9[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              Temp_byte_Variable_6;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77FA[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_1;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FB[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button_2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CosmeticLoadoutScreen_C_InitLayout) == 0x000008, "Wrong alignment on CosmeticLoadoutScreen_C_InitLayout");
static_assert(sizeof(CosmeticLoadoutScreen_C_InitLayout) == 0x000080, "Wrong size on CosmeticLoadoutScreen_C_InitLayout");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, InputPin) == 0x000000, "Member 'CosmeticLoadoutScreen_C_InitLayout::InputPin' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_int_Variable) == 0x000004, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable) == 0x000008, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_float_Variable) == 0x00000C, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_float_Variable_1) == 0x000010, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_float_Variable_2) == 0x000014, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_float_Variable_3) == 0x000018, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_1) == 0x00001C, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_Select_Default) == 0x000020, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_MakeStruct_Margin) == 0x000024, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_2) == 0x000034, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_3) == 0x000035, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_4) == 0x000036, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_5) == 0x000037, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_int_Variable_1) == 0x000038, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_Select_Default_1) == 0x00003C, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_int_Variable_2) == 0x000040, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_int_Variable_3) == 0x000044, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000048, "Member 'CosmeticLoadoutScreen_C_InitLayout::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000050, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, Temp_byte_Variable_6) == 0x000059, "Member 'CosmeticLoadoutScreen_C_InitLayout::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_AsIcon_Text_Button_1) == 0x000060, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_AsIcon_Text_Button_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_Select_Default_2) == 0x00006C, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_AsIcon_Text_Button_2) == 0x000070, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_AsIcon_Text_Button_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_InitLayout, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'CosmeticLoadoutScreen_C_InitLayout::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutScreen_C_OnInputMethodChanged_Event final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutScreen_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on CosmeticLoadoutScreen_C_OnInputMethodChanged_Event");
static_assert(sizeof(CosmeticLoadoutScreen_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on CosmeticLoadoutScreen_C_OnInputMethodChanged_Event");
static_assert(offsetof(CosmeticLoadoutScreen_C_OnInputMethodChanged_Event, bNewInputType) == 0x000000, "Member 'CosmeticLoadoutScreen_C_OnInputMethodChanged_Event::bNewInputType' has a wrong offset!");

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.OnPreviewTile
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutScreen_C_OnPreviewTile final
{
public:
	EFortLoadoutCardType                          CardType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutScreen_C_OnPreviewTile) == 0x000001, "Wrong alignment on CosmeticLoadoutScreen_C_OnPreviewTile");
static_assert(sizeof(CosmeticLoadoutScreen_C_OnPreviewTile) == 0x000001, "Wrong size on CosmeticLoadoutScreen_C_OnPreviewTile");
static_assert(offsetof(CosmeticLoadoutScreen_C_OnPreviewTile, CardType) == 0x000000, "Member 'CosmeticLoadoutScreen_C_OnPreviewTile::CardType' has a wrong offset!");

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.OnFlavorForScreenMode
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutScreen_C_OnFlavorForScreenMode final
{
public:
	EFortCosmeticLoadoutScreenMode                NewMode;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutScreen_C_OnFlavorForScreenMode) == 0x000001, "Wrong alignment on CosmeticLoadoutScreen_C_OnFlavorForScreenMode");
static_assert(sizeof(CosmeticLoadoutScreen_C_OnFlavorForScreenMode) == 0x000001, "Wrong size on CosmeticLoadoutScreen_C_OnFlavorForScreenMode");
static_assert(offsetof(CosmeticLoadoutScreen_C_OnFlavorForScreenMode, NewMode) == 0x000000, "Member 'CosmeticLoadoutScreen_C_OnFlavorForScreenMode::NewMode' has a wrong offset!");

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CosmeticLoadoutScreen_C_PreConstruct) == 0x000001, "Wrong alignment on CosmeticLoadoutScreen_C_PreConstruct");
static_assert(sizeof(CosmeticLoadoutScreen_C_PreConstruct) == 0x000001, "Wrong size on CosmeticLoadoutScreen_C_PreConstruct");
static_assert(offsetof(CosmeticLoadoutScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CosmeticLoadoutScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CosmeticLoadoutScreen.CosmeticLoadoutScreen_C.ExecuteUbergraph_CosmeticLoadoutScreen
// 0x00A8 (0x00A8 - 0x0000)
struct CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77FC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	EFortCosmeticLoadoutScreenMode                Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCosmeticLoadoutScreenMode                Temp_byte_Variable_3;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77FD[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleFeatured_YellowButton_C*         K2Node_DynamicCast_AsSimple_Featured_Yellow_Button; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCosmeticLoadoutScreenMode                Temp_byte_Variable_4;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLoadoutCardType                          K2Node_Event_CardType;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FE[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCosmeticLoadoutScreenMode                K2Node_Event_NewMode;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77FF[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0060(0x0018)(ConstParm)
	class FText                                   K2Node_Select_Default_2;                           // 0x0078(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0090(0x0018)()
};
static_assert(alignof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen) == 0x000008, "Wrong alignment on CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen");
static_assert(sizeof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen) == 0x0000A8, "Wrong size on CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, EntryPoint) == 0x000000, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_text_Variable) == 0x000008, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_text_Variable_1) == 0x000020, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_byte_Variable) == 0x000038, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_bool_Variable) == 0x000039, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_byte_Variable_1) == 0x00003A, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_byte_Variable_2) == 0x00003B, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_byte_Variable_3) == 0x00003C, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_DynamicCast_AsSimple_Featured_Yellow_Button) == 0x000040, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_DynamicCast_AsSimple_Featured_Yellow_Button' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_CustomEvent_bNewInputType) == 0x000049, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, Temp_byte_Variable_4) == 0x00004A, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Event_CardType) == 0x00004B, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Event_CardType' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004C, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Select_Default) == 0x000058, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Event_NewMode) == 0x000059, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Event_NewMode' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Event_IsDesignTime) == 0x00005A, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Select_Default_1) == 0x000060, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Select_Default_2) == 0x000078, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen, K2Node_Select_Default_3) == 0x000090, "Member 'CosmeticLoadoutScreen_C_ExecuteUbergraph_CosmeticLoadoutScreen::K2Node_Select_Default_3' has a wrong offset!");

}

