#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ChannelBrowser

#include "Basic.hpp"

#include "ChannelBrowserDetails_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChannelBrowserChannelStruct_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "ChannelBrowserItemStruct_structs.hpp"


namespace SDK::Params
{

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.ExecuteUbergraph_Cr_ChannelBrowser
// 0x00F8 (0x00F8 - 0x0000)
struct Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5996[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_AssociatedButton;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ButtonIndex;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5997[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroup*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_inActor;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5998[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserChTile_C*                  K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5999[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroup*                     CallFunc_SpawnObject_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_AssociatedButton;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599A[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue_1;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599B[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue_2;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599C[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue_3;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599D[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserChTile_C*                  K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599E[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserDeviceTile_C*              K2Node_DynamicCast_AsCr_Ch_Browser_Device_Tile;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser");
static_assert(sizeof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser) == 0x0000F8, "Wrong size on Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, EntryPoint) == 0x000000, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_Button_3) == 0x000008, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_AssociatedButton) == 0x000018, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_AssociatedButton' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_ButtonIndex) == 0x000020, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CustomEvent_inActor) == 0x000040, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CustomEvent_inActor' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_HasAnyChildren_ReturnValue) == 0x000048, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_GetChildAt_ReturnValue) == 0x000050, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile) == 0x000058, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_SpawnObject_ReturnValue_1) == 0x000068, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CustomEvent_AssociatedButton) == 0x000070, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CustomEvent_AssociatedButton' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CustomEvent_ButtonIndex) == 0x000078, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_SwitchInteger_CmpSuccess) == 0x00007C, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000090, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_Button_1) == 0x000098, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_ComponentBoundEvent_Button) == 0x0000A0, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_HasAnyChildren_ReturnValue_1) == 0x0000A8, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_HasAnyChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CustomEvent_bNewInputType) == 0x0000A9, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_HasAnyChildren_ReturnValue_2) == 0x0000BC, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_HasAnyChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000BD, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_GetChildAt_ReturnValue_1) == 0x0000C0, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_HasAnyChildren_ReturnValue_3) == 0x0000C8, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_HasAnyChildren_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile_1) == 0x0000D0, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_IsValid_ReturnValue_1) == 0x0000D9, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_GetChildAt_ReturnValue_2) == 0x0000E0, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_AsCr_Ch_Browser_Device_Tile) == 0x0000E8, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_AsCr_Ch_Browser_Device_Tile' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser, CallFunc_IsValid_ReturnValue_2) == 0x0000F1, "Member 'Cr_ChannelBrowser_C_ExecuteUbergraph_Cr_ChannelBrowser::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.OnInputMethodChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0 final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong alignment on Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0");
static_assert(sizeof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong size on Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0");
static_assert(offsetof(Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0, bNewInputType) == 0x000000, "Member 'Cr_ChannelBrowser_C_OnInputMethodChanged_Event_0::bNewInputType' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Cr_ChannelBrowser_C_BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct Cr_ChannelBrowser_C_CustomEvent_0 final
{
public:
	class UCommonButton*                          AssociatedButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_CustomEvent_0) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_CustomEvent_0");
static_assert(sizeof(Cr_ChannelBrowser_C_CustomEvent_0) == 0x000010, "Wrong size on Cr_ChannelBrowser_C_CustomEvent_0");
static_assert(offsetof(Cr_ChannelBrowser_C_CustomEvent_0, AssociatedButton) == 0x000000, "Member 'Cr_ChannelBrowser_C_CustomEvent_0::AssociatedButton' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_CustomEvent_0, ButtonIndex) == 0x000008, "Member 'Cr_ChannelBrowser_C_CustomEvent_0::ButtonIndex' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.TeleportToActor
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_TeleportToActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_TeleportToActor) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_TeleportToActor");
static_assert(sizeof(Cr_ChannelBrowser_C_TeleportToActor) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_TeleportToActor");
static_assert(offsetof(Cr_ChannelBrowser_C_TeleportToActor, InActor) == 0x000000, "Member 'Cr_ChannelBrowser_C_TeleportToActor::InActor' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature final
{
public:
	class UCommonButton*                          AssociatedButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature");
static_assert(sizeof(Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature) == 0x000010, "Wrong size on Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature, AssociatedButton) == 0x000000, "Member 'Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature::AssociatedButton' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature, ButtonIndex) == 0x000008, "Member 'Cr_ChannelBrowser_C_BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature::ButtonIndex' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Cr_ChannelBrowser_C_BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Cr_ChannelBrowser_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PopulateDevicesByChannel
// 0x01C8 (0x01C8 - 0x0000)
struct Cr_ChannelBrowser_C_PopulateDevicesByChannel final
{
public:
	int32                                         TargetChannel;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGoodToAdd;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              DvTileWidget;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A0[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A1[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A2[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserItemStruct              CallFunc_Array_Get_Item;                           // 0x00B0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A3[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A4[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A5[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_2;                         // 0x0140(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A6[0x1];                                     // 0x0167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0168(0x0018)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A7[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A8[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cr_ChannelBrowser_C_PopulateDevicesByChannel) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_PopulateDevicesByChannel");
static_assert(sizeof(Cr_ChannelBrowser_C_PopulateDevicesByChannel) == 0x0001C8, "Wrong size on Cr_ChannelBrowser_C_PopulateDevicesByChannel");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, TargetChannel) == 0x000000, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::TargetChannel' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, bGoodToAdd) == 0x000004, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::bGoodToAdd' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, DvTileWidget) == 0x000008, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::DvTileWidget' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeArray_Array) == 0x000058, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Format_ReturnValue) == 0x000070, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Array_Index_Variable_2) == 0x000090, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00011C, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Conv_IntToText_ReturnValue) == 0x000120, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_BooleanOR_ReturnValue) == 0x000138, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Array_Length_ReturnValue_2) == 0x000160, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000164, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue_1) == 0x000165, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_BooleanOR_ReturnValue_1) == 0x000166, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000168, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_MakeStruct_Margin) == 0x000180, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000190, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, Temp_int_Loop_Counter_Variable_2) == 0x000198, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Create_ReturnValue) == 0x0001A0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001A8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001AC, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, CallFunc_AddChild_ReturnValue) == 0x0001B0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x0001B8, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateDevicesByChannel, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'Cr_ChannelBrowser_C_PopulateDevicesByChannel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PopulateChannelsInUse
// 0x00A8 (0x00A8 - 0x0000)
struct Cr_ChannelBrowser_C_PopulateChannelsInUse final
{
public:
	int32                                         NumReceiving;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumTransmitting;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChannelToTest;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGoodToAdd;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A9[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCr_ChBrowserDeviceTile_C*              DvTileWidget;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AA[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserChTile_C*                  K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AB[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AC[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0078(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ChBrowserChTile_C*                  CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cr_ChannelBrowser_C_PopulateChannelsInUse) == 0x000008, "Wrong alignment on Cr_ChannelBrowser_C_PopulateChannelsInUse");
static_assert(sizeof(Cr_ChannelBrowser_C_PopulateChannelsInUse) == 0x0000A8, "Wrong size on Cr_ChannelBrowser_C_PopulateChannelsInUse");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, NumReceiving) == 0x000000, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::NumReceiving' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, NumTransmitting) == 0x000004, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::NumTransmitting' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, Style) == 0x000008, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::Style' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, ChannelToTest) == 0x000010, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::ChannelToTest' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, bGoodToAdd) == 0x000014, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::bGoodToAdd' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, DvTileWidget) == 0x000018, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::DvTileWidget' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToBool_ReturnValue) == 0x000054, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetChildAt_ReturnValue) == 0x000058, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile) == 0x000060, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::K2Node_DynamicCast_AsCr_Ch_Browser_Ch_Tile' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_HasAnyChildren_ReturnValue) == 0x00006A, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, Temp_int_Variable) == 0x00006C, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000078, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_Create_ReturnValue) == 0x000098, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChannelBrowser_C_PopulateChannelsInUse, CallFunc_AddChild_ReturnValue) == 0x0000A0, "Member 'Cr_ChannelBrowser_C_PopulateChannelsInUse::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function Cr_ChannelBrowser.Cr_ChannelBrowser_C.PrintDebugData
// 0x01A0 (0x01A0 - 0x0000)
struct Cr_ChannelBrowser_C_PrintDebugData final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AD[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserItemStruct              CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AE[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AF[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FChannelBrowserChannelStruct           CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0020)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59B0[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
