#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ChBrowserChTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cr_ChBrowserChTile.Cr_ChBrowserChTile_C
// 0x0040 (0x0BB0 - 0x0B70)
class UCr_ChBrowserChTile_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Selection_Hover;                             // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_InputAction;                               // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Channel;                                      // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RxNum;                                        // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TxNum;                                        // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChNumber;                                          // 0x0BA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NumTrasmittingDevices;                             // 0x0BA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NumReceivingDevices;                               // 0x0BA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Cr_ChBrowserChTile(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnDeselected();
	void BP_OnSelected();
	void Populate(const class FText& InName, const class FText& InTX, const class FText& InRX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cr_ChBrowserChTile_C">();
	}
	static class UCr_ChBrowserChTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCr_ChBrowserChTile_C>();
	}
};
static_assert(alignof(UCr_ChBrowserChTile_C) == 0x000008, "Wrong alignment on UCr_ChBrowserChTile_C");
static_assert(sizeof(UCr_ChBrowserChTile_C) == 0x000BB0, "Wrong size on UCr_ChBrowserChTile_C");
static_assert(offsetof(UCr_ChBrowserChTile_C, UberGraphFrame) == 0x000B70, "Member 'UCr_ChBrowserChTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, Image_Selection_Hover) == 0x000B78, "Member 'UCr_ChBrowserChTile_C::Image_Selection_Hover' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, Overlay_InputAction) == 0x000B80, "Member 'UCr_ChBrowserChTile_C::Overlay_InputAction' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, Text_Channel) == 0x000B88, "Member 'UCr_ChBrowserChTile_C::Text_Channel' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, Text_RxNum) == 0x000B90, "Member 'UCr_ChBrowserChTile_C::Text_RxNum' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, Text_TxNum) == 0x000B98, "Member 'UCr_ChBrowserChTile_C::Text_TxNum' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, ChNumber) == 0x000BA0, "Member 'UCr_ChBrowserChTile_C::ChNumber' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, NumTrasmittingDevices) == 0x000BA4, "Member 'UCr_ChBrowserChTile_C::NumTrasmittingDevices' has a wrong offset!");
static_assert(offsetof(UCr_ChBrowserChTile_C, NumReceivingDevices) == 0x000BA8, "Member 'UCr_ChBrowserChTile_C::NumReceivingDevices' has a wrong offset!");

}

