#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ChannelBrowser

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "ChannelBrowserItemStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cr_ChannelBrowser.Cr_ChannelBrowser_C
// 0x01B0 (0x0488 - 0x02D8)
class UCr_ChannelBrowser_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoloButton_C*                          Button_Close;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Scan;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Empty;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_HeaderDevices;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Channels;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_HeaderCh;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backplate;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Spinner;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AllDevices;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SelectTags;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_AllDevices;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Ch;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Dv;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_Ch;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_Dv;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Creator;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton_Left;                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton_Right;                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Close;                                             // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FChannelBrowserItemStruct>      DeviceData;                                        // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UCommonButtonGroup*                     ChannelButtonGroup;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ChTxCount;                                         // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 ChRxCount;                                         // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class AActor*, class FText>              AllDevices;                                        // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UCommonButtonGroup*                     TabButtonGroup;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayTagContainer*              Valid_Device_Tags;                                 // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UClass*, class FText>              ClassDisplayNameMap;                               // 0x0428(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Invalid_Class_List;                                // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Close__DelegateSignature();
	void ExecuteUbergraph_Cr_ChannelBrowser(int32 EntryPoint);
	void OnInputMethodChanged_Event_0(ECommonInputType bNewInputType);
	void BndEvt__UserActionMenuInputButton_Right_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__UserActionMenuInputButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Tab1Selected();
	void Tab0Selected();
	void CustomEvent_0(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void TeleportToActor(class AActor* InActor);
	void BndEvt__ChannelButtonGroup_K2Node_ComponentBoundEvent_5_SimpleButtonGroupDelegate__DelegateSignature(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void Construct();
	void BndEvt__Button_CommitTags_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Scan();
	void PopulateDevicesByChannel(int32 TargetChannel);
	void PopulateChannelsInUse();
	void PrintDebugData();
	void HandleChannelSelect(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void BuildActorArray();
	void BuildChannelArray();
	void UpdateChannelArray(int32 Channel, int32 TxDelta, int32 RxDelta);
	void Handle_CloseUI();
	void HandleAllDevicesView();
	void GetAllDevices();
	void Get_Actor_Name(class AActor* Actor, bool* HasName, class FText* Actor_Name);
	void Generate_Class_to_Name_Map();
	void Set_Target_Channel_Count(TArray<int32>& Array, int32 Param_Index, int32& Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cr_ChannelBrowser_C">();
	}
	static class UCr_ChannelBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCr_ChannelBrowser_C>();
	}
};
static_assert(alignof(UCr_ChannelBrowser_C) == 0x000008, "Wrong alignment on UCr_ChannelBrowser_C");
static_assert(sizeof(UCr_ChannelBrowser_C) == 0x000488, "Wrong size on UCr_ChannelBrowser_C");
static_assert(offsetof(UCr_ChannelBrowser_C, UberGraphFrame) == 0x0002D8, "Member 'UCr_ChannelBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Button_Close) == 0x0002E0, "Member 'UCr_ChannelBrowser_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Button_Scan) == 0x0002E8, "Member 'UCr_ChannelBrowser_C::Button_Scan' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, CommonTextBlock_Empty) == 0x0002F0, "Member 'UCr_ChannelBrowser_C::CommonTextBlock_Empty' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, CommonTextBlock_HeaderDevices) == 0x0002F8, "Member 'UCr_ChannelBrowser_C::CommonTextBlock_HeaderDevices' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, HorizontalBox_Channels) == 0x000300, "Member 'UCr_ChannelBrowser_C::HorizontalBox_Channels' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, HorizontalBox_HeaderCh) == 0x000308, "Member 'UCr_ChannelBrowser_C::HorizontalBox_HeaderCh' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Image_Backplate) == 0x000310, "Member 'UCr_ChannelBrowser_C::Image_Backplate' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Image_Spinner) == 0x000318, "Member 'UCr_ChannelBrowser_C::Image_Spinner' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Lightbox) == 0x000320, "Member 'UCr_ChannelBrowser_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Overlay_AllDevices) == 0x000328, "Member 'UCr_ChannelBrowser_C::Overlay_AllDevices' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Overlay_SelectTags) == 0x000330, "Member 'UCr_ChannelBrowser_C::Overlay_SelectTags' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ScrollBox_AllDevices) == 0x000338, "Member 'UCr_ChannelBrowser_C::ScrollBox_AllDevices' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ScrollBox_Ch) == 0x000340, "Member 'UCr_ChannelBrowser_C::ScrollBox_Ch' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ScrollBox_Dv) == 0x000348, "Member 'UCr_ChannelBrowser_C::ScrollBox_Dv' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Switcher) == 0x000350, "Member 'UCr_ChannelBrowser_C::Switcher' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Tab_Ch) == 0x000358, "Member 'UCr_ChannelBrowser_C::Tab_Ch' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Tab_Dv) == 0x000360, "Member 'UCr_ChannelBrowser_C::Tab_Dv' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Text_Creator) == 0x000368, "Member 'UCr_ChannelBrowser_C::Text_Creator' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, UserActionMenuInputButton_Left) == 0x000370, "Member 'UCr_ChannelBrowser_C::UserActionMenuInputButton_Left' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, UserActionMenuInputButton_Right) == 0x000378, "Member 'UCr_ChannelBrowser_C::UserActionMenuInputButton_Right' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Close) == 0x000380, "Member 'UCr_ChannelBrowser_C::Close' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, DeviceData) == 0x000390, "Member 'UCr_ChannelBrowser_C::DeviceData' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ChannelButtonGroup) == 0x0003A0, "Member 'UCr_ChannelBrowser_C::ChannelButtonGroup' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ChTxCount) == 0x0003A8, "Member 'UCr_ChannelBrowser_C::ChTxCount' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ChRxCount) == 0x0003B8, "Member 'UCr_ChannelBrowser_C::ChRxCount' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, AllDevices) == 0x0003C8, "Member 'UCr_ChannelBrowser_C::AllDevices' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, TabButtonGroup) == 0x000418, "Member 'UCr_ChannelBrowser_C::TabButtonGroup' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Valid_Device_Tags) == 0x000420, "Member 'UCr_ChannelBrowser_C::Valid_Device_Tags' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, ClassDisplayNameMap) == 0x000428, "Member 'UCr_ChannelBrowser_C::ClassDisplayNameMap' has a wrong offset!");
static_assert(offsetof(UCr_ChannelBrowser_C, Invalid_Class_List) == 0x000478, "Member 'UCr_ChannelBrowser_C::Invalid_Class_List' has a wrong offset!");

}

