#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ChBrowserChTile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cr_ChBrowserChTile.Cr_ChBrowserChTile_C.ExecuteUbergraph_Cr_ChBrowserChTile
// 0x0018 (0x0018 - 0x0000)
struct Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile) == 0x000004, "Wrong alignment on Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile");
static_assert(sizeof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile) == 0x000018, "Wrong size on Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile");
static_assert(offsetof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile, EntryPoint) == 0x000000, "Member 'Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile, CallFunc_GetSelected_ReturnValue) == 0x000014, "Member 'Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile, CallFunc_GetSelected_ReturnValue_1) == 0x000015, "Member 'Cr_ChBrowserChTile_C_ExecuteUbergraph_Cr_ChBrowserChTile::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");

// Function Cr_ChBrowserChTile.Cr_ChBrowserChTile_C.Populate
// 0x0048 (0x0048 - 0x0000)
struct Cr_ChBrowserChTile_C_Populate final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InTX;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InRX;                                              // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Cr_ChBrowserChTile_C_Populate) == 0x000008, "Wrong alignment on Cr_ChBrowserChTile_C_Populate");
static_assert(sizeof(Cr_ChBrowserChTile_C_Populate) == 0x000048, "Wrong size on Cr_ChBrowserChTile_C_Populate");
static_assert(offsetof(Cr_ChBrowserChTile_C_Populate, InName) == 0x000000, "Member 'Cr_ChBrowserChTile_C_Populate::InName' has a wrong offset!");
static_assert(offsetof(Cr_ChBrowserChTile_C_Populate, InTX) == 0x000018, "Member 'Cr_ChBrowserChTile_C_Populate::InTX' has a wrong offset!");
static_assert(offsetof(Cr_ChBrowserChTile_C_Populate, InRX) == 0x000030, "Member 'Cr_ChBrowserChTile_C_Populate::InRX' has a wrong offset!");

}

