#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cr_ItemTag

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Cr_ItemTag.Cr_ItemTag_C.Update
// 0x0018 (0x0018 - 0x0000)
struct Cr_ItemTag_C_Update final
{
public:
	class FText                                   InTagText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Cr_ItemTag_C_Update) == 0x000008, "Wrong alignment on Cr_ItemTag_C_Update");
static_assert(sizeof(Cr_ItemTag_C_Update) == 0x000018, "Wrong size on Cr_ItemTag_C_Update");
static_assert(offsetof(Cr_ItemTag_C_Update, InTagText) == 0x000000, "Member 'Cr_ItemTag_C_Update::InTagText' has a wrong offset!");

// Function Cr_ItemTag.Cr_ItemTag_C.HandleStyling
// 0x0028 (0x0028 - 0x0000)
struct Cr_ItemTag_C_HandleStyling final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(Cr_ItemTag_C_HandleStyling) == 0x000008, "Wrong alignment on Cr_ItemTag_C_HandleStyling");
static_assert(sizeof(Cr_ItemTag_C_HandleStyling) == 0x000028, "Wrong size on Cr_ItemTag_C_HandleStyling");
static_assert(offsetof(Cr_ItemTag_C_HandleStyling, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'Cr_ItemTag_C_HandleStyling::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function Cr_ItemTag.Cr_ItemTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Cr_ItemTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cr_ItemTag_C_PreConstruct) == 0x000001, "Wrong alignment on Cr_ItemTag_C_PreConstruct");
static_assert(sizeof(Cr_ItemTag_C_PreConstruct) == 0x000001, "Wrong size on Cr_ItemTag_C_PreConstruct");
static_assert(offsetof(Cr_ItemTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Cr_ItemTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Cr_ItemTag.Cr_ItemTag_C.ExecuteUbergraph_Cr_ItemTag
// 0x0008 (0x0008 - 0x0000)
struct Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag) == 0x000004, "Wrong alignment on Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag");
static_assert(sizeof(Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag) == 0x000008, "Wrong size on Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag");
static_assert(offsetof(Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag, EntryPoint) == 0x000000, "Member 'Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Cr_ItemTag_C_ExecuteUbergraph_Cr_ItemTag::K2Node_Event_IsDesignTime' has a wrong offset!");

}

