#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativePortalHUDSwitcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativePortalHUDSwitcher.CreativePortalHUDSwitcher_C
// 0x0028 (0x0258 - 0x0230)
class UCreativePortalHUDSwitcher_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCreativePortalCodeScreenHUDDetails_C*  CreativePortalCodeScreenHUDDetails;                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativePortalHUDDetails_C*            CreativePortalHUDDetails;                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PortalHUDSwitcher;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABGA_IslandPortal_C*                    MyBGAIslandPortal;                                 // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupPortalEventBinding(class ABGA_IslandPortal_C* InPortal, bool bBind);
	void SetActivePortalDisplayWidget(bool bIsLookingAtCodeScreen);
	void InitFromObject(class UObject* InitObject);
	void PlayIntro();
	void ExecuteUbergraph_CreativePortalHUDSwitcher(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativePortalHUDSwitcher_C">();
	}
	static class UCreativePortalHUDSwitcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativePortalHUDSwitcher_C>();
	}
};
static_assert(alignof(UCreativePortalHUDSwitcher_C) == 0x000008, "Wrong alignment on UCreativePortalHUDSwitcher_C");
static_assert(sizeof(UCreativePortalHUDSwitcher_C) == 0x000258, "Wrong size on UCreativePortalHUDSwitcher_C");
static_assert(offsetof(UCreativePortalHUDSwitcher_C, UberGraphFrame) == 0x000230, "Member 'UCreativePortalHUDSwitcher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativePortalHUDSwitcher_C, CreativePortalCodeScreenHUDDetails) == 0x000238, "Member 'UCreativePortalHUDSwitcher_C::CreativePortalCodeScreenHUDDetails' has a wrong offset!");
static_assert(offsetof(UCreativePortalHUDSwitcher_C, CreativePortalHUDDetails) == 0x000240, "Member 'UCreativePortalHUDSwitcher_C::CreativePortalHUDDetails' has a wrong offset!");
static_assert(offsetof(UCreativePortalHUDSwitcher_C, PortalHUDSwitcher) == 0x000248, "Member 'UCreativePortalHUDSwitcher_C::PortalHUDSwitcher' has a wrong offset!");
static_assert(offsetof(UCreativePortalHUDSwitcher_C, MyBGAIslandPortal) == 0x000250, "Member 'UCreativePortalHUDSwitcher_C::MyBGAIslandPortal' has a wrong offset!");

}

