#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMiniGameMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeMiniGameMessage.CreativeMiniGameMessage_C
// 0x0048 (0x02E0 - 0x0298)
class UCreativeMiniGameMessage_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCreativeMiniGameInfoWidget_C*          CreativeMiniGameInfoWidget;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShouldShowMessage;                                // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bOnIsland;                                         // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7024[0x6];                                     // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           VolumeBindingHandler;                              // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TryAttempts;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                MobilePadding;                                     // 0x02BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                DefaultPadding;                                    // 0x02CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	class AFortMinigame* GetMinigameHelper(class AFortVolume* VolumeToCheck);
	void ShouldRetry(bool* bShouldRetry);
	void FinishVolumeBinding();
	void HandleLoadingScreenChanged(class AFortPlayerControllerAthena* PlayerController, bool bEnabled, const class FText& HUDReasonText);
	void SetVisibilityForPublishedIslands(class AFortMinigame* MinigameToCheck, bool* bIsVisible);
	void Construct();
	void Destruct();
	void BindMiniGameEvents(class AFortVolume* MinigameVolume);
	void UnBindMiniGameEvents();
	void OnLeaveIsland(class AFortPlayerPawn* PlayerPawn);
	void OnEnterVolume(class APlayerState* Client, class AFortVolume* Volume);
	void DisableMessage();
	void UnbindGlobalEvents();
	void BindGlobalEvents();
	void OnMinigameStateChanged(class AFortMinigame* ChangedMinigame, EFortMinigameState MinigameState);
	void OnStartingGame();
	void TrySetup();
	void UpdateVisibility(class AFortMinigame* MinigameToCheck);
	void ExecuteUbergraph_CreativeMiniGameMessage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeMiniGameMessage_C">();
	}
	static class UCreativeMiniGameMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeMiniGameMessage_C>();
	}
};
static_assert(alignof(UCreativeMiniGameMessage_C) == 0x000008, "Wrong alignment on UCreativeMiniGameMessage_C");
static_assert(sizeof(UCreativeMiniGameMessage_C) == 0x0002E0, "Wrong size on UCreativeMiniGameMessage_C");
static_assert(offsetof(UCreativeMiniGameMessage_C, UberGraphFrame) == 0x000298, "Member 'UCreativeMiniGameMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, CreativeMiniGameInfoWidget) == 0x0002A0, "Member 'UCreativeMiniGameMessage_C::CreativeMiniGameInfoWidget' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, bShouldShowMessage) == 0x0002A8, "Member 'UCreativeMiniGameMessage_C::bShouldShowMessage' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, bOnIsland) == 0x0002A9, "Member 'UCreativeMiniGameMessage_C::bOnIsland' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, VolumeBindingHandler) == 0x0002B0, "Member 'UCreativeMiniGameMessage_C::VolumeBindingHandler' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, TryAttempts) == 0x0002B8, "Member 'UCreativeMiniGameMessage_C::TryAttempts' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, MobilePadding) == 0x0002BC, "Member 'UCreativeMiniGameMessage_C::MobilePadding' has a wrong offset!");
static_assert(offsetof(UCreativeMiniGameMessage_C, DefaultPadding) == 0x0002CC, "Member 'UCreativeMiniGameMessage_C::DefaultPadding' has a wrong offset!");

}

