#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMinigameInfoMappanelWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CreativeMinigameInfoMappanelWidget.CreativeMinigameInfoMapPanelWidget_C.SetVisiblityBasedOnText
// 0x0038 (0x0038 - 0x0000)
struct CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText final
{
public:
	class UWidget*                                Element;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextSetting;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B69[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText) == 0x000008, "Wrong alignment on CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText");
static_assert(sizeof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText) == 0x000038, "Wrong size on CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, Element) == 0x000000, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::Element' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, TextSetting) == 0x000008, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::TextSetting' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, Temp_bool_Variable) == 0x000010, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, Temp_byte_Variable) == 0x000030, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, CallFunc_TextIsEmpty_ReturnValue) == 0x000031, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, Temp_byte_Variable_1) == 0x000032, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText, K2Node_Select_Default) == 0x000033, "Member 'CreativeMinigameInfoMapPanelWidget_C_SetVisiblityBasedOnText::K2Node_Select_Default' has a wrong offset!");

// Function CreativeMinigameInfoMappanelWidget.CreativeMinigameInfoMapPanelWidget_C.ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget
// 0x0040 (0x0040 - 0x0000)
struct CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B6A[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0020(0x0018)()
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget) == 0x000008, "Wrong alignment on CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget");
static_assert(sizeof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget) == 0x000040, "Wrong size on CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, EntryPoint) == 0x000000, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, Temp_bool_Variable) == 0x000004, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, Temp_byte_Variable) == 0x000005, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, Temp_byte_Variable_1) == 0x000006, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, CallFunc_GetText_ReturnValue_1) == 0x000020, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x000038, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget, K2Node_Select_Default) == 0x000039, "Member 'CreativeMinigameInfoMapPanelWidget_C_ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget::K2Node_Select_Default' has a wrong offset!");

}

