#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptions

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CreativeServerOptions.CreativeServerOptions_C.BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptions_C_BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptions.CreativeServerOptions_C.BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptions_C_BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptions.CreativeServerOptions_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CreativeServerOptions_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeServerOptions_C_PreConstruct) == 0x000001, "Wrong alignment on CreativeServerOptions_C_PreConstruct");
static_assert(sizeof(CreativeServerOptions_C_PreConstruct) == 0x000001, "Wrong size on CreativeServerOptions_C_PreConstruct");
static_assert(offsetof(CreativeServerOptions_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CreativeServerOptions_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CreativeServerOptions.CreativeServerOptions_C.ExecuteUbergraph_CreativeServerOptions
// 0x0070 (0x0070 - 0x0000)
struct CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C62[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C63[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C64[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C65[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C66[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C67[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions) == 0x000008, "Wrong alignment on CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions");
static_assert(sizeof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions) == 0x000070, "Wrong size on CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, EntryPoint) == 0x000000, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_byte_Variable) == 0x000004, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_bool_Variable) == 0x00000D, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_float_Variable) == 0x000010, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_byte_Variable_1) == 0x000014, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_bool_Variable_1) == 0x000015, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_byte_Variable_2) == 0x000016, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_Select_Default) == 0x000017, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_byte_Variable_3) == 0x000018, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_IsMobileGame_ReturnValue) == 0x000030, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_PauseAnimation_ReturnValue) == 0x000034, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_GetStartTime_ReturnValue) == 0x000038, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_PauseAnimation_ReturnValue_1) == 0x00003C, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_GetEndTime_ReturnValue) == 0x000050, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_Select_Default_1) == 0x000058, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, Temp_bool_Variable_2) == 0x000068, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions, K2Node_Select_Default_2) == 0x000069, "Member 'CreativeServerOptions_C_ExecuteUbergraph_CreativeServerOptions::K2Node_Select_Default_2' has a wrong offset!");

// Function CreativeServerOptions.CreativeServerOptions_C.OnSelectedServerChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature final
{
public:
	class UFortCreativeServerInfo*                ServerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature");
static_assert(sizeof(CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature");
static_assert(offsetof(CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature, ServerInfo) == 0x000000, "Member 'CreativeServerOptions_C_OnSelectedServerChanged__DelegateSignature::ServerInfo' has a wrong offset!");

}

