#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeAffiliatePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeAffiliatePanel.CreativeAffiliatePanel_C
// 0x0040 (0x0488 - 0x0448)
class UCreativeAffiliatePanel_C final : public UFortCreativeAffiliatePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAffiliateKeyModal_C*                   AffiliateKeyModal;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             OpenMenuSound;                                     // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CloseMenuSound;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPanelClose;                                      // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetAffiliateName(const class FText& AffiliateName);
	void Close();
	void BP_OnDeactivated();
	void ButtonClicked(class UCommonButton* Button);
	void PopupClosed();
	void BP_OnActivated();
	void InitFromObject(class UObject* InitObject);
	void On_Success();
	void ExecuteUbergraph_CreativeAffiliatePanel(int32 EntryPoint);
	void OnSuccess__DelegateSignature();
	void OnPanelClose__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeAffiliatePanel_C">();
	}
	static class UCreativeAffiliatePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeAffiliatePanel_C>();
	}
};
static_assert(alignof(UCreativeAffiliatePanel_C) == 0x000008, "Wrong alignment on UCreativeAffiliatePanel_C");
static_assert(sizeof(UCreativeAffiliatePanel_C) == 0x000488, "Wrong size on UCreativeAffiliatePanel_C");
static_assert(offsetof(UCreativeAffiliatePanel_C, UberGraphFrame) == 0x000448, "Member 'UCreativeAffiliatePanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeAffiliatePanel_C, AffiliateKeyModal) == 0x000450, "Member 'UCreativeAffiliatePanel_C::AffiliateKeyModal' has a wrong offset!");
static_assert(offsetof(UCreativeAffiliatePanel_C, OpenMenuSound) == 0x000458, "Member 'UCreativeAffiliatePanel_C::OpenMenuSound' has a wrong offset!");
static_assert(offsetof(UCreativeAffiliatePanel_C, CloseMenuSound) == 0x000460, "Member 'UCreativeAffiliatePanel_C::CloseMenuSound' has a wrong offset!");
static_assert(offsetof(UCreativeAffiliatePanel_C, OnPanelClose) == 0x000468, "Member 'UCreativeAffiliatePanel_C::OnPanelClose' has a wrong offset!");
static_assert(offsetof(UCreativeAffiliatePanel_C, OnSuccess) == 0x000478, "Member 'UCreativeAffiliatePanel_C::OnSuccess' has a wrong offset!");

}

