#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativePortalInfoHUDDisplay

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.SetupInteraction
// 0x0070 (0x0070 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_SetupInteraction final
{
public:
	bool                                          bKeybindWidgetVisible;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortKeybindForcedHoldStatus                  Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortKeybindForcedHoldStatus                  Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F24[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F25[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F26[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue_2;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F27[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue_3;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F28[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0050(0x0018)()
	EFortKeybindForcedHoldStatus                  K2Node_Select_Default_1;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_SetupInteraction) == 0x000008, "Wrong alignment on CreativePortalInfoHUDDisplay_C_SetupInteraction");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_SetupInteraction) == 0x000070, "Wrong size on CreativePortalInfoHUDDisplay_C_SetupInteraction");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, bKeybindWidgetVisible) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::bKeybindWidgetVisible' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable) == 0x000001, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable_1) == 0x000002, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_bool_Variable) == 0x000003, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable_2) == 0x000004, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable_3) == 0x000005, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_bool_Variable_1) == 0x000006, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable_4) == 0x000007, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_byte_Variable_5) == 0x000008, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_GetActiveContextInfo_ReturnValue) == 0x000010, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_GetActiveContextInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, Temp_bool_Variable_2) == 0x000018, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, K2Node_Select_Default) == 0x00001A, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_GetActiveContextInfo_ReturnValue_1) == 0x000020, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_GetActiveContextInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Not_PreBool_ReturnValue_2) == 0x00002A, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002B, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_BooleanAND_ReturnValue_1) == 0x00002C, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_GetActiveContextInfo_ReturnValue_2) == 0x000030, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_GetActiveContextInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_BooleanAND_ReturnValue_2) == 0x000038, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Not_PreBool_ReturnValue_3) == 0x000039, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00003A, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_GetActiveContextInfo_ReturnValue_3) == 0x000040, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_GetActiveContextInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_BooleanAND_ReturnValue_3) == 0x000048, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_TextToUpper_ReturnValue) == 0x000050, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, K2Node_Select_Default_1) == 0x000068, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000069, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_SetupInteraction, K2Node_Select_Default_2) == 0x00006A, "Member 'CreativePortalInfoHUDDisplay_C_SetupInteraction::K2Node_Select_Default_2' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.ShowBasicInteractionWidget
// 0x0018 (0x0018 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget final
{
public:
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F29[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget) == 0x000008, "Wrong alignment on CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget) == 0x000018, "Wrong size on CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget, CallFunc_IsUsingTouch_ReturnValue) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget, CallFunc_GetActiveContextInfo_ReturnValue) == 0x000008, "Member 'CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget::CallFunc_GetActiveContextInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'CreativePortalInfoHUDDisplay_C_ShowBasicInteractionWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.UpdateInteractionKeybind
// 0x0010 (0x0010 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetUseActionName_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind) == 0x000008, "Wrong alignment on CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind) == 0x000010, "Wrong size on CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind, CallFunc_GetUseActionName_ReturnValue) == 0x000008, "Member 'CreativePortalInfoHUDDisplay_C_UpdateInteractionKeybind::CallFunc_GetUseActionName_ReturnValue' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.UpdateWidgetVisibility
// 0x0005 (0x0005 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionWidgetSurpressed_bIsSurpressed; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility) == 0x000001, "Wrong alignment on CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility) == 0x000005, "Wrong size on CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility, Temp_bool_Variable) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility, Temp_byte_Variable) == 0x000001, "Member 'CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility, CallFunc_IsInteractionWidgetSurpressed_bIsSurpressed) == 0x000003, "Member 'CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility::CallFunc_IsInteractionWidgetSurpressed_bIsSurpressed' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility, K2Node_Select_Default) == 0x000004, "Member 'CreativePortalInfoHUDDisplay_C_UpdateWidgetVisibility::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.IsInteractionWidgetSurpressed
// 0x0002 (0x0002 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed final
{
public:
	bool                                          bIsSurpressed;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed) == 0x000001, "Wrong alignment on CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed) == 0x000002, "Wrong size on CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed, bIsSurpressed) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed::bIsSurpressed' has a wrong offset!");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'CreativePortalInfoHUDDisplay_C_IsInteractionWidgetSurpressed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.OnInteractChanged
// 0x0008 (0x0008 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_OnInteractChanged final
{
public:
	const class UFortInteractContextInfo*         ContextInfo;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_OnInteractChanged) == 0x000008, "Wrong alignment on CreativePortalInfoHUDDisplay_C_OnInteractChanged");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_OnInteractChanged) == 0x000008, "Wrong size on CreativePortalInfoHUDDisplay_C_OnInteractChanged");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_OnInteractChanged, ContextInfo) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_OnInteractChanged::ContextInfo' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on CreativePortalInfoHUDDisplay_C_PreConstruct");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_PreConstruct) == 0x000001, "Wrong size on CreativePortalInfoHUDDisplay_C_PreConstruct");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CreativePortalInfoHUDDisplay.CreativePortalInfoHUDDisplay_C.ExecuteUbergraph_CreativePortalInfoHUDDisplay
// 0x00D0 (0x00D0 - 0x0000)
struct CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortInteractContextInfo* ContextInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFortInteractContextInfo* ContextInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6F2A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInteractContextInfo*               CallFunc_GetActiveContextInfo_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2B[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICreativePortalHUDDetailsInterface_C> K2Node_DynamicCast_AsCreative_Portal_HUDDetails_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6F2E[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortInteractContextInfo*         K2Node_CustomEvent_ContextInfo;                    // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIslandPortalInteractionInterface_C> K2Node_DynamicCast_AsIsland_Portal_Interaction_Interface; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIslandPortalInteractionInterface_C> K2Node_DynamicCast_AsIsland_Portal_Interaction_Interface_1; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F30[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay) == 0x000008, "Wrong alignment on CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay");
static_assert(sizeof(CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay) == 0x0000D0, "Wrong size on CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay");
static_assert(offsetof(CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay, EntryPoint) == 0x000000, "Member 'CreativePortalInfoHUDDisplay_C_ExecuteUbergraph_CreativePortalInfoHUDDisplay::EntryPoint' has a wrong offset!");
