#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptionsTile

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.InitServerInfo
// 0x0220 (0x0220 - 0x0000)
struct CreativeServerOptionsTile_C_InitServerInfo final
{
public:
	class UFortCreativeServerInfo*                ServerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73A7[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73A8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73A9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterAsNumber_ReturnValue_2;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73AA[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73AB[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00D0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73AC[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeModeAccessLimited_ReturnValue;  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73AD[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsDate_DateTime_ReturnValue;              // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73AE[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0018)()
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x01C8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73AF[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeServerFriend_C*                K2Node_DynamicCast_AsCreative_Server_Friend;       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B0[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B1[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_InitServerInfo) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_InitServerInfo");
static_assert(sizeof(CreativeServerOptionsTile_C_InitServerInfo) == 0x000220, "Wrong size on CreativeServerOptionsTile_C_InitServerInfo");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, ServerInfo) == 0x000000, "Member 'CreativeServerOptionsTile_C_InitServerInfo::ServerInfo' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable) == 0x000008, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_byte_Variable) == 0x000009, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_byte_Variable_1) == 0x000010, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Get_Item) == 0x000018, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue) == 0x000028, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue_1) == 0x000044, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCharacterAsNumber_ReturnValue_2) == 0x000048, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCharacterAsNumber_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeArray_Array) == 0x0000A0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable_1) == 0x0000C8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_TextToUpper_ReturnValue) == 0x0000D0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select_Default) == 0x0000E8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000F8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue) == 0x000100, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_IsCreativeModeAccessLimited_ReturnValue) == 0x000108, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_IsCreativeModeAccessLimited_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_AsDate_DateTime_ReturnValue) == 0x000110, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_AsDate_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable_2) == 0x000168, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_MakeArray_Array_1) == 0x000170, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select_Default_1) == 0x000198, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_JoinStringArray_ReturnValue) == 0x0001A0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_TextToUpper_ReturnValue_1) == 0x0001C8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Array_Length_ReturnValue_2) == 0x0001E0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001E4, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_bool_Variable_3) == 0x0001E5, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_BP_CreateEntry_ReturnValue) == 0x0001E8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_DynamicCast_AsCreative_Server_Friend) == 0x0001F0, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_DynamicCast_AsCreative_Server_Friend' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select_Default_2) == 0x000200, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, K2Node_Select_Default_3) == 0x000208, "Member 'CreativeServerOptionsTile_C_InitServerInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, Temp_int_Loop_Counter_Variable) == 0x000210, "Member 'CreativeServerOptionsTile_C_InitServerInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_InitServerInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x000218, "Member 'CreativeServerOptionsTile_C_InitServerInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.OnLoaded_3534B041413498BC4DD6D2B727558DF9
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9");
static_assert(sizeof(CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9");
static_assert(offsetof(CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9, Loaded) == 0x000000, "Member 'CreativeServerOptionsTile_C_OnLoaded_3534B041413498BC4DD6D2B727558DF9::Loaded' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CreativeServerOptionsTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeServerOptionsTile_C_PreConstruct) == 0x000001, "Wrong alignment on CreativeServerOptionsTile_C_PreConstruct");
static_assert(sizeof(CreativeServerOptionsTile_C_PreConstruct) == 0x000001, "Wrong size on CreativeServerOptionsTile_C_PreConstruct");
static_assert(offsetof(CreativeServerOptionsTile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CreativeServerOptionsTile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.SetBPData
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_SetBPData final
{
public:
	const class UFortCreativeServerInfo*          ServerInfo;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_SetBPData) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_SetBPData");
static_assert(sizeof(CreativeServerOptionsTile_C_SetBPData) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_SetBPData");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBPData, ServerInfo) == 0x000000, "Member 'CreativeServerOptionsTile_C_SetBPData::ServerInfo' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeServerOptionsTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.InputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeServerOptionsTile_C_InputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_InputMethodChanged) == 0x000001, "Wrong alignment on CreativeServerOptionsTile_C_InputMethodChanged");
static_assert(sizeof(CreativeServerOptionsTile_C_InputMethodChanged) == 0x000001, "Wrong size on CreativeServerOptionsTile_C_InputMethodChanged");
static_assert(offsetof(CreativeServerOptionsTile_C_InputMethodChanged, bNewInputType) == 0x000000, "Member 'CreativeServerOptionsTile_C_InputMethodChanged::bNewInputType' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.SetBackgroundImage
// 0x0004 (0x0004 - 0x0000)
struct CreativeServerOptionsTile_C_SetBackgroundImage final
{
public:
	int32                                         ArrayIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_SetBackgroundImage) == 0x000004, "Wrong alignment on CreativeServerOptionsTile_C_SetBackgroundImage");
static_assert(sizeof(CreativeServerOptionsTile_C_SetBackgroundImage) == 0x000004, "Wrong size on CreativeServerOptionsTile_C_SetBackgroundImage");
static_assert(offsetof(CreativeServerOptionsTile_C_SetBackgroundImage, ArrayIndex) == 0x000000, "Member 'CreativeServerOptionsTile_C_SetBackgroundImage::ArrayIndex' has a wrong offset!");

// Function CreativeServerOptionsTile.CreativeServerOptionsTile_C.ExecuteUbergraph_CreativeServerOptionsTile
// 0x0250 (0x0250 - 0x0000)
struct CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B2[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B3[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_4;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B4[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortCreativeServerInfo*          K2Node_Event_ServerInfo;                           // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B5[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73B6[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B7[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73B8[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_73B9[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73BA[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0130(0x0018)()
	bool                                          K2Node_Select_Default_1;                           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73BB[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0150(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73BC[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ArrayIndex;                     // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73BD[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0178(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73BE[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCreativeServerDisplayOption       CallFunc_GetDataTableRowFromName_OutRow;           // 0x01C0(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73BF[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RGBToHSV_H;                               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S;                               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V;                               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A;                               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_H_1;                             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S_1;                             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V_1;                             // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A_1;                             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x0224(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue_1;                   // 0x023C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile) == 0x000008, "Wrong alignment on CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile");
static_assert(sizeof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile) == 0x000250, "Wrong size on CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, EntryPoint) == 0x000000, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile, Temp_bool_Variable) == 0x000004, "Member 'CreativeServerOptionsTile_C_ExecuteUbergraph_CreativeServerOptionsTile::Temp_bool_Variable' has a wrong offset!");
