#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeThumbnailStage_InGame

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CreativeThumbnailStage_InGame.CreativeThumbnailStage_InGame_C
// 0x0028 (0x0248 - 0x0220)
class ACreativeThumbnailStage_InGame_C final : public AActor
{
public:
	class UDirectionalLightComponent*             DirectionalLight1;                                 // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Sky_Sphere;                                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeThumbnailStage_InGame_C">();
	}
	static class ACreativeThumbnailStage_InGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeThumbnailStage_InGame_C>();
	}
};
static_assert(alignof(ACreativeThumbnailStage_InGame_C) == 0x000008, "Wrong alignment on ACreativeThumbnailStage_InGame_C");
static_assert(sizeof(ACreativeThumbnailStage_InGame_C) == 0x000248, "Wrong size on ACreativeThumbnailStage_InGame_C");
static_assert(offsetof(ACreativeThumbnailStage_InGame_C, DirectionalLight1) == 0x000220, "Member 'ACreativeThumbnailStage_InGame_C::DirectionalLight1' has a wrong offset!");
static_assert(offsetof(ACreativeThumbnailStage_InGame_C, DirectionalLight) == 0x000228, "Member 'ACreativeThumbnailStage_InGame_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ACreativeThumbnailStage_InGame_C, Camera) == 0x000230, "Member 'ACreativeThumbnailStage_InGame_C::Camera' has a wrong offset!");
static_assert(offsetof(ACreativeThumbnailStage_InGame_C, BP_Sky_Sphere) == 0x000238, "Member 'ACreativeThumbnailStage_InGame_C::BP_Sky_Sphere' has a wrong offset!");
static_assert(offsetof(ACreativeThumbnailStage_InGame_C, DefaultSceneRoot) == 0x000240, "Member 'ACreativeThumbnailStage_InGame_C::DefaultSceneRoot' has a wrong offset!");

}

