#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMinigameInfoMappanelWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeMinigameInfoMappanelWidget.CreativeMinigameInfoMapPanelWidget_C
// 0x0060 (0x02F0 - 0x0290)
class UCreativeMinigameInfoMapPanelWidget_C final : public UFortCreativeMiniGameInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BulletBox1;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BulletBox2;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BulletBox3;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CreatorBox;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DetailsBox;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                PanelSpacer;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SupportCodeBox;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetVisiblityBasedOnText(class UWidget* Element, class UTextBlock* TextSetting);
	void OnTextSet();
	void ExecuteUbergraph_CreativeMinigameInfoMapPanelWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeMinigameInfoMapPanelWidget_C">();
	}
	static class UCreativeMinigameInfoMapPanelWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeMinigameInfoMapPanelWidget_C>();
	}
};
static_assert(alignof(UCreativeMinigameInfoMapPanelWidget_C) == 0x000008, "Wrong alignment on UCreativeMinigameInfoMapPanelWidget_C");
static_assert(sizeof(UCreativeMinigameInfoMapPanelWidget_C) == 0x0002F0, "Wrong size on UCreativeMinigameInfoMapPanelWidget_C");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, UberGraphFrame) == 0x000290, "Member 'UCreativeMinigameInfoMapPanelWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, BulletBox1) == 0x000298, "Member 'UCreativeMinigameInfoMapPanelWidget_C::BulletBox1' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, BulletBox2) == 0x0002A0, "Member 'UCreativeMinigameInfoMapPanelWidget_C::BulletBox2' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, BulletBox3) == 0x0002A8, "Member 'UCreativeMinigameInfoMapPanelWidget_C::BulletBox3' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, CreatorBox) == 0x0002B0, "Member 'UCreativeMinigameInfoMapPanelWidget_C::CreatorBox' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, DetailsBox) == 0x0002B8, "Member 'UCreativeMinigameInfoMapPanelWidget_C::DetailsBox' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, Image_0) == 0x0002C0, "Member 'UCreativeMinigameInfoMapPanelWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, Image_1) == 0x0002C8, "Member 'UCreativeMinigameInfoMapPanelWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, Image_2) == 0x0002D0, "Member 'UCreativeMinigameInfoMapPanelWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, Image_3) == 0x0002D8, "Member 'UCreativeMinigameInfoMapPanelWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, PanelSpacer) == 0x0002E0, "Member 'UCreativeMinigameInfoMapPanelWidget_C::PanelSpacer' has a wrong offset!");
static_assert(offsetof(UCreativeMinigameInfoMapPanelWidget_C, SupportCodeBox) == 0x0002E8, "Member 'UCreativeMinigameInfoMapPanelWidget_C::SupportCodeBox' has a wrong offset!");

}

