#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativePlayModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativePlayModal.CreativePlayModal_C.ManageCancelButton
// 0x0018 (0x0018 - 0x0000)
struct CreativePlayModal_C_ManageCancelButton final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C48[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_ManageCancelButton) == 0x000008, "Wrong alignment on CreativePlayModal_C_ManageCancelButton");
static_assert(sizeof(CreativePlayModal_C_ManageCancelButton) == 0x000018, "Wrong size on CreativePlayModal_C_ManageCancelButton");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, Temp_bool_Variable) == 0x000000, "Member 'CreativePlayModal_C_ManageCancelButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, Temp_byte_Variable) == 0x000001, "Member 'CreativePlayModal_C_ManageCancelButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, Temp_byte_Variable_1) == 0x000002, "Member 'CreativePlayModal_C_ManageCancelButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CreativePlayModal_C_ManageCancelButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'CreativePlayModal_C_ManageCancelButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, CallFunc_IsUsingGamepad_ReturnValue) == 0x000011, "Member 'CreativePlayModal_C_ManageCancelButton::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'CreativePlayModal_C_ManageCancelButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'CreativePlayModal_C_ManageCancelButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ManageCancelButton, K2Node_Select_Default) == 0x000014, "Member 'CreativePlayModal_C_ManageCancelButton::K2Node_Select_Default' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.SetStartIsland
// 0x00C0 (0x00C0 - 0x0000)
struct CreativePlayModal_C_SetStartIsland final
{
public:
	class FText                                   StartIslandName;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C49[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C4A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x0090(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00A8(0x0018)()
};
static_assert(alignof(CreativePlayModal_C_SetStartIsland) == 0x000008, "Wrong alignment on CreativePlayModal_C_SetStartIsland");
static_assert(sizeof(CreativePlayModal_C_SetStartIsland) == 0x0000C0, "Wrong size on CreativePlayModal_C_SetStartIsland");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, StartIslandName) == 0x000000, "Member 'CreativePlayModal_C_SetStartIsland::StartIslandName' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, Temp_bool_Variable) == 0x000018, "Member 'CreativePlayModal_C_SetStartIsland::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'CreativePlayModal_C_SetStartIsland::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, CallFunc_TextIsEmpty_ReturnValue) == 0x000060, "Member 'CreativePlayModal_C_SetStartIsland::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, K2Node_MakeArray_Array) == 0x000068, "Member 'CreativePlayModal_C_SetStartIsland::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, CallFunc_Format_ReturnValue) == 0x000078, "Member 'CreativePlayModal_C_SetStartIsland::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, Temp_text_Variable) == 0x000090, "Member 'CreativePlayModal_C_SetStartIsland::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_SetStartIsland, K2Node_Select_Default) == 0x0000A8, "Member 'CreativePlayModal_C_SetStartIsland::K2Node_Select_Default' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.HandleSocialImportClosed
// 0x0018 (0x0018 - 0x0000)
struct CreativePlayModal_C_HandleSocialImportClosed final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CreativePlayModal_C_HandleSocialImportClosed) == 0x000008, "Wrong alignment on CreativePlayModal_C_HandleSocialImportClosed");
static_assert(sizeof(CreativePlayModal_C_HandleSocialImportClosed) == 0x000018, "Wrong size on CreativePlayModal_C_HandleSocialImportClosed");
static_assert(offsetof(CreativePlayModal_C_HandleSocialImportClosed, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CreativePlayModal_C_HandleSocialImportClosed::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_HandleSocialImportClosed, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CreativePlayModal_C_HandleSocialImportClosed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.InitializeAddFriends
// 0x00A8 (0x00A8 - 0x0000)
struct CreativePlayModal_C_InitializeAddFriends final
{
public:
	class FText                                   PlatformName;                                      // 0x0000(0x0018)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowImportPlatformFriendsOption_ReturnValue; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C4B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4C[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePlayModal_C_InitializeAddFriends) == 0x000008, "Wrong alignment on CreativePlayModal_C_InitializeAddFriends");
static_assert(sizeof(CreativePlayModal_C_InitializeAddFriends) == 0x0000A8, "Wrong size on CreativePlayModal_C_InitializeAddFriends");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, PlatformName) == 0x000000, "Member 'CreativePlayModal_C_InitializeAddFriends::PlatformName' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, Temp_byte_Variable) == 0x000018, "Member 'CreativePlayModal_C_InitializeAddFriends::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, Temp_byte_Variable_1) == 0x000019, "Member 'CreativePlayModal_C_InitializeAddFriends::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, CallFunc_ShouldShowImportPlatformFriendsOption_ReturnValue) == 0x00001A, "Member 'CreativePlayModal_C_InitializeAddFriends::CallFunc_ShouldShowImportPlatformFriendsOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, Temp_bool_Variable) == 0x00001B, "Member 'CreativePlayModal_C_InitializeAddFriends::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'CreativePlayModal_C_InitializeAddFriends::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, K2Node_Select_Default) == 0x000060, "Member 'CreativePlayModal_C_InitializeAddFriends::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, K2Node_MakeArray_Array) == 0x000068, "Member 'CreativePlayModal_C_InitializeAddFriends::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, CallFunc_Format_ReturnValue) == 0x000078, "Member 'CreativePlayModal_C_InitializeAddFriends::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, CallFunc_GetPlatformName_ReturnValue) == 0x000090, "Member 'CreativePlayModal_C_InitializeAddFriends::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000A0, "Member 'CreativePlayModal_C_InitializeAddFriends::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_InitializeAddFriends, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0000A1, "Member 'CreativePlayModal_C_InitializeAddFriends::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.NullActionHandler
// 0x0001 (0x0001 - 0x0000)
struct CreativePlayModal_C_NullActionHandler final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePlayModal_C_NullActionHandler) == 0x000001, "Wrong alignment on CreativePlayModal_C_NullActionHandler");
static_assert(sizeof(CreativePlayModal_C_NullActionHandler) == 0x000001, "Wrong size on CreativePlayModal_C_NullActionHandler");
static_assert(offsetof(CreativePlayModal_C_NullActionHandler, bPassThrough) == 0x000000, "Member 'CreativePlayModal_C_NullActionHandler::bPassThrough' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_InitFromObject) == 0x000008, "Wrong alignment on CreativePlayModal_C_InitFromObject");
static_assert(sizeof(CreativePlayModal_C_InitFromObject) == 0x000008, "Wrong size on CreativePlayModal_C_InitFromObject");
static_assert(offsetof(CreativePlayModal_C_InitFromObject, InitObject) == 0x000000, "Member 'CreativePlayModal_C_InitFromObject::InitObject' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature final
{
public:
	class UFortCreativeServerInfo*                ServerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature) == 0x000008, "Wrong alignment on CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature");
static_assert(sizeof(CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature) == 0x000008, "Wrong size on CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature");
static_assert(offsetof(CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature, ServerInfo) == 0x000000, "Member 'CreativePlayModal_C_BndEvt__CreativeOptionsServers_K2Node_ComponentBoundEvent_0_OnSelectedServerChanged__DelegateSignature::ServerInfo' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativePlayModal_C_BndEvt__AddFriendsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativePlayModal_C_BndEvt__IslandCodeButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.CreativeIslandCodeConfirmedEvent
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_CreativeIslandCodeConfirmedEvent final
{
public:
	const class UFortCreativeIslandLink*          IslandLink;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_CreativeIslandCodeConfirmedEvent) == 0x000008, "Wrong alignment on CreativePlayModal_C_CreativeIslandCodeConfirmedEvent");
static_assert(sizeof(CreativePlayModal_C_CreativeIslandCodeConfirmedEvent) == 0x000008, "Wrong size on CreativePlayModal_C_CreativeIslandCodeConfirmedEvent");
static_assert(offsetof(CreativePlayModal_C_CreativeIslandCodeConfirmedEvent, IslandLink) == 0x000000, "Member 'CreativePlayModal_C_CreativeIslandCodeConfirmedEvent::IslandLink' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativePlayModal_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on CreativePlayModal_C_OnInputMethodChanged");
static_assert(sizeof(CreativePlayModal_C_OnInputMethodChanged) == 0x000001, "Wrong size on CreativePlayModal_C_OnInputMethodChanged");
static_assert(offsetof(CreativePlayModal_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'CreativePlayModal_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativePlayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativePlayModal.CreativePlayModal_C.ExecuteUbergraph_CreativePlayModal
// 0x0148 (0x0148 - 0x0000)
struct CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4E[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortCreativeIslandLink* IslandLink)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UCreativeIslandLinkScreen_C*            CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C4F[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InitObject;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCreativeServerInfo*                K2Node_ComponentBoundEvent_ServerInfo;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeServerOptions_C*               K2Node_DynamicCast_AsCreative_Server_Options;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C50[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C51[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C52[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C53[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeModeAccessLimited_ReturnValue;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C54[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C55[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedButtonIndex_ReturnValue;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C56[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeServerOptionsTile_C*           K2Node_DynamicCast_AsCreative_Server_Options_Tile; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C57[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortCreativeIslandLink*          K2Node_CustomEvent_IslandLink;                     // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C58[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_2;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C59[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal) == 0x000008, "Wrong alignment on CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal");
static_assert(sizeof(CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal) == 0x000148, "Wrong size on CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal");
static_assert(offsetof(CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal, EntryPoint) == 0x000000, "Member 'CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'CreativePlayModal_C_ExecuteUbergraph_CreativePlayModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
