#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_Enabled_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Creative_EnabledState_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "EEnabledState_structs.hpp"


namespace SDK::Params
{

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.On Enabled State Changed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature) == 0x000001, "Wrong alignment on Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature");
static_assert(sizeof(Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature) == 0x000001, "Wrong size on Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature");
static_assert(offsetof(Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature, Enabled) == 0x000000, "Member 'Creative_Enabled_Component_C_On_Enabled_State_Changed__DelegateSignature::Enabled' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.ExecuteUbergraph_Creative_Enabled_Component
// 0x0080 (0x0080 - 0x0000)
struct Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortMinigame* Minigame, bool bIsInPlayMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortMinigame* Minigame, EFortMinigameState MinigameState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_651A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameLogicComponent*            K2Node_CustomEvent_Logic_Component;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Enabled_Index;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_CustomEvent_Minigame_2;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651C[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_CustomEvent_Minigame_1;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            K2Node_CustomEvent_MinigameState;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          K2Node_CustomEvent_Minigame;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsInPlayMode;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651E[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component");
static_assert(sizeof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component) == 0x000080, "Wrong size on Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, EntryPoint) == 0x000000, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_Logic_Component) == 0x000028, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_Logic_Component' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_Enabled_Index) == 0x000030, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_Enabled_Index' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_Minigame_2) == 0x000038, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_Minigame_2' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_Minigame_1) == 0x000048, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_Minigame_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_MinigameState) == 0x000050, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_MinigameState' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_Minigame) == 0x000060, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CustomEvent_bIsInPlayMode) == 0x000068, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CustomEvent_bIsInPlayMode' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, CallFunc_HasAuthority_ReturnValue) == 0x00006A, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'Creative_Enabled_Component_C_ExecuteUbergraph_Creative_Enabled_Component::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Minigame Play Mode Changed
// 0x0010 (0x0010 - 0x0000)
struct Creative_Enabled_Component_C_Minigame_Play_Mode_Changed final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInPlayMode;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Minigame_Play_Mode_Changed) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Minigame_Play_Mode_Changed");
static_assert(sizeof(Creative_Enabled_Component_C_Minigame_Play_Mode_Changed) == 0x000010, "Wrong size on Creative_Enabled_Component_C_Minigame_Play_Mode_Changed");
static_assert(offsetof(Creative_Enabled_Component_C_Minigame_Play_Mode_Changed, Minigame) == 0x000000, "Member 'Creative_Enabled_Component_C_Minigame_Play_Mode_Changed::Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Minigame_Play_Mode_Changed, bIsInPlayMode) == 0x000008, "Member 'Creative_Enabled_Component_C_Minigame_Play_Mode_Changed::bIsInPlayMode' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Minigame State Changed
// 0x0010 (0x0010 - 0x0000)
struct Creative_Enabled_Component_C_Minigame_State_Changed final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            MinigameState;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Enabled_Component_C_Minigame_State_Changed) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Minigame_State_Changed");
static_assert(sizeof(Creative_Enabled_Component_C_Minigame_State_Changed) == 0x000010, "Wrong size on Creative_Enabled_Component_C_Minigame_State_Changed");
static_assert(offsetof(Creative_Enabled_Component_C_Minigame_State_Changed, Minigame) == 0x000000, "Member 'Creative_Enabled_Component_C_Minigame_State_Changed::Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Minigame_State_Changed, MinigameState) == 0x000008, "Member 'Creative_Enabled_Component_C_Minigame_State_Changed::MinigameState' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Bind to Minigame
// 0x0008 (0x0008 - 0x0000)
struct Creative_Enabled_Component_C_Bind_to_Minigame final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Enabled_Component_C_Bind_to_Minigame) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Bind_to_Minigame");
static_assert(sizeof(Creative_Enabled_Component_C_Bind_to_Minigame) == 0x000008, "Wrong size on Creative_Enabled_Component_C_Bind_to_Minigame");
static_assert(offsetof(Creative_Enabled_Component_C_Bind_to_Minigame, Minigame) == 0x000000, "Member 'Creative_Enabled_Component_C_Bind_to_Minigame::Minigame' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Initialize Component
// 0x0010 (0x0010 - 0x0000)
struct Creative_Enabled_Component_C_Initialize_Component final
{
public:
	class UFortMinigameLogicComponent*            Param_Logic_Component;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Enabled_Index;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Enabled_Component_C_Initialize_Component) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Initialize_Component");
static_assert(sizeof(Creative_Enabled_Component_C_Initialize_Component) == 0x000010, "Wrong size on Creative_Enabled_Component_C_Initialize_Component");
static_assert(offsetof(Creative_Enabled_Component_C_Initialize_Component, Param_Logic_Component) == 0x000000, "Member 'Creative_Enabled_Component_C_Initialize_Component::Param_Logic_Component' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Initialize_Component, Param_Enabled_Index) == 0x000008, "Member 'Creative_Enabled_Component_C_Initialize_Component::Param_Enabled_Index' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Set Enabled on Phase
// 0x0018 (0x0018 - 0x0000)
struct Creative_Enabled_Component_C_Set_Enabled_on_Phase final
{
public:
	EFortMinigameState                            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnabledIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabledPhaseMatch_Enabled;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Set_Enabled_on_Phase) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Set_Enabled_on_Phase");
static_assert(sizeof(Creative_Enabled_Component_C_Set_Enabled_on_Phase) == 0x000018, "Wrong size on Creative_Enabled_Component_C_Set_Enabled_on_Phase");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, State) == 0x000000, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::State' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, EnabledIndex) == 0x000004, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::EnabledIndex' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, CallFunc_IsEnabledPhaseMatch_Enabled) == 0x000010, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::CallFunc_IsEnabledPhaseMatch_Enabled' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, CallFunc_Set_Contains_ReturnValue) == 0x000011, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Phase, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Phase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.IsEnabled
// 0x0004 (0x0004 - 0x0000)
struct Creative_Enabled_Component_C_IsEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Can_be_Enabled_True;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_IsEnabled) == 0x000001, "Wrong alignment on Creative_Enabled_Component_C_IsEnabled");
static_assert(sizeof(Creative_Enabled_Component_C_IsEnabled) == 0x000004, "Wrong size on Creative_Enabled_Component_C_IsEnabled");
static_assert(offsetof(Creative_Enabled_Component_C_IsEnabled, Enabled) == 0x000000, "Member 'Creative_Enabled_Component_C_IsEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsEnabled, CallFunc_Can_be_Enabled_True) == 0x000001, "Member 'Creative_Enabled_Component_C_IsEnabled::CallFunc_Can_be_Enabled_True' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'Creative_Enabled_Component_C_IsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'Creative_Enabled_Component_C_IsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Set Enabled
// 0x0030 (0x0030 - 0x0000)
struct Creative_Enabled_Component_C_Set_Enabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EEnabledState                                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6520[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEnabledState                                 Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_be_Enabled_True;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6521[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnabledState                                 K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6522[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreative_EnabledState                 K2Node_MakeStruct_Creative_EnabledState;           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Set_Enabled) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Set_Enabled");
static_assert(sizeof(Creative_Enabled_Component_C_Set_Enabled) == 0x000030, "Wrong size on Creative_Enabled_Component_C_Set_Enabled");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, bEnabled) == 0x000000, "Member 'Creative_Enabled_Component_C_Set_Enabled::bEnabled' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, Temp_byte_Variable) == 0x000001, "Member 'Creative_Enabled_Component_C_Set_Enabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, Temp_byte_Variable_1) == 0x000012, "Member 'Creative_Enabled_Component_C_Set_Enabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_Can_be_Enabled_True) == 0x000013, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_Can_be_Enabled_True' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, Temp_bool_Variable) == 0x000015, "Member 'Creative_Enabled_Component_C_Set_Enabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, K2Node_Select_Default) == 0x000020, "Member 'Creative_Enabled_Component_C_Set_Enabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, K2Node_MakeStruct_Creative_EnabledState) == 0x000024, "Member 'Creative_Enabled_Component_C_Set_Enabled::K2Node_MakeStruct_Creative_EnabledState' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'Creative_Enabled_Component_C_Set_Enabled::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Set Enabled on Play Mode
// 0x0001 (0x0001 - 0x0000)
struct Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode final
{
public:
	bool                                          Play_Mode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode) == 0x000001, "Wrong alignment on Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode");
static_assert(sizeof(Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode) == 0x000001, "Wrong size on Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode");
static_assert(offsetof(Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode, Play_Mode) == 0x000000, "Member 'Creative_Enabled_Component_C_Set_Enabled_on_Play_Mode::Play_Mode' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Reset Delay Complete
// 0x0010 (0x0010 - 0x0000)
struct Creative_Enabled_Component_C_Reset_Delay_Complete final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Reset_Delay_Complete) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Reset_Delay_Complete");
static_assert(sizeof(Creative_Enabled_Component_C_Reset_Delay_Complete) == 0x000010, "Wrong size on Creative_Enabled_Component_C_Reset_Delay_Complete");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Complete, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'Creative_Enabled_Component_C_Reset_Delay_Complete::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Complete, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Creative_Enabled_Component_C_Reset_Delay_Complete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Complete, CallFunc_HasAuthority_ReturnValue) == 0x000009, "Member 'Creative_Enabled_Component_C_Reset_Delay_Complete::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Reset Delay Start
// 0x0038 (0x0038 - 0x0000)
struct Creative_Enabled_Component_C_Reset_Delay_Start final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCreative_EnabledState                 K2Node_MakeStruct_Creative_EnabledState;           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6523[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6524[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_Enabled;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResetting_True;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6525[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_IsResetting_Remaining_Time;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Reset_Delay_Start) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Reset_Delay_Start");
static_assert(sizeof(Creative_Enabled_Component_C_Reset_Delay_Start) == 0x000038, "Wrong size on Creative_Enabled_Component_C_Reset_Delay_Start");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, Delay) == 0x000000, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::Delay' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, K2Node_MakeStruct_Creative_EnabledState) == 0x000004, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::K2Node_MakeStruct_Creative_EnabledState' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_GetOwner_ReturnValue_1) == 0x000020, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_IsEnabled_Enabled) == 0x000028, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_IsEnabled_Enabled' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_HasAuthority_ReturnValue) == 0x000029, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_IsResetting_True) == 0x00002A, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_IsResetting_True' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_IsResetting_Remaining_Time) == 0x00002C, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_IsResetting_Remaining_Time' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_BooleanAND_ReturnValue_1) == 0x000032, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Reset_Delay_Start, CallFunc_BooleanAND_ReturnValue_2) == 0x000033, "Member 'Creative_Enabled_Component_C_Reset_Delay_Start::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.IsResetting
// 0x0010 (0x0010 - 0x0000)
struct Creative_Enabled_Component_C_IsResetting final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6526[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Remaining_Time;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_IsResetting) == 0x000004, "Wrong alignment on Creative_Enabled_Component_C_IsResetting");
static_assert(sizeof(Creative_Enabled_Component_C_IsResetting) == 0x000010, "Wrong size on Creative_Enabled_Component_C_IsResetting");
static_assert(offsetof(Creative_Enabled_Component_C_IsResetting, TURR) == 0x000000, "Member 'Creative_Enabled_Component_C_IsResetting::TURR' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsResetting, Remaining_Time) == 0x000004, "Member 'Creative_Enabled_Component_C_IsResetting::Remaining_Time' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsResetting, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000008, "Member 'Creative_Enabled_Component_C_IsResetting::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_IsResetting, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'Creative_Enabled_Component_C_IsResetting::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.OnRep_EIsEnabled
// 0x0020 (0x0020 - 0x0000)
struct Creative_Enabled_Component_C_OnRep_EIsEnabled final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_OnRep_EIsEnabled) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_OnRep_EIsEnabled");
static_assert(sizeof(Creative_Enabled_Component_C_OnRep_EIsEnabled) == 0x000020, "Wrong size on Creative_Enabled_Component_C_OnRep_EIsEnabled");
static_assert(offsetof(Creative_Enabled_Component_C_OnRep_EIsEnabled, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Creative_Enabled_Component_C_OnRep_EIsEnabled::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_OnRep_EIsEnabled, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'Creative_Enabled_Component_C_OnRep_EIsEnabled::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_OnRep_EIsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'Creative_Enabled_Component_C_OnRep_EIsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_OnRep_EIsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'Creative_Enabled_Component_C_OnRep_EIsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function Creative_Enabled_Component.Creative_Enabled_Component_C.Can be Enabled
// 0x0020 (0x0020 - 0x0000)
struct Creative_Enabled_Component_C_Can_be_Enabled final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPlayMode_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6527[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_Enabled_Component_C_Can_be_Enabled) == 0x000008, "Wrong alignment on Creative_Enabled_Component_C_Can_be_Enabled");
static_assert(sizeof(Creative_Enabled_Component_C_Can_be_Enabled) == 0x000020, "Wrong size on Creative_Enabled_Component_C_Can_be_Enabled");
static_assert(offsetof(Creative_Enabled_Component_C_Can_be_Enabled, TURR) == 0x000000, "Member 'Creative_Enabled_Component_C_Can_be_Enabled::TURR' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Can_be_Enabled, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Creative_Enabled_Component_C_Can_be_Enabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Enabled_Component_C_Can_be_Enabled, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Creative_Enabled_Component_C_Can_be_Enabled::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
