#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeAffiliatePanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function CreativeAffiliatePanel.CreativeAffiliatePanel_C.SetAffiliateName
// 0x0020 (0x0020 - 0x0000)
struct CreativeAffiliatePanel_C_SetAffiliateName final
{
public:
	class FText                                   AffiliateName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeAffiliatePanel_C_SetAffiliateName) == 0x000008, "Wrong alignment on CreativeAffiliatePanel_C_SetAffiliateName");
static_assert(sizeof(CreativeAffiliatePanel_C_SetAffiliateName) == 0x000020, "Wrong size on CreativeAffiliatePanel_C_SetAffiliateName");
static_assert(offsetof(CreativeAffiliatePanel_C_SetAffiliateName, AffiliateName) == 0x000000, "Member 'CreativeAffiliatePanel_C_SetAffiliateName::AffiliateName' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_SetAffiliateName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'CreativeAffiliatePanel_C_SetAffiliateName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CreativeAffiliatePanel.CreativeAffiliatePanel_C.ButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct CreativeAffiliatePanel_C_ButtonClicked final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeAffiliatePanel_C_ButtonClicked) == 0x000008, "Wrong alignment on CreativeAffiliatePanel_C_ButtonClicked");
static_assert(sizeof(CreativeAffiliatePanel_C_ButtonClicked) == 0x000008, "Wrong size on CreativeAffiliatePanel_C_ButtonClicked");
static_assert(offsetof(CreativeAffiliatePanel_C_ButtonClicked, Button) == 0x000000, "Member 'CreativeAffiliatePanel_C_ButtonClicked::Button' has a wrong offset!");

// Function CreativeAffiliatePanel.CreativeAffiliatePanel_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct CreativeAffiliatePanel_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeAffiliatePanel_C_InitFromObject) == 0x000008, "Wrong alignment on CreativeAffiliatePanel_C_InitFromObject");
static_assert(sizeof(CreativeAffiliatePanel_C_InitFromObject) == 0x000008, "Wrong size on CreativeAffiliatePanel_C_InitFromObject");
static_assert(offsetof(CreativeAffiliatePanel_C_InitFromObject, InitObject) == 0x000000, "Member 'CreativeAffiliatePanel_C_InitFromObject::InitObject' has a wrong offset!");

// Function CreativeAffiliatePanel.CreativeAffiliatePanel_C.ExecuteUbergraph_CreativeAffiliatePanel
// 0x0050 (0x0050 - 0x0000)
struct CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_70C9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_Event_InitObject;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel) == 0x000008, "Wrong alignment on CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel");
static_assert(sizeof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel) == 0x000050, "Wrong size on CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, EntryPoint) == 0x000000, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, K2Node_CustomEvent_Button) == 0x000018, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, K2Node_Event_InitObject) == 0x000030, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'CreativeAffiliatePanel_C_ExecuteUbergraph_CreativeAffiliatePanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

