#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_VisibleInGame_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_ForcedValueDuringGame_structs.hpp"
#include "Creative_DeviceComponent_Parent_classes.hpp"
#include "EVisibleInGameState_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Creative_VisibleInGame_Component.Creative_VisibleInGame_Component_C
// 0x0090 (0x0148 - 0x00B8)
class UCreative_VisibleInGame_Component_C final : public UCreative_DeviceComponent_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Creative_VisibleInGame_Component_C; // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             On_Visibility_Changed;                             // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class USceneComponent*>                VisibleSceneComponents;                            // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bEnableCollisionUpdates;                           // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Default_Collision_Enabled_State;                   // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Collision_Disabled_State;                          // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           VisibleDuringPhase;                                // 0x00E3(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetOnComponentActivation;                       // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6505[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RetryBindMiniGameEventsTimer;                      // 0x00E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class USceneComponent*, ECollisionEnabled> Collision_Enabled_Overrides;                       // 0x00F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	Enum_ForcedValueDuringGame                    ForcedVisibilityDuringGame;                        // 0x0140(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSetHiddenInGame;                               // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Update_Foliage_on_Visibility_Change;               // 0x0142(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void On_Visibility_Changed__DelegateSignature(bool Visible);
	void ExecuteUbergraph_Creative_VisibleInGame_Component(int32 EntryPoint);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void Bind_Minigame_Events();
	void OnPlayModeChangedDelegate(class AFortMinigame* Minigame, bool bIsInPlayMode);
	void ReceiveBeginPlay();
	void Get_Visibility_Components(TArray<class USceneComponent*>* Components);
	void Update_Visibility();
	void Set_Visiblity_During_Phase(EVisibleInGameState New_Visible_During_Phase);
	void Update_Component_Visibility(class USceneComponent* Component, bool Visible);
	void Update_Primitive_Component_Collision(class UPrimitiveComponent* Primitive_Component, bool Visible);
	void Update_Audio_Component(class UAudioComponent* Audio_Component, bool Visible);
	void Update_Particle_Component(class UParticleSystemComponent* Particle_Component, bool Visible);
	bool Is_In_Play_Mode();
	void Set_Visibility_Components(TArray<class USceneComponent*>& Scene_Components);
	void OnRep_VisibleDuringPhase();
	void Should_Be_Visible(bool* Visible);
	void Set_Visibility_Components_with_Collision(const TMap<class USceneComponent*, ECollisionEnabled>& Collision_Overrides);
	void Update_Array_Visibility(TArray<class USceneComponent*>& Array);
	void SetForcedVisibilityDuringGame(Enum_ForcedValueDuringGame NewForcedVisibilityDuringGame);
	void OnRep_ForcedVisibilityDuringGame();
	void Update_Foliage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Creative_VisibleInGame_Component_C">();
	}
	static class UCreative_VisibleInGame_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreative_VisibleInGame_Component_C>();
	}
};
static_assert(alignof(UCreative_VisibleInGame_Component_C) == 0x000008, "Wrong alignment on UCreative_VisibleInGame_Component_C");
static_assert(sizeof(UCreative_VisibleInGame_Component_C) == 0x000148, "Wrong size on UCreative_VisibleInGame_Component_C");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, UberGraphFrame_Creative_VisibleInGame_Component_C) == 0x0000B8, "Member 'UCreative_VisibleInGame_Component_C::UberGraphFrame_Creative_VisibleInGame_Component_C' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, On_Visibility_Changed) == 0x0000C0, "Member 'UCreative_VisibleInGame_Component_C::On_Visibility_Changed' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, VisibleSceneComponents) == 0x0000D0, "Member 'UCreative_VisibleInGame_Component_C::VisibleSceneComponents' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, bEnableCollisionUpdates) == 0x0000E0, "Member 'UCreative_VisibleInGame_Component_C::bEnableCollisionUpdates' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, Default_Collision_Enabled_State) == 0x0000E1, "Member 'UCreative_VisibleInGame_Component_C::Default_Collision_Enabled_State' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, Collision_Disabled_State) == 0x0000E2, "Member 'UCreative_VisibleInGame_Component_C::Collision_Disabled_State' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, VisibleDuringPhase) == 0x0000E3, "Member 'UCreative_VisibleInGame_Component_C::VisibleDuringPhase' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, bResetOnComponentActivation) == 0x0000E4, "Member 'UCreative_VisibleInGame_Component_C::bResetOnComponentActivation' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, RetryBindMiniGameEventsTimer) == 0x0000E8, "Member 'UCreative_VisibleInGame_Component_C::RetryBindMiniGameEventsTimer' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, Collision_Enabled_Overrides) == 0x0000F0, "Member 'UCreative_VisibleInGame_Component_C::Collision_Enabled_Overrides' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, ForcedVisibilityDuringGame) == 0x000140, "Member 'UCreative_VisibleInGame_Component_C::ForcedVisibilityDuringGame' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, bUseSetHiddenInGame) == 0x000141, "Member 'UCreative_VisibleInGame_Component_C::bUseSetHiddenInGame' has a wrong offset!");
static_assert(offsetof(UCreative_VisibleInGame_Component_C, Update_Foliage_on_Visibility_Change) == 0x000142, "Member 'UCreative_VisibleInGame_Component_C::Update_Foliage_on_Visibility_Change' has a wrong offset!");

}

