#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeIslandLinkEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeIslandLinkEntry.CreativeIslandLinkEntry_C
// 0x0058 (0x0BD0 - 0x0B78)
class UCreativeIslandLinkEntry_C final : public UFortCreativeIslandLinkEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Text;                                       // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimplePipButton_C*                     SimplePipButton;                                   // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CreatorName;                                  // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandDescription;                            // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Version;                                      // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Mnemonic;                                          // 0x0BC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_OnSelected();
	void BP_OnDeselected();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BndEvt__SimplePipButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_CreativeIslandLinkEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeIslandLinkEntry_C">();
	}
	static class UCreativeIslandLinkEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeIslandLinkEntry_C>();
	}
};
static_assert(alignof(UCreativeIslandLinkEntry_C) == 0x000008, "Wrong alignment on UCreativeIslandLinkEntry_C");
static_assert(sizeof(UCreativeIslandLinkEntry_C) == 0x000BD0, "Wrong size on UCreativeIslandLinkEntry_C");
static_assert(offsetof(UCreativeIslandLinkEntry_C, UberGraphFrame) == 0x000B78, "Member 'UCreativeIslandLinkEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Border_Text) == 0x000B80, "Member 'UCreativeIslandLinkEntry_C::Border_Text' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Image_0) == 0x000B88, "Member 'UCreativeIslandLinkEntry_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Image_SelectedBG) == 0x000B90, "Member 'UCreativeIslandLinkEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, SimplePipButton) == 0x000B98, "Member 'UCreativeIslandLinkEntry_C::SimplePipButton' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_CreatorName) == 0x000BA0, "Member 'UCreativeIslandLinkEntry_C::Text_CreatorName' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_IslandDescription) == 0x000BA8, "Member 'UCreativeIslandLinkEntry_C::Text_IslandDescription' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_IslandName) == 0x000BB0, "Member 'UCreativeIslandLinkEntry_C::Text_IslandName' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_Version) == 0x000BB8, "Member 'UCreativeIslandLinkEntry_C::Text_Version' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Mnemonic) == 0x000BC0, "Member 'UCreativeIslandLinkEntry_C::Mnemonic' has a wrong offset!");

}

