#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_DeviceComponent_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Creative_DeviceComponent_Parent.Creative_DeviceComponent_Parent_C.ExecuteUbergraph_Creative_DeviceComponent_Parent
// 0x0040 (0x0040 - 0x0000)
struct Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6325[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class ACreative_Device_Prop_Parent_C*         K2Node_DynamicCast_AsCreative_Device_Prop_Parent;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent) == 0x000008, "Wrong alignment on Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent");
static_assert(sizeof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent) == 0x000040, "Wrong size on Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, EntryPoint) == 0x000000, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, K2Node_DynamicCast_AsCreative_Device_Prop_Parent) == 0x000030, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::K2Node_DynamicCast_AsCreative_Device_Prop_Parent' has a wrong offset!");
static_assert(offsetof(Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Creative_DeviceComponent_Parent_C_ExecuteUbergraph_Creative_DeviceComponent_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

