#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerPipButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeServerPipButton.CreativeServerPipButton_C
// 0x0048 (0x0BB8 - 0x0B70)
class UCreativeServerPipButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             ContentSlot;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ControllerInputStyle;                              // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ButtonClickAction;                                 // 0x0B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EHorizontalAlignment                          InputActionHorizontalAlignment;                    // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            InputActionVerticalAlignment;                      // 0x0BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C7B[0x2];                                     // 0x0BA2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InputActionRenderTranslation;                      // 0x0BA4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionUseRimBrush;                            // 0x0BAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C7C[0x3];                                     // 0x0BAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InputActionRimBrushSize;                           // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateInputActionLayout();
	void UpdateStyle(bool bUsingGamepad);
	void InitializeButton();
	void UpdateTextAndStyle();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void OnActionProgress(float HeldPercent);
	void OnActionComplete();
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_CreativeServerPipButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeServerPipButton_C">();
	}
	static class UCreativeServerPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeServerPipButton_C>();
	}
};
static_assert(alignof(UCreativeServerPipButton_C) == 0x000008, "Wrong alignment on UCreativeServerPipButton_C");
static_assert(sizeof(UCreativeServerPipButton_C) == 0x000BB8, "Wrong size on UCreativeServerPipButton_C");
static_assert(offsetof(UCreativeServerPipButton_C, UberGraphFrame) == 0x000B70, "Member 'UCreativeServerPipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, ContentSlot) == 0x000B78, "Member 'UCreativeServerPipButton_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, ControllerInputStyle) == 0x000B80, "Member 'UCreativeServerPipButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, MouseKeyboardStyle) == 0x000B88, "Member 'UCreativeServerPipButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, ButtonClickAction) == 0x000B90, "Member 'UCreativeServerPipButton_C::ButtonClickAction' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, InputActionHorizontalAlignment) == 0x000BA0, "Member 'UCreativeServerPipButton_C::InputActionHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, InputActionVerticalAlignment) == 0x000BA1, "Member 'UCreativeServerPipButton_C::InputActionVerticalAlignment' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, InputActionRenderTranslation) == 0x000BA4, "Member 'UCreativeServerPipButton_C::InputActionRenderTranslation' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, InputActionUseRimBrush) == 0x000BAC, "Member 'UCreativeServerPipButton_C::InputActionUseRimBrush' has a wrong offset!");
static_assert(offsetof(UCreativeServerPipButton_C, InputActionRimBrushSize) == 0x000BB0, "Member 'UCreativeServerPipButton_C::InputActionRimBrushSize' has a wrong offset!");

}

