#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativePortalHUDDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.PopulateTags
// 0x0080 (0x0080 - 0x0000)
struct CreativePortalHUDDetails_C_PopulateTags final
{
public:
	TArray<struct FCreativeIslandDescriptionTag>  TagArray;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F32[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F33[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeIslandDescriptionTag          CallFunc_Array_Get_Item;                           // 0x0038(0x0028)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F34[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCr_ItemTag_C*                          CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_PopulateTags) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_PopulateTags");
static_assert(sizeof(CreativePortalHUDDetails_C_PopulateTags) == 0x000080, "Wrong size on CreativePortalHUDDetails_C_PopulateTags");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, TagArray) == 0x000000, "Member 'CreativePortalHUDDetails_C_PopulateTags::TagArray' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'CreativePortalHUDDetails_C_PopulateTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, Temp_int_Array_Index_Variable) == 0x000020, "Member 'CreativePortalHUDDetails_C_PopulateTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, K2Node_MakeStruct_Margin) == 0x000024, "Member 'CreativePortalHUDDetails_C_PopulateTags::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_Array_Get_Item) == 0x000038, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_TextIsEmpty_ReturnValue) == 0x000060, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_Create_ReturnValue) == 0x000070, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_PopulateTags, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000078, "Member 'CreativePortalHUDDetails_C_PopulateTags::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.UpdateVisBasedOnDistance
// 0x0006 (0x0006 - 0x0000)
struct CreativePortalHUDDetails_C_UpdateVisBasedOnDistance final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance) == 0x000001, "Wrong alignment on CreativePortalHUDDetails_C_UpdateVisBasedOnDistance");
static_assert(sizeof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance) == 0x000006, "Wrong size on CreativePortalHUDDetails_C_UpdateVisBasedOnDistance");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, Temp_bool_Variable) == 0x000000, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, Temp_byte_Variable) == 0x000001, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, Temp_byte_Variable_1) == 0x000002, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000003, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_UpdateVisBasedOnDistance, K2Node_Select_Default) == 0x000005, "Member 'CreativePortalHUDDetails_C_UpdateVisBasedOnDistance::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetLinkCode
// 0x0038 (0x0038 - 0x0000)
struct CreativePortalHUDDetails_C_SetLinkCode final
{
public:
	class FString                                 LinkCode;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F35[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetLinkCode) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetLinkCode");
static_assert(sizeof(CreativePortalHUDDetails_C_SetLinkCode) == 0x000038, "Wrong size on CreativePortalHUDDetails_C_SetLinkCode");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, LinkCode) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetLinkCode::LinkCode' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, Temp_bool_Variable) == 0x000010, "Member 'CreativePortalHUDDetails_C_SetLinkCode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'CreativePortalHUDDetails_C_SetLinkCode::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, CallFunc_Len_ReturnValue) == 0x000030, "Member 'CreativePortalHUDDetails_C_SetLinkCode::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, Temp_byte_Variable) == 0x000034, "Member 'CreativePortalHUDDetails_C_SetLinkCode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000035, "Member 'CreativePortalHUDDetails_C_SetLinkCode::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, Temp_byte_Variable_1) == 0x000036, "Member 'CreativePortalHUDDetails_C_SetLinkCode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetLinkCode, K2Node_Select_Default) == 0x000037, "Member 'CreativePortalHUDDetails_C_SetLinkCode::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetDescription
// 0x0038 (0x0038 - 0x0000)
struct CreativePortalHUDDetails_C_SetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F36[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCreativeIslandDescriptionTag>  CallFunc_GetIslandDescriptionTags_DescriptionTags; // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetDescription) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetDescription");
static_assert(sizeof(CreativePortalHUDDetails_C_SetDescription) == 0x000038, "Wrong size on CreativePortalHUDDetails_C_SetDescription");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, Description) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetDescription::Description' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, Temp_bool_Variable) == 0x000018, "Member 'CreativePortalHUDDetails_C_SetDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'CreativePortalHUDDetails_C_SetDescription::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, Temp_byte_Variable) == 0x00001A, "Member 'CreativePortalHUDDetails_C_SetDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'CreativePortalHUDDetails_C_SetDescription::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, Temp_byte_Variable_1) == 0x00001C, "Member 'CreativePortalHUDDetails_C_SetDescription::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, CallFunc_GetIslandDescriptionTags_DescriptionTags) == 0x000020, "Member 'CreativePortalHUDDetails_C_SetDescription::CallFunc_GetIslandDescriptionTags_DescriptionTags' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetDescription, K2Node_Select_Default) == 0x000030, "Member 'CreativePortalHUDDetails_C_SetDescription::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetCuratedStatus
// 0x0006 (0x0006 - 0x0000)
struct CreativePortalHUDDetails_C_SetCuratedStatus final
{
public:
	bool                                          bIsFeatured;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLinkCode;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsUserInitiatedLoad;                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetCuratedStatus) == 0x000001, "Wrong alignment on CreativePortalHUDDetails_C_SetCuratedStatus");
static_assert(sizeof(CreativePortalHUDDetails_C_SetCuratedStatus) == 0x000006, "Wrong size on CreativePortalHUDDetails_C_SetCuratedStatus");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, bIsFeatured) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::bIsFeatured' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, bIsLinkCode) == 0x000001, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::bIsLinkCode' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, bIsUserInitiatedLoad) == 0x000002, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::bIsUserInitiatedLoad' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetCuratedStatus, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'CreativePortalHUDDetails_C_SetCuratedStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetupPortalEventBinding
// 0x00D0 (0x00D0 - 0x0000)
struct CreativePortalHUDDetails_C_SetupPortalEventBinding final
{
public:
	class ABGA_IslandPortal_C*                    InPortal;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bind;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F37[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& LinkCode)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& LinkCode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText Description)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText Description)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsCurated, bool bIsLinkCode, bool bIsUserInitiatedLoad)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsCurated, bool bIsLinkCode, bool bIsUserInitiatedLoad)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText NewIslandName)>    K2Node_CreateDelegate_OutputDelegate_6;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText NewPlayerName)>    K2Node_CreateDelegate_OutputDelegate_7;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 NewPop)>                 K2Node_CreateDelegate_OutputDelegate_8;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 NewPop)>                 K2Node_CreateDelegate_OutputDelegate_9;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText NewPlayerName)>    K2Node_CreateDelegate_OutputDelegate_10;           // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText NewIslandName)>    K2Node_CreateDelegate_OutputDelegate_11;           // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetupPortalEventBinding) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetupPortalEventBinding");
static_assert(sizeof(CreativePortalHUDDetails_C_SetupPortalEventBinding) == 0x0000D0, "Wrong size on CreativePortalHUDDetails_C_SetupPortalEventBinding");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, InPortal) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::InPortal' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, Bind) == 0x000008, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::Bind' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_4) == 0x00004C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_5) == 0x00005C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_6) == 0x00006C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_7) == 0x00007C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_8) == 0x00008C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_9) == 0x00009C, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000AC, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetupPortalEventBinding, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000BC, "Member 'CreativePortalHUDDetails_C_SetupPortalEventBinding::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetIslandName
// 0x0038 (0x0038 - 0x0000)
struct CreativePortalHUDDetails_C_SetIslandName final
{
public:
	class FText                                   NewIslandName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetIslandName) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetIslandName");
static_assert(sizeof(CreativePortalHUDDetails_C_SetIslandName) == 0x000038, "Wrong size on CreativePortalHUDDetails_C_SetIslandName");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, NewIslandName) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetIslandName::NewIslandName' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'CreativePortalHUDDetails_C_SetIslandName::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'CreativePortalHUDDetails_C_SetIslandName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, Temp_bool_Variable) == 0x000031, "Member 'CreativePortalHUDDetails_C_SetIslandName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, Temp_byte_Variable) == 0x000032, "Member 'CreativePortalHUDDetails_C_SetIslandName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, Temp_byte_Variable_1) == 0x000033, "Member 'CreativePortalHUDDetails_C_SetIslandName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandName, K2Node_Select_Default) == 0x000034, "Member 'CreativePortalHUDDetails_C_SetIslandName::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetIslandPop
// 0x00C8 (0x00C8 - 0x0000)
struct CreativePortalHUDDetails_C_SetIslandPop final
{
public:
	int32                                         NewPop;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F38[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F39[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
};
static_assert(alignof(CreativePortalHUDDetails_C_SetIslandPop) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetIslandPop");
static_assert(sizeof(CreativePortalHUDDetails_C_SetIslandPop) == 0x0000C8, "Wrong size on CreativePortalHUDDetails_C_SetIslandPop");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, NewPop) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetIslandPop::NewPop' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'CreativePortalHUDDetails_C_SetIslandPop::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_GetGameState_ReturnValue) == 0x000050, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_Min_ReturnValue) == 0x00005C, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'CreativePortalHUDDetails_C_SetIslandPop::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, K2Node_MakeArray_Array) == 0x0000A0, "Member 'CreativePortalHUDDetails_C_SetIslandPop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetIslandPop, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'CreativePortalHUDDetails_C_SetIslandPop::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.SetPlayerName
// 0x0020 (0x0020 - 0x0000)
struct CreativePortalHUDDetails_C_SetPlayerName final
{
public:
	class FText                                   Param_PlayerName;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_SetPlayerName) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_SetPlayerName");
static_assert(sizeof(CreativePortalHUDDetails_C_SetPlayerName) == 0x000020, "Wrong size on CreativePortalHUDDetails_C_SetPlayerName");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, Param_PlayerName) == 0x000000, "Member 'CreativePortalHUDDetails_C_SetPlayerName::Param_PlayerName' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, Temp_bool_Variable) == 0x000018, "Member 'CreativePortalHUDDetails_C_SetPlayerName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'CreativePortalHUDDetails_C_SetPlayerName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, Temp_byte_Variable) == 0x00001A, "Member 'CreativePortalHUDDetails_C_SetPlayerName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, Temp_byte_Variable_1) == 0x00001B, "Member 'CreativePortalHUDDetails_C_SetPlayerName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_SetPlayerName, K2Node_Select_Default) == 0x00001C, "Member 'CreativePortalHUDDetails_C_SetPlayerName::K2Node_Select_Default' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct CreativePortalHUDDetails_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_InitFromObject) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_InitFromObject");
static_assert(sizeof(CreativePortalHUDDetails_C_InitFromObject) == 0x000008, "Wrong size on CreativePortalHUDDetails_C_InitFromObject");
static_assert(offsetof(CreativePortalHUDDetails_C_InitFromObject, InitObject) == 0x000000, "Member 'CreativePortalHUDDetails_C_InitFromObject::InitObject' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.OnNewVisibilityThresholdChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged final
{
public:
	bool                                          bNewVis;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged) == 0x000001, "Wrong alignment on CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged");
static_assert(sizeof(CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged) == 0x000001, "Wrong size on CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged");
static_assert(offsetof(CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged, bNewVis) == 0x000000, "Member 'CreativePortalHUDDetails_C_OnNewVisibilityThresholdChanged::bNewVis' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.ExecuteUbergraph_CreativePortalHUDDetails
// 0x0050 (0x0050 - 0x0000)
struct CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F3A[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeModeAccessLimited_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F3B[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InitObject;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_IslandPortal_C*                    K2Node_DynamicCast_AsBGA_Island_Portal;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bNewVis;                        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F3C[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails");
static_assert(sizeof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails) == 0x000050, "Wrong size on CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, EntryPoint) == 0x000000, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, Temp_bool_Variable) == 0x000004, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, Temp_byte_Variable) == 0x000005, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, Temp_byte_Variable_1) == 0x000006, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_TextIsEmpty_ReturnValue) == 0x000007, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_IsCreativeModeAccessLimited_ReturnValue) == 0x000018, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_IsCreativeModeAccessLimited_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, K2Node_Event_InitObject) == 0x000020, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, K2Node_DynamicCast_AsBGA_Island_Portal) == 0x000028, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::K2Node_DynamicCast_AsBGA_Island_Portal' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, K2Node_Select_Default) == 0x000031, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, K2Node_CustomEvent_bNewVis) == 0x000032, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::K2Node_CustomEvent_bNewVis' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'CreativePortalHUDDetails_C_ExecuteUbergraph_CreativePortalHUDDetails::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function CreativePortalHUDDetails.CreativePortalHUDDetails_C.GetIslandDescriptionTags
// 0x0028 (0x0028 - 0x0000)
struct CreativePortalHUDDetails_C_GetIslandDescriptionTags final
{
public:
	TArray<struct FCreativeIslandDescriptionTag>  DescriptionTags;                                   // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F3D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCreativeIslandDescriptionTag>  CallFunc_GetIslandDescriptionTags_ReturnValue;     // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(CreativePortalHUDDetails_C_GetIslandDescriptionTags) == 0x000008, "Wrong alignment on CreativePortalHUDDetails_C_GetIslandDescriptionTags");
static_assert(sizeof(CreativePortalHUDDetails_C_GetIslandDescriptionTags) == 0x000028, "Wrong size on CreativePortalHUDDetails_C_GetIslandDescriptionTags");
static_assert(offsetof(CreativePortalHUDDetails_C_GetIslandDescriptionTags, DescriptionTags) == 0x000000, "Member 'CreativePortalHUDDetails_C_GetIslandDescriptionTags::DescriptionTags' has a wrong offset!");
static_assert(offsetof(CreativePortalHUDDetails_C_GetIslandDescriptionTags, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'CreativePortalHUDDetails_C_GetIslandDescriptionTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
