#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CruciblePrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CruciblePrompt.CruciblePrompt_C
// 0x0050 (0x02F8 - 0x02A8)
class UCruciblePrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Header;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFX_Intro;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CruciblePrompt(int32 EntryPoint);
	void CloseWidget();
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CruciblePrompt_C">();
	}
	static class UCruciblePrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCruciblePrompt_C>();
	}
};
static_assert(alignof(UCruciblePrompt_C) == 0x000008, "Wrong alignment on UCruciblePrompt_C");
static_assert(sizeof(UCruciblePrompt_C) == 0x0002F8, "Wrong size on UCruciblePrompt_C");
static_assert(offsetof(UCruciblePrompt_C, UberGraphFrame) == 0x0002A8, "Member 'UCruciblePrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Outro) == 0x0002B0, "Member 'UCruciblePrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Intro) == 0x0002B8, "Member 'UCruciblePrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Image_FiligreeLeft) == 0x0002C0, "Member 'UCruciblePrompt_C::Image_FiligreeLeft' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Image_FiligreeRight) == 0x0002C8, "Member 'UCruciblePrompt_C::Image_FiligreeRight' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Image_Header) == 0x0002D0, "Member 'UCruciblePrompt_C::Image_Header' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Image_Shadow) == 0x0002D8, "Member 'UCruciblePrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Text_Description) == 0x0002E0, "Member 'UCruciblePrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, Text_Title) == 0x0002E8, "Member 'UCruciblePrompt_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UCruciblePrompt_C, SFX_Intro) == 0x0002F0, "Member 'UCruciblePrompt_C::SFX_Intro' has a wrong offset!");

}

