#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomLocomotionLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomLocomotionLayerInterface.CustomLocomotionLayerInterface_C.CustomLocomotionFullBodyLayer
// 0x0020 (0x0020 - 0x0000)
struct CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer final
{
public:
	struct FPoseLink                              PassThroughCustomFullBody;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_CustomLocomotionFullBodyLayer;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer) == 0x000008, "Wrong alignment on CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer");
static_assert(sizeof(CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer) == 0x000020, "Wrong size on CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer");
static_assert(offsetof(CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer, PassThroughCustomFullBody) == 0x000000, "Member 'CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer::PassThroughCustomFullBody' has a wrong offset!");
static_assert(offsetof(CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer, Param_CustomLocomotionFullBodyLayer) == 0x000010, "Member 'CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer::Param_CustomLocomotionFullBodyLayer' has a wrong offset!");

// Function CustomLocomotionLayerInterface.CustomLocomotionLayerInterface_C.CustomLocomotionPreIKLayer
// 0x0020 (0x0020 - 0x0000)
struct CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer final
{
public:
	struct FPoseLink                              InPosePreIK;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_CustomLocomotionPreIKLayer;                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer) == 0x000008, "Wrong alignment on CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer");
static_assert(sizeof(CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer) == 0x000020, "Wrong size on CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer");
static_assert(offsetof(CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer, InPosePreIK) == 0x000000, "Member 'CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer::InPosePreIK' has a wrong offset!");
static_assert(offsetof(CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer, Param_CustomLocomotionPreIKLayer) == 0x000010, "Member 'CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer::Param_CustomLocomotionPreIKLayer' has a wrong offset!");

}

