#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_CarminePack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function DA_CarminePack.DA_CarminePack_C.ExecuteUbergraph_DA_CarminePack
// 0x0338 (0x0338 - 0x0000)
struct DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC3[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper_1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0030(0x00B0)()
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC4[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x00F0(0x00B0)()
	int32                                         Temp_int_Variable;                                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC5[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC6[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC7[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EC8[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x01E8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4EC9[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECA[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECB[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECC[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_5;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECD[0x6];                                     // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate;              // 0x02D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECE[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_6;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECF[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x02FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED0[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED1[0x6];                                     // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED2[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ED3[0x2];                                     // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue_1; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack) == 0x000008, "Wrong alignment on DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack");
static_assert(sizeof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack) == 0x000338, "Wrong size on DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, EntryPoint) == 0x000000, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::EntryPoint' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, Temp_bool_Variable) == 0x000010, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_Event_FortDecoHelper_1) == 0x000018, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_Event_FortDecoHelper_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_Event_FortDecoHelper) == 0x000020, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_Event_FortDecoHelper' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue) == 0x000028, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_MakeStruct_GameplayEventData) == 0x000030, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsFort_Pawn) == 0x0000E0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_IsFalling_ReturnValue) == 0x0000E9, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_MakeStruct_GameplayEventData_1) == 0x0000F0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_MakeStruct_GameplayEventData_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, Temp_int_Variable) == 0x0001A0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001A4, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A5, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_1) == 0x0001A8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001B0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_2) == 0x0001B8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, Temp_bool_Variable_1) == 0x0001C0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0001C8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001D9, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_3) == 0x0001E0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_CustomEvent_Hit) == 0x0001E8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000278, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess_2) == 0x000280, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_4) == 0x000288, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_BooleanAND_ReturnValue) == 0x000290, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000298, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess_3) == 0x0002A8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_5) == 0x0002B0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsFort_Pawn_2) == 0x0002B8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsFort_Pawn_2' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess_4) == 0x0002C0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0002C1, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0002C8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue) == 0x0002D0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_CreateDelegate_OutputDelegate) == 0x0002D4, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0002E4, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetInstigator_ReturnValue_6) == 0x0002E8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetInstigator_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002F0, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, K2Node_DynamicCast_bSuccess_5) == 0x0002F8, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Array_Get_Item) == 0x0002FC, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000308, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000310, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_IsValid_ReturnValue) == 0x000311, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue) == 0x000318, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Array_Length_ReturnValue) == 0x000320, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Less_IntInt_ReturnValue) == 0x000324, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Add_IntInt_ReturnValue_1) == 0x000328, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_IsServer_ReturnValue) == 0x00032C, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_Greater_IntInt_ReturnValue) == 0x00032D, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack, CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue_1) == 0x000330, "Member 'DA_CarminePack_C_ExecuteUbergraph_DA_CarminePack::CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue_1' has a wrong offset!");

// Function DA_CarminePack.DA_CarminePack_C.Landed
// 0x008C (0x008C - 0x0000)
struct DA_CarminePack_C_Landed final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DA_CarminePack_C_Landed) == 0x000004, "Wrong alignment on DA_CarminePack_C_Landed");
static_assert(sizeof(DA_CarminePack_C_Landed) == 0x00008C, "Wrong size on DA_CarminePack_C_Landed");
static_assert(offsetof(DA_CarminePack_C_Landed, Hit) == 0x000000, "Member 'DA_CarminePack_C_Landed::Hit' has a wrong offset!");

// Function DA_CarminePack.DA_CarminePack_C.BPPressSecondaryFire
// 0x0008 (0x0008 - 0x0000)
struct DA_CarminePack_C_BPPressSecondaryFire final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_CarminePack_C_BPPressSecondaryFire) == 0x000008, "Wrong alignment on DA_CarminePack_C_BPPressSecondaryFire");
static_assert(sizeof(DA_CarminePack_C_BPPressSecondaryFire) == 0x000008, "Wrong size on DA_CarminePack_C_BPPressSecondaryFire");
static_assert(offsetof(DA_CarminePack_C_BPPressSecondaryFire, FortDecoHelper) == 0x000000, "Member 'DA_CarminePack_C_BPPressSecondaryFire::FortDecoHelper' has a wrong offset!");

// Function DA_CarminePack.DA_CarminePack_C.BPPressTrigger
// 0x0008 (0x0008 - 0x0000)
struct DA_CarminePack_C_BPPressTrigger final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DA_CarminePack_C_BPPressTrigger) == 0x000008, "Wrong alignment on DA_CarminePack_C_BPPressTrigger");
static_assert(sizeof(DA_CarminePack_C_BPPressTrigger) == 0x000008, "Wrong size on DA_CarminePack_C_BPPressTrigger");
static_assert(offsetof(DA_CarminePack_C_BPPressTrigger, FortDecoHelper) == 0x000000, "Member 'DA_CarminePack_C_BPPressTrigger::FortDecoHelper' has a wrong offset!");

}

