#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_SpookyMist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_SpookyMist.DA_SpookyMist_C
// 0x0040 (0x0CE0 - 0x0CA0)
class ADA_SpookyMist_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanCancelAbility;                                  // 0x0CA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BAA[0x7];                                     // 0x0CA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CanCancelTimer;                                    // 0x0CB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CancelDelay;                                       // 0x0CB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_SpookyMist(int32 EntryPoint);
	void On_DBNO();
	void ReceiveBeginPlay();
	void CanCancel();
	void BPReleaseSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPOnUnEquip();
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_SpookyMist_C">();
	}
	static class ADA_SpookyMist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_SpookyMist_C>();
	}
};
static_assert(alignof(ADA_SpookyMist_C) == 0x000008, "Wrong alignment on ADA_SpookyMist_C");
static_assert(sizeof(ADA_SpookyMist_C) == 0x000CE0, "Wrong size on ADA_SpookyMist_C");
static_assert(offsetof(ADA_SpookyMist_C, UberGraphFrame) == 0x000CA0, "Member 'ADA_SpookyMist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_SpookyMist_C, CanCancelAbility) == 0x000CA8, "Member 'ADA_SpookyMist_C::CanCancelAbility' has a wrong offset!");
static_assert(offsetof(ADA_SpookyMist_C, CanCancelTimer) == 0x000CB0, "Member 'ADA_SpookyMist_C::CanCancelTimer' has a wrong offset!");
static_assert(offsetof(ADA_SpookyMist_C, CancelDelay) == 0x000CB8, "Member 'ADA_SpookyMist_C::CancelDelay' has a wrong offset!");
static_assert(offsetof(ADA_SpookyMist_C, PlayerPawn) == 0x000CD8, "Member 'ADA_SpookyMist_C::PlayerPawn' has a wrong offset!");

}

