#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBNO_Carried_Simulation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DBNO_Carried_Simulation.DBNO_Carried_Simulation_C
// 0x0810 (0x0A80 - 0x0270)
class UDBNO_Carried_Simulation_C final : public UAnimInstance
{
public:
	uint8                                         Pad_554B[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x02A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x02C8(0x0088)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x0350(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0370(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0410(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x04D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0500(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x05C8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x05E8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0608(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x0630(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0650(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0670(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0698(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x06C0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x06E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0700(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0728(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0748(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0768(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0790(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x07D0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07F8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x08C0(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x08E8(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0988(0x00A0)()
	bool                                          Carried;                                           // 0x0A28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_554C[0x7];                                     // 0x0A29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   CarrierPawn;                                       // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                CarrierAnimBP;                                     // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LHandIKLocation;                                   // 0x0A40(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LHandIKRotation;                                   // 0x0A4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                TempAttachLocation;                                // 0x0A58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TempAttachRotation;                                // 0x0A64(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortCustomBodyType                           My_bodytype;                                       // 0x0A70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             My_gender;                                         // 0x0A71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMale;                                            // 0x0A72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortPlayerAnimBodyType                       My_animbodytype;                                   // 0x0A73(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         bodytype_int;                                      // 0x0A74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DBNO_Carried_Simulation(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DBNO_Carried_Simulation_C">();
	}
	static class UDBNO_Carried_Simulation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBNO_Carried_Simulation_C>();
	}
};
static_assert(alignof(UDBNO_Carried_Simulation_C) == 0x000010, "Wrong alignment on UDBNO_Carried_Simulation_C");
static_assert(sizeof(UDBNO_Carried_Simulation_C) == 0x000A80, "Wrong size on UDBNO_Carried_Simulation_C");
static_assert(offsetof(UDBNO_Carried_Simulation_C, UberGraphFrame) == 0x000270, "Member 'UDBNO_Carried_Simulation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_Root) == 0x000278, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace_5) == 0x0002A8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace_5' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_SubInput) == 0x0002C8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace_5) == 0x000350, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace_5' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_BlendListByBool) == 0x000370, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_SaveCachedPose_2) == 0x000410, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_7) == 0x0004D8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_SaveCachedPose_1) == 0x000500, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace_4) == 0x0005C8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace_4' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace_4) == 0x0005E8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace_4' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_6) == 0x000608, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x000630, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace_3) == 0x000650, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_5) == 0x000670, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_4) == 0x000698, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x0006C0, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0006E0, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_3) == 0x000700, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000728, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000748, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_2) == 0x000768, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_ComponentToLocalSpace) == 0x000790, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_LocalToComponentSpace) == 0x0007B0, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose_1) == 0x0007D0, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_SaveCachedPose) == 0x0007F8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_UseCachedPose) == 0x0008C0, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_BlendListByInt_1) == 0x0008E8, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, AnimGraphNode_BlendListByInt) == 0x000988, "Member 'UDBNO_Carried_Simulation_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, Carried) == 0x000A28, "Member 'UDBNO_Carried_Simulation_C::Carried' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, CarrierPawn) == 0x000A30, "Member 'UDBNO_Carried_Simulation_C::CarrierPawn' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, CarrierAnimBP) == 0x000A38, "Member 'UDBNO_Carried_Simulation_C::CarrierAnimBP' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, LHandIKLocation) == 0x000A40, "Member 'UDBNO_Carried_Simulation_C::LHandIKLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, LHandIKRotation) == 0x000A4C, "Member 'UDBNO_Carried_Simulation_C::LHandIKRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, TempAttachLocation) == 0x000A58, "Member 'UDBNO_Carried_Simulation_C::TempAttachLocation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, TempAttachRotation) == 0x000A64, "Member 'UDBNO_Carried_Simulation_C::TempAttachRotation' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, My_bodytype) == 0x000A70, "Member 'UDBNO_Carried_Simulation_C::My_bodytype' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, My_gender) == 0x000A71, "Member 'UDBNO_Carried_Simulation_C::My_gender' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, IsMale) == 0x000A72, "Member 'UDBNO_Carried_Simulation_C::IsMale' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, My_animbodytype) == 0x000A73, "Member 'UDBNO_Carried_Simulation_C::My_animbodytype' has a wrong offset!");
static_assert(offsetof(UDBNO_Carried_Simulation_C, bodytype_int) == 0x000A74, "Member 'UDBNO_Carried_Simulation_C::bodytype_int' has a wrong offset!");

}

