#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DivisionDetailsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DivisionDetailsScreen.DivisionDetailsScreen_C
// 0x0058 (0x04C0 - 0x0468)
class UDivisionDetailsScreen_C final : public UFortDivisionDetailsScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  BackButton;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GeneralDivisionInfo;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBG;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  NextButton;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ScoringPayoutInfo;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_TopContainer;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RightShoulderButton(bool* Handled);
	void LeftShoulderButton(bool* Handled);
	void EmptyFunction(bool* Handled);
	void BP_OnActivated();
	void BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__NextButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_DivisionDetailsScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DivisionDetailsScreen_C">();
	}
	static class UDivisionDetailsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDivisionDetailsScreen_C>();
	}
};
static_assert(alignof(UDivisionDetailsScreen_C) == 0x000008, "Wrong alignment on UDivisionDetailsScreen_C");
static_assert(sizeof(UDivisionDetailsScreen_C) == 0x0004C0, "Wrong size on UDivisionDetailsScreen_C");
static_assert(offsetof(UDivisionDetailsScreen_C, UberGraphFrame) == 0x000468, "Member 'UDivisionDetailsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, Intro) == 0x000470, "Member 'UDivisionDetailsScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, BackButton) == 0x000478, "Member 'UDivisionDetailsScreen_C::BackButton' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, GeneralDivisionInfo) == 0x000480, "Member 'UDivisionDetailsScreen_C::GeneralDivisionInfo' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, Image_12) == 0x000488, "Member 'UDivisionDetailsScreen_C::Image_12' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, Image_PanelBG) == 0x000490, "Member 'UDivisionDetailsScreen_C::Image_PanelBG' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, Image_PanelBorder) == 0x000498, "Member 'UDivisionDetailsScreen_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, NextButton) == 0x0004A0, "Member 'UDivisionDetailsScreen_C::NextButton' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, SafeZone_1) == 0x0004A8, "Member 'UDivisionDetailsScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, ScoringPayoutInfo) == 0x0004B0, "Member 'UDivisionDetailsScreen_C::ScoringPayoutInfo' has a wrong offset!");
static_assert(offsetof(UDivisionDetailsScreen_C, SizeBox_TopContainer) == 0x0004B8, "Member 'UDivisionDetailsScreen_C::SizeBox_TopContainer' has a wrong offset!");

}

