#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EliminatedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EliminatedOverlay.EliminatedOverlay_C
// 0x0040 (0x0350 - 0x0310)
class UEliminatedOverlay_C final : public UEliminatedOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MultiWinnerSwap;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinnerDetermined;                                  // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlacementOutro;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlacementIntro;                                    // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EliminatedToSpectating;                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EliminatedByIntro;                                 // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPlayerRankEmblem_C*                    PlayerRankEmblem;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FText DeathCauseToText(EDeathCause DeathCause);
	void SetPlaceTextFont_TEMP();
	bool IsEliminatedByIntroAnimFinished();
	void Construct();
	void WinnerSwapComplete();
	void PlacementIntroComplete();
	void PlayPlacementOutro();
	void SetBannerInfo(const struct FPlayerBannerInfo& BannerInfo);
	void OnShowPlacementBox();
	void OnUpdateMultiwinner();
	void OnWinnerDetermined();
	void OnResetSpectatingForCreative();
	void OnEliminatedByIntro();
	void CustomEvent_0();
	void ExecuteUbergraph_EliminatedOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EliminatedOverlay_C">();
	}
	static class UEliminatedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEliminatedOverlay_C>();
	}
};
static_assert(alignof(UEliminatedOverlay_C) == 0x000008, "Wrong alignment on UEliminatedOverlay_C");
static_assert(sizeof(UEliminatedOverlay_C) == 0x000350, "Wrong size on UEliminatedOverlay_C");
static_assert(offsetof(UEliminatedOverlay_C, UberGraphFrame) == 0x000310, "Member 'UEliminatedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, MultiWinnerSwap) == 0x000318, "Member 'UEliminatedOverlay_C::MultiWinnerSwap' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, WinnerDetermined) == 0x000320, "Member 'UEliminatedOverlay_C::WinnerDetermined' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlacementOutro) == 0x000328, "Member 'UEliminatedOverlay_C::PlacementOutro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlacementIntro) == 0x000330, "Member 'UEliminatedOverlay_C::PlacementIntro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, EliminatedToSpectating) == 0x000338, "Member 'UEliminatedOverlay_C::EliminatedToSpectating' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, EliminatedByIntro) == 0x000340, "Member 'UEliminatedOverlay_C::EliminatedByIntro' has a wrong offset!");
static_assert(offsetof(UEliminatedOverlay_C, PlayerRankEmblem) == 0x000348, "Member 'UEliminatedOverlay_C::PlayerRankEmblem' has a wrong offset!");

}

