#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyNoticeWidgetBR

#include "Basic.hpp"


namespace SDK::Params
{

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.Show Notice
// 0x0008 (0x0008 - 0x0000)
struct EmergencyNoticeWidgetBR_C_Show_Notice final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_Show_Notice) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_Show_Notice");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_Show_Notice) == 0x000008, "Wrong size on EmergencyNoticeWidgetBR_C_Show_Notice");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_Show_Notice, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_Show_Notice::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.ShowNotice
// 0x0030 (0x0030 - 0x0000)
struct EmergencyNoticeWidgetBR_C_ShowNotice final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Body;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_ShowNotice) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_ShowNotice");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_ShowNotice) == 0x000030, "Wrong size on EmergencyNoticeWidgetBR_C_ShowNotice");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ShowNotice, Title) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_ShowNotice::Title' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ShowNotice, Body) == 0x000018, "Member 'EmergencyNoticeWidgetBR_C_ShowNotice::Body' has a wrong offset!");

// Function EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C.ExecuteUbergraph_EmergencyNoticeWidgetBR
// 0x0050 (0x0050 - 0x0000)
struct EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_446B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Body;                                 // 0x0020(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0038(0x0018)()
};
static_assert(alignof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR) == 0x000008, "Wrong alignment on EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR");
static_assert(sizeof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR) == 0x000050, "Wrong size on EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, EntryPoint) == 0x000000, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Event_Title) == 0x000008, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, K2Node_Event_Body) == 0x000020, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::K2Node_Event_Body' has a wrong offset!");
static_assert(offsetof(EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR, CallFunc_TextToUpper_ReturnValue) == 0x000038, "Member 'EmergencyNoticeWidgetBR_C_ExecuteUbergraph_EmergencyNoticeWidgetBR::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

