#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndOfMatch_QuestProgessRecap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EndOfMatch_QuestProgessRecap.EndOfMatch_QuestProgessRecap_C
// 0x0038 (0x02E8 - 0x02B0)
class UEndOfMatch_QuestProgessRecap_C final : public UEndOfMatchQuestUpdateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FlatBG;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoBG;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BackgroundType;                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LocationType;                                      // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EndOfMatch_QuestProgessRecap(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RunIntroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EndOfMatch_QuestProgessRecap_C">();
	}
	static class UEndOfMatch_QuestProgessRecap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndOfMatch_QuestProgessRecap_C>();
	}
};
static_assert(alignof(UEndOfMatch_QuestProgessRecap_C) == 0x000008, "Wrong alignment on UEndOfMatch_QuestProgessRecap_C");
static_assert(sizeof(UEndOfMatch_QuestProgessRecap_C) == 0x0002E8, "Wrong size on UEndOfMatch_QuestProgessRecap_C");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, UberGraphFrame) == 0x0002B0, "Member 'UEndOfMatch_QuestProgessRecap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, HorizontalBox_Header) == 0x0002B8, "Member 'UEndOfMatch_QuestProgessRecap_C::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, Image_FlatBG) == 0x0002C0, "Member 'UEndOfMatch_QuestProgessRecap_C::Image_FlatBG' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, Image_NoBG) == 0x0002C8, "Member 'UEndOfMatch_QuestProgessRecap_C::Image_NoBG' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, ImageBackground) == 0x0002D0, "Member 'UEndOfMatch_QuestProgessRecap_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, WidgetSwitcher_BackgroundType) == 0x0002D8, "Member 'UEndOfMatch_QuestProgessRecap_C::WidgetSwitcher_BackgroundType' has a wrong offset!");
static_assert(offsetof(UEndOfMatch_QuestProgessRecap_C, LocationType) == 0x0002E0, "Member 'UEndOfMatch_QuestProgessRecap_C::LocationType' has a wrong offset!");

}

