#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EntityCore.EMovementType
// NumValues: 0x0004
enum class EMovementType : uint8
{
	SweepPhysics                             = 0,
	TeleportPhysics                          = 1,
	ResetPhysics                             = 2,
	EMovementType_MAX                        = 3,
};

// ScriptStruct EntityCore.ComponentData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FComponentData
{
};
#pragma pack(pop)
static_assert(alignof(FComponentData) == 0x000001, "Wrong alignment on FComponentData");
static_assert(sizeof(FComponentData) == 0x000001, "Wrong size on FComponentData");

// ScriptStruct EntityCore.EntityCoreSystemRelativePositionComponentData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FEntityCoreSystemRelativePositionComponentData final : public FComponentData
{
public:
	uint8                                         Pad_4991[0x10];                                    // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEntityCoreSystemRelativePositionComponentData) == 0x000004, "Wrong alignment on FEntityCoreSystemRelativePositionComponentData");
static_assert(sizeof(FEntityCoreSystemRelativePositionComponentData) == 0x000010, "Wrong size on FEntityCoreSystemRelativePositionComponentData");

// ScriptStruct EntityCore.EntityScaleComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityScaleComponentData final : public FComponentData
{
public:
	struct FVector                                WorldScale3D;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEntityScaleComponentData) == 0x000004, "Wrong alignment on FEntityScaleComponentData");
static_assert(sizeof(FEntityScaleComponentData) == 0x00000C, "Wrong size on FEntityScaleComponentData");
static_assert(offsetof(FEntityScaleComponentData, WorldScale3D) == 0x000000, "Member 'FEntityScaleComponentData::WorldScale3D' has a wrong offset!");

// ScriptStruct EntityCore.EntityRotationComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityRotationComponentData final : public FComponentData
{
public:
	struct FRotator                               WorldRotation;                                     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEntityRotationComponentData) == 0x000004, "Wrong alignment on FEntityRotationComponentData");
static_assert(sizeof(FEntityRotationComponentData) == 0x00000C, "Wrong size on FEntityRotationComponentData");
static_assert(offsetof(FEntityRotationComponentData, WorldRotation) == 0x000000, "Member 'FEntityRotationComponentData::WorldRotation' has a wrong offset!");

// ScriptStruct EntityCore.EntityPositionComponentData
// 0x000C (0x000C - 0x0000)
struct FEntityPositionComponentData final : public FComponentData
{
public:
	struct FVector                                WorldPosition;                                     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEntityPositionComponentData) == 0x000004, "Wrong alignment on FEntityPositionComponentData");
static_assert(sizeof(FEntityPositionComponentData) == 0x00000C, "Wrong size on FEntityPositionComponentData");
static_assert(offsetof(FEntityPositionComponentData, WorldPosition) == 0x000000, "Member 'FEntityPositionComponentData::WorldPosition' has a wrong offset!");

// ScriptStruct EntityCore.EntityTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FEntityTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_4992[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEntityTickFunction) == 0x000008, "Wrong alignment on FEntityTickFunction");
static_assert(sizeof(FEntityTickFunction) == 0x000030, "Wrong size on FEntityTickFunction");

}

