#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Phoebe_Context_Unstuck_Reachable_Goal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_Phoebe_Context_Unstuck_Reachable_Goal.EQS_Phoebe_Context_Unstuck_Reachable_Goal_C.ProvideSingleLocation
// 0x0088 (0x0088 - 0x0000)
struct EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuerierLocation;                                   // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698F[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6990[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6991[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsNAN_ReturnValue;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation");
static_assert(sizeof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation) == 0x000088, "Wrong size on EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, QuerierLocation) == 0x00001C, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::QuerierLocation' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, K2Node_DynamicCast_AsPawn) == 0x000038, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000041, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_GetController_ReturnValue) == 0x000048, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, K2Node_DynamicCast_AsAIController) == 0x000050, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000059, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_GetBlackboard_ReturnValue) == 0x000060, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000068, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x00006C, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000074, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_IsValidAILocation_ReturnValue) == 0x000080, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_Vector_IsNAN_ReturnValue) == 0x000081, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_Vector_IsNAN_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation, CallFunc_BooleanOR_ReturnValue) == 0x000083, "Member 'EQS_Phoebe_Context_Unstuck_Reachable_Goal_C_ProvideSingleLocation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

