#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQSC_Athena_FlopperSpawn_Origin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQSC_Athena_FlopperSpawn_Origin.EQSC_Athena_FlopperSpawn_Origin_C.ProvideSingleLocation
// 0x0048 (0x0048 - 0x0000)
struct EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterSubsystem*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOceanTotalHeight_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation");
static_assert(sizeof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation) == 0x000048, "Wrong size on EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_RandomFloatInRange_ReturnValue) == 0x00001C, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000024, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_GetOceanTotalHeight_ReturnValue) == 0x000030, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_GetOceanTotalHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'EQSC_Athena_FlopperSpawn_Origin_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

