#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorLlama

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorLlama.ErrorLlama_C
// 0x0030 (0x0260 - 0x0230)
class UErrorLlama_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Llama;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlippedTexture;                                   // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0C[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CurLookAt2D;                                       // 0x024C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurInputType;                                      // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F0D[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeInterpSpeed;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaterialInputScale;                                // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandleInputTypeChanged(ECommonInputType NewInputType);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void RandomizeColor();
	void HandleNormalizedInputDirection(const struct FVector2D& TwoDInputVec);
	void ExecuteUbergraph_ErrorLlama(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorLlama_C">();
	}
	static class UErrorLlama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorLlama_C>();
	}
};
static_assert(alignof(UErrorLlama_C) == 0x000008, "Wrong alignment on UErrorLlama_C");
static_assert(sizeof(UErrorLlama_C) == 0x000260, "Wrong size on UErrorLlama_C");
static_assert(offsetof(UErrorLlama_C, UberGraphFrame) == 0x000230, "Member 'UErrorLlama_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, Image_0) == 0x000238, "Member 'UErrorLlama_C::Image_0' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MID_Llama) == 0x000240, "Member 'UErrorLlama_C::MID_Llama' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, bFlippedTexture) == 0x000248, "Member 'UErrorLlama_C::bFlippedTexture' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurLookAt2D) == 0x00024C, "Member 'UErrorLlama_C::CurLookAt2D' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurInputType) == 0x000254, "Member 'UErrorLlama_C::CurInputType' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, EyeInterpSpeed) == 0x000258, "Member 'UErrorLlama_C::EyeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MaterialInputScale) == 0x00025C, "Member 'UErrorLlama_C::MaterialInputScale' has a wrong offset!");

}

