#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardSummary

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.EventColorize
// 0x0170 (0x0170 - 0x0000)
struct EventLeaderboardSummary_C_EventColorize final
{
public:
	struct FFortTournamentDisplayInfo             Param_TournamentDisplayInfo;                       // 0x0000(0x0170)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(EventLeaderboardSummary_C_EventColorize) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_EventColorize");
static_assert(sizeof(EventLeaderboardSummary_C_EventColorize) == 0x000170, "Wrong size on EventLeaderboardSummary_C_EventColorize");
static_assert(offsetof(EventLeaderboardSummary_C_EventColorize, Param_TournamentDisplayInfo) == 0x000000, "Member 'EventLeaderboardSummary_C_EventColorize::Param_TournamentDisplayInfo' has a wrong offset!");

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EventLeaderboardSummary_C_BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.ExecuteUbergraph_EventLeaderboardSummary
// 0x0258 (0x0258 - 0x0000)
struct EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7267[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_TournamentDisplayInfo;          // 0x0010(0x0170)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0180(0x0028)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7268[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7269[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_3;             // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_726A[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventLeaderboardAvailable_ReturnValue;  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_726B[0x2];                                     // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary");
static_assert(sizeof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary) == 0x000258, "Wrong size on EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, EntryPoint) == 0x000000, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, Temp_bool_Variable) == 0x000004, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_CustomEvent_TournamentDisplayInfo) == 0x000010, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_CustomEvent_TournamentDisplayInfo' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_MakeStruct_SlateColor) == 0x000180, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_MakeStruct_LinearColor) == 0x0001A8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, Temp_float_Variable) == 0x0001B8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_ComponentBoundEvent_Button_1) == 0x0001C0, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_ComponentBoundEvent_Button) == 0x0001C8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PauseAnimation_ReturnValue) == 0x0001D0, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetStartTime_ReturnValue) == 0x0001D4, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PauseAnimation_ReturnValue_1) == 0x0001D8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001DC, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E0, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetEndTime_ReturnValue) == 0x0001E4, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PlayAnimation_ReturnValue) == 0x0001E8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001F0, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PauseAnimation_ReturnValue_2) == 0x0001F4, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PauseAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetStartTime_ReturnValue_1) == 0x0001F8, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetStartTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PauseAnimation_ReturnValue_3) == 0x0001FC, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PauseAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000200, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000204, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PlayAnimation_ReturnValue_1) == 0x000208, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetEndTime_ReturnValue_1) == 0x000210, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000214, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, Temp_bool_Variable_1) == 0x000218, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_IsEventLeaderboardAvailable_ReturnValue) == 0x000219, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_IsEventLeaderboardAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_Select_Default) == 0x00021C, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetTournamentId_ReturnValue) == 0x000220, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PlayAnimation_ReturnValue_2) == 0x000230, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_GetEventId_ReturnValue) == 0x000238, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, Temp_float_Variable_1) == 0x000248, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, K2Node_Select_Default_1) == 0x00024C, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary, CallFunc_PlayAnimation_ReturnValue_3) == 0x000250, "Member 'EventLeaderboardSummary_C_ExecuteUbergraph_EventLeaderboardSummary::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function EventLeaderboardSummary.EventLeaderboardSummary_C.EventViewFullLeaderboard__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature final
{
public:
	class FString                                 TournamentId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature) == 0x000008, "Wrong alignment on EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature");
static_assert(sizeof(EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature) == 0x000020, "Wrong size on EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature");
static_assert(offsetof(EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature, TournamentId) == 0x000000, "Member 'EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature::TournamentId' has a wrong offset!");
static_assert(offsetof(EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature, EventId) == 0x000010, "Member 'EventLeaderboardSummary_C_EventViewFullLeaderboard__DelegateSignature::EventId' has a wrong offset!");

}

