#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C
// 0x0068 (0x0C18 - 0x0BB0)
class UEventTeamMatchHistoryEntry_C final : public UFortEventTeamMatchHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Zebra;                                      // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_eliminations;                                // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Placement;                                   // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ReplayInteraction;                            // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventPlayerStatProfileSelector_C*      ProfileStatSelector;                               // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Hovered;                                           // 0x0BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Unhovered;                                         // 0x0C08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_EventTeamMatchHistoryEntry(int32 EntryPoint);
	void Unhovered__DelegateSignature();
	void Hovered__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryEntry_C">();
	}
	static class UEventTeamMatchHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryEntry_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryEntry_C) == 0x000008, "Wrong alignment on UEventTeamMatchHistoryEntry_C");
static_assert(sizeof(UEventTeamMatchHistoryEntry_C) == 0x000C18, "Wrong size on UEventTeamMatchHistoryEntry_C");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, UberGraphFrame) == 0x000BB0, "Member 'UEventTeamMatchHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Selected) == 0x000BB8, "Member 'UEventTeamMatchHistoryEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Border_Zebra) == 0x000BC0, "Member 'UEventTeamMatchHistoryEntry_C::Border_Zebra' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_eliminations) == 0x000BC8, "Member 'UEventTeamMatchHistoryEntry_C::Image_eliminations' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_OnlineStatus) == 0x000BD0, "Member 'UEventTeamMatchHistoryEntry_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_Placement) == 0x000BD8, "Member 'UEventTeamMatchHistoryEntry_C::Image_Placement' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_SelectedBG) == 0x000BE0, "Member 'UEventTeamMatchHistoryEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Text_ReplayInteraction) == 0x000BE8, "Member 'UEventTeamMatchHistoryEntry_C::Text_ReplayInteraction' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, ProfileStatSelector) == 0x000BF0, "Member 'UEventTeamMatchHistoryEntry_C::ProfileStatSelector' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Hovered) == 0x000BF8, "Member 'UEventTeamMatchHistoryEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Unhovered) == 0x000C08, "Member 'UEventTeamMatchHistoryEntry_C::Unhovered' has a wrong offset!");

}

