#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryModal.EventTeamMatchHistoryModal_C
// 0x0040 (0x04B0 - 0x0470)
class UEventTeamMatchHistoryModal_C final : public UFortEventTeamMatchHistoryModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseMainPanel;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventMatchHistoryTournamentInfo_C*     EventMatchHistoryTournamentInfo;                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Content;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EventLabel;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TeamLabel;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void OnSetupMatchHistory(const class FString& TournamentId, const class FString& EventWindowId);
	void ExecuteUbergraph_EventTeamMatchHistoryModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryModal_C">();
	}
	static class UEventTeamMatchHistoryModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryModal_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryModal_C) == 0x000008, "Wrong alignment on UEventTeamMatchHistoryModal_C");
static_assert(sizeof(UEventTeamMatchHistoryModal_C) == 0x0004B0, "Wrong size on UEventTeamMatchHistoryModal_C");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, UberGraphFrame) == 0x000470, "Member 'UEventTeamMatchHistoryModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, Intro) == 0x000478, "Member 'UEventTeamMatchHistoryModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, CloseMainPanel) == 0x000480, "Member 'UEventTeamMatchHistoryModal_C::CloseMainPanel' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, EventMatchHistoryTournamentInfo) == 0x000488, "Member 'UEventTeamMatchHistoryModal_C::EventMatchHistoryTournamentInfo' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, SafeZone_0) == 0x000490, "Member 'UEventTeamMatchHistoryModal_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, Switcher_Content) == 0x000498, "Member 'UEventTeamMatchHistoryModal_C::Switcher_Content' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, Text_EventLabel) == 0x0004A0, "Member 'UEventTeamMatchHistoryModal_C::Text_EventLabel' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryModal_C, Text_TeamLabel) == 0x0004A8, "Member 'UEventTeamMatchHistoryModal_C::Text_TeamLabel' has a wrong offset!");

}

