#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventPlayerStatProfileSelectorEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventPlayerStatProfileSelectorEntry.EventPlayerStatProfileSelectorEntry_C
// 0x0040 (0x0BD0 - 0x0B90)
class UEventPlayerStatProfileSelectorEntry_C final : public UFortEventPlayerStatProfileSelectorEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventPlayerStatProfileSelector_C*      ProfileStatSelector;                               // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Hovered;                                           // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Unhovered;                                         // 0x0BC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_EventPlayerStatProfileSelectorEntry(int32 EntryPoint);
	void Unhovered__DelegateSignature();
	void Hovered__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventPlayerStatProfileSelectorEntry_C">();
	}
	static class UEventPlayerStatProfileSelectorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventPlayerStatProfileSelectorEntry_C>();
	}
};
static_assert(alignof(UEventPlayerStatProfileSelectorEntry_C) == 0x000008, "Wrong alignment on UEventPlayerStatProfileSelectorEntry_C");
static_assert(sizeof(UEventPlayerStatProfileSelectorEntry_C) == 0x000BD0, "Wrong size on UEventPlayerStatProfileSelectorEntry_C");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, UberGraphFrame) == 0x000B90, "Member 'UEventPlayerStatProfileSelectorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, Selected) == 0x000B98, "Member 'UEventPlayerStatProfileSelectorEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, Image_SelectedBG) == 0x000BA0, "Member 'UEventPlayerStatProfileSelectorEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, ProfileStatSelector) == 0x000BA8, "Member 'UEventPlayerStatProfileSelectorEntry_C::ProfileStatSelector' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, Hovered) == 0x000BB0, "Member 'UEventPlayerStatProfileSelectorEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelectorEntry_C, Unhovered) == 0x000BC0, "Member 'UEventPlayerStatProfileSelectorEntry_C::Unhovered' has a wrong offset!");

}

