#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosvieBow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ExplosvieBow_AnimBP.ExplosvieBow_AnimBP_C.ExecuteUbergraph_ExplosvieBow_AnimBP
// 0x0024 (0x0024 - 0x0000)
struct ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP) == 0x000004, "Wrong alignment on ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP");
static_assert(sizeof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP) == 0x000024, "Wrong size on ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP");
static_assert(offsetof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP, EntryPoint) == 0x000000, "Member 'ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP, CallFunc_MakeRotator_ReturnValue_1) == 0x000018, "Member 'ExplosvieBow_AnimBP_C_ExecuteUbergraph_ExplosvieBow_AnimBP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function ExplosvieBow_AnimBP.ExplosvieBow_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ExplosvieBow_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ExplosvieBow_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ExplosvieBow_AnimBP_C_AnimGraph");
static_assert(sizeof(ExplosvieBow_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on ExplosvieBow_AnimBP_C_AnimGraph");
static_assert(offsetof(ExplosvieBow_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ExplosvieBow_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

