#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosvieBow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ExplosvieBow_AnimBP.ExplosvieBow_AnimBP_C
// 0x1200 (0x1560 - 0x0360)
class UExplosvieBow_AnimBP_C final : public UFortBowWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0398(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0430(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0458(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0478(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0498(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x05A0(0x0108)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x06A8(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x0788(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0838(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x08B0(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0960(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0A28(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0AA0(0x0078)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0B18(0x0188)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0CA0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0D68(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0E48(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0F28(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0FF0(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1020(0x0018)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1038(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x10D8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x11A0(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1280(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x12F8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1328(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x13D8(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1498(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1510(0x0048)()

public:
	void ExecuteUbergraph_ExplosvieBow_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ExplosvieBow_AnimBP_AnimGraphNode_ModifyBone_0E1011B841DA7A109A69F18ED59C9A93();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ExplosvieBow_AnimBP_AnimGraphNode_ModifyBone_D0BC44E84FB0F05DC49A24B18D5B2D51();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExplosvieBow_AnimBP_C">();
	}
	static class UExplosvieBow_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExplosvieBow_AnimBP_C>();
	}
};
static_assert(alignof(UExplosvieBow_AnimBP_C) == 0x000010, "Wrong alignment on UExplosvieBow_AnimBP_C");
static_assert(sizeof(UExplosvieBow_AnimBP_C) == 0x001560, "Wrong size on UExplosvieBow_AnimBP_C");
static_assert(offsetof(UExplosvieBow_AnimBP_C, UberGraphFrame) == 0x000360, "Member 'UExplosvieBow_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Slot_1) == 0x000398, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0003E0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000408, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000430, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000458, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000478, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000498, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0005A0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_3) == 0x0006A8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x000788, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000838, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x0008B0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x000960, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000A28, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000AA0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000B18, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x000CA0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000D68, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000E48, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x000F28, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000FF0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x001020, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001038, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0010D8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0011A0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001280, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateResult) == 0x0012F8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateMachine) == 0x001328, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0013D8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001498, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Slot) == 0x001510, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

