#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Black_Knight_Helmet_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Black_Knight_Helmet_FaceAcc_AnimBP.F_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C
// 0x02C0 (0x0530 - 0x0270)
class UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_55AB[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02A8(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x03E8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0510(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_F_MED_Black_Knight_Helmet_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C) == 0x000530, "Wrong size on UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002A8, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x0003E8, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0004F0, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000510, "Member 'UF_MED_Black_Knight_Helmet_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

