#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Mechanical_Engineer_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Mechanical_Engineer_FaceAcc_AnimBP.F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function F_MED_Mechanical_Engineer_FaceAcc_AnimBP.F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C.ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP
// 0x0030 (0x0030 - 0x0000)
struct F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AFA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AFB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP) == 0x000008, "Wrong alignment on F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP");
static_assert(sizeof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP) == 0x000030, "Wrong size on F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000010, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000020, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000028, "Member 'F_MED_Mechanical_Engineer_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Mechanical_Engineer_FaceAcc_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");

}

