#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Space_Wanderer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Space_Wanderer_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Space_Wanderer_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Space_Wanderer_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Space_Wanderer_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'F_MED_Space_Wanderer_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.OnNotifyPartsStarted
// 0x0008 (0x0008 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted) == 0x000004, "Wrong alignment on F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted");
static_assert(sizeof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted) == 0x000008, "Wrong size on F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted, Context) == 0x000000, "Member 'F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted::Context' has a wrong offset!");

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.OnNotifyPartsStopped
// 0x0008 (0x0008 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped) == 0x000004, "Wrong alignment on F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped");
static_assert(sizeof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped) == 0x000008, "Wrong size on F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped, Context) == 0x000000, "Member 'F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped::Context' has a wrong offset!");

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP
// 0x0018 (0x0018 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context_1;                            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP) == 0x000004, "Wrong alignment on F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP");
static_assert(sizeof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP) == 0x000018, "Wrong size on F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP, K2Node_Event_Context_1) == 0x000004, "Member 'F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP::K2Node_Event_Context_1' has a wrong offset!");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP, K2Node_Event_Context) == 0x00000C, "Member 'F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000015, "Member 'F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

}

