#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Black_Knight_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Black_Knight_AnimBP.F_MED_Black_Knight_AnimBP_C
// 0x3300 (0x3800 - 0x0500)
class UF_MED_Black_Knight_AnimBP_C final : public UCustomCharacterPartAnimInstance_BlackKnightBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x0508(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x0610(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x0718(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x0820(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0928(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x0A30(0x0108)()
	uint8                                         Pad_6A39[0x8];                                     // 0x0B38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x0B40(0x0650)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x1190(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x1298(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x13A0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x14A8(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x15B0(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x1C00(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1D08(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1E10(0x0108)()
	uint8                                         Pad_6A3A[0x8];                                     // 0x1F18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1F20(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x2570(0x0108)()
	uint8                                         Pad_6A3B[0x8];                                     // 0x2678(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2680(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x2CD0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2DD8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x2DF8(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2F00(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x2F20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x3028(0x0108)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x3130(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3270(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x32A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x33A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x34B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x35B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x36C0(0x0108)()
	bool                                          Crouch_bool;                                       // 0x37C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3C[0x7];                                     // 0x37C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Skel_mesh;                                         // 0x37D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Crouch_float;                                      // 0x37D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thigh_knife_fix_sm;                                // 0x37DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ar_firingPosition;                                 // 0x37E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3D[0x7];                                     // 0x37E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Anim_Inst;                                         // 0x37E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Emote_active;                                      // 0x37F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Pickaxe_active;                                    // 0x37F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3E[0x2];                                     // 0x37F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delta_time;                                        // 0x37F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWearingBackbling_b;                             // 0x37F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Skydive_bool;                                      // 0x37F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void OnBeginCrouching();
	void OnEndCrouching();
	void OnBeginPlayingEmote();
	void OnEndPlayingEmote();
	void BlueprintInitializeAnimation();
	void OnCharacterCustomizationLoaded();
	void OnBeginSkydiving();
	void OnEndSkydiving();
	void ExecuteUbergraph_F_MED_Black_Knight_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Black_Knight_AnimBP_C">();
	}
	static class UF_MED_Black_Knight_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Black_Knight_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Black_Knight_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Black_Knight_AnimBP_C");
static_assert(sizeof(UF_MED_Black_Knight_AnimBP_C) == 0x003800, "Wrong size on UF_MED_Black_Knight_AnimBP_C");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, UberGraphFrame) == 0x000500, "Member 'UF_MED_Black_Knight_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_7) == 0x000508, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_6) == 0x000610, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_5) == 0x000718, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_4) == 0x000820, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000928, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_14) == 0x000A30, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_RigidBody_3) == 0x000B40, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_2) == 0x001190, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_13) == 0x001298, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x0013A0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0014A8, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x0015B0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x001C00, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Constraint) == 0x001D08, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x001E10, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x001F20, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x002570, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_RigidBody) == 0x002680, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x002CD0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002DD8, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x002DF8, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002F00, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x002F20, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x003028, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x003130, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_Root) == 0x003270, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0032A0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x0033A8, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0034B0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0035B8, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0036C0, "Member 'UF_MED_Black_Knight_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Crouch_bool) == 0x0037C8, "Member 'UF_MED_Black_Knight_AnimBP_C::Crouch_bool' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Skel_mesh) == 0x0037D0, "Member 'UF_MED_Black_Knight_AnimBP_C::Skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Crouch_float) == 0x0037D8, "Member 'UF_MED_Black_Knight_AnimBP_C::Crouch_float' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Thigh_knife_fix_sm) == 0x0037DC, "Member 'UF_MED_Black_Knight_AnimBP_C::Thigh_knife_fix_sm' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Ar_firingPosition) == 0x0037E0, "Member 'UF_MED_Black_Knight_AnimBP_C::Ar_firingPosition' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Anim_Inst) == 0x0037E8, "Member 'UF_MED_Black_Knight_AnimBP_C::Anim_Inst' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Emote_active) == 0x0037F0, "Member 'UF_MED_Black_Knight_AnimBP_C::Emote_active' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Pickaxe_active) == 0x0037F1, "Member 'UF_MED_Black_Knight_AnimBP_C::Pickaxe_active' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Delta_time) == 0x0037F4, "Member 'UF_MED_Black_Knight_AnimBP_C::Delta_time' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, bIsWearingBackbling_b) == 0x0037F8, "Member 'UF_MED_Black_Knight_AnimBP_C::bIsWearingBackbling_b' has a wrong offset!");
static_assert(offsetof(UF_MED_Black_Knight_AnimBP_C, Skydive_bool) == 0x0037F9, "Member 'UF_MED_Black_Knight_AnimBP_C::Skydive_bool' has a wrong offset!");

}

