#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FidgetHUDWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FidgetHUDWidget.FidgetHUDWidget_C.SkydiveLeaderChanged
// 0x0010 (0x0010 - 0x0000)
struct FidgetHUDWidget_C_SkydiveLeaderChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocal;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B3[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       SkydiveLeader;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FidgetHUDWidget_C_SkydiveLeaderChanged) == 0x000008, "Wrong alignment on FidgetHUDWidget_C_SkydiveLeaderChanged");
static_assert(sizeof(FidgetHUDWidget_C_SkydiveLeaderChanged) == 0x000010, "Wrong size on FidgetHUDWidget_C_SkydiveLeaderChanged");
static_assert(offsetof(FidgetHUDWidget_C_SkydiveLeaderChanged, bEnabled) == 0x000000, "Member 'FidgetHUDWidget_C_SkydiveLeaderChanged::bEnabled' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_SkydiveLeaderChanged, bLocal) == 0x000001, "Member 'FidgetHUDWidget_C_SkydiveLeaderChanged::bLocal' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_SkydiveLeaderChanged, SkydiveLeader) == 0x000008, "Member 'FidgetHUDWidget_C_SkydiveLeaderChanged::SkydiveLeader' has a wrong offset!");

// Function FidgetHUDWidget.FidgetHUDWidget_C.OnGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct FidgetHUDWidget_C_OnGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FidgetHUDWidget_C_OnGamePhaseStepChanged) == 0x000001, "Wrong alignment on FidgetHUDWidget_C_OnGamePhaseStepChanged");
static_assert(sizeof(FidgetHUDWidget_C_OnGamePhaseStepChanged) == 0x000001, "Wrong size on FidgetHUDWidget_C_OnGamePhaseStepChanged");
static_assert(offsetof(FidgetHUDWidget_C_OnGamePhaseStepChanged, GamePhaseStep) == 0x000000, "Member 'FidgetHUDWidget_C_OnGamePhaseStepChanged::GamePhaseStep' has a wrong offset!");

// Function FidgetHUDWidget.FidgetHUDWidget_C.ExecuteUbergraph_FidgetHUDWidget
// 0x0118 (0x0118 - 0x0000)
struct FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B4[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B5[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetUseActionName_ReturnValue;             // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable_16;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B6[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B7[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B8[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bLocal;                         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B9[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       K2Node_CustomEvent_SkydiveLeader;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41BA[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41BB[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Select_Default_1;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_GamePhaseStep;                        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41BC[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bEnabled, bool bLocal, class AFortPlayerState* LeaderPlayerState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget) == 0x000008, "Wrong alignment on FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget");
static_assert(sizeof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget) == 0x000118, "Wrong size on FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, EntryPoint) == 0x000000, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable) == 0x000004, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_bool_Variable) == 0x000008, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable) == 0x000009, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_1) == 0x00000A, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_2) == 0x000020, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetUseActionName_ReturnValue) == 0x000024, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetUseActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_3) == 0x00002C, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_4) == 0x00002D, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_5) == 0x00002E, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_6) == 0x00002F, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_7) == 0x000030, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_8) == 0x000031, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_9) == 0x000032, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_10) == 0x000033, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_11) == 0x000034, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_12) == 0x000035, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_13) == 0x000036, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_14) == 0x000037, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_15) == 0x000038, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_byte_Variable_16) == 0x000039, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_1) == 0x00003C, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_2) == 0x000040, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_3) == 0x000044, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_4) == 0x000048, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_5) == 0x00004C, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_6) == 0x000050, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_7) == 0x000054, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_8) == 0x000058, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_9) == 0x00005C, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_10) == 0x000060, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_11) == 0x000064, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_12) == 0x000068, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_13) == 0x00006C, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_bool_Variable_1) == 0x000070, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000080, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000090, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x000098, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A2, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_CustomEvent_bEnabled) == 0x0000A3, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_CustomEvent_bEnabled' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_CustomEvent_bLocal) == 0x0000A4, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_CustomEvent_bLocal' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_CustomEvent_SkydiveLeader) == 0x0000A8, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_CustomEvent_SkydiveLeader' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_GetPlayerName_ReturnValue) == 0x0000B8, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_Select_Default) == 0x0000E0, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, Temp_int_Variable_14) == 0x0000E4, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_Select_Default_1) == 0x0000F8, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_Event_GamePhaseStep) == 0x0000FC, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_Event_GamePhaseStep' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_Select_Default_2) == 0x0000FD, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_Select_Default_3) == 0x000100, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000104, "Member 'FidgetHUDWidget_C_ExecuteUbergraph_FidgetHUDWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

