#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlameCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FlameCounter.FlameCounter_C
// 0x0038 (0x02C8 - 0x0290)
class UFlameCounter_C final : public UFortCommunityVotingVoteCounter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Increment;                                         // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle;                                              // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Com_LlamaLikeIcon_1;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayIncreaseVote();
	void PlayIdle();
	void PlayFadeOut();
	void PlayFadeIn();
	void ExecuteUbergraph_FlameCounter(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlameCounter_C">();
	}
	static class UFlameCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlameCounter_C>();
	}
};
static_assert(alignof(UFlameCounter_C) == 0x000008, "Wrong alignment on UFlameCounter_C");
static_assert(sizeof(UFlameCounter_C) == 0x0002C8, "Wrong size on UFlameCounter_C");
static_assert(offsetof(UFlameCounter_C, UberGraphFrame) == 0x000290, "Member 'UFlameCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, Fade) == 0x000298, "Member 'UFlameCounter_C::Fade' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, FadeIn) == 0x0002A0, "Member 'UFlameCounter_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, FadeOut) == 0x0002A8, "Member 'UFlameCounter_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, Increment) == 0x0002B0, "Member 'UFlameCounter_C::Increment' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, Idle) == 0x0002B8, "Member 'UFlameCounter_C::Idle' has a wrong offset!");
static_assert(offsetof(UFlameCounter_C, Com_LlamaLikeIcon_1) == 0x0002C0, "Member 'UFlameCounter_C::Com_LlamaLikeIcon_1' has a wrong offset!");

}

