#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlameCounter

#include "Basic.hpp"


namespace SDK::Params
{

// Function FlameCounter.FlameCounter_C.ExecuteUbergraph_FlameCounter
// 0x0028 (0x0028 - 0x0000)
struct FlameCounter_C_ExecuteUbergraph_FlameCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlameCounter_C_ExecuteUbergraph_FlameCounter) == 0x000008, "Wrong alignment on FlameCounter_C_ExecuteUbergraph_FlameCounter");
static_assert(sizeof(FlameCounter_C_ExecuteUbergraph_FlameCounter) == 0x000028, "Wrong size on FlameCounter_C_ExecuteUbergraph_FlameCounter");
static_assert(offsetof(FlameCounter_C_ExecuteUbergraph_FlameCounter, EntryPoint) == 0x000000, "Member 'FlameCounter_C_ExecuteUbergraph_FlameCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(FlameCounter_C_ExecuteUbergraph_FlameCounter, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'FlameCounter_C_ExecuteUbergraph_FlameCounter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlameCounter_C_ExecuteUbergraph_FlameCounter, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'FlameCounter_C_ExecuteUbergraph_FlameCounter::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FlameCounter_C_ExecuteUbergraph_FlameCounter, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'FlameCounter_C_ExecuteUbergraph_FlameCounter::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FlameCounter_C_ExecuteUbergraph_FlameCounter, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'FlameCounter_C_ExecuteUbergraph_FlameCounter::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

