#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fort_Entry_Music_Controller_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Change Music
// 0x0008 (0x0008 - 0x0000)
struct Fort_Entry_Music_Controller_BP_C_Change_Music final
{
public:
	class USoundBase*                             New_Music;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Entry_Music_Controller_BP_C_Change_Music) == 0x000008, "Wrong alignment on Fort_Entry_Music_Controller_BP_C_Change_Music");
static_assert(sizeof(Fort_Entry_Music_Controller_BP_C_Change_Music) == 0x000008, "Wrong size on Fort_Entry_Music_Controller_BP_C_Change_Music");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_Change_Music, New_Music) == 0x000000, "Member 'Fort_Entry_Music_Controller_BP_C_Change_Music::New_Music' has a wrong offset!");

// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.OnMusicPackChanged
// 0x0008 (0x0008 - 0x0000)
struct Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged final
{
public:
	const class UAthenaMusicPackItemDefinition*   NewMusicPack;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged) == 0x000008, "Wrong alignment on Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged");
static_assert(sizeof(Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged) == 0x000008, "Wrong size on Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged, NewMusicPack) == 0x000000, "Member 'Fort_Entry_Music_Controller_BP_C_OnMusicPackChanged::NewMusicPack' has a wrong offset!");

// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Lobby Music Override
// 0x0010 (0x0010 - 0x0000)
struct Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override final
{
public:
	bool                                          Lobby_Music_Activate;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7042[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             New_Music;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override) == 0x000008, "Wrong alignment on Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override");
static_assert(sizeof(Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override) == 0x000010, "Wrong size on Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override, Lobby_Music_Activate) == 0x000000, "Member 'Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override::Lobby_Music_Activate' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override, New_Music) == 0x000008, "Member 'Fort_Entry_Music_Controller_BP_C_Lobby_Music_Override::New_Music' has a wrong offset!");

// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.DelayedPlayMusicPack
// 0x0008 (0x0008 - 0x0000)
struct Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack final
{
public:
	class UAthenaMusicPackItemDefinition*         Param_MusicPackToPlayLater;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack) == 0x000008, "Wrong alignment on Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack");
static_assert(sizeof(Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack) == 0x000008, "Wrong size on Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack, Param_MusicPackToPlayLater) == 0x000000, "Member 'Fort_Entry_Music_Controller_BP_C_DelayedPlayMusicPack::Param_MusicPackToPlayLater' has a wrong offset!");

// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.ExecuteUbergraph_Fort_Entry_Music_Controller_BP
// 0x00B8 (0x00B8 - 0x0000)
struct Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7043[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_New_Music_1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7044[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAthenaMusicPackItemDefinition*   K2Node_CustomEvent_NewMusicPack;                   // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Lobby_Music_Activate;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7045[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_CustomEvent_New_Music;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7046[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7047[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAthenaMusicPackItemDefinition* NewMusicPack)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7048[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMusicPackItemDefinition*         K2Node_CustomEvent_MusicPackToPlayLater;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7049[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMusicPackItemDefinition*         CallFunc_GetEquippedMusicPack_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_704A[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue_3;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDefaultMusicEquipped_ReturnValue;       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_704B[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMusicPackItemDefinition*         CallFunc_GetEquippedMusicPack_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP) == 0x000008, "Wrong alignment on Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP");
static_assert(sizeof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP) == 0x0000B8, "Wrong size on Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, EntryPoint) == 0x000000, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CustomEvent_New_Music_1) == 0x000010, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CustomEvent_New_Music_1' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, Temp_bool_Has_Been_Initd_Variable) == 0x00001A, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CustomEvent_NewMusicPack) == 0x000020, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CustomEvent_NewMusicPack' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CustomEvent_Lobby_Music_Activate) == 0x000028, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CustomEvent_Lobby_Music_Activate' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CustomEvent_New_Music) == 0x000030, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CustomEvent_New_Music' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000038, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_DynamicCast_AsSound_Base) == 0x000048, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_IsPlaying_ReturnValue) == 0x000051, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, K2Node_CustomEvent_MusicPackToPlayLater) == 0x000068, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::K2Node_CustomEvent_MusicPackToPlayLater' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetContext_ReturnValue_1) == 0x000078, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000080, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetEquippedMusicPack_ReturnValue) == 0x000088, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetEquippedMusicPack_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, Temp_bool_Variable) == 0x000090, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_IsValid_ReturnValue_2) == 0x000091, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000092, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetContext_ReturnValue_2) == 0x000098, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetContext_ReturnValue_3) == 0x0000A0, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_IsDefaultMusicEquipped_ReturnValue) == 0x0000A8, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_IsDefaultMusicEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP, CallFunc_GetEquippedMusicPack_ReturnValue_1) == 0x0000B0, "Member 'Fort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP::CallFunc_GetEquippedMusicPack_ReturnValue_1' has a wrong offset!");

}

