#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastViewSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortBroadcastViewSettings.FortBroadcastViewSettings_C
// 0x0038 (0x0480 - 0x0448)
class UFortBroadcastViewSettings_C final : public UFortBroadcastViewSettings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CameraType;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ResetButton;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   ViewSettingsTabList;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ViewSettingsWidgetSwitcher;                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        SpectatorController;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortBroadcastViewSettings(int32 EntryPoint);
	void BP_OnActivated();
	void BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* PlayerController, ESpectatorCameraType Param_CameraType);
	void SwitchToValidTab();
	void CameraTypeToText(ESpectatorCameraType Param_CameraType, class FText* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortBroadcastViewSettings_C">();
	}
	static class UFortBroadcastViewSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBroadcastViewSettings_C>();
	}
};
static_assert(alignof(UFortBroadcastViewSettings_C) == 0x000008, "Wrong alignment on UFortBroadcastViewSettings_C");
static_assert(sizeof(UFortBroadcastViewSettings_C) == 0x000480, "Wrong size on UFortBroadcastViewSettings_C");
static_assert(offsetof(UFortBroadcastViewSettings_C, UberGraphFrame) == 0x000448, "Member 'UFortBroadcastViewSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, CameraType) == 0x000450, "Member 'UFortBroadcastViewSettings_C::CameraType' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, CloseButton) == 0x000458, "Member 'UFortBroadcastViewSettings_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, ResetButton) == 0x000460, "Member 'UFortBroadcastViewSettings_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, ViewSettingsTabList) == 0x000468, "Member 'UFortBroadcastViewSettings_C::ViewSettingsTabList' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, ViewSettingsWidgetSwitcher) == 0x000470, "Member 'UFortBroadcastViewSettings_C::ViewSettingsWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UFortBroadcastViewSettings_C, SpectatorController) == 0x000478, "Member 'UFortBroadcastViewSettings_C::SpectatorController' has a wrong offset!");

}

