#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortLayeredAudioComponent_Glider

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortLayeredAudioComponent_Glider.FortLayeredAudioComponent_Glider_C.Update Glider Audio
// 0x0008 (0x0008 - 0x0000)
struct FortLayeredAudioComponent_Glider_C_Update_Glider_Audio final
{
public:
	float                                         ForwardDot;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightDot;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortLayeredAudioComponent_Glider_C_Update_Glider_Audio) == 0x000004, "Wrong alignment on FortLayeredAudioComponent_Glider_C_Update_Glider_Audio");
static_assert(sizeof(FortLayeredAudioComponent_Glider_C_Update_Glider_Audio) == 0x000008, "Wrong size on FortLayeredAudioComponent_Glider_C_Update_Glider_Audio");
static_assert(offsetof(FortLayeredAudioComponent_Glider_C_Update_Glider_Audio, ForwardDot) == 0x000000, "Member 'FortLayeredAudioComponent_Glider_C_Update_Glider_Audio::ForwardDot' has a wrong offset!");
static_assert(offsetof(FortLayeredAudioComponent_Glider_C_Update_Glider_Audio, RightDot) == 0x000004, "Member 'FortLayeredAudioComponent_Glider_C_Update_Glider_Audio::RightDot' has a wrong offset!");

// Function FortLayeredAudioComponent_Glider.FortLayeredAudioComponent_Glider_C.ExecuteUbergraph_FortLayeredAudioComponent_Glider
// 0x000C (0x000C - 0x0000)
struct FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ForwardDot;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RightDot;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider) == 0x000004, "Wrong alignment on FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider");
static_assert(sizeof(FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider) == 0x00000C, "Wrong size on FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider");
static_assert(offsetof(FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider, EntryPoint) == 0x000000, "Member 'FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider, K2Node_CustomEvent_ForwardDot) == 0x000004, "Member 'FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider::K2Node_CustomEvent_ForwardDot' has a wrong offset!");
static_assert(offsetof(FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider, K2Node_CustomEvent_RightDot) == 0x000008, "Member 'FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider::K2Node_CustomEvent_RightDot' has a wrong offset!");

}

