#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortVolumeActor_PrefabGrenades

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FortVolumeActor_PrefabGrenades.FortVolumeActor_PrefabGrenades_C.ExecuteUbergraph_FortVolumeActor_PrefabGrenades
// 0x00E8 (0x00E8 - 0x0000)
struct FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0034(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D0(0x0018)()
};
static_assert(alignof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades) == 0x000008, "Wrong alignment on FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades");
static_assert(sizeof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades) == 0x0000E8, "Wrong size on FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, EntryPoint) == 0x000000, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_Damage) == 0x000004, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_DamageTags) == 0x000008, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_Momentum) == 0x000028, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_HitInfo) == 0x000034, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_InstigatedBy) == 0x0000C0, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_DamageCauser) == 0x0000C8, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades, K2Node_Event_EffectContext) == 0x0000D0, "Member 'FortVolumeActor_PrefabGrenades_C_ExecuteUbergraph_FortVolumeActor_PrefabGrenades::K2Node_Event_EffectContext' has a wrong offset!");

// Function FortVolumeActor_PrefabGrenades.FortVolumeActor_PrefabGrenades_C.OnDeathPlayEffects_2
// 0x00E8 (0x00E8 - 0x0000)
struct FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2 final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6868[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2) == 0x000008, "Wrong alignment on FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2");
static_assert(sizeof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2) == 0x0000E8, "Wrong size on FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, Damage) == 0x000000, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::Damage' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, DamageTags) == 0x000008, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::DamageTags' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, Momentum) == 0x000028, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::Momentum' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, HitInfo) == 0x000034, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::HitInfo' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, InstigatedBy) == 0x0000C0, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::InstigatedBy' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, DamageCauser) == 0x0000C8, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2, EffectContext) == 0x0000D0, "Member 'FortVolumeActor_PrefabGrenades_C_OnDeathPlayEffects_2::EffectContext' has a wrong offset!");

}

