#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortReplayHighlightItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortReplayHighlightItem.FortReplayHighlightItem_C
// 0x0450 (0x10F8 - 0x0CA8)
class UFortReplayHighlightItem_C final : public UFortReplayHighlightItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ClockImage;                                        // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            GenericHighlightIcon;                              // 0x0CB8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            GameSummaryHighlightIcon;                          // 0x0D40(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            ExtenedGameSummaryHighlightIcon;                   // 0x0DC8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BuilderHighlightIcon;                              // 0x0E50(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            FastMoverHighlightIcon;                            // 0x0ED8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            LongDistanceHighlightIcon;                         // 0x0F60(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MultikillHighlightIcon;                            // 0x0FE8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            StormCloudHighlightIcon;                           // 0x1070(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_FortReplayHighlightItem(int32 EntryPoint);
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortReplayHighlightItem_C">();
	}
	static class UFortReplayHighlightItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReplayHighlightItem_C>();
	}
};
static_assert(alignof(UFortReplayHighlightItem_C) == 0x000008, "Wrong alignment on UFortReplayHighlightItem_C");
static_assert(sizeof(UFortReplayHighlightItem_C) == 0x0010F8, "Wrong size on UFortReplayHighlightItem_C");
static_assert(offsetof(UFortReplayHighlightItem_C, UberGraphFrame) == 0x000CA8, "Member 'UFortReplayHighlightItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, ClockImage) == 0x000CB0, "Member 'UFortReplayHighlightItem_C::ClockImage' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, GenericHighlightIcon) == 0x000CB8, "Member 'UFortReplayHighlightItem_C::GenericHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, GameSummaryHighlightIcon) == 0x000D40, "Member 'UFortReplayHighlightItem_C::GameSummaryHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, ExtenedGameSummaryHighlightIcon) == 0x000DC8, "Member 'UFortReplayHighlightItem_C::ExtenedGameSummaryHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, BuilderHighlightIcon) == 0x000E50, "Member 'UFortReplayHighlightItem_C::BuilderHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, FastMoverHighlightIcon) == 0x000ED8, "Member 'UFortReplayHighlightItem_C::FastMoverHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, LongDistanceHighlightIcon) == 0x000F60, "Member 'UFortReplayHighlightItem_C::LongDistanceHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, MultikillHighlightIcon) == 0x000FE8, "Member 'UFortReplayHighlightItem_C::MultikillHighlightIcon' has a wrong offset!");
static_assert(offsetof(UFortReplayHighlightItem_C, StormCloudHighlightIcon) == 0x001070, "Member 'UFortReplayHighlightItem_C::StormCloudHighlightIcon' has a wrong offset!");

}

