#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastCameraSettingsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C
// 0x00C0 (0x04D8 - 0x0418)
class UFortBroadcastCameraSettingsTab_C final : public UFortSpectatorCameraSettingsTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelectorReplaySettings_C*       BattleMapAutomaticCameraPlacement;                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowAllSquadMembers;                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowNearbyChests;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BattleMapShowTimeIndicator;                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       BlendSettings;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       DamageEffects;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       DroneIgnoreJump;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       HighQualityFX;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             OutsideSafeZoneOpacity;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       RelevancyZone;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       SessionIDwatermark;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       ShareLensSettings;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       StormEffects;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       TPAutoFollow;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelectorReplaySettings_C*       TPCameraCollision;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSliderReplay_C*             TPDistanceToSubject;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OffText;                                           // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   OnText;                                            // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_FortBroadcastCameraSettingsTab(int32 EntryPoint);
	void OnSessionIDWatermarkChanged(bool bShowSessionIDWatermark);
	void BndEvt__SessionIDwatermark_K2Node_ComponentBoundEvent_12_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void OnBattleMapAutomaticCameraPlacementChanged(bool bInBattleMapAutomaticCameraPlacement);
	void OnBattleMapShowAllSquadMembersChanged(bool bBattleMapShowAllSquadMembers);
	void OnBattleMapShowNearbyChestsChanged(bool bBattleMapShowNearbyChests);
	void OnBattleMapShowTimeIndicatorChanged(bool bBattleMapShowTimeIndicator);
	void OnDroneIgnoreJumpChanged(bool bDroneIgnoreJump);
	void OnShareLensSettingsChanged(bool bShareLensSettings);
	void OnThirdPersonCameraCollisionChanged(bool bThirdPersonCameraCollision);
	void OnThirdPersonDistanceToSubjectChanged(float ThirdPersonDistanceToSubject);
	void OnThirdPersonAutoFollowModeChanged(EThirdPersonAutoFollowMode ThirdPersonAutoFollowMode);
	void OnDamageFxEnabledChanged(bool bDamageFxEnabled);
	void OnHighQualityFxEnabledChanged(bool bHighQualityFxEnabled);
	void OnRelevancyZoneVisibleChanged(bool bRelevancyZoneVisible);
	void OnSafeZoneOpacityChanged(float SafeZoneOpacity);
	void OnStormEffectsEnabledChanged(bool bStormEffectsEnabled);
	void OnPlayerOutlinesEnabledChanged(bool bPlayerOutlinesEnabled);
	void BndEvt__BattleMapAutomaticCameraPlacement_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowTimeIndicator_K2Node_ComponentBoundEvent_11_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowNearbyChests_K2Node_ComponentBoundEvent_10_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BattleMapShowAllSquadMembers_K2Node_ComponentBoundEvent_9_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__TrackJumpTest_K2Node_ComponentBoundEvent_7_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__HighQualityFX_K2Node_ComponentBoundEvent_8_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__OutsideSafeZoneOpacity_K2Node_ComponentBoundEvent_6_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__StormEffects_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__BlendSettings_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ShareLensSettings_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void Construct();
	void BndEvt__DamageEffects_K2Node_ComponentBoundEvent_29_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__TPDistanceToSubject_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__TPAutoFollow_K2Node_ComponentBoundEvent_4_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__RelevancyZone_K2Node_ComponentBoundEvent_3_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__PlayerOutlines_K2Node_ComponentBoundEvent_2_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__CameraCollision_K2Node_ComponentBoundEvent_0_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* FortPlayerControllerSpectating, ESpectatorCameraType CameraType);
	void CenterOnTab();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortBroadcastCameraSettingsTab_C">();
	}
	static class UFortBroadcastCameraSettingsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBroadcastCameraSettingsTab_C>();
	}
};
static_assert(alignof(UFortBroadcastCameraSettingsTab_C) == 0x000008, "Wrong alignment on UFortBroadcastCameraSettingsTab_C");
static_assert(sizeof(UFortBroadcastCameraSettingsTab_C) == 0x0004D8, "Wrong size on UFortBroadcastCameraSettingsTab_C");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, UberGraphFrame) == 0x000418, "Member 'UFortBroadcastCameraSettingsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapAutomaticCameraPlacement) == 0x000420, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapAutomaticCameraPlacement' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowAllSquadMembers) == 0x000428, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowAllSquadMembers' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowNearbyChests) == 0x000430, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowNearbyChests' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BattleMapShowTimeIndicator) == 0x000438, "Member 'UFortBroadcastCameraSettingsTab_C::BattleMapShowTimeIndicator' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, BlendSettings) == 0x000440, "Member 'UFortBroadcastCameraSettingsTab_C::BlendSettings' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, DamageEffects) == 0x000448, "Member 'UFortBroadcastCameraSettingsTab_C::DamageEffects' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, DroneIgnoreJump) == 0x000450, "Member 'UFortBroadcastCameraSettingsTab_C::DroneIgnoreJump' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, HighQualityFX) == 0x000458, "Member 'UFortBroadcastCameraSettingsTab_C::HighQualityFX' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OutsideSafeZoneOpacity) == 0x000460, "Member 'UFortBroadcastCameraSettingsTab_C::OutsideSafeZoneOpacity' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, RelevancyZone) == 0x000468, "Member 'UFortBroadcastCameraSettingsTab_C::RelevancyZone' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, SessionIDwatermark) == 0x000470, "Member 'UFortBroadcastCameraSettingsTab_C::SessionIDwatermark' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, ShareLensSettings) == 0x000478, "Member 'UFortBroadcastCameraSettingsTab_C::ShareLensSettings' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, StormEffects) == 0x000480, "Member 'UFortBroadcastCameraSettingsTab_C::StormEffects' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPAutoFollow) == 0x000488, "Member 'UFortBroadcastCameraSettingsTab_C::TPAutoFollow' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPCameraCollision) == 0x000490, "Member 'UFortBroadcastCameraSettingsTab_C::TPCameraCollision' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, TPDistanceToSubject) == 0x000498, "Member 'UFortBroadcastCameraSettingsTab_C::TPDistanceToSubject' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, VerticalBox) == 0x0004A0, "Member 'UFortBroadcastCameraSettingsTab_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OffText) == 0x0004A8, "Member 'UFortBroadcastCameraSettingsTab_C::OffText' has a wrong offset!");
static_assert(offsetof(UFortBroadcastCameraSettingsTab_C, OnText) == 0x0004C0, "Member 'UFortBroadcastCameraSettingsTab_C::OnText' has a wrong offset!");

}

