#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortBroadcastCameraSettingsTab

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FortBroadcastCameraSettingsTab.FortBroadcastCameraSettingsTab_C.ExecuteUbergraph_FortBroadcastCameraSettingsTab
// 0x0348 (0x0348 - 0x0000)
struct FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FDD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FDE[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FDF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE0[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE1[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_8;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_12;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE3[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE4[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_16;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE5[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_18;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FE6[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE7[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_20;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FE8[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE9[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x00D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x00E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_4;                          // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FEA[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_5;                          // 0x0110(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FEB[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_6;                          // 0x0128(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_7;                          // 0x0138(0x0010)(ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FEC[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_8;                          // 0x0150(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_9;                          // 0x0160(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_10;                         // 0x0170(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_11;                         // 0x0180(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerControllerSpectating*        K2Node_Event_FortPlayerControllerSpectating;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatorCameraType                          K2Node_Event_CameraType;                           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FED[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_14;      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBroadcasterToken_ReturnValue;          // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FEE[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FEF[0x2];                                     // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_13;      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF0[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_12;      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF1[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_11;      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value_1;         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FF2[0x2];                                     // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_10;      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF3[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_9;       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF4[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_12;                         // 0x01E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_8;       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FF5[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_7;       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF6[0x2];                                     // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF7[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_6;       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_6;             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF8[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings_1; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF9[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_23;                              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_5;       // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_7;             // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_13;                             // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FFA[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_24;                              // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FFB[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotatorSelectorReplaySettings_C*       K2Node_DynamicCast_AsRotator_Selector_Replay_Settings_2; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FFC[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_25;                              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_15;                             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FFD[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue_1;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FFE[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_13;                         // 0x0258(0x0010)(ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FFF[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_14;                         // 0x0270(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0280(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6000[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6001[0x2];                                     // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_4;       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_3;       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_8;             // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_9;             // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_16;                             // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x02B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_2;       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_10;            // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6002[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index_1;       // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_11;            // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6003[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayerOutlinesEnabled;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6004[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerSpectating*        K2Node_DynamicCast_AsFort_Player_Controller_Spectating; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6005[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStormEffectsEnabled;                 // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6006[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_SafeZoneOpacity;                      // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRelevancyZoneVisible;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHighQualityFxEnabled;                // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6007[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_5;                           // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_6;                           // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDamageFxEnabled;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EThirdPersonAutoFollowMode                    K2Node_Event_ThirdPersonAutoFollowMode;            // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6008[0x2];                                     // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_7;                           // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ThirdPersonDistanceToSubject;         // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bThirdPersonCameraCollision;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShareLensSettings;                   // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6009[0x2];                                     // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_8;                           // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_9;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDroneIgnoreJump;                     // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBattleMapShowTimeIndicator;          // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600A[0x2];                                     // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_10;                          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_11;                          // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBattleMapShowNearbyChests;           // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBattleMapShowAllSquadMembers;        // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600B[0x2];                                     // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_12;                          // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_13;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInBattleMapAutomaticCameraPlacement; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600C[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_14;                          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_12;            // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_15;                          // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowSessionIDWatermark;              // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default_16;                          // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab) == 0x000008, "Wrong alignment on FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab");
static_assert(sizeof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab) == 0x000348, "Wrong size on FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, EntryPoint) == 0x000000, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable) == 0x000004, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable) == 0x000008, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_1) == 0x00000C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_1) == 0x000010, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_2) == 0x000014, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_3) == 0x000018, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_2) == 0x00001C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_4) == 0x000020, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_5) == 0x000024, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_3) == 0x000028, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_6) == 0x00002C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_7) == 0x000030, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_4) == 0x000034, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_8) == 0x000038, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_9) == 0x00003C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_5) == 0x000040, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_10) == 0x000044, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_11) == 0x000048, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeStruct_Margin) == 0x00004C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_6) == 0x00005C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_byte_Variable) == 0x00005D, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_byte_Variable_1) == 0x00005E, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_7) == 0x00005F, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_12) == 0x000060, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_13) == 0x000064, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_8) == 0x000068, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_14) == 0x00006C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_15) == 0x000070, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_9) == 0x000074, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_16) == 0x000078, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_17) == 0x00007C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_10) == 0x000080, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_18) == 0x000084, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_19) == 0x000088, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_11) == 0x000098, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_20) == 0x00009C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_21) == 0x0000A0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_byte_Variable_2) == 0x0000A4, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array) == 0x0000A8, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_bool_Variable_12) == 0x0000B8, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_2) == 0x0000D0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_3) == 0x0000E0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_4) == 0x0000F0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Array_Index_Variable) == 0x000108, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_5) == 0x000110, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_int_Variable_22) == 0x000120, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_byte_Variable_3) == 0x000124, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_6) == 0x000128, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_7) == 0x000138, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, Temp_byte_Variable_4) == 0x000148, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_8) == 0x000150, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_9) == 0x000160, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_10) == 0x000170, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_MakeArray_Array_11) == 0x000180, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_MakeArray_Array_11' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_Event_FortPlayerControllerSpectating) == 0x000190, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_Event_FortPlayerControllerSpectating' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_Event_CameraType) == 0x000198, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_Event_CameraType' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_14) == 0x00019C, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_14' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A1, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001A2, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_HasBroadcasterToken_ReturnValue) == 0x0001A3, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_HasBroadcasterToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_BooleanAND_ReturnValue) == 0x0001A4, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_DynamicCast_AsRotator_Selector_Replay_Settings) == 0x0001A8, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_DynamicCast_AsRotator_Selector_Replay_Settings' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_Select_Default) == 0x0001B1, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_13) == 0x0001B4, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_13' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001B8, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_12) == 0x0001BC, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_12' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001C0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_11) == 0x0001C4, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_11' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Slider_Value_1) == 0x0001C8, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Slider_Value_1' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001CC, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, CallFunc_GetValidValue_ReturnValue) == 0x0001CD, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab, K2Node_ComponentBoundEvent_Selected_Index_10) == 0x0001D0, "Member 'FortBroadcastCameraSettingsTab_C_ExecuteUbergraph_FortBroadcastCameraSettingsTab::K2Node_ComponentBoundEvent_Selected_Index_10' has a wrong offset!");
