#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortVoiceChannelSpeakerHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortVoiceChannelSpeakerHUD.FortVoiceChannelSpeakerHUD_C
// 0x0020 (0x02F0 - 0x02D0)
class UFortVoiceChannelSpeakerHUD_C final : public UFortVoiceChannelSpeakerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimateVoice;                                      // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Content;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnAnimateTalkingChanged(bool bIsNowTalking);
	void ExecuteUbergraph_FortVoiceChannelSpeakerHUD(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnStyleAssigned(EChannelSpeakerStyle NewStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortVoiceChannelSpeakerHUD_C">();
	}
	static class UFortVoiceChannelSpeakerHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVoiceChannelSpeakerHUD_C>();
	}
};
static_assert(alignof(UFortVoiceChannelSpeakerHUD_C) == 0x000008, "Wrong alignment on UFortVoiceChannelSpeakerHUD_C");
static_assert(sizeof(UFortVoiceChannelSpeakerHUD_C) == 0x0002F0, "Wrong size on UFortVoiceChannelSpeakerHUD_C");
static_assert(offsetof(UFortVoiceChannelSpeakerHUD_C, UberGraphFrame) == 0x0002D0, "Member 'UFortVoiceChannelSpeakerHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortVoiceChannelSpeakerHUD_C, AnimateVoice) == 0x0002D8, "Member 'UFortVoiceChannelSpeakerHUD_C::AnimateVoice' has a wrong offset!");
static_assert(offsetof(UFortVoiceChannelSpeakerHUD_C, Border_OnlineStatusIndicator) == 0x0002E0, "Member 'UFortVoiceChannelSpeakerHUD_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UFortVoiceChannelSpeakerHUD_C, Content) == 0x0002E8, "Member 'UFortVoiceChannelSpeakerHUD_C::Content' has a wrong offset!");

}

