#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fort_Pickup_Creative

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Fort_Pickup_Creative.Fort_Pickup_Creative_C
// 0x0018 (0x0698 - 0x0680)
class AFort_Pickup_Creative_C final : public AFortPickupCreative
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCreativePickupItemCostComponent_C*     CreativePickupItemCostComponent;                   // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PickupSphere;                                      // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__PickupSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_Fort_Pickup_Creative(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fort_Pickup_Creative_C">();
	}
	static class AFort_Pickup_Creative_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFort_Pickup_Creative_C>();
	}
};
static_assert(alignof(AFort_Pickup_Creative_C) == 0x000008, "Wrong alignment on AFort_Pickup_Creative_C");
static_assert(sizeof(AFort_Pickup_Creative_C) == 0x000698, "Wrong size on AFort_Pickup_Creative_C");
static_assert(offsetof(AFort_Pickup_Creative_C, UberGraphFrame) == 0x000680, "Member 'AFort_Pickup_Creative_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFort_Pickup_Creative_C, CreativePickupItemCostComponent) == 0x000688, "Member 'AFort_Pickup_Creative_C::CreativePickupItemCostComponent' has a wrong offset!");
static_assert(offsetof(AFort_Pickup_Creative_C, PickupSphere) == 0x000690, "Member 'AFort_Pickup_Creative_C::PickupSphere' has a wrong offset!");

}

