#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MenuScreenDispatcher__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature final
{
public:
	class UFortPlayerAnimInstance*                CharPart;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature) == 0x000008, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature, CharPart) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature::CharPart' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint
// 0x0150 (0x0150 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_584F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5850[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5851[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5852[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_1;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5853[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_3;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5854[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_3;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5855[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_2;      // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5856[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_3;      // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5857[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance*                K2Node_CustomEvent_CharPart;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateZone*                     K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5858[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_4;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_4;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5859[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_4;      // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585A[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_5;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_5;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585B[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterfacePlayerPawn_C> K2Node_DynamicCast_AsInterface_Player_Pawn_5;      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint) == 0x000150, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000008, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000018, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000030, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn) == 0x000040, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_1) == 0x000058, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_2) == 0x000070, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_3) == 0x000078, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_2) == 0x000080, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_3) == 0x000090, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_5) == 0x000098, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_2) == 0x0000A0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_6) == 0x0000B0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_3) == 0x0000B8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_7) == 0x0000C8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_CustomEvent_CharPart) == 0x0000D0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_CustomEvent_CharPart' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_GetGameState_ReturnValue) == 0x0000D8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Game_State_Zone) == 0x0000E0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Game_State_Zone' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_8) == 0x0000E8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_4) == 0x0000F0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_4) == 0x0000F8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_9) == 0x000100, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_4) == 0x000108, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_10) == 0x000118, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue_5) == 0x000120, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsFort_Pawn_5) == 0x000128, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsFort_Pawn_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_11) == 0x000130, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_AsInterface_Player_Pawn_5) == 0x000138, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_AsInterface_Player_Pawn_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, K2Node_DynamicCast_bSuccess_12) == 0x000148, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_Has_Been_Initd_Variable) == 0x000149, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, Temp_bool_IsClosed_Variable) == 0x00014A, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x00014B, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.CharPartEvent
// 0x0008 (0x0008 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent final
{
public:
	class UFortPlayerAnimInstance*                CharPart;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent) == 0x000008, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent, CharPart) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_CharPartEvent::CharPart' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ValidateDBNONativize
// 0x0168 (0x0168 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize final
{
public:
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585D[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_2;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_3;          // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_4;          // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_5;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585F[0x1];                                     // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_2;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_3;        // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_4;        // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_5;        // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5860[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_4;         // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_6;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5861[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_5;         // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_7;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5862[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize) == 0x000168, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_BoolToString_ReturnValue) == 0x000030, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000058, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x000068, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000078, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000088, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000098, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000A8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000B8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000B9, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BA, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x0000C0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000D0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000D8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x0000E8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue_2) == 0x0000E9, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue_3) == 0x0000EA, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue_4) == 0x0000EB, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_BoolBool_ReturnValue_5) == 0x0000EC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_BoolBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000ED, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Not_PreBool_ReturnValue) == 0x0000EE, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue_3) == 0x0000F0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000100, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_1) == 0x000110, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_2) == 0x000111, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_3) == 0x000112, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_4) == 0x000113, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_5) == 0x000114, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue_4) == 0x000118, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_6) == 0x000128, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000130, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Conv_FloatToString_ReturnValue_5) == 0x000140, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Conv_FloatToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_NotEqual_FloatFloat_ReturnValue_7) == 0x000150, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_NotEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000158, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ValidateDBNONativize::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.VehicleLowerBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride final
{
public:
	struct FPoseLink                              InPoseLowerBodyDefault;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleLowerBodyOverride;                    // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride) == 0x000030, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride, InPoseLowerBodyDefault) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride::InPoseLowerBodyDefault' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride, InPoseUpperBody) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride::InPoseUpperBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride, Param_VehicleLowerBodyOverride) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleLowerBodyOverride::Param_VehicleLowerBodyOverride' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.VehicleFullBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerCachePose;                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleFullBodyOverride;                     // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride) == 0x000030, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride, InPoseFullBody) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride::InPoseFullBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride, InPoseUpperAndLowerCachePose) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride::InPoseUpperAndLowerCachePose' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride, Param_VehicleFullBodyOverride) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleFullBodyOverride::Param_VehicleFullBodyOverride' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.VehicleSplitBodyOverride
// 0x00B0 (0x00B0 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride final
{
public:
	struct FPoseLink                              InPoseSplitBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerBody;                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_TurnInPlace             Param_TurnInPlace;                                 // 0x0020(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPoseLink                              InPoseUpperAndLowerBodyRemoveRoot;                 // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleSplitBodyOverride;                    // 0x00A0(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride) == 0x0000B0, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride, InPoseSplitBody) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride::InPoseSplitBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBody) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBody' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride, Param_TurnInPlace) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride::Param_TurnInPlace' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBodyRemoveRoot) == 0x000090, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBodyRemoveRoot' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride, Param_VehicleSplitBodyOverride) == 0x0000A0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_VehicleSplitBodyOverride::Param_VehicleSplitBodyOverride' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemRelaxedEntry;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry, InPoseRelaxedEntry) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry::InPoseRelaxedEntry' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry, Param_ItemRelaxedEntry) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemRelaxedEntry::Param_ItemRelaxedEntry' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPostPivot;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot, InPoseLowerBodyJogPostPivot) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot::InPoseLowerBodyJogPostPivot' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot, Param_ItemLowerBodyJogPostPivot) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPostPivot::Param_ItemLowerBodyJogPostPivot' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogPrePivot;                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot, InPoseLowerBodyJogPrePivot) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot::InPoseLowerBodyJogPrePivot' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot, Param_ItemLowerBodyJogPrePivot) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogPrePivot::Param_ItemLowerBodyJogPrePivot' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStop;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop, InPoseLowerBodyJogStop) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop::InPoseLowerBodyJogStop' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop, Param_ItemLowerBodyJogStop) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStop::Param_ItemLowerBodyJogStop' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyJogStart;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart, InPoseLowerBodyJogStart) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart::InPoseLowerBodyJogStart' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart, Param_ItemLowerBodyJogStart) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyJogStart::Param_ItemLowerBodyJogStart' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyMovement;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement) == 0x000020, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement, InPoseLowerBodyMovement) == 0x000000, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement::InPoseLowerBodyMovement' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement, Param_ItemLowerBodyMovement) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint_C_ItemLowerBodyMovement::Param_ItemLowerBodyMovement' has a wrong offset!");

// Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct Fortnite_M_Avg_Player_AnimBlueprint_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
