#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendSubscriptionToastWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function FriendSubscriptionToastWidget.FriendSubscriptionToastWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FriendSubscriptionToastWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendSubscriptionToastWidget_C_PreConstruct) == 0x000001, "Wrong alignment on FriendSubscriptionToastWidget_C_PreConstruct");
static_assert(sizeof(FriendSubscriptionToastWidget_C_PreConstruct) == 0x000001, "Wrong size on FriendSubscriptionToastWidget_C_PreConstruct");
static_assert(offsetof(FriendSubscriptionToastWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FriendSubscriptionToastWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FriendSubscriptionToastWidget.FriendSubscriptionToastWidget_C.ExecuteUbergraph_FriendSubscriptionToastWidget
// 0x0030 (0x0030 - 0x0000)
struct FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_546C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget) == 0x000008, "Wrong alignment on FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget");
static_assert(sizeof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget) == 0x000030, "Wrong size on FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget");
static_assert(offsetof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget, EntryPoint) == 0x000000, "Member 'FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget, K2Node_Event_IsDesignTime) == 0x000028, "Member 'FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

