#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fringe_Plank_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fringe_Plank_AnimBP.Fringe_Plank_AnimBP_C
// 0x0750 (0x09C0 - 0x0270)
class UFringe_Plank_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5A22[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02A8(0x0088)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0330(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0980(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09A0(0x0020)()

public:
	void ExecuteUbergraph_Fringe_Plank_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fringe_Plank_AnimBP_C">();
	}
	static class UFringe_Plank_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFringe_Plank_AnimBP_C>();
	}
};
static_assert(alignof(UFringe_Plank_AnimBP_C) == 0x000010, "Wrong alignment on UFringe_Plank_AnimBP_C");
static_assert(sizeof(UFringe_Plank_AnimBP_C) == 0x0009C0, "Wrong size on UFringe_Plank_AnimBP_C");
static_assert(offsetof(UFringe_Plank_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UFringe_Plank_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFringe_Plank_AnimBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UFringe_Plank_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFringe_Plank_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x0002A8, "Member 'UFringe_Plank_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UFringe_Plank_AnimBP_C, AnimGraphNode_RigidBody) == 0x000330, "Member 'UFringe_Plank_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UFringe_Plank_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000980, "Member 'UFringe_Plank_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UFringe_Plank_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009A0, "Member 'UFringe_Plank_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

