#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Lobby_Background

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.SetShowPedestalSparkles
// 0x0038 (0x0038 - 0x0000)
struct Frontend_Lobby_Background_C_SetShowPedestalSparkles final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BE9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATeamMemberPedestal_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BEA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATeamMemberPedestal_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Lobby_Background_C_SetShowPedestalSparkles) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_SetShowPedestalSparkles");
static_assert(sizeof(Frontend_Lobby_Background_C_SetShowPedestalSparkles) == 0x000038, "Wrong size on Frontend_Lobby_Background_C_SetShowPedestalSparkles");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Show) == 0x000000, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Show' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Array_Get_Item) == 0x000028, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.UpdateFade
// 0x0014 (0x0014 - 0x0000)
struct Frontend_Lobby_Background_C_UpdateFade final
{
public:
	float                                         FadeValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeFloorToBlack;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InFadeGrid;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_UpdateFade) == 0x000004, "Wrong alignment on Frontend_Lobby_Background_C_UpdateFade");
static_assert(sizeof(Frontend_Lobby_Background_C_UpdateFade) == 0x000014, "Wrong size on Frontend_Lobby_Background_C_UpdateFade");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, FadeValue) == 0x000000, "Member 'Frontend_Lobby_Background_C_UpdateFade::FadeValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, FadeFloorToBlack) == 0x000004, "Member 'Frontend_Lobby_Background_C_UpdateFade::FadeFloorToBlack' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, InFadeGrid) == 0x000008, "Member 'Frontend_Lobby_Background_C_UpdateFade::InFadeGrid' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'Frontend_Lobby_Background_C_UpdateFade::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'Frontend_Lobby_Background_C_UpdateFade::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature final
{
public:
	class FString                                 PresetEnvironmentName;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature, PresetEnvironmentName) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature::PresetEnvironmentName' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature final
{
public:
	class UTexture*                               BackgroundImage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature, BackgroundImage) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature::BackgroundImage' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.ExecuteUbergraph_Frontend_Lobby_Background
// 0x0050 (0x0050 - 0x0000)
struct Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BEB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_ActorBoundEvent_BackgroundImage;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ActorBoundEvent_PresetEnvironmentName;      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BEC[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(sizeof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000050, "Wrong size on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, EntryPoint) == 0x000000, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_SwitchString_CmpSuccess) == 0x000004, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_BackgroundImage) == 0x000008, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_BackgroundImage' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_PresetEnvironmentName) == 0x000010, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_PresetEnvironmentName' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000020, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_MakeColor_ReturnValue) == 0x000024, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000034, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_bool_Variable) == 0x000038, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000048, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");

}

