#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_BP13_Room_A_Art

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_BP13_Room_A_Art.Frontend_BP13_Room_A_Art_C
// 0x0020 (0x0258 - 0x0238)
class AFrontend_BP13_Room_A_Art_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AAmbientSound*                          UI_AMB_Dock_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          UI_AMB_MainRoom_Cue_2_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          UI_AMB_Fan_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Frontend_BP13_Room_A_Art(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_BP13_Room_A_Art_C">();
	}
	static class AFrontend_BP13_Room_A_Art_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_BP13_Room_A_Art_C>();
	}
};
static_assert(alignof(AFrontend_BP13_Room_A_Art_C) == 0x000008, "Wrong alignment on AFrontend_BP13_Room_A_Art_C");
static_assert(sizeof(AFrontend_BP13_Room_A_Art_C) == 0x000258, "Wrong size on AFrontend_BP13_Room_A_Art_C");
static_assert(offsetof(AFrontend_BP13_Room_A_Art_C, UberGraphFrame) == 0x000238, "Member 'AFrontend_BP13_Room_A_Art_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontend_BP13_Room_A_Art_C, UI_AMB_Dock_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty) == 0x000240, "Member 'AFrontend_BP13_Room_A_Art_C::UI_AMB_Dock_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_BP13_Room_A_Art_C, UI_AMB_MainRoom_Cue_2_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty) == 0x000248, "Member 'AFrontend_BP13_Room_A_Art_C::UI_AMB_MainRoom_Cue_2_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_BP13_Room_A_Art_C, UI_AMB_Fan_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty) == 0x000250, "Member 'AFrontend_BP13_Room_A_Art_C::UI_AMB_Fan_Cue_ExecuteUbergraph_Frontend_BP13_Room_A_Art_RefProperty' has a wrong offset!");

}

