#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendCamera_VaultRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FrontendCamera_VaultRotator.FrontendCamera_VaultRotator_C
// 0x0020 (0x07F0 - 0x07D0)
class AFrontendCamera_VaultRotator_C final : public AFortCameraBase
{
public:
	uint8                                         Pad_7D1E[0x8];                                     // 0x07C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       LoginCamera_0;                                     // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBattlepass;                                      // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1F[0x7];                                     // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVaultRotator_C*                        ActiveVaultRotator;                                // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetVaultRotatorLighting(class FName ItemRotatorTag);
	void OnActivated(class AFortPlayerController* PlayerController);
	void OnDeactivated(class AFortPlayerController* PlayerController);
	void ExecuteUbergraph_FrontendCamera_VaultRotator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontendCamera_VaultRotator_C">();
	}
	static class AFrontendCamera_VaultRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontendCamera_VaultRotator_C>();
	}
};
static_assert(alignof(AFrontendCamera_VaultRotator_C) == 0x000010, "Wrong alignment on AFrontendCamera_VaultRotator_C");
static_assert(sizeof(AFrontendCamera_VaultRotator_C) == 0x0007F0, "Wrong size on AFrontendCamera_VaultRotator_C");
static_assert(offsetof(AFrontendCamera_VaultRotator_C, UberGraphFrame) == 0x0007D0, "Member 'AFrontendCamera_VaultRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontendCamera_VaultRotator_C, LoginCamera_0) == 0x0007D8, "Member 'AFrontendCamera_VaultRotator_C::LoginCamera_0' has a wrong offset!");
static_assert(offsetof(AFrontendCamera_VaultRotator_C, IsBattlepass) == 0x0007E0, "Member 'AFrontendCamera_VaultRotator_C::IsBattlepass' has a wrong offset!");
static_assert(offsetof(AFrontendCamera_VaultRotator_C, ActiveVaultRotator) == 0x0007E8, "Member 'AFrontendCamera_VaultRotator_C::ActiveVaultRotator' has a wrong offset!");

}

