#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FloppingRabbit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FloppingRabbit.GA_Athena_FloppingRabbit_C
// 0x0020 (0x0E10 - 0x0DF0)
class UGA_Athena_FloppingRabbit_C final : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_FloppingRabbit_C;         // 0x0DF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_Active;                                          // 0x0DF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_InWorld;                                         // 0x0E00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CastMontageWeapon;                                 // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_FloppingRabbit(int32 EntryPoint);
	void ThrowMontageStarted();
	void K2_ActivateAbility();
	void OnCompleted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnBlendOut_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnInterrupted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyBegin_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyEnd_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FloppingRabbit_C">();
	}
	static class UGA_Athena_FloppingRabbit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FloppingRabbit_C>();
	}
};
static_assert(alignof(UGA_Athena_FloppingRabbit_C) == 0x000008, "Wrong alignment on UGA_Athena_FloppingRabbit_C");
static_assert(sizeof(UGA_Athena_FloppingRabbit_C) == 0x000E10, "Wrong size on UGA_Athena_FloppingRabbit_C");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, UberGraphFrame_GA_Athena_FloppingRabbit_C) == 0x000DF0, "Member 'UGA_Athena_FloppingRabbit_C::UberGraphFrame_GA_Athena_FloppingRabbit_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, T_Active) == 0x000DF8, "Member 'UGA_Athena_FloppingRabbit_C::T_Active' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, T_InWorld) == 0x000E00, "Member 'UGA_Athena_FloppingRabbit_C::T_InWorld' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, CastMontageWeapon) == 0x000E08, "Member 'UGA_Athena_FloppingRabbit_C::CastMontageWeapon' has a wrong offset!");

}

