#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Tethered_PassiveTriggered

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Tethered_PassiveTriggered.GA_Athena_Tethered_PassiveTriggered_C
// 0x0020 (0x0A98 - 0x0A78)
class UGA_Athena_Tethered_PassiveTriggered_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           GCN_BoostTag;                                      // 0x0A80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GCN_JumpTag;                                       // 0x0A88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ZiplineExit;                                       // 0x0A90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Tethered_PassiveTriggered(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Tethered_PassiveTriggered_C">();
	}
	static class UGA_Athena_Tethered_PassiveTriggered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Tethered_PassiveTriggered_C>();
	}
};
static_assert(alignof(UGA_Athena_Tethered_PassiveTriggered_C) == 0x000008, "Wrong alignment on UGA_Athena_Tethered_PassiveTriggered_C");
static_assert(sizeof(UGA_Athena_Tethered_PassiveTriggered_C) == 0x000A98, "Wrong size on UGA_Athena_Tethered_PassiveTriggered_C");
static_assert(offsetof(UGA_Athena_Tethered_PassiveTriggered_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Athena_Tethered_PassiveTriggered_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Tethered_PassiveTriggered_C, GCN_BoostTag) == 0x000A80, "Member 'UGA_Athena_Tethered_PassiveTriggered_C::GCN_BoostTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Tethered_PassiveTriggered_C, GCN_JumpTag) == 0x000A88, "Member 'UGA_Athena_Tethered_PassiveTriggered_C::GCN_JumpTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Tethered_PassiveTriggered_C, ZiplineExit) == 0x000A90, "Member 'UGA_Athena_Tethered_PassiveTriggered_C::ZiplineExit' has a wrong offset!");

}

