#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_BottomlessChugJug

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_BottomlessChugJug.GA_Athena_BottomlessChugJug_C.OnMontageTriggered
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_BottomlessChugJug_C_OnMontageTriggered final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered) == 0x000008, "Wrong alignment on GA_Athena_BottomlessChugJug_C_OnMontageTriggered");
static_assert(sizeof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered) == 0x000020, "Wrong size on GA_Athena_BottomlessChugJug_C_OnMontageTriggered");
static_assert(offsetof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Athena_BottomlessChugJug_C_OnMontageTriggered::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000008, "Member 'GA_Athena_BottomlessChugJug_C_OnMontageTriggered::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'GA_Athena_BottomlessChugJug_C_OnMontageTriggered::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000018, "Member 'GA_Athena_BottomlessChugJug_C_OnMontageTriggered::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_Athena_BottomlessChugJug_C_OnMontageTriggered, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000019, "Member 'GA_Athena_BottomlessChugJug_C_OnMontageTriggered::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

}

