#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_EnvSlurp_SilkyDino

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_EnvSlurp_SilkyDino.GA_Athena_EnvSlurp_SilkyDino_C.ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85BC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85BD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino) == 0x000008, "Wrong alignment on GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino");
static_assert(sizeof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino) == 0x000030, "Wrong size on GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, EntryPoint) == 0x000000, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, Temp_bool_Variable) == 0x000004, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, CallFunc_RowToBool_ReturnValue) == 0x000010, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000018, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000029, "Member 'GA_Athena_EnvSlurp_SilkyDino_C_ExecuteUbergraph_GA_Athena_EnvSlurp_SilkyDino::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

