#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent.GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C
// 0x0188 (0x0C00 - 0x0A78)
class UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    ProjectileReference;                               // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceFromInstigatorCheck;                       // 0x0A90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeedMin;                                // 0x0A94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeedMax;                                // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrajectoryProjectileGravityScaleCorrection;        // 0x0A9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProjectileTargetingOriginOffset;                   // 0x0AA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DummyShouldBounce;                                 // 0x0AAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DCA[0x3];                                     // 0x0AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DummyBounciness;                                   // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyFriction;                                     // 0x0AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyMaxSpeed;                                     // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyGravity;                                      // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyTimeStep;                                     // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DummyExtent;                                       // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProjectileTargetingOriginOffset_Crouched;          // 0x0AC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InThrowWindup;                                     // 0x0AD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DCB[0x3];                                     // 0x0AD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAbilityMontageInfo        ThrowWindupMontage;                                // 0x0AD8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_ProjectileTrajectory_Athena_C*      TrajectoryIndicator;                               // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorClass;                          // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityKeyPressed;                                 // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DCC[0x3];                                     // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalThrowAngle;                              // 0x0B44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeedPitch;                                     // 0x0B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinSpeedPitch;                                     // 0x0B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxThrowPitch;                                     // 0x0B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTrajectoryBounces;                              // 0x0B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsThrowing;                                        // 0x0B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DCD[0x3];                                     // 0x0B59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PostThrowDelay;                                    // 0x0B5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawned_On_Equip;                                  // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECollisionChannel                             DummyCollisionChannel;                             // 0x0B61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DCE[0x6];                                     // 0x0B62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ThrowConsumablesEnabled;                           // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_ItemThrown;                                      // 0x0B88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_Quest;                                           // 0x0BA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BGA_ToSpawn;                                       // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HeldObject_Parent_C*               DummyProjectile;                                   // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HeldObject_Parent_C*               SpawnedBGAHeldObject;                              // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCountToRemoveWhenThrown;                       // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DCF[0x4];                                     // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Windup;                                         // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_InWindup;                                      // 0x0BD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AB_PetrolWeapon_C*                      PetrolWeapon;                                      // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent(int32 EntryPoint);
	void SendGameplayEventsAndQuestUpdate();
	void UpdateDummyProjectileBGA();
	void RemoveItemFromQuickBar();
	void SpawnBGA_ServerOnly_();
	void UpdateSpawnedBGA_ServerOnly_();
	void UpdateTrajectory();
	void Cleanup_Trajectory_Display_On_End();
	void CleanupTrajectoryIndicatorOnUnequip();
	void InitTrajectoryVariables();
	void ThrowConsumable();
	void CleanupTrajectoryDisplay();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityInputReleased();
	void K2_ActivateAbility();
	void EventReceived_526561A640EC49D3EEBA449BC71450EF(const struct FGameplayEventData& Payload);
	void OnSync_9DBAE13E407ED891AB4EECA2ADF75C8D();
	void EventReceived_37ED270D4E5065DF6944ECB72BFD05A2(const struct FGameplayEventData& Payload);
	void OnFinish_4303A6684F8456517B7D258D8BA1CE9B();
	void OnCompleted_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnBlendOut_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnInterrupted_D12FE2DE4501EC495B89AAA1271D8CC2();
	void OnCancelled_D12FE2DE4501EC495B89AAA1271D8CC2();
	void Triggered_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_11EB7D0B4C52CC25C785B3A1EA90B008(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void SetupDummyProjectile();
	void UpdateTrajectorySpline();
	void CanBeDropped(bool* Yes);
	void GetProjectileTrajectoryPoints(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, struct FHitResult* OutHitResult);
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip);

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;
	void CalcProjectileSpeedFromPitch(float AimPitch, float* GrenadeSpeed) const;
	void GetOwningPlayer(class AFortPlayerPawn** Player_Pawn) const;
	TSubclassOf<class AFortProjectileTrajectory> GetProjectileTrajectoryActor() const;
	bool ShouldOnlyShowTrajectoryOnUse() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C">();
	}
	static class UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C");
static_assert(sizeof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C) == 0x000C00, "Wrong size on UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, PlayerPawn) == 0x000A80, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileReference) == 0x000A88, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileReference' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DistanceFromInstigatorCheck) == 0x000A90, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DistanceFromInstigatorCheck' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileSpeedMin) == 0x000A94, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileSpeedMin' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileSpeedMax) == 0x000A98, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileSpeedMax' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryProjectileGravityScaleCorrection) == 0x000A9C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryProjectileGravityScaleCorrection' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileTargetingOriginOffset) == 0x000AA0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileTargetingOriginOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyShouldBounce) == 0x000AAC, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyShouldBounce' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyBounciness) == 0x000AB0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyBounciness' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyFriction) == 0x000AB4, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyFriction' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyMaxSpeed) == 0x000AB8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyMaxSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyGravity) == 0x000ABC, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyGravity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyTimeStep) == 0x000AC0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyTimeStep' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyExtent) == 0x000AC4, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyExtent' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ProjectileTargetingOriginOffset_Crouched) == 0x000AC8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ProjectileTargetingOriginOffset_Crouched' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, InThrowWindup) == 0x000AD4, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::InThrowWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ThrowWindupMontage) == 0x000AD8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ThrowWindupMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryIndicator) == 0x000B30, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryIndicator' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, TrajectoryIndicatorClass) == 0x000B38, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::TrajectoryIndicatorClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, AbilityKeyPressed) == 0x000B40, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::AbilityKeyPressed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, AdditionalThrowAngle) == 0x000B44, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::AdditionalThrowAngle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxSpeedPitch) == 0x000B48, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxSpeedPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MinSpeedPitch) == 0x000B4C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MinSpeedPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxThrowPitch) == 0x000B50, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxThrowPitch' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, MaxTrajectoryBounces) == 0x000B54, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::MaxTrajectoryBounces' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, IsThrowing) == 0x000B58, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::IsThrowing' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, PostThrowDelay) == 0x000B5C, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::PostThrowDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, Spawned_On_Equip) == 0x000B60, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::Spawned_On_Equip' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyCollisionChannel) == 0x000B61, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyCollisionChannel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ThrowConsumablesEnabled) == 0x000B68, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ThrowConsumablesEnabled' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, T_ItemThrown) == 0x000B88, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::T_ItemThrown' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, T_Quest) == 0x000BA8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::T_Quest' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, BGA_ToSpawn) == 0x000BB0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::BGA_ToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, DummyProjectile) == 0x000BB8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::DummyProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, SpawnedBGAHeldObject) == 0x000BC0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::SpawnedBGAHeldObject' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, ItemCountToRemoveWhenThrown) == 0x000BC8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::ItemCountToRemoveWhenThrown' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, GE_Windup) == 0x000BD0, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::GE_Windup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, Tag_InWindup) == 0x000BD8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::Tag_InWindup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C, PetrolWeapon) == 0x000BF8, "Member 'UGA_Athena_Consumable_ThrowWithTrajectoryAsHeldObjectBGA_Parent_C::PetrolWeapon' has a wrong offset!");

}

