#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HookDestroy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ToyAngleSelectorInfo_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.ExecuteUbergraph_GA_Athena_HookDestroy
// 0x0830 (0x0830 - 0x0000)
struct GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0010(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D0(0x00B0)()
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Hook_Athena_C*                   K2Node_DynamicCast_AsB_Prj_Hook_Athena;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9B[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_PickGrappleMontage_SectionName;           // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C9C[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0228(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x02D8(0x00B0)()
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_2;                              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0408(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0440(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x0458(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_3;                              // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0488(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0498(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0548(0x00B0)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x05F8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0612(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0613(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x0614(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9D[0x2];                                     // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0630(0x0048)(ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9E[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9F[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0690(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x06B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetInventoryGUID_ReturnValue;             // 0x06D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA0[0x4];                                     // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0700(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA1[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0725(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA2[0x2];                                     // 0x0726(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0730(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA3[0x3];                                     // 0x0749(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x074C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA4[0x4];                                     // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue_1;     // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0768(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA5[0x7];                                     // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Hookgun_Athena_C*                    K2Node_DynamicCast_AsB_Hookgun_Athena;             // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA6[0x3];                                     // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x078C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6CA7[0x4];                                     // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle;   // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA8[0x7];                                     // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA9[0x6];                                     // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue_1;          // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x07D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAA[0x2];                                     // 0x07DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x07DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x07E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAB[0x3];                                     // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CAC[0x3];                                     // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0804(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAD[0x3];                                     // 0x0805(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAE[0x6];                                     // 0x0812(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0829(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy) == 0x000008, "Wrong alignment on GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy");
static_assert(sizeof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy) == 0x000830, "Wrong size on GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, EntryPoint) == 0x000000, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable) == 0x000004, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload_2) == 0x000010, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable) == 0x0000D0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000180, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_14) == 0x000190, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsB_Prj_Hook_Athena) == 0x000198, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsB_Prj_Hook_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_PickGrappleMontage_SectionName) == 0x0001B4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_PickGrappleMontage_SectionName' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_13) == 0x0001BC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_12) == 0x0001C4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001CC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_11) == 0x0001DC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_10) == 0x0001F4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001FC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_1) == 0x00020C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_6) == 0x000214, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload_1) == 0x000228, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable_1) == 0x0002D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_7) == 0x000388, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_9) == 0x000398, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_8) == 0x0003A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003A8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_7) == 0x0003B8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003C0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_6) == 0x0003D0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_10) == 0x0003D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_5) == 0x0003E8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_11) == 0x0003F0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_2) == 0x000400, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_12) == 0x000408, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_4) == 0x000418, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_3) == 0x000420, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_13) == 0x000428, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_2) == 0x000438, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_14) == 0x000440, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_1) == 0x000450, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_15) == 0x000458, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName) == 0x000468, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_16) == 0x000470, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_3) == 0x000480, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_17) == 0x000488, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload) == 0x000498, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable_2) == 0x000548, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_18) == 0x0005F8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitNetSync_ReturnValue) == 0x000608, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue) == 0x000610, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_IsClosed_Variable) == 0x000611, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_Has_Been_Initd_Variable) == 0x000612, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsServer_ReturnValue) == 0x000613, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_19) == 0x000614, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_IsClosed_Variable_1) == 0x000624, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_Has_Been_Initd_Variable_1) == 0x000625, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_15) == 0x000628, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetActorInfo_ReturnValue) == 0x000630, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsServer_ReturnValue_1) == 0x000678, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000680, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_1) == 0x000688, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000690, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0006B8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_18) == 0x0006C8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x0006D0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetInventoryGUID_ReturnValue) == 0x0006D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetInventoryGUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0006E8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue) == 0x0006F0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0006F8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_20) == 0x000700, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_1) == 0x000710, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000718, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000720, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000724, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_2) == 0x000725, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_19) == 0x000728, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_19' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_21) == 0x000730, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x000740, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_3) == 0x000748, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_16) == 0x00074C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentSourceWeapon_ReturnValue_1) == 0x000758, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentSourceWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000760, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000768, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000770, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_2) == 0x000778, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsB_Hookgun_Athena) == 0x000780, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsB_Hookgun_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_3) == 0x000788, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_22) == 0x00078C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetVehicleActor_ReturnValue) == 0x0007A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle) == 0x0007A8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_4) == 0x0007B0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3) == 0x0007B8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_Not_PreBool_ReturnValue) == 0x0007C0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_4) == 0x0007C1, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentMontage_ReturnValue) == 0x0007C8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentMontage_ReturnValue_1) == 0x0007D0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0007D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0007D9, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_17) == 0x0007DC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_17' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_23) == 0x0007E4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_K2_CommitAbility_ReturnValue) == 0x0007F4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_Add_FloatFloat_ReturnValue) == 0x0007F8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0007FC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000800, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000804, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000808, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_5) == 0x000810, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_SwitchEnum_CmpSuccess) == 0x000811, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000818, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000820, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_6) == 0x000828, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_7) == 0x000829, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.EventReceived_1B71851D49048B6433DA75B0D6007B6E
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E) == 0x000008, "Wrong alignment on GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E");
static_assert(sizeof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E) == 0x0000B0, "Wrong size on GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E");
static_assert(offsetof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E, Payload) == 0x000000, "Member 'GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E::Payload' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnCompleted_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnBlendOut_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnInterrupted_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnCompleted_28C962BC449D96C668F3C4BE36E6CA62
// 0x0008 (0x0008 - 0x0000)
