#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FloppingRabbit_Pull

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FloppingRabbit_Pull.GA_Athena_FloppingRabbit_Pull_C
// 0x0088 (0x0B00 - 0x0A78)
class UGA_Athena_FloppingRabbit_Pull_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        Target;                                            // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Launcher;                                          // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_InVehicle;                                       // 0x0A90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LaunchArc;                                         // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LaunchGrav;                                        // 0x0A9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_PullAmount;                                    // 0x0AA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_PullEnabled;                                   // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_CanPullFriends;                                // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_FloppingRabbit_Pull(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FloppingRabbit_Pull_C">();
	}
	static class UGA_Athena_FloppingRabbit_Pull_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FloppingRabbit_Pull_C>();
	}
};
static_assert(alignof(UGA_Athena_FloppingRabbit_Pull_C) == 0x000008, "Wrong alignment on UGA_Athena_FloppingRabbit_Pull_C");
static_assert(sizeof(UGA_Athena_FloppingRabbit_Pull_C) == 0x000B00, "Wrong size on UGA_Athena_FloppingRabbit_Pull_C");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Athena_FloppingRabbit_Pull_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, Target) == 0x000A80, "Member 'UGA_Athena_FloppingRabbit_Pull_C::Target' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, Launcher) == 0x000A88, "Member 'UGA_Athena_FloppingRabbit_Pull_C::Launcher' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, T_InVehicle) == 0x000A90, "Member 'UGA_Athena_FloppingRabbit_Pull_C::T_InVehicle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, LaunchArc) == 0x000A98, "Member 'UGA_Athena_FloppingRabbit_Pull_C::LaunchArc' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, LaunchGrav) == 0x000A9C, "Member 'UGA_Athena_FloppingRabbit_Pull_C::LaunchGrav' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, Row_PullAmount) == 0x000AA0, "Member 'UGA_Athena_FloppingRabbit_Pull_C::Row_PullAmount' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, Row_PullEnabled) == 0x000AC0, "Member 'UGA_Athena_FloppingRabbit_Pull_C::Row_PullEnabled' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_Pull_C, Row_CanPullFriends) == 0x000AE0, "Member 'UGA_Athena_FloppingRabbit_Pull_C::Row_CanPullFriends' has a wrong offset!");

}

