#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_PhantomBooth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_PhantomBooth_Disguise_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_PhantomBooth.GA_Athena_PhantomBooth_C
// 0x00C8 (0x0B40 - 0x0A78)
class UGA_Athena_PhantomBooth_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AFortPawn*>                      HidingPlayers;                                     // 0x0A80(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class AFortPawn*                              Pawn;                                              // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        CameraMod;                                         // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HidingProp_C*                        HidingProp;                                        // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraDstance;                                     // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraHeight;                                      // 0x0AAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExitMagnitude;                                     // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83F4[0x4];                                     // 0x0ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ShouldCycle;                                       // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           AlterCue;                                          // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EgoCue;                                            // 0x0B08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ShowOffMontage;                                    // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_PhantomBooth_Disguise>  Struct_Disguises;                                  // 0x0B18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortGadgetItemDefinition*              NoValidDisguiseBackup;                             // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGadgetItemDefinition*              SandcastleAGID;                                    // 0x0B30(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGadgetItemDefinition*              SandcastleAGID2;                                   // 0x0B38(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_PhantomBooth(int32 EntryPoint);
	void End(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void WaitForTags();
	void OutfitChangeComplete();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnFinish_80743B324480A26D04C76BBBC27B2DA5();
	void OnVelocityChage_337ED75E4C221FDF49E3F4B3C80A7C4C();
	void OnVelocityChage_FC8811F24A2C168551849AA652EBBF03();
	void OnVelocityChage_B4F4D9D04DAB4F262BD32E9903AD5100();
	void OnFinish_A66F8F104A6E857B60C2E5B5BAAF47C2();
	void OnCompleted_7C49B62B40375D60A970DBB41EF8A716();
	void OnBlendOut_7C49B62B40375D60A970DBB41EF8A716();
	void OnInterrupted_7C49B62B40375D60A970DBB41EF8A716();
	void OnCancelled_7C49B62B40375D60A970DBB41EF8A716();
	void OnVelocityChage_FBD1A77240775E2DCF5AF3B6568A423A();
	void Added_DFBB384D432D369FC3C672927DAFE02D();
	void Added_EE0EB6124F4922F4DEC6559B293FC673();
	void Added_CB678B154885FD601BB3418E963B02C6();
	void FindStructToUse(const struct FGameplayTag& Faction, struct FStruct_PhantomBooth_Disguise* StructOut, bool* FoundStruct);
	void FindDisguise(const struct FGameplayTag& Faction, class UFortGadgetItemDefinition** AGID);
	void GetAllDisguiseAGIDs(TArray<class UFortGadgetItemDefinition*>* DisguiseAGIDs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_PhantomBooth_C">();
	}
	static class UGA_Athena_PhantomBooth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_PhantomBooth_C>();
	}
};
static_assert(alignof(UGA_Athena_PhantomBooth_C) == 0x000008, "Wrong alignment on UGA_Athena_PhantomBooth_C");
static_assert(sizeof(UGA_Athena_PhantomBooth_C) == 0x000B40, "Wrong size on UGA_Athena_PhantomBooth_C");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Athena_PhantomBooth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, HidingPlayers) == 0x000A80, "Member 'UGA_Athena_PhantomBooth_C::HidingPlayers' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, Pawn) == 0x000A90, "Member 'UGA_Athena_PhantomBooth_C::Pawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, CameraMod) == 0x000A98, "Member 'UGA_Athena_PhantomBooth_C::CameraMod' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, HidingProp) == 0x000AA0, "Member 'UGA_Athena_PhantomBooth_C::HidingProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, CameraDstance) == 0x000AA8, "Member 'UGA_Athena_PhantomBooth_C::CameraDstance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, CameraHeight) == 0x000AAC, "Member 'UGA_Athena_PhantomBooth_C::CameraHeight' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, ExitMagnitude) == 0x000AB8, "Member 'UGA_Athena_PhantomBooth_C::ExitMagnitude' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, ShouldCycle) == 0x000AC0, "Member 'UGA_Athena_PhantomBooth_C::ShouldCycle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, T_HudElementToHide) == 0x000AE0, "Member 'UGA_Athena_PhantomBooth_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, AlterCue) == 0x000B00, "Member 'UGA_Athena_PhantomBooth_C::AlterCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, EgoCue) == 0x000B08, "Member 'UGA_Athena_PhantomBooth_C::EgoCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, ShowOffMontage) == 0x000B10, "Member 'UGA_Athena_PhantomBooth_C::ShowOffMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, Struct_Disguises) == 0x000B18, "Member 'UGA_Athena_PhantomBooth_C::Struct_Disguises' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, NoValidDisguiseBackup) == 0x000B28, "Member 'UGA_Athena_PhantomBooth_C::NoValidDisguiseBackup' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, SandcastleAGID) == 0x000B30, "Member 'UGA_Athena_PhantomBooth_C::SandcastleAGID' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PhantomBooth_C, SandcastleAGID2) == 0x000B38, "Member 'UGA_Athena_PhantomBooth_C::SandcastleAGID2' has a wrong offset!");

}

