#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_PurpleMouse_Throw

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_PurpleMouse_Throw.GA_Athena_PurpleMouse_Throw_C.ExecuteUbergraph_GA_Athena_PurpleMouse_Throw
// 0x001C (0x001C - 0x0000)
struct GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C6F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFireLocation_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw) == 0x000004, "Wrong alignment on GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw");
static_assert(sizeof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw) == 0x00001C, "Wrong size on GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw, EntryPoint) == 0x000000, "Member 'GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw, K2Node_Event_bWasCancelled) == 0x00000C, "Member 'GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw, CallFunc_GetFireLocation_ReturnValue) == 0x000010, "Member 'GA_Athena_PurpleMouse_Throw_C_ExecuteUbergraph_GA_Athena_PurpleMouse_Throw::CallFunc_GetFireLocation_ReturnValue' has a wrong offset!");

// Function GA_Athena_PurpleMouse_Throw.GA_Athena_PurpleMouse_Throw_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_PurpleMouse_Throw_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_PurpleMouse_Throw.GA_Athena_PurpleMouse_Throw_C.GetPlayer
// 0x0078 (0x0078 - 0x0000)
struct GA_Athena_PurpleMouse_Throw_C_GetPlayer final
{
public:
	class AActor*                                 PlayerOrVehicle;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PropTag;                                           // 0x0010(0x0020)(Edit, BlueprintVisible)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C70[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActorPlayerPropAttachment* CallFunc_GetPossessedProp_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C71[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_PurpleMouse_Throw_C_GetPlayer) == 0x000008, "Wrong alignment on GA_Athena_PurpleMouse_Throw_C_GetPlayer");
static_assert(sizeof(GA_Athena_PurpleMouse_Throw_C_GetPlayer) == 0x000078, "Wrong size on GA_Athena_PurpleMouse_Throw_C_GetPlayer");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, PlayerOrVehicle) == 0x000000, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::PlayerOrVehicle' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, Player) == 0x000008, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::Player' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, PropTag) == 0x000010, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::PropTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000030, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, CallFunc_GetPossessedProp_ReturnValue) == 0x000040, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::CallFunc_GetPossessedProp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000048, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, CallFunc_GetAllPassengers_ReturnValue) == 0x000060, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PurpleMouse_Throw_C_GetPlayer, CallFunc_Array_Get_Item) == 0x000070, "Member 'GA_Athena_PurpleMouse_Throw_C_GetPlayer::CallFunc_Array_Get_Item' has a wrong offset!");

}

