#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_EnvCampFire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.ExecuteUbergraph_GA_Athena_EnvCampFire
// 0x03B8 (0x03B8 - 0x0000)
struct GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6570[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00B8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6571[0x2];                                     // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0198(0x00B0)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6572[0x2];                                     // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsStoked;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6573[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire;   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6574[0x6];                                     // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0288(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6575[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x02B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6576[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x02C0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6577[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6578[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6579[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0310(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_657A[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657B[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0370(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0398(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_EnvCampFire_C*            K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire");
static_assert(sizeof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire) == 0x0003B8, "Wrong size on GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, EntryPoint) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_Payload) == 0x000008, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable) == 0x0000B8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000168, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_Event_bWasCancelled) == 0x000171, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate) == 0x000174, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_Event_EventData) == 0x000198, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_int_Variable) == 0x000248, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00024C, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00024D, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000260, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_IsStoked) == 0x000268, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_IsStoked' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire) == 0x000270, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_1) == 0x000279, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_WaitTargetSelection_ReturnValue) == 0x000280, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_1) == 0x000288, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_2) == 0x0002B0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, Temp_struct_Variable_2) == 0x0002B4, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0002C0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0002D0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1) == 0x0002D8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_1) == 0x0002E0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002E4, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002F8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetValueAtLevel_ReturnValue) == 0x000304, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000308, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData) == 0x000310, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag) == 0x000338, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000340, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CreateDelegate_OutputDelegate_4) == 0x000344, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000358, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2) == 0x000360, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_2) == 0x000368, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_TargetData_1) == 0x000370, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_CustomEvent_ApplicationTag_1) == 0x000398, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x0003A0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3) == 0x0003A8, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_AsB_BGA_Athena_Env_Camp_Fire_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire, K2Node_DynamicCast_bSuccess_3) == 0x0003B0, "Member 'GA_Athena_EnvCampFire_C_ExecuteUbergraph_GA_Athena_EnvCampFire::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetIsStoked
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetIsStoked final
{
public:
	bool                                          Param_IsStoked;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetIsStoked) == 0x000001, "Wrong alignment on GA_Athena_EnvCampFire_C_SetIsStoked");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetIsStoked) == 0x000001, "Wrong size on GA_Athena_EnvCampFire_C_SetIsStoked");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetIsStoked, Param_IsStoked) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetIsStoked::Param_IsStoked' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_EnvCampFire_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_EnvCampFire_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_EnvCampFire_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_EnvCampFire_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_EnvCampFire_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4");
static_assert(sizeof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4) == 0x0000B0, "Wrong size on GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4");
static_assert(offsetof(GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4, Payload) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_EventReceived_63E2BB3E47E5E63C7A4A0A8C45DC23E4::Payload' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Targeted_EDAB937443020D47385625B06E892DF0
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0");
static_assert(sizeof(GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0, TargetData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0, ApplicationTag) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_Targeted_EDAB937443020D47385625B06E892DF0::ApplicationTag' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.Cancelled_EDAB937443020D47385625B06E892DF0
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0");
static_assert(sizeof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0, TargetData) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0, ApplicationTag) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_Cancelled_EDAB937443020D47385625B06E892DF0::ApplicationTag' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetCustomTargetingTrans
// 0x0070 (0x0070 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetCustomTargetingTrans final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657C[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans) == 0x000010, "Wrong alignment on GA_Athena_EnvCampFire_C_SetCustomTargetingTrans");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans) == 0x000070, "Wrong size on GA_Athena_EnvCampFire_C_SetCustomTargetingTrans");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_X) == 0x000020, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_Y) == 0x000024, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_BreakVector_Z) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetCustomTargetingTrans, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'GA_Athena_EnvCampFire_C_SetCustomTargetingTrans::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.SetBalanceValues
// 0x0058 (0x0058 - 0x0000)
struct GA_Athena_EnvCampFire_C_SetBalanceValues final
{
public:
	bool                                          Stoke;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_SetBalanceValues) == 0x000008, "Wrong alignment on GA_Athena_EnvCampFire_C_SetBalanceValues");
static_assert(sizeof(GA_Athena_EnvCampFire_C_SetBalanceValues) == 0x000058, "Wrong size on GA_Athena_EnvCampFire_C_SetBalanceValues");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, Stoke) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::Stoke' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000010, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000014, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000018, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000040, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x000044, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_FTrunc_ReturnValue_1) == 0x00004C, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvCampFire_C_SetBalanceValues, CallFunc_SelectInt_ReturnValue) == 0x000050, "Member 'GA_Athena_EnvCampFire_C_SetBalanceValues::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvCampFire.GA_Athena_EnvCampFire_C.GetCustomAbilitySourceTransform
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform) == 0x000010, "Wrong alignment on GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform");
static_assert(sizeof(GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform) == 0x000030, "Wrong size on GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform");
static_assert(offsetof(GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform, ReturnValue) == 0x000000, "Member 'GA_Athena_EnvCampFire_C_GetCustomAbilitySourceTransform::ReturnValue' has a wrong offset!");

}

