#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HidingProp_Teleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HidingProp_Teleport.GA_Athena_HidingProp_Teleport_C
// 0x00A0 (0x0B18 - 0x0A78)
class UGA_Athena_HidingProp_Teleport_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x0A80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AB_HidingProp_C*                        HidingProp;                                        // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HidingProp_C*                        TargetTeleporter;                                  // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        CameraModifier;                                    // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0AA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TargetPropTeleportingCue;                          // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WobbleHandle;                                      // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           WobbleCue;                                         // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ServerWorldTime;                                   // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EnterCue;                                          // 0x0AE4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HidingInPropTag;                                   // 0x0AEC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFB[0x4];                                     // 0x0AF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ChangeEquipmentTag;                                // 0x0AF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_GA_Athena_HidingProp_Teleport(int32 EntryPoint);
	void GrapplerFailSafe(class AFortPawn* FortPawn);
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Wobble();
	void QuestUpdate(class AFortPawn* Pawn);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Added_F96D6DD549939CA425D2D1BE1AD32090();
	void Added_CB8220A04B74338E758C11B7371D4630();
	void Added_67FE14EA4DF2D8C2DB494AA89443681B();
	void OnComplete_EE0FA6804073079396C44591432259C0();
	void Added_FD079A2341CDD832DF47CD975DFC3BB3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HidingProp_Teleport_C">();
	}
	static class UGA_Athena_HidingProp_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HidingProp_Teleport_C>();
	}
};
static_assert(alignof(UGA_Athena_HidingProp_Teleport_C) == 0x000008, "Wrong alignment on UGA_Athena_HidingProp_Teleport_C");
static_assert(sizeof(UGA_Athena_HidingProp_Teleport_C) == 0x000B18, "Wrong size on UGA_Athena_HidingProp_Teleport_C");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Athena_HidingProp_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, NewEventDispatcher_0) == 0x000A80, "Member 'UGA_Athena_HidingProp_Teleport_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, HidingProp) == 0x000A90, "Member 'UGA_Athena_HidingProp_Teleport_C::HidingProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, TargetTeleporter) == 0x000A98, "Member 'UGA_Athena_HidingProp_Teleport_C::TargetTeleporter' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, CameraModifier) == 0x000AA0, "Member 'UGA_Athena_HidingProp_Teleport_C::CameraModifier' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, T_HudElementToHide) == 0x000AA8, "Member 'UGA_Athena_HidingProp_Teleport_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, TargetPropTeleportingCue) == 0x000AC8, "Member 'UGA_Athena_HidingProp_Teleport_C::TargetPropTeleportingCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, WobbleHandle) == 0x000AD0, "Member 'UGA_Athena_HidingProp_Teleport_C::WobbleHandle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, WobbleCue) == 0x000AD8, "Member 'UGA_Athena_HidingProp_Teleport_C::WobbleCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, ServerWorldTime) == 0x000AE0, "Member 'UGA_Athena_HidingProp_Teleport_C::ServerWorldTime' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, EnterCue) == 0x000AE4, "Member 'UGA_Athena_HidingProp_Teleport_C::EnterCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, HidingInPropTag) == 0x000AEC, "Member 'UGA_Athena_HidingProp_Teleport_C::HidingInPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Teleport_C, ChangeEquipmentTag) == 0x000AF8, "Member 'UGA_Athena_HidingProp_Teleport_C::ChangeEquipmentTag' has a wrong offset!");

}

