#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_SecondaryTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_Grenade_ThrowWithTrajectory_Secondary_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_AppleSun_SecondaryTrajectory.GA_Athena_AppleSun_SecondaryTrajectory_C
// 0x0060 (0x0E78 - 0x0E18)
class UGA_Athena_AppleSun_SecondaryTrajectory_C final : public UGA_Athena_Grenade_ThrowWithTrajectory_Secondary_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_AppleSun_SecondaryTrajectory_C; // 0x0E18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LocationIsValid;                                   // 0x0E20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C41[0x3];                                     // 0x0E21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OffsetLocation;                                    // 0x0E24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDef;                                           // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDef_VR;                                        // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Recharging_Tags;                                   // 0x0E38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  VR_tag;                                            // 0x0E58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_AppleSun_SecondaryTrajectory(int32 EntryPoint);
	void Remove_Item_();
	void UpdateTrajectory();
	void K2_CommitExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_AppleSun_SecondaryTrajectory_C">();
	}
	static class UGA_Athena_AppleSun_SecondaryTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_AppleSun_SecondaryTrajectory_C>();
	}
};
static_assert(alignof(UGA_Athena_AppleSun_SecondaryTrajectory_C) == 0x000008, "Wrong alignment on UGA_Athena_AppleSun_SecondaryTrajectory_C");
static_assert(sizeof(UGA_Athena_AppleSun_SecondaryTrajectory_C) == 0x000E78, "Wrong size on UGA_Athena_AppleSun_SecondaryTrajectory_C");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, UberGraphFrame_GA_Athena_AppleSun_SecondaryTrajectory_C) == 0x000E18, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::UberGraphFrame_GA_Athena_AppleSun_SecondaryTrajectory_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, LocationIsValid) == 0x000E20, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::LocationIsValid' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, OffsetLocation) == 0x000E24, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::OffsetLocation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, ItemDef) == 0x000E28, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::ItemDef' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, ItemDef_VR) == 0x000E30, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::ItemDef_VR' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, Recharging_Tags) == 0x000E38, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::Recharging_Tags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_SecondaryTrajectory_C, VR_tag) == 0x000E58, "Member 'UGA_Athena_AppleSun_SecondaryTrajectory_C::VR_tag' has a wrong offset!");

}

