#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_EnvSlurp_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_EnvSlurp_Parent.GA_Athena_EnvSlurp_Parent_C.ExecuteUbergraph_GA_Athena_EnvSlurp_Parent
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7864[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7865[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0048(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue_1;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent) == 0x000008, "Wrong alignment on GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent");
static_assert(sizeof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent) == 0x0000C8, "Wrong size on GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000038, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000048, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_EffectContextGetInstigatorActor_ReturnValue) == 0x000060, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_EffectContextGetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_GetActorBounds_Origin) == 0x000078, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_GetActorBounds_BoxExtent) == 0x000084, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000090, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_BreakVector_X) == 0x000098, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_BreakVector_Y) == 0x00009C, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_BreakVector_Z) == 0x0000A0, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Square_ReturnValue) == 0x0000A4, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Square_ReturnValue_1) == 0x0000A8, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Square_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000AC, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B8, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_VSize_ReturnValue) == 0x0000BC, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Sqrt_ReturnValue) == 0x0000C0, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C4, "Member 'GA_Athena_EnvSlurp_Parent_C_ExecuteUbergraph_GA_Athena_EnvSlurp_Parent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvSlurp_Parent.GA_Athena_EnvSlurp_Parent_C.ApplyHealthGE
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE final
{
public:
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0000(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0010(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE) == 0x000008, "Wrong alignment on GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE");
static_assert(sizeof(GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE) == 0x000028, "Wrong size on GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000000, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000010, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000020, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyHealthGE::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Athena_EnvSlurp_Parent.GA_Athena_EnvSlurp_Parent_C.Health and Overheal Calc
// 0x0024 (0x0024 - 0x0000)
struct GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7866[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7867[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc) == 0x000004, "Wrong alignment on GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc");
static_assert(sizeof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc) == 0x000024, "Wrong size on GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, Temp_float_Variable) == 0x000000, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_GetHealth_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_GetMaxHealth_ReturnValue) == 0x00000C, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, Temp_bool_Variable) == 0x000010, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000018, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, CallFunc_Less_FloatFloat_ReturnValue) == 0x00001C, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc, K2Node_Select_Default) == 0x000020, "Member 'GA_Athena_EnvSlurp_Parent_C_Health_and_Overheal_Calc::K2Node_Select_Default' has a wrong offset!");

// Function GA_Athena_EnvSlurp_Parent.GA_Athena_EnvSlurp_Parent_C.ApplyShieldGE
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7868[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0018(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE) == 0x000008, "Wrong alignment on GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE");
static_assert(sizeof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE) == 0x000030, "Wrong size on GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000018, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000028, "Member 'GA_Athena_EnvSlurp_Parent_C_ApplyShieldGE::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

}

