#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Coconut_ShieldHealth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Coconut_ShieldHealth.GA_Coconut_ShieldHealth_C
// 0x0050 (0x0AC8 - 0x0A78)
class UGA_Coconut_ShieldHealth_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         TimeInterval;                                      // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_Interval;                                    // 0x0AA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Heals;                                          // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Shields;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Activate;                                       // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Coconut_ShieldHealth(int32 EntryPoint);
	void ApplyEffect();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Coconut_ShieldHealth_C">();
	}
	static class UGA_Coconut_ShieldHealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Coconut_ShieldHealth_C>();
	}
};
static_assert(alignof(UGA_Coconut_ShieldHealth_C) == 0x000008, "Wrong alignment on UGA_Coconut_ShieldHealth_C");
static_assert(sizeof(UGA_Coconut_ShieldHealth_C) == 0x000AC8, "Wrong size on UGA_Coconut_ShieldHealth_C");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, UberGraphFrame) == 0x000A78, "Member 'UGA_Coconut_ShieldHealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, PlayerPawn) == 0x000A80, "Member 'UGA_Coconut_ShieldHealth_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, TimeInterval) == 0x000A88, "Member 'UGA_Coconut_ShieldHealth_C::TimeInterval' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, Timer_Interval) == 0x000AA8, "Member 'UGA_Coconut_ShieldHealth_C::Timer_Interval' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GE_Heals) == 0x000AB0, "Member 'UGA_Coconut_ShieldHealth_C::GE_Heals' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GE_Shields) == 0x000AB8, "Member 'UGA_Coconut_ShieldHealth_C::GE_Shields' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GC_Activate) == 0x000AC0, "Member 'UGA_Coconut_ShieldHealth_C::GC_Activate' has a wrong offset!");

}

