#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GenericConsume

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GenericConsume.GA_GenericConsume_C
// 0x0030 (0x0AA8 - 0x0A78)
class UGA_GenericConsume_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              GESpecToApply;                                     // 0x0A88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          GESpecAlreadyApplied;                              // 0x0A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68D7[0x7];                                     // 0x0A99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   ForceFeedback;                                     // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_GenericConsume(int32 EntryPoint);
	void DropHeldObject();
	void K2_ActivateAbility();
	void Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnGenericNotifyFromAnimation(const struct FGameplayTag& NotifyTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_GenericConsume_C">();
	}
	static class UGA_GenericConsume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GenericConsume_C>();
	}
};
static_assert(alignof(UGA_GenericConsume_C) == 0x000008, "Wrong alignment on UGA_GenericConsume_C");
static_assert(sizeof(UGA_GenericConsume_C) == 0x000AA8, "Wrong size on UGA_GenericConsume_C");
static_assert(offsetof(UGA_GenericConsume_C, UberGraphFrame) == 0x000A78, "Member 'UGA_GenericConsume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_GenericConsume_C, MontageToPlay) == 0x000A80, "Member 'UGA_GenericConsume_C::MontageToPlay' has a wrong offset!");
static_assert(offsetof(UGA_GenericConsume_C, GESpecToApply) == 0x000A88, "Member 'UGA_GenericConsume_C::GESpecToApply' has a wrong offset!");
static_assert(offsetof(UGA_GenericConsume_C, GESpecAlreadyApplied) == 0x000A98, "Member 'UGA_GenericConsume_C::GESpecAlreadyApplied' has a wrong offset!");
static_assert(offsetof(UGA_GenericConsume_C, ForceFeedback) == 0x000AA0, "Member 'UGA_GenericConsume_C::ForceFeedback' has a wrong offset!");

}

