#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HeldObject_Explode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_HeldObject_Explode.GA_HeldObject_Explode_C.ExecuteUbergraph_GA_HeldObject_Explode
// 0x05B0 (0x05B0 - 0x0000)
struct GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F20[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0008(0x0018)()
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_2;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_3;                // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F21[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F22[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F23[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00B0(0x00B0)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F24[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F25[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_2; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F26[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F27[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4F28[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F29[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2A[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0218(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0248(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0258(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_1;     // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2B[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2C[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2D[0x6];                                     // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_3;               // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_4;                // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2E[0x3];                                     // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_5;                // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2F[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F30[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F31[0x3];                                     // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F32[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_4;                     // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F33[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_4;               // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_2;     // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F34[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue_1;               // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_2;                    // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F35[0x3];                                     // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_5;               // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F36[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_HeldObject_Explosive_C*            K2Node_DynamicCast_AsBGA_Held_Object_Explosive;    // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F37[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F38[0x3];                                     // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x04BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x04C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4F39[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x04D8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0500(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F3A[0x3];                                     // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_6;                // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_5;                     // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_7;                // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F3B[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_6;               // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_7;               // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue_2;               // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_2;            // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_8;               // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode) == 0x000008, "Wrong alignment on GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode");
static_assert(sizeof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode) == 0x0005B0, "Wrong size on GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, EntryPoint) == 0x000000, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_MakeEffectContext_ReturnValue) == 0x000008, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_1) == 0x00002C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Normal_ReturnValue) == 0x000038, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Normal_ReturnValue_1) == 0x000044, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetActorForwardVector_ReturnValue) == 0x000050, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_2) == 0x00005C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000068, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_VSize_ReturnValue) == 0x000074, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_3) == 0x000078, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000084, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_VSize_ReturnValue_1) == 0x000088, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue) == 0x00008C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000098, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue_1) == 0x00009C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000A8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_Event_EventData) == 0x0000B0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, Temp_int_Array_Index_Variable) == 0x000160, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000164, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000168, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00016C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000170, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetActivatingAbilityComponent_ReturnValue) == 0x000178, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetActivatingAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetActivatingAbilityComponent_ReturnValue_1) == 0x000180, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetActivatingAbilityComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetOwner_ReturnValue) == 0x000188, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetOwner_ReturnValue_1) == 0x000190, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000198, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetActivatingAbilityComponent_ReturnValue_2) == 0x0001A8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetActivatingAbilityComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, Temp_int_Loop_Counter_Variable) == 0x0001B0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetOwner_ReturnValue_2) == 0x0001B8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001C0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Add_IntInt_ReturnValue) == 0x0001CC, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, Temp_bool_Variable) == 0x0001D0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CreateDelegate_OutputDelegate) == 0x0001D4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_WaitTargetSelection_ReturnValue) == 0x0001E8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001F0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetPawn_ReturnValue) == 0x000200, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000208, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, Temp_struct_Variable) == 0x000218, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, Temp_struct_Variable_1) == 0x000240, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000248, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CustomEvent_TargetData) == 0x000258, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CustomEvent_ApplicationTag) == 0x000280, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Array_Get_Item) == 0x000288, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000290, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x00029C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002A8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0002B4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Normal_ReturnValue_2) == 0x0002C0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Normal_ReturnValue_3) == 0x0002CC, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Normal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x0002D8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue_2) == 0x0002E4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002F0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_ProjectVectorOnToPlane_ReturnValue_1) == 0x0002F4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_ProjectVectorOnToPlane_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_DegAcos_ReturnValue) == 0x000300, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Cross_VectorVector_ReturnValue) == 0x000304, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Less_FloatFloat_ReturnValue) == 0x000310, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_NegateVector_ReturnValue) == 0x000314, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000320, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_RotateAngleAxis_ReturnValue) == 0x000324, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_DegAcos_ReturnValue_1) == 0x000330, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_DegAcos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000338, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_bSuccess_1) == 0x000348, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000349, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x000350, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue_3) == 0x000358, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_4) == 0x000364, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000370, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_VSize_ReturnValue_2) == 0x00037C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_X) == 0x000380, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_Y) == 0x000384, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_Z) == 0x000388, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00038C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_MakeVector_ReturnValue) == 0x000390, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00039C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_5) == 0x0003A8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_AsFort_Pawn) == 0x0003B8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_bSuccess_2) == 0x0003C0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Add_VectorVector_ReturnValue) == 0x0003C4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0003D0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0003E0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0003E4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0003F0, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000400, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Normal_ReturnValue_4) == 0x000404, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Normal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BooleanOR_ReturnValue) == 0x000410, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue_4) == 0x000414, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_ProjectVectorOnToPlane_ReturnValue_2) == 0x000420, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_ProjectVectorOnToPlane_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000430, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000438, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x000444, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_NegateVector_ReturnValue_1) == 0x000448, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_NegateVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_DegAcos_ReturnValue_2) == 0x000454, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_DegAcos_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000458, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000464, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_SelectVector_ReturnValue_5) == 0x000468, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_SelectVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_AsBGA_Held_Object_Explosive) == 0x000478, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_AsBGA_Held_Object_Explosive' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_bSuccess_3) == 0x000480, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000484, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_X_1) == 0x000490, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_Y_1) == 0x000494, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BreakVector_Z_1) == 0x000498, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_MakeVector_ReturnValue_1) == 0x00049C, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Array_Length_ReturnValue) == 0x0004A8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_Select_Default) == 0x0004AC, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_Less_IntInt_ReturnValue) == 0x0004B8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x0004BC, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004C4, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CustomEvent_TargetData_1) == 0x0004D8, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_CustomEvent_ApplicationTag_1) == 0x000500, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000508, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, K2Node_DynamicCast_bSuccess_4) == 0x000510, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode, CallFunc_GetVelocity_ReturnValue_6) == 0x000514, "Member 'GA_HeldObject_Explode_C_ExecuteUbergraph_GA_HeldObject_Explode::CallFunc_GetVelocity_ReturnValue_6' has a wrong offset!");
