#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_FloorJumpPad

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.ExecuteUbergraph_GA_Trap_FloorJumpPad
// 0x0308 (0x0308 - 0x0000)
struct GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6584[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0020(0x0010)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6585[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6586[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetReloadBeginGameplayCueTag_ReturnValue; // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6587[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6588[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6589[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658A[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataCountFromTargetData_ReturnValue;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTrapLevel_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x00B0(0x00B0)()
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActivateTrapGameplayCueTag_ReturnValue; // 0x0164(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658B[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x017C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetDelayBeginGameplayCueTag_ReturnValue;  // 0x0184(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658C[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658D[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x01A0(0x0028)()
	class AFortPlayerPawn*                        K2Node_CustomEvent_Player;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658E[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x01D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658F[0x2];                                     // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6590[0x1];                                     // 0x020B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6591[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0220(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0230(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0270(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6592[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6593[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6594[0x1];                                     // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6595[0x3];                                     // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad) == 0x000308, "Wrong size on GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, EntryPoint) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000010, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilityLevel_ReturnValue) == 0x000018, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000020, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_K2_CommitAbility_ReturnValue) == 0x000038, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsBuilding_Trap) == 0x000040, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetReloadBeginGameplayCueTag_ReturnValue) == 0x00004C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetReloadBeginGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Get_Item) == 0x000060, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000070, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsDedicatedServer_ReturnValue) == 0x00007A, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000080, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsDBNO_ReturnValue) == 0x000088, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000090, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_AsBuilding_Trap_1) == 0x000098, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_AsBuilding_Trap_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDataCountFromTargetData_ReturnValue) == 0x0000A4, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDataCountFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetTrapLevel_ReturnValue) == 0x0000A8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetTrapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000AC, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_MakeStruct_GameplayEventData) == 0x0000B0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDamageDelay_ReturnValue) == 0x000160, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetActivateTrapGameplayCueTag_ReturnValue) == 0x000164, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetActivateTrapGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000170, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetFireDelay_ReturnValue) == 0x000178, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x00017C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetDelayBeginGameplayCueTag_ReturnValue) == 0x000184, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetDelayBeginGameplayCueTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_WaitTargetSelection_ReturnValue) == 0x000190, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_struct_Variable) == 0x0001A0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_Player) == 0x0001C8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_int_Variable) == 0x0001D0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0001D8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001E8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Length_ReturnValue_1) == 0x0001F8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue_1) == 0x0001FC, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Greater_IntInt_ReturnValue) == 0x0001FD, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000200, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_DoesSocketExist_ReturnValue) == 0x000208, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_DoesSocketExist_ReturnValue_1) == 0x000209, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_DoesSocketExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00020A, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Add_IntInt_ReturnValue_1) == 0x00020C, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, Temp_struct_Variable_1) == 0x000210, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Array_Add_ReturnValue) == 0x000218, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000220, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_TargetData) == 0x000230, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_ApplicationTag) == 0x000258, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CreateDelegate_OutputDelegate) == 0x000260, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_TargetData_1) == 0x000270, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CustomEvent_ApplicationTag_1) == 0x000298, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetController_ReturnValue) == 0x0002A0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002A8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002B8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_GetVehicleUInterface_ReturnValue) == 0x0002C0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002D0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0002D8, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BooleanAND_ReturnValue) == 0x0002E0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsInVehicle_ReturnValue) == 0x0002E1, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_IsValid_ReturnValue_2) == 0x0002E2, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_MakeVector_ReturnValue) == 0x0002E4, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, CallFunc_BooleanAND_ReturnValue_1) == 0x0002F0, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002F4, "Member 'GA_Trap_FloorJumpPad_C_ExecuteUbergraph_GA_Trap_FloorJumpPad::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.PlayPlayerFX
// 0x0008 (0x0008 - 0x0000)
struct GA_Trap_FloorJumpPad_C_PlayPlayerFX final
{
public:
	class AFortPlayerPawn*                        Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_PlayPlayerFX) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_PlayPlayerFX");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_PlayPlayerFX) == 0x000008, "Wrong size on GA_Trap_FloorJumpPad_C_PlayPlayerFX");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_PlayPlayerFX, Player) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_PlayPlayerFX::Player' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.Targeted_E91C59AB43D826926CE5CEAA22E84570
// 0x0030 (0x0030 - 0x0000)
struct GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Param_TargetData;                                  // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570) == 0x000030, "Wrong size on GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570, Param_TargetData) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570::Param_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570, ApplicationTag) == 0x000028, "Member 'GA_Trap_FloorJumpPad_C_Targeted_E91C59AB43D826926CE5CEAA22E84570::ApplicationTag' has a wrong offset!");

// Function GA_Trap_FloorJumpPad.GA_Trap_FloorJumpPad_C.Cancelled_E91C59AB43D826926CE5CEAA22E84570
// 0x0030 (0x0030 - 0x0000)
struct GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Param_TargetData;                                  // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570) == 0x000008, "Wrong alignment on GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570");
static_assert(sizeof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570) == 0x000030, "Wrong size on GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570, Param_TargetData) == 0x000000, "Member 'GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570::Param_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570, ApplicationTag) == 0x000028, "Member 'GA_Trap_FloorJumpPad_C_Cancelled_E91C59AB43D826926CE5CEAA22E84570::ApplicationTag' has a wrong offset!");

}

