#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurfaceChange_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_SurfaceChange_Vehicle.GAB_SurfaceChange_Vehicle_C
// 0x0150 (0x0BC8 - 0x0A78)
class UGAB_SurfaceChange_Vehicle_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Debug;                                             // 0x0A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559F[0x7];                                     // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         RemovalDelay;                                      // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_SurfaceChange_Ice;                              // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         BaseVerticalBounceVelocity;                        // 0x0AB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BaseLateralBounceVelocity;                         // 0x0AD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LavaBounceMultiplier;                              // 0x0AF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A0[0x4];                                     // 0x0AF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BounceMultiplierStepAmount;                        // 0x0AF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxBounceMultiplier;                               // 0x0B18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RandomConeAngle;                                   // 0x0B38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ReplicatedRandomAngle;                             // 0x0B58(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A1[0x4];                                     // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FacingAngleVelocityComponent;                      // 0x0B60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  IceTags;                                           // 0x0B80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  LavaTags;                                          // 0x0BA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           LavaBounceCue;                                     // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_SurfaceChange_Vehicle(int32 EntryPoint);
	void MulticastLavaBounce(class UObject* AvatarActor);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void RemoveGameplayEffects();
	void HotfixableGEApplication(const struct FScalableFloat& Input, class UClass* GameplayEffectAppliedOnTrue, class UClass* GameplayEffectAppliedOnFalse);
	void LavaBounce(class UObject* AvatarActor);
	void SurfaceCleanup(EPhysicalSurface SurfaceType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SurfaceChange_Vehicle_C">();
	}
	static class UGAB_SurfaceChange_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SurfaceChange_Vehicle_C>();
	}
};
static_assert(alignof(UGAB_SurfaceChange_Vehicle_C) == 0x000008, "Wrong alignment on UGAB_SurfaceChange_Vehicle_C");
static_assert(sizeof(UGAB_SurfaceChange_Vehicle_C) == 0x000BC8, "Wrong size on UGAB_SurfaceChange_Vehicle_C");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, UberGraphFrame) == 0x000A78, "Member 'UGAB_SurfaceChange_Vehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, Debug) == 0x000A80, "Member 'UGAB_SurfaceChange_Vehicle_C::Debug' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, RemovalDelay) == 0x000A88, "Member 'UGAB_SurfaceChange_Vehicle_C::RemovalDelay' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, GE_SurfaceChange_Ice) == 0x000AA8, "Member 'UGAB_SurfaceChange_Vehicle_C::GE_SurfaceChange_Ice' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, BaseVerticalBounceVelocity) == 0x000AB0, "Member 'UGAB_SurfaceChange_Vehicle_C::BaseVerticalBounceVelocity' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, BaseLateralBounceVelocity) == 0x000AD0, "Member 'UGAB_SurfaceChange_Vehicle_C::BaseLateralBounceVelocity' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, LavaBounceMultiplier) == 0x000AF0, "Member 'UGAB_SurfaceChange_Vehicle_C::LavaBounceMultiplier' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, BounceMultiplierStepAmount) == 0x000AF8, "Member 'UGAB_SurfaceChange_Vehicle_C::BounceMultiplierStepAmount' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, MaxBounceMultiplier) == 0x000B18, "Member 'UGAB_SurfaceChange_Vehicle_C::MaxBounceMultiplier' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, RandomConeAngle) == 0x000B38, "Member 'UGAB_SurfaceChange_Vehicle_C::RandomConeAngle' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, ReplicatedRandomAngle) == 0x000B58, "Member 'UGAB_SurfaceChange_Vehicle_C::ReplicatedRandomAngle' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, FacingAngleVelocityComponent) == 0x000B60, "Member 'UGAB_SurfaceChange_Vehicle_C::FacingAngleVelocityComponent' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, IceTags) == 0x000B80, "Member 'UGAB_SurfaceChange_Vehicle_C::IceTags' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, LavaTags) == 0x000BA0, "Member 'UGAB_SurfaceChange_Vehicle_C::LavaTags' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_Vehicle_C, LavaBounceCue) == 0x000BC0, "Member 'UGAB_SurfaceChange_Vehicle_C::LavaBounceCue' has a wrong offset!");

}

