#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_CarryPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_CarryPlayer.GAB_CarryPlayer_C
// 0x0048 (0x0AF0 - 0x0AA8)
class UGAB_CarryPlayer_C final : public UFortGameplayAbility_CarryPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PickedUpPawn;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DBNOCarryHolster;                                  // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedPickup;                                  // 0x0AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61B6[0x3];                                     // 0x0AC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalDistanceTraveled;                             // 0x0ACC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PickupLocation;                                    // 0x0AD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CarryLongDistanceThreshold;                        // 0x0ADC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         NewVar_0;                                          // 0x0AE0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_CarryPlayer(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_C4440F1640E9A8D79E44FD8C23525824();
	void OnBlendOut_C4440F1640E9A8D79E44FD8C23525824();
	void OnInterrupted_C4440F1640E9A8D79E44FD8C23525824();
	void OnCancelled_C4440F1640E9A8D79E44FD8C23525824();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_CarryPlayer_C">();
	}
	static class UGAB_CarryPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_CarryPlayer_C>();
	}
};
static_assert(alignof(UGAB_CarryPlayer_C) == 0x000008, "Wrong alignment on UGAB_CarryPlayer_C");
static_assert(sizeof(UGAB_CarryPlayer_C) == 0x000AF0, "Wrong size on UGAB_CarryPlayer_C");
static_assert(offsetof(UGAB_CarryPlayer_C, UberGraphFrame) == 0x000AA8, "Member 'UGAB_CarryPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, PlayerPawn) == 0x000AB0, "Member 'UGAB_CarryPlayer_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, PickedUpPawn) == 0x000AB8, "Member 'UGAB_CarryPlayer_C::PickedUpPawn' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, DBNOCarryHolster) == 0x000AC0, "Member 'UGAB_CarryPlayer_C::DBNOCarryHolster' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, bCompletedPickup) == 0x000AC8, "Member 'UGAB_CarryPlayer_C::bCompletedPickup' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, TotalDistanceTraveled) == 0x000ACC, "Member 'UGAB_CarryPlayer_C::TotalDistanceTraveled' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, PickupLocation) == 0x000AD0, "Member 'UGAB_CarryPlayer_C::PickupLocation' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, CarryLongDistanceThreshold) == 0x000ADC, "Member 'UGAB_CarryPlayer_C::CarryLongDistanceThreshold' has a wrong offset!");
static_assert(offsetof(UGAB_CarryPlayer_C, NewVar_0) == 0x000AE0, "Member 'UGAB_CarryPlayer_C::NewVar_0' has a wrong offset!");

}

