#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_InterrogatePlayer_Search

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C
// 0x0110 (0x0BB8 - 0x0AA8)
class UGAB_InterrogatePlayer_Search_C final : public UFortGameplayAbility_CarryPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        InterrogatedPlayer;                                // 0x0AC0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_Search;                                       // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InterrogateHolster;                                // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTierGroupName;                                 // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDefinition;                                    // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberToSpawn;                                     // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LootSpawnOffset;                                   // 0x0AEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxDropsInstance;                                  // 0x0AF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumDropsInstance;                                  // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6152[0x4];                                     // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         KeycardDropBias;                                   // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortWorldItemDefinition*>       KeycardItemDefinitions;                            // 0x0B40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           T_Keycard_Yacht;                                   // 0x0B50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Keycard_OilRig;                                  // 0x0B58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Keycard_SharkIsland;                             // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Keycard_HQ;                                      // 0x0B68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Keycard_MountainBase;                            // 0x0B70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Interrogation;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_ReticleHUD;                                      // 0x0B80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_NPC_Mang;                                        // 0x0BA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Cooldown;                                       // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PickedUp;                                       // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_InterrogatePlayer_Search(int32 EntryPoint);
	void OnDied_Event_1(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDied_Event_0(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Added_9291D75D4A0949E1C5B7E49C1FD11F8B();
	void Triggered_6BBDC9B445D4280492A25E8E5EA7A53D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_6BBDC9B445D4280492A25E8E5EA7A53D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void InitAbility();
	void EndAbilityCleanup();
	void ToggleReticleVisibility(bool Hide);
	void DropLoot();
	void GetKeycardToDrop(bool* HasKeycard, class UFortWorldItemDefinition** Output);
	void DropKeycard();
	void ApplyGameplayEffectToHenchman(class UClass* GameplayEffect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_InterrogatePlayer_Search_C">();
	}
	static class UGAB_InterrogatePlayer_Search_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_InterrogatePlayer_Search_C>();
	}
};
static_assert(alignof(UGAB_InterrogatePlayer_Search_C) == 0x000008, "Wrong alignment on UGAB_InterrogatePlayer_Search_C");
static_assert(sizeof(UGAB_InterrogatePlayer_Search_C) == 0x000BB8, "Wrong size on UGAB_InterrogatePlayer_Search_C");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, UberGraphFrame) == 0x000AA8, "Member 'UGAB_InterrogatePlayer_Search_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, PlayerPawn) == 0x000AB0, "Member 'UGAB_InterrogatePlayer_Search_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, PlayerController) == 0x000AB8, "Member 'UGAB_InterrogatePlayer_Search_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, InterrogatedPlayer) == 0x000AC0, "Member 'UGAB_InterrogatePlayer_Search_C::InterrogatedPlayer' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, Anim_Search) == 0x000AC8, "Member 'UGAB_InterrogatePlayer_Search_C::Anim_Search' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, InterrogateHolster) == 0x000AD0, "Member 'UGAB_InterrogatePlayer_Search_C::InterrogateHolster' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, LootTierGroupName) == 0x000AD8, "Member 'UGAB_InterrogatePlayer_Search_C::LootTierGroupName' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, ItemDefinition) == 0x000AE0, "Member 'UGAB_InterrogatePlayer_Search_C::ItemDefinition' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, NumberToSpawn) == 0x000AE8, "Member 'UGAB_InterrogatePlayer_Search_C::NumberToSpawn' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, LootSpawnOffset) == 0x000AEC, "Member 'UGAB_InterrogatePlayer_Search_C::LootSpawnOffset' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, MaxDropsInstance) == 0x000AF8, "Member 'UGAB_InterrogatePlayer_Search_C::MaxDropsInstance' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, NumDropsInstance) == 0x000B18, "Member 'UGAB_InterrogatePlayer_Search_C::NumDropsInstance' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, KeycardDropBias) == 0x000B20, "Member 'UGAB_InterrogatePlayer_Search_C::KeycardDropBias' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, KeycardItemDefinitions) == 0x000B40, "Member 'UGAB_InterrogatePlayer_Search_C::KeycardItemDefinitions' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_Keycard_Yacht) == 0x000B50, "Member 'UGAB_InterrogatePlayer_Search_C::T_Keycard_Yacht' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_Keycard_OilRig) == 0x000B58, "Member 'UGAB_InterrogatePlayer_Search_C::T_Keycard_OilRig' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_Keycard_SharkIsland) == 0x000B60, "Member 'UGAB_InterrogatePlayer_Search_C::T_Keycard_SharkIsland' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_Keycard_HQ) == 0x000B68, "Member 'UGAB_InterrogatePlayer_Search_C::T_Keycard_HQ' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_Keycard_MountainBase) == 0x000B70, "Member 'UGAB_InterrogatePlayer_Search_C::T_Keycard_MountainBase' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, Timer_Interrogation) == 0x000B78, "Member 'UGAB_InterrogatePlayer_Search_C::Timer_Interrogation' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_ReticleHUD) == 0x000B80, "Member 'UGAB_InterrogatePlayer_Search_C::T_ReticleHUD' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, T_NPC_Mang) == 0x000BA0, "Member 'UGAB_InterrogatePlayer_Search_C::T_NPC_Mang' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, GE_Cooldown) == 0x000BA8, "Member 'UGAB_InterrogatePlayer_Search_C::GE_Cooldown' has a wrong offset!");
static_assert(offsetof(UGAB_InterrogatePlayer_Search_C, GE_PickedUp) == 0x000BB0, "Member 'UGAB_InterrogatePlayer_Search_C::GE_PickedUp' has a wrong offset!");

}

