#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_ApplyFullBodyHit_MANG

#include "Basic.hpp"


namespace SDK::Params
{

// Function GAB_ApplyFullBodyHit_MANG.GAB_ApplyFullBodyHit_MANG_C.PickFullBodyHitMontageSection
// 0x0020 (0x0020 - 0x0000)
struct GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection final
{
public:
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MangPlayerPawn_Parent_C*            K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_810F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection) == 0x000008, "Wrong alignment on GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection");
static_assert(sizeof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection) == 0x000020, "Wrong size on GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection");
static_assert(offsetof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection, CallFunc_GetActivatingPawn_ReturnValue) == 0x000000, "Member 'GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection, K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent) == 0x000008, "Member 'GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection::K2Node_DynamicCast_AsBP_Mang_Player_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection, CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage) == 0x000018, "Member 'GAB_ApplyFullBodyHit_MANG_C_PickFullBodyHitMontageSection::CallFunc_GetCurrentFullbodyHitReactionMontage_CurrentMontage' has a wrong offset!");

}

