#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_StormDespawn_MANG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_StormDespawn_MANG.GAB_StormDespawn_MANG_C
// 0x0018 (0x0AA8 - 0x0A90)
class UGAB_StormDespawn_MANG_C final : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_StormDespawn_MANG_C;            // 0x0A90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DespawnMinDelay;                                   // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DespawnMaxDelay;                                   // 0x0A9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChosenRandomDespawnTime;                           // 0x0AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_StormDespawn_MANG(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void Triggered_6B588AEA442B568EE2103CA25A3B31EA(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6B588AEA442B568EE2103CA25A3B31EA(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_6B588AEA442B568EE2103CA25A3B31EA(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_StormDespawn_MANG_C">();
	}
	static class UGAB_StormDespawn_MANG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_StormDespawn_MANG_C>();
	}
};
static_assert(alignof(UGAB_StormDespawn_MANG_C) == 0x000008, "Wrong alignment on UGAB_StormDespawn_MANG_C");
static_assert(sizeof(UGAB_StormDespawn_MANG_C) == 0x000AA8, "Wrong size on UGAB_StormDespawn_MANG_C");
static_assert(offsetof(UGAB_StormDespawn_MANG_C, UberGraphFrame_GAB_StormDespawn_MANG_C) == 0x000A90, "Member 'UGAB_StormDespawn_MANG_C::UberGraphFrame_GAB_StormDespawn_MANG_C' has a wrong offset!");
static_assert(offsetof(UGAB_StormDespawn_MANG_C, DespawnMinDelay) == 0x000A98, "Member 'UGAB_StormDespawn_MANG_C::DespawnMinDelay' has a wrong offset!");
static_assert(offsetof(UGAB_StormDespawn_MANG_C, DespawnMaxDelay) == 0x000A9C, "Member 'UGAB_StormDespawn_MANG_C::DespawnMaxDelay' has a wrong offset!");
static_assert(offsetof(UGAB_StormDespawn_MANG_C, ChosenRandomDespawnTime) == 0x000AA0, "Member 'UGAB_StormDespawn_MANG_C::ChosenRandomDespawnTime' has a wrong offset!");

}

