#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Abilities_Death_FadeCapsule_StW

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Abilities_Death_FadeCapsule_StW.GC_Abilities_Death_FadeCapsule_StW_C.ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW
// 0x0110 (0x0110 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7238[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7239[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_723A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0028(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_723B[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_723C[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_723D[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW) == 0x000110, "Wrong size on GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, EntryPoint) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, Temp_int_Array_Index_Variable) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_Event_MyTarget) == 0x000018, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_Event_EventType) == 0x000020, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_Event_Parameters) == 0x000028, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000E8, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_Lerp_ReturnValue) == 0x0000F4, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_Array_Get_Item) == 0x000100, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_ExecuteUbergraph_GC_Abilities_Death_FadeCapsule_StW::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GC_Abilities_Death_FadeCapsule_StW.GC_Abilities_Death_FadeCapsule_StW_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_723E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GC_Abilities_Death_FadeCapsule_StW.GC_Abilities_Death_FadeCapsule_StW_C.SkeletalMeshSetup
// 0x00B8 (0x00B8 - 0x0000)
struct GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup final
{
public:
	class AFortPlayerPawn*                        FortPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_723F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7240[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7241[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_3; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7242[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_4; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7243[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_5; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7244[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USkeletalMeshComponent*           Temp_object_Variable;                              // 0x0068(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           Temp_object_Variable_1;                            // 0x0070(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           Temp_object_Variable_2;                            // 0x0078(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           Temp_object_Variable_3;                            // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           Temp_object_Variable_4;                            // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7245[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USkeletalMeshComponent*           Temp_object_Variable_5;                            // 0x00A8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup) == 0x000008, "Wrong alignment on GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup");
static_assert(sizeof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup) == 0x0000B8, "Wrong size on GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, FortPawn) == 0x000000, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::FortPawn' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000008, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue_1) == 0x000018, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue_2) == 0x000028, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue_3) == 0x000038, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue_4) == 0x000048, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_GetSkeletalMeshForPartType_ReturnValue_5) == 0x000058, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_GetSkeletalMeshForPartType_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_IsValid_ReturnValue_5) == 0x000060, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable) == 0x000068, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable_1) == 0x000070, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable_2) == 0x000078, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable_3) == 0x000080, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable_4) == 0x000090, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue_2) == 0x000098, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue_3) == 0x00009C, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue_4) == 0x0000A0, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, Temp_object_Variable_5) == 0x0000A8, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup, CallFunc_Array_Add_ReturnValue_5) == 0x0000B0, "Member 'GC_Abilities_Death_FadeCapsule_StW_C_SkeletalMeshSetup::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

}

