#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_Feedback_ExplosionSmall

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Athena_Feedback_ExplosionSmall.GC_Athena_Feedback_ExplosionSmall_C.OnBurst
// 0x01B0 (0x01B0 - 0x0000)
struct GC_Athena_Feedback_ExplosionSmall_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0120(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0140(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst) == 0x000008, "Wrong alignment on GC_Athena_Feedback_ExplosionSmall_C_OnBurst");
static_assert(sizeof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst) == 0x0001B0, "Wrong size on GC_Athena_Feedback_ExplosionSmall_C_OnBurst");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F0, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000F4, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F8, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000110, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000118, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000120, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000140, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000160, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x00016C, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000178, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000180, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000188, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000190, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000198, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00019C, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001A0, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Athena_Feedback_ExplosionSmall_C_OnBurst, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A8, "Member 'GC_Athena_Feedback_ExplosionSmall_C_OnBurst::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

