#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_Shotgun_StartCharge

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCL_Shotgun_StartCharge.GCL_Shotgun_StartCharge_C.ExecuteUbergraph_GCL_Shotgun_StartCharge
// 0x0208 (0x0208 - 0x0000)
struct GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7096[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7097[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0110(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargePercent_ReturnValue;             // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge) == 0x000008, "Wrong alignment on GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge");
static_assert(sizeof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge) == 0x000208, "Wrong size on GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, EntryPoint) == 0x000000, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_MyTarget_1) == 0x000008, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_ParticleComponents_1) == 0x0000C8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_AudioComponents_1) == 0x0000D8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_BurstCameraShakeInstance_1) == 0x0000E8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_BurstDecalInstance_1) == 0x0000F0, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000F8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_MyTarget) == 0x000108, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_Parameters) == 0x000110, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_ParticleComponents) == 0x0001C8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_AudioComponents) == 0x0001D8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_BurstCameraShakeInstance) == 0x0001E8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_BurstDecalInstance) == 0x0001F0, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, K2Node_Event_DeltaSeconds) == 0x0001F8, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, CallFunc_GetChargePercent_ReturnValue) == 0x0001FC, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::CallFunc_GetChargePercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge, CallFunc_FInterpTo_ReturnValue) == 0x000200, "Member 'GCL_Shotgun_StartCharge_C_ExecuteUbergraph_GCL_Shotgun_StartCharge::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function GCL_Shotgun_StartCharge.GCL_Shotgun_StartCharge_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCL_Shotgun_StartCharge_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Shotgun_StartCharge_C_OnRemoval) == 0x000008, "Wrong alignment on GCL_Shotgun_StartCharge_C_OnRemoval");
static_assert(sizeof(GCL_Shotgun_StartCharge_C_OnRemoval) == 0x0000F0, "Wrong size on GCL_Shotgun_StartCharge_C_OnRemoval");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, Parameters) == 0x000008, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCL_Shotgun_StartCharge_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCL_Shotgun_StartCharge.GCL_Shotgun_StartCharge_C.OnApplication
// 0x00F0 (0x00F0 - 0x0000)
struct GCL_Shotgun_StartCharge_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Shotgun_StartCharge_C_OnApplication) == 0x000008, "Wrong alignment on GCL_Shotgun_StartCharge_C_OnApplication");
static_assert(sizeof(GCL_Shotgun_StartCharge_C_OnApplication) == 0x0000F0, "Wrong size on GCL_Shotgun_StartCharge_C_OnApplication");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, MyTarget) == 0x000000, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, Parameters) == 0x000008, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, ParticleComponents) == 0x0000C0, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, AudioComponents) == 0x0000D0, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_OnApplication, BurstDecalInstance) == 0x0000E8, "Member 'GCL_Shotgun_StartCharge_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCL_Shotgun_StartCharge.GCL_Shotgun_StartCharge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCL_Shotgun_StartCharge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Shotgun_StartCharge_C_ReceiveTick) == 0x000004, "Wrong alignment on GCL_Shotgun_StartCharge_C_ReceiveTick");
static_assert(sizeof(GCL_Shotgun_StartCharge_C_ReceiveTick) == 0x000004, "Wrong size on GCL_Shotgun_StartCharge_C_ReceiveTick");
static_assert(offsetof(GCL_Shotgun_StartCharge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCL_Shotgun_StartCharge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

