#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_Cornfield_Movement

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCL_Cornfield_Movement.GCL_Cornfield_Movement_C.ExecuteUbergraph_GCL_Cornfield_Movement
// 0x0040 (0x0040 - 0x0000)
struct GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72FB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72FC[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72FD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement) == 0x000008, "Wrong alignment on GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement");
static_assert(sizeof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement) == 0x000040, "Wrong size on GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, EntryPoint) == 0x000000, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, Temp_bool_Variable) == 0x000004, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, Temp_object_Variable) == 0x000008, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, Temp_object_Variable_1) == 0x000010, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000018, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, CallFunc_IsLocallyControlled_ReturnValue) == 0x000030, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement, K2Node_Select_Default) == 0x000038, "Member 'GCL_Cornfield_Movement_C_ExecuteUbergraph_GCL_Cornfield_Movement::K2Node_Select_Default' has a wrong offset!");

// Function GCL_Cornfield_Movement.GCL_Cornfield_Movement_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GCL_Cornfield_Movement_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72FE[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_72FF[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7300[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Cornfield_Movement_C_OnRemove) == 0x000008, "Wrong alignment on GCL_Cornfield_Movement_C_OnRemove");
static_assert(sizeof(GCL_Cornfield_Movement_C_OnRemove) == 0x000100, "Wrong size on GCL_Cornfield_Movement_C_OnRemove");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, MyTarget) == 0x000000, "Member 'GCL_Cornfield_Movement_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, Parameters) == 0x000008, "Member 'GCL_Cornfield_Movement_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GCL_Cornfield_Movement_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'GCL_Cornfield_Movement_C_OnRemove::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000D8, "Member 'GCL_Cornfield_Movement_C_OnRemove::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GCL_Cornfield_Movement_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'GCL_Cornfield_Movement_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000E8, "Member 'GCL_Cornfield_Movement_C_OnRemove::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnRemove, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'GCL_Cornfield_Movement_C_OnRemove::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GCL_Cornfield_Movement.GCL_Cornfield_Movement_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GCL_Cornfield_Movement_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7301[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PlayerPawn;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7302[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_Cornfield_Movement_C_OnActive) == 0x000008, "Wrong alignment on GCL_Cornfield_Movement_C_OnActive");
static_assert(sizeof(GCL_Cornfield_Movement_C_OnActive) == 0x0000F8, "Wrong size on GCL_Cornfield_Movement_C_OnActive");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, MyTarget) == 0x000000, "Member 'GCL_Cornfield_Movement_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, Parameters) == 0x000008, "Member 'GCL_Cornfield_Movement_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GCL_Cornfield_Movement_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, PlayerPawn) == 0x0000C8, "Member 'GCL_Cornfield_Movement_C_OnActive::PlayerPawn' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'GCL_Cornfield_Movement_C_OnActive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000E0, "Member 'GCL_Cornfield_Movement_C_OnActive::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GCL_Cornfield_Movement_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_OnActive, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000EC, "Member 'GCL_Cornfield_Movement_C_OnActive::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function GCL_Cornfield_Movement.GCL_Cornfield_Movement_C.WhileActive
// 0x00D8 (0x00D8 - 0x0000)
struct GCL_Cornfield_Movement_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7303[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCL_Cornfield_Movement_C_WhileActive) == 0x000008, "Wrong alignment on GCL_Cornfield_Movement_C_WhileActive");
static_assert(sizeof(GCL_Cornfield_Movement_C_WhileActive) == 0x0000D8, "Wrong size on GCL_Cornfield_Movement_C_WhileActive");
static_assert(offsetof(GCL_Cornfield_Movement_C_WhileActive, MyTarget) == 0x000000, "Member 'GCL_Cornfield_Movement_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_WhileActive, Parameters) == 0x000008, "Member 'GCL_Cornfield_Movement_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_WhileActive, ReturnValue) == 0x0000C0, "Member 'GCL_Cornfield_Movement_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_WhileActive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000C8, "Member 'GCL_Cornfield_Movement_C_WhileActive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCL_Cornfield_Movement_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GCL_Cornfield_Movement_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

