#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Loop_SpookyMist

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.ExecuteUbergraph_GCN_Loop_SpookyMist
// 0x03E0 (0x03E0 - 0x0000)
struct GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72E3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0038(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0118(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E4[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E5[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0228(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_1;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E6[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E7[0x2];                                     // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Velocity;                       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_72E8[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_2;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E9[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue;           // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72EA[0x2];                                     // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72EB[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue_1;         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72EC[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72ED[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72EE[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_3;                         // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_4;                         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72EF[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0330(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_5;                         // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F0[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_6;                         // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F1[0x1];                                     // 0x035B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F2[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F3[0x1];                                     // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F4[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F5[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_5;           // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_7;                         // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_8;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F6[0x2];                                     // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_6;           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBroadcastClient_ReturnValue;         // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist) == 0x000008, "Wrong alignment on GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist");
static_assert(sizeof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist) == 0x0003E0, "Wrong size on GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, EntryPoint) == 0x000000, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_MyTarget_1) == 0x000030, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_Parameters_1) == 0x000038, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_ParticleComponents_1) == 0x0000F0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_AudioComponents_1) == 0x000100, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_MyTarget) == 0x000110, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_Parameters) == 0x000118, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_ParticleComponents) == 0x0001D0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_AudioComponents) == 0x0001E0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_BurstCameraShakeInstance) == 0x0001F0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_BurstDecalInstance) == 0x0001F8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item) == 0x000200, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000208, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000218, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000228, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_1) == 0x000238, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Less_IntInt_ReturnValue) == 0x000244, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_Event_DeltaSeconds) == 0x000248, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsValid_ReturnValue) == 0x00024C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_OnSameTeam_ReturnValue) == 0x00024D, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate) == 0x000250, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000260, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000268, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000270, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CustomEvent_Velocity) == 0x000274, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_MapRangeClamped_ReturnValue) == 0x000278, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00027C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_FInterpTo_ReturnValue) == 0x000280, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate_1) == 0x000284, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_2) == 0x000298, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsValid_ReturnValue_1) == 0x0002A0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002B4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002C4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002D4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetIsPlayingReplay_ReturnValue) == 0x0002D5, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetIsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002D8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_BooleanOR_ReturnValue) == 0x0002E8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002F0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetIsPlayingReplay_ReturnValue_1) == 0x0002F8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetIsPlayingReplay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x0002FC, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000300, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000304, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000308, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_3) == 0x000310, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_4) == 0x000318, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue) == 0x000320, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000324, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000328, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000330, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_5) == 0x000338, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Length_ReturnValue_1) == 0x000340, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Less_IntInt_ReturnValue_1) == 0x000344, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_6) == 0x000348, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Length_ReturnValue_2) == 0x000350, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Length_ReturnValue_3) == 0x000354, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Less_IntInt_ReturnValue_2) == 0x000358, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Greater_IntInt_ReturnValue) == 0x000359, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsValid_ReturnValue_2) == 0x00035A, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetVelocity_ReturnValue) == 0x00035C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000368, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_VSize_ReturnValue) == 0x00036C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Not_PreBool_ReturnValue) == 0x000370, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000371, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000372, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x000374, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsInVehicle_ReturnValue) == 0x000378, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00037C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_BooleanOR_ReturnValue_1) == 0x000380, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_BooleanOR_ReturnValue_2) == 0x000381, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x000384, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_5) == 0x000388, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00038C, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_7) == 0x000390, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Array_Get_Item_8) == 0x000398, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetScalarParameterValue_ReturnValue) == 0x0003A0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x0003A4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003A5, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Conv_BoolToFloat_ReturnValue_6) == 0x0003A8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Conv_BoolToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0003AC, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0003B0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003B4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003B8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0003BC, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0003C0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_FClamp_ReturnValue) == 0x0003C4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_FInterpTo_ReturnValue_1) == 0x0003C8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0003CC, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0003D0, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x0003D4, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_FClamp_ReturnValue_1) == 0x0003D8, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_GetIsBroadcastClient_ReturnValue) == 0x0003DC, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_GetIsBroadcastClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist, CallFunc_BooleanOR_ReturnValue_3) == 0x0003DD, "Member 'GCN_Loop_SpookyMist_C_ExecuteUbergraph_GCN_Loop_SpookyMist::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.Audio Tick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Loop_SpookyMist_C_Audio_Tick final
{
public:
	float                                         Velocity;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_Audio_Tick) == 0x000004, "Wrong alignment on GCN_Loop_SpookyMist_C_Audio_Tick");
static_assert(sizeof(GCN_Loop_SpookyMist_C_Audio_Tick) == 0x000004, "Wrong size on GCN_Loop_SpookyMist_C_Audio_Tick");
static_assert(offsetof(GCN_Loop_SpookyMist_C_Audio_Tick, Velocity) == 0x000000, "Member 'GCN_Loop_SpookyMist_C_Audio_Tick::Velocity' has a wrong offset!");

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Loop_SpookyMist_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_Loop_SpookyMist_C_ReceiveTick");
static_assert(sizeof(GCN_Loop_SpookyMist_C_ReceiveTick) == 0x000004, "Wrong size on GCN_Loop_SpookyMist_C_ReceiveTick");
static_assert(offsetof(GCN_Loop_SpookyMist_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_Loop_SpookyMist_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCN_Loop_SpookyMist_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Loop_SpookyMist_C_OnRemoval");
static_assert(sizeof(GCN_Loop_SpookyMist_C_OnRemoval) == 0x0000F0, "Wrong size on GCN_Loop_SpookyMist_C_OnRemoval");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Loop_SpookyMist_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCN_Loop_SpookyMist_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCN_Loop_SpookyMist_C_OnLoopingStart");
static_assert(sizeof(GCN_Loop_SpookyMist_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCN_Loop_SpookyMist_C_OnLoopingStart");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCN_Loop_SpookyMist_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCN_Loop_SpookyMist_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCN_Loop_SpookyMist_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Loop_SpookyMist_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCN_Loop_SpookyMist_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C.GetSkeletalMeshes
// 0x0040 (0x0040 - 0x0000)
struct GCN_Loop_SpookyMist_C_GetSkeletalMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72F8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72F9[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Loop_SpookyMist_C_GetSkeletalMeshes) == 0x000008, "Wrong alignment on GCN_Loop_SpookyMist_C_GetSkeletalMeshes");
static_assert(sizeof(GCN_Loop_SpookyMist_C_GetSkeletalMeshes) == 0x000040, "Wrong size on GCN_Loop_SpookyMist_C_GetSkeletalMeshes");
