#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_ChillBronco_Explode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_ChillBronco_Explode.GCN_Athena_ChillBronco_Explode_C.ExecuteUbergraph_GCN_Athena_ChillBronco_Explode
// 0x0120 (0x0120 - 0x0000)
struct GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50EE[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50EF[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50F0[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode) == 0x000008, "Wrong alignment on GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode");
static_assert(sizeof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode) == 0x000120, "Wrong size on GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, EntryPoint) == 0x000000, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_MyTarget) == 0x000008, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_Parameters) == 0x000010, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_AudioComponents) == 0x0000D8, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, K2Node_Event_BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000FC, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000108, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000118, "Member 'GCN_Athena_ChillBronco_Explode_C_ExecuteUbergraph_GCN_Athena_ChillBronco_Explode::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function GCN_Athena_ChillBronco_Explode.GCN_Athena_ChillBronco_Explode_C.OnBurst
// 0x00F0 (0x00F0 - 0x0000)
struct GCN_Athena_ChillBronco_Explode_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_ChillBronco_Explode_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_ChillBronco_Explode_C_OnBurst");
static_assert(sizeof(GCN_Athena_ChillBronco_Explode_C_OnBurst) == 0x0000F0, "Wrong size on GCN_Athena_ChillBronco_Explode_C_OnBurst");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_ChillBronco_Explode_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Athena_ChillBronco_Explode_C_OnBurst::BurstDecalInstance' has a wrong offset!");

}

