#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_FringePlank_Reveal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_FringePlank_Reveal.GCN_Athena_FringePlank_Reveal_C
// 0x0088 (0x04E8 - 0x0460)
class AGCN_Athena_FringePlank_Reveal_C final : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SweepDuration;                                     // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71EF[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SweepDelayHandle;                                  // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SweepRadius;                                       // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0484(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawnAthena;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeSweep;                                  // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71F0[0x4];                                     // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayBeforeSweepHandle;                            // 0x04A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleRelativeLocation;                          // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71F1[0x4];                                     // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              RevealSoundMix;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StencilSweepDuration;                              // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71F2[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         StencilDuration;                                   // 0x04C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCN_Athena_FringePlank_Reveal(int32 EntryPoint);
	void PlayWorldSweep();
	void BeginSweepFX();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void EndSweepFX();
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_FringePlank_Reveal_C">();
	}
	static class AGCN_Athena_FringePlank_Reveal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_FringePlank_Reveal_C>();
	}
};
static_assert(alignof(AGCN_Athena_FringePlank_Reveal_C) == 0x000008, "Wrong alignment on AGCN_Athena_FringePlank_Reveal_C");
static_assert(sizeof(AGCN_Athena_FringePlank_Reveal_C) == 0x0004E8, "Wrong size on AGCN_Athena_FringePlank_Reveal_C");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, UberGraphFrame) == 0x000460, "Member 'AGCN_Athena_FringePlank_Reveal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, PostProcess) == 0x000468, "Member 'AGCN_Athena_FringePlank_Reveal_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, SweepDuration) == 0x000470, "Member 'AGCN_Athena_FringePlank_Reveal_C::SweepDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, SweepDelayHandle) == 0x000478, "Member 'AGCN_Athena_FringePlank_Reveal_C::SweepDelayHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, SweepRadius) == 0x000480, "Member 'AGCN_Athena_FringePlank_Reveal_C::SweepRadius' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, Location) == 0x000484, "Member 'AGCN_Athena_FringePlank_Reveal_C::Location' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, PlayerPawnAthena) == 0x000490, "Member 'AGCN_Athena_FringePlank_Reveal_C::PlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, DelayBeforeSweep) == 0x000498, "Member 'AGCN_Athena_FringePlank_Reveal_C::DelayBeforeSweep' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, DelayBeforeSweepHandle) == 0x0004A0, "Member 'AGCN_Athena_FringePlank_Reveal_C::DelayBeforeSweepHandle' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, ParticleRelativeLocation) == 0x0004A8, "Member 'AGCN_Athena_FringePlank_Reveal_C::ParticleRelativeLocation' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, RevealSoundMix) == 0x0004B8, "Member 'AGCN_Athena_FringePlank_Reveal_C::RevealSoundMix' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, StencilSweepDuration) == 0x0004C0, "Member 'AGCN_Athena_FringePlank_Reveal_C::StencilSweepDuration' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_FringePlank_Reveal_C, StencilDuration) == 0x0004C8, "Member 'AGCN_Athena_FringePlank_Reveal_C::StencilDuration' has a wrong offset!");

}

