#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Player_InWater_HandSplash_Sprint

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Player_InWater_HandSplash_Sprint.GCN_Player_InWater_HandSplash_Sprint_C.OnBurst
// 0x0108 (0x0108 - 0x0000)
struct GCN_Player_InWater_HandSplash_Sprint_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71ED[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Player_InWater_HandSplash_Sprint_C_OnBurst");
static_assert(sizeof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst) == 0x000108, "Wrong size on GCN_Player_InWater_HandSplash_Sprint_C_OnBurst");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000F0, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Player_InWater_HandSplash_Sprint_C_OnBurst, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000100, "Member 'GCN_Player_InWater_HandSplash_Sprint_C_OnBurst::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

}

