#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Item_SuperDingo_Despawned

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Item_SuperDingo_Despawned.GCN_Athena_Item_SuperDingo_Despawned_C.OnBurst
// 0x0108 (0x0108 - 0x0000)
struct GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SuperDingo_C*               K2Node_DynamicCast_AsBGA_Athena_Super_Dingo;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst");
static_assert(sizeof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst) == 0x000108, "Wrong size on GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, K2Node_DynamicCast_AsBGA_Athena_Super_Dingo) == 0x0000F8, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::K2Node_DynamicCast_AsBGA_Athena_Super_Dingo' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, CallFunc_IsValid_ReturnValue_1) == 0x000102, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000103, "Member 'GCN_Athena_Item_SuperDingo_Despawned_C_OnBurst::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

