#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_SneakySnowman

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_SneakySnowman.GCN_Athena_SneakySnowman_C.ExecuteUbergraph_GCN_Athena_SneakySnowman
// 0x04B0 (0x04B0 - 0x0000)
struct GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0018(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0118(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72D1[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x020C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72D2[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72D3[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72D4[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72D5[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72D6[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Prop_SneakySnowman_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0378(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_72D7[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2;    // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72D8[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0414(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman) == 0x000010, "Wrong alignment on GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman");
static_assert(sizeof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman) == 0x0004B0, "Wrong size on GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, EntryPoint) == 0x000000, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_MyTarget_1) == 0x000010, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_Parameters_1) == 0x000018, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_ParticleComponents_1) == 0x0000D0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_AudioComponents_1) == 0x0000E0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_BurstCameraShakeInstance) == 0x0000F0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_BurstDecalInstance) == 0x0000F8, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_MyTarget) == 0x000110, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_Parameters) == 0x000118, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_ParticleComponents) == 0x0001D0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_Event_AudioComponents) == 0x0001E0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000200, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00020C, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000298, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_GetTransform_ReturnValue) == 0x0002A0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_BreakTransform_Location) == 0x0002D0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_BreakTransform_Rotation) == 0x0002DC, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_BreakTransform_Scale) == 0x0002E8, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_Add_VectorVector_ReturnValue) == 0x0002F4, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000300, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_MakeTransform_ReturnValue) == 0x000310, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000340, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000350, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000360, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_FinishSpawningActor_ReturnValue) == 0x000370, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000378, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2) == 0x000408, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, K2Node_DynamicCast_bSuccess_2) == 0x000410, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000414, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0004A0, "Member 'GCN_Athena_SneakySnowman_C_ExecuteUbergraph_GCN_Athena_SneakySnowman::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function GCN_Athena_SneakySnowman.GCN_Athena_SneakySnowman_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCN_Athena_SneakySnowman_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_SneakySnowman_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCN_Athena_SneakySnowman_C_OnLoopingStart");
static_assert(sizeof(GCN_Athena_SneakySnowman_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCN_Athena_SneakySnowman_C_OnLoopingStart");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCN_Athena_SneakySnowman_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCN_Athena_SneakySnowman_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCN_Athena_SneakySnowman_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCN_Athena_SneakySnowman_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCN_Athena_SneakySnowman.GCN_Athena_SneakySnowman_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCN_Athena_SneakySnowman_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_SneakySnowman_C_OnRemoval) == 0x000008, "Wrong alignment on GCN_Athena_SneakySnowman_C_OnRemoval");
static_assert(sizeof(GCN_Athena_SneakySnowman_C_OnRemoval) == 0x0000F0, "Wrong size on GCN_Athena_SneakySnowman_C_OnRemoval");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, Parameters) == 0x000008, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SneakySnowman_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Athena_SneakySnowman_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

}

