#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_EnvCampFire_Doused

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_EnvCampFire_Doused.GCNL_EnvCampFire_Doused_C
// 0x0038 (0x07F8 - 0x07C0)
class AGCNL_EnvCampFire_Doused_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Fade_Doused_Smoke_Fade_50A77D974140FDA04967E2BABB987458; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade_Doused_Smoke__Direction_50A77D974140FDA04967E2BABB987458; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7224[0x3];                                     // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fade_Doused_Smoke;                                 // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_Duration;                                      // 0x07D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_EnvCampFire_Doused(int32 EntryPoint);
	void DestroyOnDestroy(class AActor* DestroyedActor);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Fade_Doused_Smoke__UpdateFunc();
	void Fade_Doused_Smoke__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_EnvCampFire_Doused_C">();
	}
	static class AGCNL_EnvCampFire_Doused_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_EnvCampFire_Doused_C>();
	}
};
static_assert(alignof(AGCNL_EnvCampFire_Doused_C) == 0x000008, "Wrong alignment on AGCNL_EnvCampFire_Doused_C");
static_assert(sizeof(AGCNL_EnvCampFire_Doused_C) == 0x0007F8, "Wrong size on AGCNL_EnvCampFire_Doused_C");
static_assert(offsetof(AGCNL_EnvCampFire_Doused_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_EnvCampFire_Doused_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Doused_C, Fade_Doused_Smoke_Fade_50A77D974140FDA04967E2BABB987458) == 0x0007C8, "Member 'AGCNL_EnvCampFire_Doused_C::Fade_Doused_Smoke_Fade_50A77D974140FDA04967E2BABB987458' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Doused_C, Fade_Doused_Smoke__Direction_50A77D974140FDA04967E2BABB987458) == 0x0007CC, "Member 'AGCNL_EnvCampFire_Doused_C::Fade_Doused_Smoke__Direction_50A77D974140FDA04967E2BABB987458' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Doused_C, Fade_Doused_Smoke) == 0x0007D0, "Member 'AGCNL_EnvCampFire_Doused_C::Fade_Doused_Smoke' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Doused_C, Row_Duration) == 0x0007D8, "Member 'AGCNL_EnvCampFire_Doused_C::Row_Duration' has a wrong offset!");

}

