#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina.GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C
// 0x0018 (0x07D8 - 0x07C0)
class AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            SpawnRampCurve;                                    // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Handle;                                      // 0x07D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina(int32 EntryPoint);
	void StartLoop();
	void Loop();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C">();
	}
	static class AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C>();
	}
};
static_assert(alignof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C) == 0x000008, "Wrong alignment on AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C");
static_assert(sizeof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C) == 0x0007D8, "Wrong size on AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, SpawnRampCurve) == 0x0007C8, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::SpawnRampCurve' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C, Timer_Handle) == 0x0007D0, "Member 'AGCNL_Athena_ReactiveProp_PropaneTank_OnFire_TNTina_C::Timer_Handle' has a wrong offset!");

}

