#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_AthenaAI_NonParticipant_AlertState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C
// 0x0080 (0x0860 - 0x07E0)
class AGCNL_AthenaAI_NonParticipant_AlertState_C final : public AFortGameplayCueNotifyAthena_AIAlertState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SpriteMesh;                                        // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             MeshRelativeTransform;                             // 0x07F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerPawn_Athena_C*                   Pawn;                                              // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColorAlert;                                    // 0x0828(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_GCNL_AthenaAI_NonParticipant_AlertState_C;   // 0x0838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColorThreatend;                                // 0x083C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationLength;                                   // 0x084C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColorAlertInner;                               // 0x0850(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveTick(float DeltaSeconds);
	void HideSpriteMesh();
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_AthenaAI_NonParticipant_AlertState_C">();
	}
	static class AGCNL_AthenaAI_NonParticipant_AlertState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_AthenaAI_NonParticipant_AlertState_C>();
	}
};
static_assert(alignof(AGCNL_AthenaAI_NonParticipant_AlertState_C) == 0x000010, "Wrong alignment on AGCNL_AthenaAI_NonParticipant_AlertState_C");
static_assert(sizeof(AGCNL_AthenaAI_NonParticipant_AlertState_C) == 0x000860, "Wrong size on AGCNL_AthenaAI_NonParticipant_AlertState_C");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, UberGraphFrame) == 0x0007E0, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, SpriteMesh) == 0x0007E8, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::SpriteMesh' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, MeshRelativeTransform) == 0x0007F0, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::MeshRelativeTransform' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, Pawn) == 0x000820, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::Pawn' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorAlert) == 0x000828, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorAlert' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, Index_GCNL_AthenaAI_NonParticipant_AlertState_C) == 0x000838, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::Index_GCNL_AthenaAI_NonParticipant_AlertState_C' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorThreatend) == 0x00083C, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorThreatend' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, AnimationLength) == 0x00084C, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::AnimationLength' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorAlertInner) == 0x000850, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorAlertInner' has a wrong offset!");

}

