#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_HidingProp_Teleporting_WilliePete

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_HidingProp_Teleporting_WilliePete.GCNL_Athena_HidingProp_Teleporting_WilliePete_C
// 0x0028 (0x07E8 - 0x07C0)
class AGCNL_Athena_HidingProp_Teleporting_WilliePete_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7257[0x3];                                     // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           LensEffect;                                        // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnePTravelAudio;                                   // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_HidingProp_Teleporting_WilliePete(int32 EntryPoint);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Timeline_0__DoFlash__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_HidingProp_Teleporting_WilliePete_C">();
	}
	static class AGCNL_Athena_HidingProp_Teleporting_WilliePete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_HidingProp_Teleporting_WilliePete_C>();
	}
};
static_assert(alignof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C) == 0x000008, "Wrong alignment on AGCNL_Athena_HidingProp_Teleporting_WilliePete_C");
static_assert(sizeof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C) == 0x0007E8, "Wrong size on AGCNL_Athena_HidingProp_Teleporting_WilliePete_C");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459) == 0x0007C8, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0_LerpWhiteWash_7F6EEB5A42EA09E354D8B4A32C35C459' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459) == 0x0007CC, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0__Direction_7F6EEB5A42EA09E354D8B4A32C35C459' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, Timeline_0) == 0x0007D0, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, LensEffect) == 0x0007D8, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::LensEffect' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_HidingProp_Teleporting_WilliePete_C, OnePTravelAudio) == 0x0007E0, "Member 'AGCNL_Athena_HidingProp_Teleporting_WilliePete_C::OnePTravelAudio' has a wrong offset!");

}

