#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_EnvCampFire_Stoke

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_EnvCampFire_Stoke.GCNL_EnvCampFire_Stoke_C
// 0x0048 (0x0808 - 0x07C0)
class AGCNL_EnvCampFire_Stoke_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_TickInterval;                                  // 0x07C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxHeals;                                      // 0x07E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_EnvCampFire_Stoke(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_EnvCampFire_Stoke_C">();
	}
	static class AGCNL_EnvCampFire_Stoke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_EnvCampFire_Stoke_C>();
	}
};
static_assert(alignof(AGCNL_EnvCampFire_Stoke_C) == 0x000008, "Wrong alignment on AGCNL_EnvCampFire_Stoke_C");
static_assert(sizeof(AGCNL_EnvCampFire_Stoke_C) == 0x000808, "Wrong size on AGCNL_EnvCampFire_Stoke_C");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_EnvCampFire_Stoke_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, Row_TickInterval) == 0x0007C8, "Member 'AGCNL_EnvCampFire_Stoke_C::Row_TickInterval' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, Row_MaxHeals) == 0x0007E8, "Member 'AGCNL_EnvCampFire_Stoke_C::Row_MaxHeals' has a wrong offset!");

}

