#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Creative_GrinderFeet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.ExecuteUbergraph_GCNL_Creative_GrinderFeet
// 0x0510 (0x0510 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C1[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0110(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0204(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C2[0x2];                                     // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C3[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_2;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0318(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_2;                 // 0x03D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_2;                    // 0x03E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance_1;           // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C4[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C5[0x3];                                     // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPawnTeamNumber_ReturnValue;            // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C6[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPawnTeamNumber_ReturnValue_1;          // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x0450(0x0010)(ZeroConstructor, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C7[0x5];                                     // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C8[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72C9[0x7];                                     // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72CA[0x7];                                     // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72CB[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x04D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72CC[0x4];                                     // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollisionAudioComponent*           CallFunc_AddComponent_ReturnValue;                 // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet) == 0x000010, "Wrong alignment on GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet) == 0x000510, "Wrong size on GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, EntryPoint) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_MyTarget_1) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_Parameters_1) == 0x000010, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_ParticleComponents_1) == 0x0000C8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_AudioComponents_1) == 0x0000D8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000F8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_DeltaSeconds) == 0x000104, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_MyTarget) == 0x000108, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_Parameters) == 0x000110, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_ParticleComponents) == 0x0001C8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_AudioComponents) == 0x0001D8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CustomEvent_SelfActor) == 0x0001E8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CustomEvent_OtherActor) == 0x0001F0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CustomEvent_NormalImpulse) == 0x0001F8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CustomEvent_Hit) == 0x000204, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_bBlockingHit) == 0x000290, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_bInitialOverlap) == 0x000291, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_Time) == 0x000294, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_Distance) == 0x000298, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_Location) == 0x00029C, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_ImpactPoint) == 0x0002A8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_Normal) == 0x0002B4, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_ImpactNormal) == 0x0002C0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_PhysMat) == 0x0002D0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_HitActor) == 0x0002D8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_HitComponent) == 0x0002E0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_HitBoneName) == 0x0002E8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_HitItem) == 0x0002F0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_FaceIndex) == 0x0002F4, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_TraceStart) == 0x0002F8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BreakHitResult_TraceEnd) == 0x000304, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_MyTarget_2) == 0x000310, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_MyTarget_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_Parameters_2) == 0x000318, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_ParticleComponents_2) == 0x0003D0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_ParticleComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_AudioComponents_2) == 0x0003E0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_AudioComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_BurstCameraShakeInstance_1) == 0x0003F0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Event_BurstDecalInstance_1) == 0x0003F8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_GetVelocity_ReturnValue) == 0x000400, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000410, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_bSuccess_1) == 0x000418, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00041C, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_GetPawnTeamNumber_ReturnValue) == 0x000428, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_GetPawnTeamNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_OnCollision_OutResult) == 0x000434, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_OnCollision_OutMagnitude) == 0x000438, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_GetPawnTeamNumber_ReturnValue_1) == 0x00043C, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_GetPawnTeamNumber_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000448, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CreateDelegate_OutputDelegate) == 0x000450, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000460, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000468, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, Temp_bool_Variable) == 0x000478, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_IsValid_ReturnValue) == 0x000479, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_IsValid_ReturnValue_1) == 0x00047A, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000480, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_DynamicCast_bSuccess_2) == 0x000488, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000490, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_IsLocallyControlled_ReturnValue) == 0x000498, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, K2Node_Select_Default) == 0x0004A0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004A8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0004B0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_Not_PreBool_ReturnValue) == 0x0004B8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_IsFalling_ReturnValue) == 0x0004B9, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_BooleanOR_ReturnValue) == 0x0004BA, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_IsValid_ReturnValue_2) == 0x0004BB, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_GetVelocity_ReturnValue_1) == 0x0004BC, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_VSize_ReturnValue) == 0x0004C8, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, Temp_struct_Variable) == 0x0004D0, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_MapRangeClamped_ReturnValue) == 0x000500, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet, CallFunc_AddComponent_ReturnValue) == 0x000508, "Member 'GCNL_Creative_GrinderFeet_C_ExecuteUbergraph_GCNL_Creative_GrinderFeet::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.On Target Pawn Hit Event
// 0x00A8 (0x00A8 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x001C(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event) == 0x000008, "Wrong alignment on GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event) == 0x0000A8, "Wrong size on GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event, SelfActor) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event::SelfActor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event, OtherActor) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event::OtherActor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event, NormalImpulse) == 0x000010, "Member 'GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event::NormalImpulse' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event, Hit) == 0x00001C, "Member 'GCNL_Creative_GrinderFeet_C_On_Target_Pawn_Hit_Event::Hit' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Creative_GrinderFeet_C_OnLoopingStart");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Creative_GrinderFeet_C_OnLoopingStart");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCNL_Creative_GrinderFeet_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCNL_Creative_GrinderFeet_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_Creative_GrinderFeet_C_ReceiveTick");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_Creative_GrinderFeet_C_ReceiveTick");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Creative_GrinderFeet_C_OnRemoval");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_OnRemoval) == 0x0000F0, "Wrong size on GCNL_Creative_GrinderFeet_C_OnRemoval");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Creative_GrinderFeet_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.OnApplication
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_Creative_GrinderFeet_C_OnApplication");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_OnApplication) == 0x0000F0, "Wrong size on GCNL_Creative_GrinderFeet_C_OnApplication");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, ParticleComponents) == 0x0000C0, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, AudioComponents) == 0x0000D0, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_OnApplication, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Creative_GrinderFeet_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.GetPawnTeamNumber
// 0x0050 (0x0050 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72CD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   Temp_struct_Variable;                              // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72CE[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber) == 0x000008, "Wrong alignment on GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber) == 0x000050, "Wrong size on GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, Actor) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::Actor' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, ReturnValue) == 0x000008, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, Temp_struct_Variable) == 0x000018, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, CallFunc_GetActorTeam_ReturnValue) == 0x000028, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, CallFunc_Array_Get_Item) == 0x000034, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000044, "Member 'GCNL_Creative_GrinderFeet_C_GetPawnTeamNumber::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function GCNL_Creative_GrinderFeet.GCNL_Creative_GrinderFeet_C.DeactivateFootParticles
// 0x0002 (0x0002 - 0x0000)
struct GCNL_Creative_GrinderFeet_C_DeactivateFootParticles final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_Creative_GrinderFeet_C_DeactivateFootParticles) == 0x000001, "Wrong alignment on GCNL_Creative_GrinderFeet_C_DeactivateFootParticles");
static_assert(sizeof(GCNL_Creative_GrinderFeet_C_DeactivateFootParticles) == 0x000002, "Wrong size on GCNL_Creative_GrinderFeet_C_DeactivateFootParticles");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_DeactivateFootParticles, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_Creative_GrinderFeet_C_DeactivateFootParticles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Creative_GrinderFeet_C_DeactivateFootParticles, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GCNL_Creative_GrinderFeet_C_DeactivateFootParticles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

