#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_MedConsumable_SoundIndicator

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_MedConsumable_SoundIndicator.GCNL_Athena_MedConsumable_SoundIndicator_C.ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator
// 0x0210 (0x0210 - 0x0000)
struct GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7215[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0038(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0100(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7216[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0138(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x01F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0200(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator) == 0x000008, "Wrong alignment on GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator");
static_assert(sizeof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator) == 0x000210, "Wrong size on GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, EntryPoint) == 0x000000, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_MakeArray_Array) == 0x000020, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_MyTarget) == 0x000030, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_Parameters) == 0x000038, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_ParticleComponents) == 0x0000F0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_AudioComponents) == 0x000100, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_BurstCameraShakeInstance) == 0x000110, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_BurstDecalInstance) == 0x000118, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, CallFunc_GetActorTeam_ReturnValue) == 0x000121, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000124, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_MyTarget_1) == 0x000130, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_Parameters_1) == 0x000138, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_ParticleComponents_1) == 0x0001F0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator, K2Node_Event_AudioComponents_1) == 0x000200, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_ExecuteUbergraph_GCNL_Athena_MedConsumable_SoundIndicator::K2Node_Event_AudioComponents_1' has a wrong offset!");

// Function GCNL_Athena_MedConsumable_SoundIndicator.GCNL_Athena_MedConsumable_SoundIndicator_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval");
static_assert(sizeof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval) == 0x0000F0, "Wrong size on GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_MedConsumable_SoundIndicator.GCNL_Athena_MedConsumable_SoundIndicator_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_MedConsumable_SoundIndicator_C_OnLoopingStart::AudioComponents' has a wrong offset!");

}

