#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GiftingScreen.GiftingScreen_C.HandleMoreInfoClicked
// 0x0010 (0x0010 - 0x0000)
struct GiftingScreen_C_HandleMoreInfoClicked final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75FD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_HandleMoreInfoClicked) == 0x000008, "Wrong alignment on GiftingScreen_C_HandleMoreInfoClicked");
static_assert(sizeof(GiftingScreen_C_HandleMoreInfoClicked) == 0x000010, "Wrong size on GiftingScreen_C_HandleMoreInfoClicked");
static_assert(offsetof(GiftingScreen_C_HandleMoreInfoClicked, bPassThrough) == 0x000000, "Member 'GiftingScreen_C_HandleMoreInfoClicked::bPassThrough' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_HandleMoreInfoClicked, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'GiftingScreen_C_HandleMoreInfoClicked::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.ToggleBackAction
// 0x0018 (0x0018 - 0x0000)
struct GiftingScreen_C_ToggleBackAction final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75FE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasInputActionHandler_ReturnValue;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInputActionHandler_ReturnValue_1;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GiftingScreen_C_ToggleBackAction) == 0x000004, "Wrong alignment on GiftingScreen_C_ToggleBackAction");
static_assert(sizeof(GiftingScreen_C_ToggleBackAction) == 0x000018, "Wrong size on GiftingScreen_C_ToggleBackAction");
static_assert(offsetof(GiftingScreen_C_ToggleBackAction, bEnable) == 0x000000, "Member 'GiftingScreen_C_ToggleBackAction::bEnable' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ToggleBackAction, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GiftingScreen_C_ToggleBackAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ToggleBackAction, CallFunc_HasInputActionHandler_ReturnValue) == 0x000014, "Member 'GiftingScreen_C_ToggleBackAction::CallFunc_HasInputActionHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ToggleBackAction, CallFunc_HasInputActionHandler_ReturnValue_1) == 0x000015, "Member 'GiftingScreen_C_ToggleBackAction::CallFunc_HasInputActionHandler_ReturnValue_1' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.HandleBackClicked
// 0x0001 (0x0001 - 0x0000)
struct GiftingScreen_C_HandleBackClicked final
{
public:
	bool                                          bIsHandled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GiftingScreen_C_HandleBackClicked) == 0x000001, "Wrong alignment on GiftingScreen_C_HandleBackClicked");
static_assert(sizeof(GiftingScreen_C_HandleBackClicked) == 0x000001, "Wrong size on GiftingScreen_C_HandleBackClicked");
static_assert(offsetof(GiftingScreen_C_HandleBackClicked, bIsHandled) == 0x000000, "Member 'GiftingScreen_C_HandleBackClicked::bIsHandled' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.OnOfferSet
// 0x0008 (0x0008 - 0x0000)
struct GiftingScreen_C_OnOfferSet final
{
public:
	class UFortStoreFrontOfferInfo*               NewOfferInfo;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_OnOfferSet) == 0x000008, "Wrong alignment on GiftingScreen_C_OnOfferSet");
static_assert(sizeof(GiftingScreen_C_OnOfferSet) == 0x000008, "Wrong size on GiftingScreen_C_OnOfferSet");
static_assert(offsetof(GiftingScreen_C_OnOfferSet, NewOfferInfo) == 0x000000, "Member 'GiftingScreen_C_OnOfferSet::NewOfferInfo' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.OnMoveToGiftWrapStep
// 0x0001 (0x0001 - 0x0000)
struct GiftingScreen_C_OnMoveToGiftWrapStep final
{
public:
	bool                                          bGiftingToSelf;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GiftingScreen_C_OnMoveToGiftWrapStep) == 0x000001, "Wrong alignment on GiftingScreen_C_OnMoveToGiftWrapStep");
static_assert(sizeof(GiftingScreen_C_OnMoveToGiftWrapStep) == 0x000001, "Wrong size on GiftingScreen_C_OnMoveToGiftWrapStep");
static_assert(offsetof(GiftingScreen_C_OnMoveToGiftWrapStep, bGiftingToSelf) == 0x000000, "Member 'GiftingScreen_C_OnMoveToGiftWrapStep::bGiftingToSelf' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'GiftingScreen_C_BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'GiftingScreen_C_BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.OnEndGiftingSubmission
// 0x0001 (0x0001 - 0x0000)
struct GiftingScreen_C_OnEndGiftingSubmission final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GiftingScreen_C_OnEndGiftingSubmission) == 0x000001, "Wrong alignment on GiftingScreen_C_OnEndGiftingSubmission");
static_assert(sizeof(GiftingScreen_C_OnEndGiftingSubmission) == 0x000001, "Wrong size on GiftingScreen_C_OnEndGiftingSubmission");
static_assert(offsetof(GiftingScreen_C_OnEndGiftingSubmission, bSuccess) == 0x000000, "Member 'GiftingScreen_C_OnEndGiftingSubmission::bSuccess' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'GiftingScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function GiftingScreen.GiftingScreen_C.ExecuteUbergraph_GiftingScreen
// 0x0058 (0x0058 - 0x0000)
struct GiftingScreen_C_ExecuteUbergraph_GiftingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75FF[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               K2Node_Event_NewOfferInfo;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiftOnly_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGiftingToSelf;                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7600[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7601[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBackClicked_bIsHandled;             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7602[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen) == 0x000008, "Wrong alignment on GiftingScreen_C_ExecuteUbergraph_GiftingScreen");
static_assert(sizeof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen) == 0x000058, "Wrong size on GiftingScreen_C_ExecuteUbergraph_GiftingScreen");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, EntryPoint) == 0x000000, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_byte_Variable) == 0x000004, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_byte_Variable_1) == 0x000005, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_bool_Variable) == 0x000006, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_byte_Variable_2) == 0x000007, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_byte_Variable_3) == 0x000008, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, Temp_bool_Variable_1) == 0x000009, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_Event_NewOfferInfo) == 0x000010, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_Event_NewOfferInfo' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_IsGiftOnly_ReturnValue) == 0x000018, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_IsGiftOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_Select_Default) == 0x000019, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_Event_bGiftingToSelf) == 0x00001A, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_Event_bGiftingToSelf' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_ComponentBoundEvent_Button_2) == 0x000020, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_Event_bSuccess) == 0x000034, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_IsMobileGame_ReturnValue) == 0x000048, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_Select_Default_1) == 0x000049, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, CallFunc_HandleBackClicked_bIsHandled) == 0x00004A, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::CallFunc_HandleBackClicked_bIsHandled' has a wrong offset!");
static_assert(offsetof(GiftingScreen_C_ExecuteUbergraph_GiftingScreen, K2Node_ComponentBoundEvent_Button) == 0x000050, "Member 'GiftingScreen_C_ExecuteUbergraph_GiftingScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

