#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GiftingScreen.GiftingScreen_C
// 0x00A8 (0x0710 - 0x0668)
class UGiftingScreen_C final : public UFortGiftingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReportSent;                                        // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Summary;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_ReasonField;                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Price;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_StackingEntry;                                  // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_Button;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MainPanelContent;                         // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_TabContent;                               // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_GiftWrap;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_Recipients;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_ChosenItem;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Recipients;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCurrentStepGiftWrap;                             // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75FC[0x7];                                     // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackAction;                                        // 0x0700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void HandleMoreInfoClicked(bool* bPassThrough);
	void ToggleBackAction(bool bEnable);
	void HandleBackClicked(bool* bIsHandled);
	void Construct();
	void OnOfferSet(class UFortStoreFrontOfferInfo* NewOfferInfo);
	void OnMoveToGiftWrapStep(bool bGiftingToSelf);
	void BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnMoveToFriendSelectStep();
	void BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnBeginGiftingSubmission();
	void OnEndGiftingSubmission(bool bSuccess);
	void BP_OnActivated();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_GiftingScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GiftingScreen_C">();
	}
	static class UGiftingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGiftingScreen_C>();
	}
};
static_assert(alignof(UGiftingScreen_C) == 0x000008, "Wrong alignment on UGiftingScreen_C");
static_assert(sizeof(UGiftingScreen_C) == 0x000710, "Wrong size on UGiftingScreen_C");
static_assert(offsetof(UGiftingScreen_C, UberGraphFrame) == 0x000668, "Member 'UGiftingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, ReportSent) == 0x000670, "Member 'UGiftingScreen_C::ReportSent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Intro) == 0x000678, "Member 'UGiftingScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Border_Summary) == 0x000680, "Member 'UGiftingScreen_C::Border_Summary' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, CircularThrobber_0) == 0x000688, "Member 'UGiftingScreen_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, CloseButton) == 0x000690, "Member 'UGiftingScreen_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, EditableText_ReasonField) == 0x000698, "Member 'UGiftingScreen_C::EditableText_ReasonField' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, HBox_Price) == 0x0006A0, "Member 'UGiftingScreen_C::HBox_Price' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Image_4) == 0x0006A8, "Member 'UGiftingScreen_C::Image_4' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SafeZone_0) == 0x0006B0, "Member 'UGiftingScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SB_StackingEntry) == 0x0006B8, "Member 'UGiftingScreen_C::SB_StackingEntry' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_Button) == 0x0006C0, "Member 'UGiftingScreen_C::Switcher_Button' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_MainPanelContent) == 0x0006C8, "Member 'UGiftingScreen_C::Switcher_MainPanelContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_TabContent) == 0x0006D0, "Member 'UGiftingScreen_C::Switcher_TabContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Tab_GiftWrap) == 0x0006D8, "Member 'UGiftingScreen_C::Tab_GiftWrap' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Tab_Recipients) == 0x0006E0, "Member 'UGiftingScreen_C::Tab_Recipients' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_ChosenItem) == 0x0006E8, "Member 'UGiftingScreen_C::VBox_ChosenItem' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_Recipients) == 0x0006F0, "Member 'UGiftingScreen_C::VBox_Recipients' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, IsCurrentStepGiftWrap) == 0x0006F8, "Member 'UGiftingScreen_C::IsCurrentStepGiftWrap' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, BackAction) == 0x000700, "Member 'UGiftingScreen_C::BackAction' has a wrong offset!");

}

