#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Glider_AnimBP_Functions

#include "Basic.hpp"


namespace SDK::Params
{

// Function Glider_AnimBP_Functions.Glider_AnimBP_Functions_C.ForwardBack_Value_Interp
// 0x0048 (0x0048 - 0x0000)
struct Glider_AnimBP_Functions_C_ForwardBack_Value_Interp final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Currnet_Value;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Idle_Value;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Idle_InterpSpeed;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Forward_Value;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Forward_InterpSpeed;                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Back_Value;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Back_InterpSpeed;                                  // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalAccelForward;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C41[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Value;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C42[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_3;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp) == 0x000008, "Wrong alignment on Glider_AnimBP_Functions_C_ForwardBack_Value_Interp");
static_assert(sizeof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp) == 0x000048, "Wrong size on Glider_AnimBP_Functions_C_ForwardBack_Value_Interp");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Time) == 0x000000, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Time' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Currnet_Value) == 0x000004, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Currnet_Value' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Idle_Value) == 0x000008, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Idle_Value' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Idle_InterpSpeed) == 0x00000C, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Idle_InterpSpeed' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Forward_Value) == 0x000010, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Forward_Value' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Forward_InterpSpeed) == 0x000014, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Forward_InterpSpeed' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Back_Value) == 0x000018, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Back_Value' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, Back_InterpSpeed) == 0x00001C, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::Back_InterpSpeed' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, LocalAccelForward) == 0x000020, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::LocalAccelForward' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, __WorldContext) == 0x000028, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::__WorldContext' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, New_Value) == 0x000030, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::New_Value' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_FInterpTo_ReturnValue) == 0x000034, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_Less_FloatFloat_ReturnValue) == 0x000038, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000039, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003A, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_FInterpTo_ReturnValue_1) == 0x00003C, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_FInterpTo_ReturnValue_2) == 0x000040, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Glider_AnimBP_Functions_C_ForwardBack_Value_Interp, CallFunc_FInterpTo_ReturnValue_3) == 0x000044, "Member 'Glider_AnimBP_Functions_C_ForwardBack_Value_Interp::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");

}

