#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalActionKeybindWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GlobalActionKeybindWidget.GlobalActionKeybindWidget_C.SetActionDetailsContext
// 0x0001 (0x0001 - 0x0000)
struct GlobalActionKeybindWidget_C_SetActionDetailsContext final
{
public:
	struct FFortGlobalActionDetailsFunctionContext Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GlobalActionKeybindWidget_C_SetActionDetailsContext) == 0x000001, "Wrong alignment on GlobalActionKeybindWidget_C_SetActionDetailsContext");
static_assert(sizeof(GlobalActionKeybindWidget_C_SetActionDetailsContext) == 0x000001, "Wrong size on GlobalActionKeybindWidget_C_SetActionDetailsContext");
static_assert(offsetof(GlobalActionKeybindWidget_C_SetActionDetailsContext, Value) == 0x000000, "Member 'GlobalActionKeybindWidget_C_SetActionDetailsContext::Value' has a wrong offset!");

// Function GlobalActionKeybindWidget.GlobalActionKeybindWidget_C.SetGlobalAction
// 0x0001 (0x0001 - 0x0000)
struct GlobalActionKeybindWidget_C_SetGlobalAction final
{
public:
	EFortGlobalAction                             Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalActionKeybindWidget_C_SetGlobalAction) == 0x000001, "Wrong alignment on GlobalActionKeybindWidget_C_SetGlobalAction");
static_assert(sizeof(GlobalActionKeybindWidget_C_SetGlobalAction) == 0x000001, "Wrong size on GlobalActionKeybindWidget_C_SetGlobalAction");
static_assert(offsetof(GlobalActionKeybindWidget_C_SetGlobalAction, Value) == 0x000000, "Member 'GlobalActionKeybindWidget_C_SetGlobalAction::Value' has a wrong offset!");

// Function GlobalActionKeybindWidget.GlobalActionKeybindWidget_C.ExecuteUbergraph_GlobalActionKeybindWidget
// 0x0020 (0x0020 - 0x0000)
struct GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGlobalActionDetailsFunctionContext Temp_struct_Variable;                              // 0x0004(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_4C49[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStandardGlobalActionDetailsDataSource* CallFunc_ConstructWithDefaultContexts_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortGlobalActionDetailsDataSource> CallFunc_SetActionSource_Value_CastInput;          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget) == 0x000008, "Wrong alignment on GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget");
static_assert(sizeof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget) == 0x000020, "Wrong size on GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget");
static_assert(offsetof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget, EntryPoint) == 0x000000, "Member 'GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget, Temp_struct_Variable) == 0x000004, "Member 'GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget, CallFunc_ConstructWithDefaultContexts_ReturnValue) == 0x000008, "Member 'GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget::CallFunc_ConstructWithDefaultContexts_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget, CallFunc_SetActionSource_Value_CastInput) == 0x000010, "Member 'GlobalActionKeybindWidget_C_ExecuteUbergraph_GlobalActionKeybindWidget::CallFunc_SetActionSource_Value_CastInput' has a wrong offset!");

}

