#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrapplingHookGun_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GrapplingHookGun_AnimBP.GrapplingHookGun_AnimBP_C
// 0x0800 (0x0A70 - 0x0270)
class UGrapplingHookGun_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6710[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x02A8(0x0018)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x02C0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03E8(0x0020)()
	uint8                                         Pad_6711[0x8];                                     // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0410(0x0650)()
	bool                                          IsFired;                                           // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GrapplingHookGun_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GrapplingHookGun_AnimBP_C">();
	}
	static class UGrapplingHookGun_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrapplingHookGun_AnimBP_C>();
	}
};
static_assert(alignof(UGrapplingHookGun_AnimBP_C) == 0x000010, "Wrong alignment on UGrapplingHookGun_AnimBP_C");
static_assert(sizeof(UGrapplingHookGun_AnimBP_C) == 0x000A70, "Wrong size on UGrapplingHookGun_AnimBP_C");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UGrapplingHookGun_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x0002A8, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0002C0, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0003C8, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003E8, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, AnimGraphNode_RigidBody) == 0x000410, "Member 'UGrapplingHookGun_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UGrapplingHookGun_AnimBP_C, IsFired) == 0x000A60, "Member 'UGrapplingHookGun_AnimBP_C::IsFired' has a wrong offset!");

}

