#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupChallengeTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GroupChallengeTag.GroupChallengeTag_C
// 0x0058 (0x0288 - 0x0230)
class UGroupChallengeTag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_2;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Overall;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   RECOMMENDED_4_PLAYERS;                             // 0x0250(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SQUAD_ASSIST;                                      // 0x0268(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ConstrainWidth;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_739C[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WidthOverrideValue;                                // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GroupChallengeTag(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GroupChallengeTag_C">();
	}
	static class UGroupChallengeTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupChallengeTag_C>();
	}
};
static_assert(alignof(UGroupChallengeTag_C) == 0x000008, "Wrong alignment on UGroupChallengeTag_C");
static_assert(sizeof(UGroupChallengeTag_C) == 0x000288, "Wrong size on UGroupChallengeTag_C");
static_assert(offsetof(UGroupChallengeTag_C, UberGraphFrame) == 0x000230, "Member 'UGroupChallengeTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, Flash) == 0x000238, "Member 'UGroupChallengeTag_C::Flash' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, Border_2) == 0x000240, "Member 'UGroupChallengeTag_C::Border_2' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, SizeBox_Overall) == 0x000248, "Member 'UGroupChallengeTag_C::SizeBox_Overall' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, RECOMMENDED_4_PLAYERS) == 0x000250, "Member 'UGroupChallengeTag_C::RECOMMENDED_4_PLAYERS' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, SQUAD_ASSIST) == 0x000268, "Member 'UGroupChallengeTag_C::SQUAD_ASSIST' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, ConstrainWidth) == 0x000280, "Member 'UGroupChallengeTag_C::ConstrainWidth' has a wrong offset!");
static_assert(offsetof(UGroupChallengeTag_C, WidthOverrideValue) == 0x000284, "Member 'UGroupChallengeTag_C::WidthOverrideValue' has a wrong offset!");

}

