#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HairStrandsCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HairStrandsCore.GroomHairGroupsPreview
// 0x0010 (0x0038 - 0x0028)
class UGroomHairGroupsPreview final : public UObject
{
public:
	TArray<struct FGroomHairGroupPreview>         Groups;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomHairGroupsPreview">();
	}
	static class UGroomHairGroupsPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomHairGroupsPreview>();
	}
};
static_assert(alignof(UGroomHairGroupsPreview) == 0x000008, "Wrong alignment on UGroomHairGroupsPreview");
static_assert(sizeof(UGroomHairGroupsPreview) == 0x000038, "Wrong size on UGroomHairGroupsPreview");
static_assert(offsetof(UGroomHairGroupsPreview, Groups) == 0x000028, "Member 'UGroomHairGroupsPreview::Groups' has a wrong offset!");

// Class HairStrandsCore.GroomActor
// 0x0008 (0x0228 - 0x0220)
class AGroomActor final : public AActor
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomActor">();
	}
	static class AGroomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGroomActor>();
	}
};
static_assert(alignof(AGroomActor) == 0x000008, "Wrong alignment on AGroomActor");
static_assert(sizeof(AGroomActor) == 0x000228, "Wrong size on AGroomActor");
static_assert(offsetof(AGroomActor, GroomComponent) == 0x000220, "Member 'AGroomActor::GroomComponent' has a wrong offset!");

// Class HairStrandsCore.GroomAsset
// 0x0060 (0x0088 - 0x0028)
class UGroomAsset final : public UObject
{
public:
	uint8                                         Pad_4A18[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupInfo>                 HairGroupsInfo;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsPhysics>             HairGroupsPhysics;                                 // 0x0040(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableGlobalInterpolation;                         // 0x0050(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationType                       HairInterpolationType;                             // 0x0051(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A19[0x16];                                    // 0x0052(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HairToGuideDensity;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1A[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1B[0x8];                                     // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomAsset">();
	}
	static class UGroomAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAsset>();
	}
};
static_assert(alignof(UGroomAsset) == 0x000008, "Wrong alignment on UGroomAsset");
static_assert(sizeof(UGroomAsset) == 0x000088, "Wrong size on UGroomAsset");
static_assert(offsetof(UGroomAsset, HairGroupsInfo) == 0x000030, "Member 'UGroomAsset::HairGroupsInfo' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsPhysics) == 0x000040, "Member 'UGroomAsset::HairGroupsPhysics' has a wrong offset!");
static_assert(offsetof(UGroomAsset, EnableGlobalInterpolation) == 0x000050, "Member 'UGroomAsset::EnableGlobalInterpolation' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairInterpolationType) == 0x000051, "Member 'UGroomAsset::HairInterpolationType' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairToGuideDensity) == 0x000068, "Member 'UGroomAsset::HairToGuideDensity' has a wrong offset!");
static_assert(offsetof(UGroomAsset, AssetUserData) == 0x000070, "Member 'UGroomAsset::AssetUserData' has a wrong offset!");

// Class HairStrandsCore.GroomBindingAsset
// 0x0078 (0x00A0 - 0x0028)
class alignas(0x10) UGroomBindingAsset final : public UObject
{
public:
	class UGroomAsset*                            Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGoomBindingGroupInfo>          GroupInfos;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1D[0x48];                                    // 0x0058(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomBindingAsset">();
	}
	static class UGroomBindingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAsset>();
	}
};
static_assert(alignof(UGroomBindingAsset) == 0x000010, "Wrong alignment on UGroomBindingAsset");
static_assert(sizeof(UGroomBindingAsset) == 0x0000A0, "Wrong size on UGroomBindingAsset");
static_assert(offsetof(UGroomBindingAsset, Groom) == 0x000028, "Member 'UGroomBindingAsset::Groom' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, SourceSkeletalMesh) == 0x000030, "Member 'UGroomBindingAsset::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, TargetSkeletalMesh) == 0x000038, "Member 'UGroomBindingAsset::TargetSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, NumInterpolationPoints) == 0x000040, "Member 'UGroomBindingAsset::NumInterpolationPoints' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, GroupInfos) == 0x000048, "Member 'UGroomBindingAsset::GroupInfos' has a wrong offset!");

// Class HairStrandsCore.GroomAssetImportData
// 0x0008 (0x0030 - 0x0028)
class UGroomAssetImportData final : public UAssetImportData
{
public:
	class UGroomImportOptions*                    ImportOptions;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomAssetImportData">();
	}
	static class UGroomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAssetImportData>();
	}
};
static_assert(alignof(UGroomAssetImportData) == 0x000008, "Wrong alignment on UGroomAssetImportData");
static_assert(sizeof(UGroomAssetImportData) == 0x000030, "Wrong size on UGroomAssetImportData");
static_assert(offsetof(UGroomAssetImportData, ImportOptions) == 0x000028, "Member 'UGroomAssetImportData::ImportOptions' has a wrong offset!");

// Class HairStrandsCore.GroomComponent
// 0x00F0 (0x0550 - 0x0460)
class UGroomComponent final : public UMeshComponent
{
public:
	class UGroomAsset*                            GroomAsset;                                        // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x0460(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindGroomToSkeletalMesh;                          // 0x0470(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1E[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomBindingAsset*                     BindingAsset;                                      // 0x0480(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HairDebugMaterial;                                 // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HairDefaultMaterial;                               // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         AngularSpringsSystem;                              // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         CosseratRodsSystem;                                // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1F[0x50];                                    // 0x04B0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupDesc>                 GroomGroupsDesc;                                   // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A20[0x40];                                    // 0x0510(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomComponent">();
	}
	static class UGroomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomComponent>();
	}
};
static_assert(alignof(UGroomComponent) == 0x000010, "Wrong alignment on UGroomComponent");
static_assert(sizeof(UGroomComponent) == 0x000550, "Wrong size on UGroomComponent");
static_assert(offsetof(UGroomComponent, GroomAsset) == 0x000458, "Member 'UGroomComponent::GroomAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, NiagaraComponents) == 0x000460, "Member 'UGroomComponent::NiagaraComponents' has a wrong offset!");
static_assert(offsetof(UGroomComponent, bBindGroomToSkeletalMesh) == 0x000470, "Member 'UGroomComponent::bBindGroomToSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomComponent, SourceSkeletalMesh) == 0x000478, "Member 'UGroomComponent::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomComponent, BindingAsset) == 0x000480, "Member 'UGroomComponent::BindingAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, PhysicsAsset) == 0x000488, "Member 'UGroomComponent::PhysicsAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, HairDebugMaterial) == 0x000490, "Member 'UGroomComponent::HairDebugMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, HairDefaultMaterial) == 0x000498, "Member 'UGroomComponent::HairDefaultMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, AngularSpringsSystem) == 0x0004A0, "Member 'UGroomComponent::AngularSpringsSystem' has a wrong offset!");
static_assert(offsetof(UGroomComponent, CosseratRodsSystem) == 0x0004A8, "Member 'UGroomComponent::CosseratRodsSystem' has a wrong offset!");
static_assert(offsetof(UGroomComponent, GroomGroupsDesc) == 0x000500, "Member 'UGroomComponent::GroomGroupsDesc' has a wrong offset!");

// Class HairStrandsCore.GroomCreateBindingOptions
// 0x0018 (0x0040 - 0x0028)
class UGroomCreateBindingOptions final : public UObject
{
public:
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A21[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCreateBindingOptions">();
	}
	static class UGroomCreateBindingOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateBindingOptions>();
	}
};
static_assert(alignof(UGroomCreateBindingOptions) == 0x000008, "Wrong alignment on UGroomCreateBindingOptions");
static_assert(sizeof(UGroomCreateBindingOptions) == 0x000040, "Wrong size on UGroomCreateBindingOptions");
static_assert(offsetof(UGroomCreateBindingOptions, SourceSkeletalMesh) == 0x000028, "Member 'UGroomCreateBindingOptions::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, TargetSkeletalMesh) == 0x000030, "Member 'UGroomCreateBindingOptions::TargetSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, NumInterpolationPoints) == 0x000038, "Member 'UGroomCreateBindingOptions::NumInterpolationPoints' has a wrong offset!");

// Class HairStrandsCore.GroomImportOptions
// 0x0028 (0x0050 - 0x0028)
class UGroomImportOptions final : public UObject
{
public:
	struct FGroomConversionSettings               ConversionSettings;                                // 0x0028(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FGroomBuildSettings                    BuildSettings;                                     // 0x0040(0x000C)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A22[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomImportOptions">();
	}
	static class UGroomImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomImportOptions>();
	}
};
static_assert(alignof(UGroomImportOptions) == 0x000008, "Wrong alignment on UGroomImportOptions");
static_assert(sizeof(UGroomImportOptions) == 0x000050, "Wrong size on UGroomImportOptions");
static_assert(offsetof(UGroomImportOptions, ConversionSettings) == 0x000028, "Member 'UGroomImportOptions::ConversionSettings' has a wrong offset!");
static_assert(offsetof(UGroomImportOptions, BuildSettings) == 0x000040, "Member 'UGroomImportOptions::BuildSettings' has a wrong offset!");

}

