#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HamburgerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HamburgerButton.HamburgerButton_C
// 0x0018 (0x04A8 - 0x0490)
class UHamburgerButton_C final : public UBacchusHUDElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MenuButton;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HamburgerButton(int32 EntryPoint);
	void BndEvt__MenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HamburgerButton_C">();
	}
	static class UHamburgerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHamburgerButton_C>();
	}
};
static_assert(alignof(UHamburgerButton_C) == 0x000008, "Wrong alignment on UHamburgerButton_C");
static_assert(sizeof(UHamburgerButton_C) == 0x0004A8, "Wrong size on UHamburgerButton_C");
static_assert(offsetof(UHamburgerButton_C, UberGraphFrame) == 0x000490, "Member 'UHamburgerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHamburgerButton_C, Icon) == 0x000498, "Member 'UHamburgerButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UHamburgerButton_C, MenuButton) == 0x0004A0, "Member 'UHamburgerButton_C::MenuButton' has a wrong offset!");

}

