#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardcoreModifierFlyover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HardcoreModifierFlyover.HardcoreModifierFlyover_C
// 0x0018 (0x02B0 - 0x0298)
class UHardcoreModifierFlyover_C final : public UHardcoreModifierFlyover
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ChallengesText;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleUpdateActiveModifiers(const class FText& ActiveModifierText);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ExecuteUbergraph_HardcoreModifierFlyover(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HardcoreModifierFlyover_C">();
	}
	static class UHardcoreModifierFlyover_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHardcoreModifierFlyover_C>();
	}
};
static_assert(alignof(UHardcoreModifierFlyover_C) == 0x000008, "Wrong alignment on UHardcoreModifierFlyover_C");
static_assert(sizeof(UHardcoreModifierFlyover_C) == 0x0002B0, "Wrong size on UHardcoreModifierFlyover_C");
static_assert(offsetof(UHardcoreModifierFlyover_C, UberGraphFrame) == 0x000298, "Member 'UHardcoreModifierFlyover_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierFlyover_C, Intro) == 0x0002A0, "Member 'UHardcoreModifierFlyover_C::Intro' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierFlyover_C, ChallengesText) == 0x0002A8, "Member 'UHardcoreModifierFlyover_C::ChallengesText' has a wrong offset!");

}

