#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeldObjectLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C
// 0x1C40 (0x1F00 - 0x02C0)
class UHeldObjectLayerAnimBP_C final : public UFortItemLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x02F8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0380(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x03B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0438(0x0030)()
	float                                         Pitch;                                             // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6398[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0478(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0500(0x0188)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0688(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0710(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07D8(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0800(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0830(0x0240)(NoDestructor)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0A70(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0AF8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0B70(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0C10(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0C40(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0CC8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0CF8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0D80(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0DB0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0DE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0E10(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0E88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0EB8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0F30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0F60(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0FD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1008(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x1080(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x10B0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x1128(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1158(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x11D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1200(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1278(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x12A8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x12D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1308(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x13C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1478(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1500(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1530(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x15B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x15E8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1670(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x16A0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1728(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1758(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x17E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1810(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1898(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x18C8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1950(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1980(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1A08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1A38(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1AC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1AF0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1B68(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1B98(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1C10(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1C40(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1CB8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1CE8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1D60(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1D90(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1E08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1E38(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1EC0(0x0030)()
	bool                                          IsHeldObjectDropped;                               // 0x1EF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeldObjectLayerAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_HeldObjectPickUp();
	void AnimNotify_HeldObjectPlace();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeldObjectLayerAnimBP_AnimGraphNode_RotationOffsetBlendSpace_C2A887E04220180AB9CD6384FDB74E4E();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* Param_ItemSkeletalControl);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* Param_ItemSwimJumpSurfaceEnd);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* Param_ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* Param_ItemSwimJumpFallLoop);
	void ItemSwimJumpStartLoop(struct FPoseLink* Param_ItemSwimJumpStartLoop);
	void ItemSwimJumpStart(struct FPoseLink* Param_ItemSwimJumpStart);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* Param_ItemLowerBodyJogPostPivot);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* Param_ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* Param_ItemLowerBodyJogStop);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* Param_ItemLowerBodyJogStart);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* Param_ItemLowerBodyLeanAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* Param_ItemLowerBodyMovement);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* Param_ItemJogPostPivotAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* Param_ItemJogPrePivotAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* Param_ItemJogStopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* Param_ItemJogStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* Param_ItemFlyModeLoopAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* Param_ItemFlyModeStartAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* Param_ItemZipLineStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* Param_ItemJetPackJumpAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* Param_ItemJetPackStartAdditive);
	void ItemFallLandAdditive(struct FPoseLink* Param_ItemFallLandAdditive);
	void ItemFallAdditive(struct FPoseLink* Param_ItemFallAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* Param_ItemJumpLoopAdditive);
	void ItemJumpUpAdditive(struct FPoseLink* Param_ItemJumpUpAdditive);
	void ItemSlopeSliding(struct FPoseLink* Param_ItemSlopeSliding);
	void ItemCrouchTurningAdditive(struct FPoseLink* Param_ItemCrouchTurningAdditive);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* Param_ItemIdleAdditive);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* Param_ItemFullBodySprint);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& Param_InputParam, struct FPoseLink* Param_ItemUpperBody);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float Param_AimOffsetAlpha, float Param_Yaw, float Param_Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* Param_ItemAimOffset);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* Param_ItemFullBodyOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeldObjectLayerAnimBP_C">();
	}
	static class UHeldObjectLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeldObjectLayerAnimBP_C>();
	}
};
static_assert(alignof(UHeldObjectLayerAnimBP_C) == 0x000010, "Wrong alignment on UHeldObjectLayerAnimBP_C");
static_assert(sizeof(UHeldObjectLayerAnimBP_C) == 0x001F00, "Wrong size on UHeldObjectLayerAnimBP_C");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UHeldObjectLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_34) == 0x0002C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x0002F8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_33) == 0x000380, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x0003B0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000438, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Pitch) == 0x000468, "Member 'UHeldObjectLayerAnimBP_C::Pitch' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Yaw) == 0x00046C, "Member 'UHeldObjectLayerAnimBP_C::Yaw' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AimOffsetAlpha) == 0x000470, "Member 'UHeldObjectLayerAnimBP_C::AimOffsetAlpha' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x000478, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000500, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x000688, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000710, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_UseCachedPose) == 0x0007D8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_31) == 0x000800, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, InputParam) == 0x000830, "Member 'UHeldObjectLayerAnimBP_C::InputParam' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000A70, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x000AF8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000B70, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000C10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000C40, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000CC8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000CF8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000D80, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000DB0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000DE0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000E10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000E88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x000EB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000F30, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000F60, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000FD8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x001008, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_22) == 0x001080, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x0010B0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_21) == 0x001128, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x001158, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_20) == 0x0011D0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001200, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_19) == 0x001278, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_18) == 0x0012A8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_17) == 0x0012D8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x001308, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_16) == 0x001390, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x0013C0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001448, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x001478, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001500, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x001530, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_13) == 0x0015B8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x0015E8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_12) == 0x001670, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x0016A0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_11) == 0x001728, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001758, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_10) == 0x0017E0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001810, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001898, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0018C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001950, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x001980, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001A08, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x001A38, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_6) == 0x001AC0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001AF0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_5) == 0x001B68, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001B98, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_4) == 0x001C10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001C40, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001CB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001CE8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001D60, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001D90, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001E08, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001E38, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root) == 0x001EC0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, IsHeldObjectDropped) == 0x001EF0, "Member 'UHeldObjectLayerAnimBP_C::IsHeldObjectDropped' has a wrong offset!");

}

