#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutActiveAbilitiesDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HeroLoadoutActiveAbilitiesDetailLayoutStyle_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroLoadoutActiveAbilitiesDetailWidget.HeroLoadoutActiveAbilitiesDetailWidget_C
// 0x0050 (0x0308 - 0x02B8)
class UHeroLoadoutActiveAbilitiesDetailWidget_C final : public UFortHeroLoadoutAbilitiesDetailPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ColumnContainer;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderHeading;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalLayoutBox;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LayoutSwitcher;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootBox;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RowContainer;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxHorizontalLayout;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalLayoutBox;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHeroLoadoutActiveAbilitiesDetailLayoutStyle  LayoutStyle;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldShowAbilityDescriptions;                     // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsHeroLoadOutMinusTooltip;                         // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ShowDescription;                                   // 0x0303(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          UseVerboseDescription;                             // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void CreateAbilityTooltips();
	void UpdateFromItem();
	void HandlePostDifferentItemToDetailSet();
	void HandleItemToDetailChangedBP();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnPlayerHomebaseChanged();
	void ExecuteUbergraph_HeroLoadoutActiveAbilitiesDetailWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroLoadoutActiveAbilitiesDetailWidget_C">();
	}
	static class UHeroLoadoutActiveAbilitiesDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroLoadoutActiveAbilitiesDetailWidget_C>();
	}
};
static_assert(alignof(UHeroLoadoutActiveAbilitiesDetailWidget_C) == 0x000008, "Wrong alignment on UHeroLoadoutActiveAbilitiesDetailWidget_C");
static_assert(sizeof(UHeroLoadoutActiveAbilitiesDetailWidget_C) == 0x000308, "Wrong size on UHeroLoadoutActiveAbilitiesDetailWidget_C");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, ColumnContainer) == 0x0002C0, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::ColumnContainer' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, CommonBorderHeading) == 0x0002C8, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::CommonBorderHeading' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, HorizontalLayoutBox) == 0x0002D0, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::HorizontalLayoutBox' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, LayoutSwitcher) == 0x0002D8, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::LayoutSwitcher' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, RootBox) == 0x0002E0, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::RootBox' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, RowContainer) == 0x0002E8, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::RowContainer' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, SizeBoxHorizontalLayout) == 0x0002F0, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::SizeBoxHorizontalLayout' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, VerticalLayoutBox) == 0x0002F8, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::VerticalLayoutBox' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, LayoutStyle) == 0x000300, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::LayoutStyle' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, ShouldShowAbilityDescriptions) == 0x000301, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::ShouldShowAbilityDescriptions' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, IsHeroLoadOutMinusTooltip) == 0x000302, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::IsHeroLoadOutMinusTooltip' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, ShowDescription) == 0x000303, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::ShowDescription' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilitiesDetailWidget_C, UseVerboseDescription) == 0x000304, "Member 'UHeroLoadoutActiveAbilitiesDetailWidget_C::UseVerboseDescription' has a wrong offset!");

}

