#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutPerkDetailRow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetRawAbilityKit
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetRawAbilityKit final
{
public:
	class UFortAbilityKit*                        Ability_Kit;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetRawAbilityKit) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetRawAbilityKit");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetRawAbilityKit) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_SetRawAbilityKit");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetRawAbilityKit, Ability_Kit) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetRawAbilityKit::Ability_Kit' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetTeamPerk
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetTeamPerk final
{
public:
	class UFortTeamPerkItem*                      Param_Team_Perk;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetTeamPerk) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetTeamPerk");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetTeamPerk) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_SetTeamPerk");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetTeamPerk, Param_Team_Perk) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetTeamPerk::Param_Team_Perk' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayUnHover
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayUnHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayUnHover) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayUnHover");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayUnHover) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayUnHover");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayUnHover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayUnHover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayHover
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayHover) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayHover");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayHover) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayHover");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetShouldDisplayWarning
// 0x0002 (0x0002 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning final
{
public:
	bool                                          InShouldDisplayWarning;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning) == 0x000002, "Wrong size on HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning, InShouldDisplayWarning) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning::InShouldDisplayWarning' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateLockedImage
// 0x0098 (0x0098 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateLockedImage final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0008(0x0088)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateLockedImage");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage) == 0x000098, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateLockedImage");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_bool_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_byte_Variable) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_byte_Variable_1) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_bool_Variable_1) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_IsPerkUnlocked_ReturnValue) == 0x000005, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, K2Node_Select_Default) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, K2Node_Select_Default_1) == 0x000090, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::K2Node_Select_Default_1' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayUnhoverCue
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayUnhoverCue final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayUnhoverCue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayUnhoverCue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayUnhoverCue::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayHoverCue
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayHoverCue final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayHoverCue) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayHoverCue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayHoverCue) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayHoverCue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayHoverCue, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayHoverCue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetShouldDisplayAsIgnored
// 0x0002 (0x0002 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored final
{
public:
	bool                                          InShouldDisplayAsIgnored;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored) == 0x000002, "Wrong size on HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored, InShouldDisplayAsIgnored) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored::InShouldDisplayAsIgnored' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetPerkTypeToRepresent
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent final
{
public:
	EFortHeroLoadoutPerkType                      Perk_Type;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent) == 0x000001, "Wrong size on HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent, Perk_Type) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent::Perk_Type' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.IsPerkUnlocked
// 0x0006 (0x0006 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_IsPerkUnlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortHeroLoadoutPerkType                      Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_IsPerkUnlocked");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked) == 0x000006, "Wrong size on HeroLoadoutPerkDetailRow_C_IsPerkUnlocked");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, Temp_bool_Variable) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, Temp_byte_Variable) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, K2Node_Select_Default) == 0x000005, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.GetPerkAbilityKit
// 0x0070 (0x0070 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit final
{
public:
	class UFortAbilityKit*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTeamPerkItemDefinition*            K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6020[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKitBP_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortHeroLoadoutPerkType                      Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6021[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6022[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          K2Node_DynamicCast_AsFort_Hero_Type;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6023[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForHeroPerk_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForCommanderPerk_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit) == 0x000070, "Wrong size on HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition) == 0x000018, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitBP_ReturnValue) == 0x000028, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, Temp_byte_Variable) == 0x000030, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetItemDefinitionBP_ReturnValue_1) == 0x000038, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetItemDefinitionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_AsFort_Hero_Type) == 0x000048, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_AsFort_Hero_Type' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitForHeroPerk_ReturnValue) == 0x000058, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitForHeroPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitForCommanderPerk_ReturnValue) == 0x000060, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitForCommanderPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_Select_Default) == 0x000068, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHero
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHero final
{
public:
	class UFortHero*                              Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHero) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHero");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHero) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHero");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHero, Hero) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHero::Hero' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateTextStyles
// 0x0058 (0x0058 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateTextStyles final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6024[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6025[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6026[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_5;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue_1;             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6027[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue_2;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6028[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_4;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_5;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateTextStyles");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles) == 0x000058, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateTextStyles");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_1) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_2) == 0x00000C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_3) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable_1) == 0x000014, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_4) == 0x000018, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable_2) == 0x00001C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_5) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable_6) == 0x000024, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable_3) == 0x000028, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable_4) == 0x000029, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue) == 0x00002A, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue_1) == 0x00002B, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default) == 0x00002C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default_1) == 0x000030, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable_5) == 0x000034, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default_2) == 0x000038, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue_2) == 0x00003C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default_3) == 0x000040, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default_4) == 0x000048, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default_5) == 0x000050, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default_5' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateFromState
// 0x02C0 (0x02C0 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateFromState final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6029[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTeamPerkItemDefinition*            K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasProgressiveBonus_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602A[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKitBP_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0018)()
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602C[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue_2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602D[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0070(0x0018)()
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0088(0x0088)()
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush;                 // 0x0110(0x0088)()
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush_1;               // 0x0198(0x0088)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602E[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0250(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602F[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          K2Node_Select_Default;                             // 0x0270(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6030[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0288(0x0018)()
	class FText                                   CallFunc_GetCombinedDescription_OutDescription_1;  // 0x02A0(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue_1;     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateFromState) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateFromState");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateFromState) == 0x0002C0, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateFromState");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_HasProgressiveBonus_ReturnValue) == 0x000019, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_HasProgressiveBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetAbilityKitBP_ReturnValue) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetAbilityKitBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue) == 0x000040, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue_1) == 0x000050, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue_2) == 0x000060, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue_3) == 0x000068, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_TextToUpper_ReturnValue) == 0x000070, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_NoResourceBrush_ReturnValue) == 0x000088, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush) == 0x000110, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush_1) == 0x000198, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetOwningPlayer_ReturnValue) == 0x000220, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x000228, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000230, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_SpawnTooltipContextWithSource_ReturnValue_1) == 0x000238, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_SpawnTooltipContextWithSource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, Temp_bool_Variable) == 0x000240, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetContext_ReturnValue) == 0x000248, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_OutDescription) == 0x000250, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_ReturnValue) == 0x000268, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, K2Node_Select_Default) == 0x000270, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, Temp_bool_Variable_1) == 0x000278, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetContext_ReturnValue_1) == 0x000280, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, K2Node_Select_Default_1) == 0x000288, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_OutDescription_1) == 0x0002A0, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_OutDescription_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_ReturnValue_1) == 0x0002B8, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_ReturnValue_1' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateFromStyle
// 0x0018 (0x0018 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateFromStyle final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6031[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateFromStyle");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle) == 0x000018, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateFromStyle");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_byte_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_byte_Variable_1) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_bool_Variable) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_bool_Variable_1) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, K2Node_Select_Default) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, K2Node_Select_Default_1) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::K2Node_Select_Default_1' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PreConstruct) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PreConstruct");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PreConstruct) == 0x000001, "Wrong size on HeroLoadoutPerkDetailRow_C_PreConstruct");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHoverAlphaValue
// 0x0004 (0x0004 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue) == 0x000004, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue) == 0x000004, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue, NewValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue::NewValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHoverHorizontalOffset
// 0x0004 (0x0004 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset) == 0x000004, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset) == 0x000004, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset, NewValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset::NewValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.ExecuteUbergraph_HeroLoadoutPerkDetailRow
// 0x00C8 (0x00C8 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6032[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6033[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6034[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00A8(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow) == 0x0000C8, "Wrong size on HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, EntryPoint) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_Event_IsDesignTime) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_Event_IsDesignTime' has a wrong offset!");
