#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutActiveAbilityDetailColumn

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroLoadoutActiveAbilityDetailColumn.HeroLoadoutActiveAbilityDetailColumn_C
// 0x0038 (0x0290 - 0x0258)
class UHeroLoadoutActiveAbilityDetailColumn_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageLockPerk;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePerkIcon;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PerkIconSizeBox;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortBrushSize                                Icon_Size;                                         // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76BD[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              Host_Hero;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortAbilityKit*                        AbilityKit;                                        // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetAbilityKit(class UFortAbilityKit* Param_AbilityKit);
	bool IsAbilityUnlocked();
	class UFortAbilityKit* GetAbilityKit();
	void SetHero(class UFortHero* Hero);
	void UpdateFromState();
	void UpdateFromStyle();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_HeroLoadoutActiveAbilityDetailColumn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroLoadoutActiveAbilityDetailColumn_C">();
	}
	static class UHeroLoadoutActiveAbilityDetailColumn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroLoadoutActiveAbilityDetailColumn_C>();
	}
};
static_assert(alignof(UHeroLoadoutActiveAbilityDetailColumn_C) == 0x000008, "Wrong alignment on UHeroLoadoutActiveAbilityDetailColumn_C");
static_assert(sizeof(UHeroLoadoutActiveAbilityDetailColumn_C) == 0x000290, "Wrong size on UHeroLoadoutActiveAbilityDetailColumn_C");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, UberGraphFrame) == 0x000258, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, ImageLockPerk) == 0x000260, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::ImageLockPerk' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, ImagePerkIcon) == 0x000268, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::ImagePerkIcon' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, PerkIconSizeBox) == 0x000270, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::PerkIconSizeBox' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, Icon_Size) == 0x000278, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::Icon_Size' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, Host_Hero) == 0x000280, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::Host_Hero' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutActiveAbilityDetailColumn_C, AbilityKit) == 0x000288, "Member 'UHeroLoadoutActiveAbilityDetailColumn_C::AbilityKit' has a wrong offset!");

}

