#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoagieDriver_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HoagieDriver_AnimBP.HoagieDriver_AnimBP_C.ExecuteUbergraph_HoagieDriver_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP) == 0x000004, "Wrong alignment on HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP");
static_assert(sizeof(HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP) == 0x000004, "Wrong size on HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP");
static_assert(offsetof(HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP, EntryPoint) == 0x000000, "Member 'HoagieDriver_AnimBP_C_ExecuteUbergraph_HoagieDriver_AnimBP::EntryPoint' has a wrong offset!");

// Function HoagieDriver_AnimBP.HoagieDriver_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HoagieDriver_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(HoagieDriver_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on HoagieDriver_AnimBP_C_AnimGraph");
static_assert(sizeof(HoagieDriver_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on HoagieDriver_AnimBP_C_AnimGraph");
static_assert(offsetof(HoagieDriver_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'HoagieDriver_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

