#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoagiePassengerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HoagiePassengerLayerAnimBP.HoagiePassengerLayerAnimBP_C
// 0x0680 (0x0C30 - 0x05B0)
class UHoagiePassengerLayerAnimBP_C final : public UFortVehicleOccupantAnimInstance
{
public:
	uint8                                         Pad_8A7D[0x8];                                     // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x05B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x05E8(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0670(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x06F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0728(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x07B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0838(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0868(0x0088)()
	struct FFortAnimInput_TurnInPlace             TurnInPlace;                                       // 0x08F0(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0960(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x09E8(0x0188)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0B70(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0BF8(0x0030)()

public:
	void ExecuteUbergraph_HoagiePassengerLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void VehicleSplitBodyOverride(const struct FPoseLink& InPoseSplitBody, const struct FPoseLink& InPoseUpperAndLowerBody, const struct FFortAnimInput_TurnInPlace& Param_TurnInPlace, const struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink* Param_VehicleSplitBodyOverride);
	void VehicleLowerBodyOverride(const struct FPoseLink& InPoseLowerBodyDefault, const struct FPoseLink& InPoseUpperBody, struct FPoseLink* Param_VehicleLowerBodyOverride);
	void VehicleFullBodyOverride(const struct FPoseLink& InPoseFullBody, const struct FPoseLink& InPoseUpperAndLowerCachePose, struct FPoseLink* Param_VehicleFullBodyOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HoagiePassengerLayerAnimBP_C">();
	}
	static class UHoagiePassengerLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoagiePassengerLayerAnimBP_C>();
	}
};
static_assert(alignof(UHoagiePassengerLayerAnimBP_C) == 0x000010, "Wrong alignment on UHoagiePassengerLayerAnimBP_C");
static_assert(sizeof(UHoagiePassengerLayerAnimBP_C) == 0x000C30, "Wrong size on UHoagiePassengerLayerAnimBP_C");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, UberGraphFrame) == 0x0005B0, "Member 'UHoagiePassengerLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_Root_3) == 0x0005B8, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x0005E8, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x000670, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_Root_2) == 0x0006F8, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x000728, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0007B0, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_Root_1) == 0x000838, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x000868, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, TurnInPlace) == 0x0008F0, "Member 'UHoagiePassengerLayerAnimBP_C::TurnInPlace' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x000960, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0009E8, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000B70, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UHoagiePassengerLayerAnimBP_C, AnimGraphNode_Root) == 0x000BF8, "Member 'UHoagiePassengerLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

