#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_XP_Feed_Entry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HUD_XP_Feed_Entry.HUD_XP_Feed_Entry_C.OpenWidget
// 0x0028 (0x0028 - 0x0000)
struct HUD_XP_Feed_Entry_C_OpenWidget final
{
public:
	int32                                         XpValue;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_708E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsRested;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_XP_Feed_Entry_C_OpenWidget) == 0x000008, "Wrong alignment on HUD_XP_Feed_Entry_C_OpenWidget");
static_assert(sizeof(HUD_XP_Feed_Entry_C_OpenWidget) == 0x000028, "Wrong size on HUD_XP_Feed_Entry_C_OpenWidget");
static_assert(offsetof(HUD_XP_Feed_Entry_C_OpenWidget, XpValue) == 0x000000, "Member 'HUD_XP_Feed_Entry_C_OpenWidget::XpValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_OpenWidget, DisplayName) == 0x000008, "Member 'HUD_XP_Feed_Entry_C_OpenWidget::DisplayName' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_OpenWidget, bIsRested) == 0x000020, "Member 'HUD_XP_Feed_Entry_C_OpenWidget::bIsRested' has a wrong offset!");

// Function HUD_XP_Feed_Entry.HUD_XP_Feed_Entry_C.On Scale Out Finished
// 0x0008 (0x0008 - 0x0000)
struct HUD_XP_Feed_Entry_C_On_Scale_Out_Finished final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Feed_Entry_C_On_Scale_Out_Finished) == 0x000004, "Wrong alignment on HUD_XP_Feed_Entry_C_On_Scale_Out_Finished");
static_assert(sizeof(HUD_XP_Feed_Entry_C_On_Scale_Out_Finished) == 0x000008, "Wrong size on HUD_XP_Feed_Entry_C_On_Scale_Out_Finished");
static_assert(offsetof(HUD_XP_Feed_Entry_C_On_Scale_Out_Finished, Param_Name) == 0x000000, "Member 'HUD_XP_Feed_Entry_C_On_Scale_Out_Finished::Param_Name' has a wrong offset!");

// Function HUD_XP_Feed_Entry.HUD_XP_Feed_Entry_C.ExecuteUbergraph_HUD_XP_Feed_Entry
// 0x0270 (0x0270 - 0x0000)
struct HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_708F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName Name)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7090[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_XpValue;                              // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7091[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_DisplayName;                          // 0x0050(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsRested;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7092[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7093[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7094[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x00A0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00C0(0x0050)(HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_1;           // 0x0110(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0130(0x0050)(HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_2;           // 0x0180(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x01A0(0x0050)(HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_3;           // 0x01F0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0210(0x0050)(HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Name;                           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry) == 0x000008, "Wrong alignment on HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry");
static_assert(sizeof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry) == 0x000270, "Wrong size on HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, EntryPoint) == 0x000000, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_object_Variable) == 0x000010, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_object_Variable_1) == 0x000018, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_bool_Variable) == 0x000030, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_struct_Variable) == 0x000034, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_byte_Variable) == 0x000044, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_bool_IsClosed_Variable) == 0x000045, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_bool_Has_Been_Initd_Variable) == 0x000046, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_bool_Variable_1) == 0x000047, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Event_XpValue) == 0x000048, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Event_XpValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Event_DisplayName) == 0x000050, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Event_DisplayName' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Event_bIsRested) == 0x000068, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Event_bIsRested' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00006C, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Select_Default) == 0x000070, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_byte_Variable_1) == 0x000078, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_bool_Variable_2) == 0x000079, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, Temp_struct_Variable_1) == 0x00007C, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Select_Default_1) == 0x00008C, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_Select_Default_2) == 0x000090, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_FontOutlineSettings) == 0x0000A0, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_SlateFontInfo) == 0x0000C0, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_FontOutlineSettings_1) == 0x000110, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_FontOutlineSettings_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_SlateFontInfo_1) == 0x000130, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_FontOutlineSettings_2) == 0x000180, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_FontOutlineSettings_2' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_SlateFontInfo_2) == 0x0001A0, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_SlateFontInfo_2' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_FontOutlineSettings_3) == 0x0001F0, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_FontOutlineSettings_3' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_MakeStruct_SlateFontInfo_3) == 0x000210, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_MakeStruct_SlateFontInfo_3' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, K2Node_CustomEvent_Name) == 0x000260, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, CallFunc_PlayAnimationByName_ReturnValue) == 0x000268, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000269, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00026A, "Member 'HUD_XP_Feed_Entry_C_ExecuteUbergraph_HUD_XP_Feed_Entry::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

}

