#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_XP_Feed

#include "Basic.hpp"


namespace SDK::Params
{

// Function HUD_XP_Feed.HUD_XP_Feed_C.EventXPLayout
// 0x0008 (0x0008 - 0x0000)
struct HUD_XP_Feed_C_EventXPLayout final
{
public:
	class FName                                   Placement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Feed_C_EventXPLayout) == 0x000004, "Wrong alignment on HUD_XP_Feed_C_EventXPLayout");
static_assert(sizeof(HUD_XP_Feed_C_EventXPLayout) == 0x000008, "Wrong size on HUD_XP_Feed_C_EventXPLayout");
static_assert(offsetof(HUD_XP_Feed_C_EventXPLayout, Placement) == 0x000000, "Member 'HUD_XP_Feed_C_EventXPLayout::Placement' has a wrong offset!");

// Function HUD_XP_Feed.HUD_XP_Feed_C.UpdateRestXP
// 0x0004 (0x0004 - 0x0000)
struct HUD_XP_Feed_C_UpdateRestXP final
{
public:
	int32                                         RestXpRemaining;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Feed_C_UpdateRestXP) == 0x000004, "Wrong alignment on HUD_XP_Feed_C_UpdateRestXP");
static_assert(sizeof(HUD_XP_Feed_C_UpdateRestXP) == 0x000004, "Wrong size on HUD_XP_Feed_C_UpdateRestXP");
static_assert(offsetof(HUD_XP_Feed_C_UpdateRestXP, RestXpRemaining) == 0x000000, "Member 'HUD_XP_Feed_C_UpdateRestXP::RestXpRemaining' has a wrong offset!");

// Function HUD_XP_Feed.HUD_XP_Feed_C.ExecuteUbergraph_HUD_XP_Feed
// 0x0040 (0x0040 - 0x0000)
struct HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Placement;                      // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WidgetPlacement)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_RestXpRemaining;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed) == 0x000008, "Wrong alignment on HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed");
static_assert(sizeof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed) == 0x000040, "Wrong size on HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, EntryPoint) == 0x000000, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, K2Node_CustomEvent_Placement) == 0x000004, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::K2Node_CustomEvent_Placement' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00000E, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, K2Node_Event_RestXpRemaining) == 0x000038, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::K2Node_Event_RestXpRemaining' has a wrong offset!");
static_assert(offsetof(HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed, CallFunc_BooleanAND_ReturnValue_1) == 0x00003C, "Member 'HUD_XP_Feed_C_ExecuteUbergraph_HUD_XP_Feed::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

