#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_XP_Pop_Widget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.UpdateXPAmount
// 0x0010 (0x0010 - 0x0000)
struct HUD_XP_Pop_Widget_C_UpdateXPAmount final
{
public:
	int32                                         NewAmount;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CB1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              Cue;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_UpdateXPAmount) == 0x000008, "Wrong alignment on HUD_XP_Pop_Widget_C_UpdateXPAmount");
static_assert(sizeof(HUD_XP_Pop_Widget_C_UpdateXPAmount) == 0x000010, "Wrong size on HUD_XP_Pop_Widget_C_UpdateXPAmount");
static_assert(offsetof(HUD_XP_Pop_Widget_C_UpdateXPAmount, NewAmount) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_UpdateXPAmount::NewAmount' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Widget_C_UpdateXPAmount, Cue) == 0x000008, "Member 'HUD_XP_Pop_Widget_C_UpdateXPAmount::Cue' has a wrong offset!");

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.UpdateXPSource
// 0x0018 (0x0018 - 0x0000)
struct HUD_XP_Pop_Widget_C_UpdateXPSource final
{
public:
	class FText                                   NewSourceText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_UpdateXPSource) == 0x000008, "Wrong alignment on HUD_XP_Pop_Widget_C_UpdateXPSource");
static_assert(sizeof(HUD_XP_Pop_Widget_C_UpdateXPSource) == 0x000018, "Wrong size on HUD_XP_Pop_Widget_C_UpdateXPSource");
static_assert(offsetof(HUD_XP_Pop_Widget_C_UpdateXPSource, NewSourceText) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_UpdateXPSource::NewSourceText' has a wrong offset!");

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HUD_XP_Pop_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on HUD_XP_Pop_Widget_C_PreConstruct");
static_assert(sizeof(HUD_XP_Pop_Widget_C_PreConstruct) == 0x000001, "Wrong size on HUD_XP_Pop_Widget_C_PreConstruct");
static_assert(offsetof(HUD_XP_Pop_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.SetSourceRestedVisuals
// 0x0008 (0x0008 - 0x0000)
struct HUD_XP_Pop_Widget_C_SetSourceRestedVisuals final
{
public:
	class UHUD_XP_Pop_Source_C*                   SourceWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_SetSourceRestedVisuals) == 0x000008, "Wrong alignment on HUD_XP_Pop_Widget_C_SetSourceRestedVisuals");
static_assert(sizeof(HUD_XP_Pop_Widget_C_SetSourceRestedVisuals) == 0x000008, "Wrong size on HUD_XP_Pop_Widget_C_SetSourceRestedVisuals");
static_assert(offsetof(HUD_XP_Pop_Widget_C_SetSourceRestedVisuals, SourceWidget) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_SetSourceRestedVisuals::SourceWidget' has a wrong offset!");

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.UpdateRestXP
// 0x0004 (0x0004 - 0x0000)
struct HUD_XP_Pop_Widget_C_UpdateRestXP final
{
public:
	int32                                         RestXpRemaining;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_UpdateRestXP) == 0x000004, "Wrong alignment on HUD_XP_Pop_Widget_C_UpdateRestXP");
static_assert(sizeof(HUD_XP_Pop_Widget_C_UpdateRestXP) == 0x000004, "Wrong size on HUD_XP_Pop_Widget_C_UpdateRestXP");
static_assert(offsetof(HUD_XP_Pop_Widget_C_UpdateRestXP, RestXpRemaining) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_UpdateRestXP::RestXpRemaining' has a wrong offset!");

// Function HUD_XP_Pop_Widget.HUD_XP_Pop_Widget_C.ExecuteUbergraph_HUD_XP_Pop_Widget
// 0x0370 (0x0370 - 0x0000)
struct HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CB2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewAmount;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CB3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_Event_Cue;                                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_NewSourceText;                        // 0x0018(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CB4[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CB5[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CB6[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CB7[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_1;                         // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CB8[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CB9[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UHUD_XP_Pop_Source_C*                   K2Node_CustomEvent_SourceWidget;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CBA[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0100(0x0028)()
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RestXpRemaining;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CBB[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUD_XP_Pop_Source_C*                   CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CBC[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CBD[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0180(0x0020)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CBE[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x01A8(0x0050)(HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUD_XP_Pop_Source_C*                   K2Node_DynamicCast_AsHUD_XP_Pop_Source;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CBF[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_1;           // 0x0210(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0230(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC0[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_2;           // 0x0288(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x02A8(0x0050)(HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_3;           // 0x02F8(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0318(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget) == 0x000008, "Wrong alignment on HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget");
static_assert(sizeof(HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget) == 0x000370, "Wrong size on HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget");
static_assert(offsetof(HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget, EntryPoint) == 0x000000, "Member 'HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget, Temp_bool_Variable) == 0x000004, "Member 'HUD_XP_Pop_Widget_C_ExecuteUbergraph_HUD_XP_Pop_Widget::Temp_bool_Variable' has a wrong offset!");
