#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_XP_Pop_Source

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HUD_XP_Pop_Source.HUD_XP_Pop_Source_C.ExecuteUbergraph_HUD_XP_Pop_Source
// 0x0150 (0x0150 - 0x0000)
struct HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_494D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0048(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_494E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0138(0x0018)()
};
static_assert(alignof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source) == 0x000008, "Wrong alignment on HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source");
static_assert(sizeof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source) == 0x000150, "Wrong size on HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, EntryPoint) == 0x000000, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, Temp_bool_Variable) == 0x000004, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, Temp_text_Variable) == 0x000048, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_MakeArray_Array) == 0x0000A8, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_Select_Default) == 0x0000D0, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, K2Node_MakeArray_Array_1) == 0x000128, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source, CallFunc_Format_ReturnValue_1) == 0x000138, "Member 'HUD_XP_Pop_Source_C_ExecuteUbergraph_HUD_XP_Pop_Source::CallFunc_Format_ReturnValue_1' has a wrong offset!");

}

