#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_ContextualTips_Base_Proxy

#include "Basic.hpp"

#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_ContextualTips_Base_Proxy.HUD_ContextualTips_Base_Proxy_C
// 0x0060 (0x02B8 - 0x0258)
class UHUD_ContextualTips_Base_Proxy_C final : public UCommonUserWidget
{
public:
	class UCanvasPanel*                           CanvasPanel_Ball;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Ball_Parented;                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkmark;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkmark_Shadow;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContextTutorialBall_C*                 ContextTutorialBall;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContextTutorialBall_C*                 ContextTutorialBallParented;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ControllerTip_Text;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconKeyBinding;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Timer;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Dialog;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               RichTextBlock_Message;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_ContextualTips_Base_Proxy_C">();
	}
	static class UHUD_ContextualTips_Base_Proxy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_ContextualTips_Base_Proxy_C>();
	}
};
static_assert(alignof(UHUD_ContextualTips_Base_Proxy_C) == 0x000008, "Wrong alignment on UHUD_ContextualTips_Base_Proxy_C");
static_assert(sizeof(UHUD_ContextualTips_Base_Proxy_C) == 0x0002B8, "Wrong size on UHUD_ContextualTips_Base_Proxy_C");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, CanvasPanel_Ball) == 0x000258, "Member 'UHUD_ContextualTips_Base_Proxy_C::CanvasPanel_Ball' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, CanvasPanel_Ball_Parented) == 0x000260, "Member 'UHUD_ContextualTips_Base_Proxy_C::CanvasPanel_Ball_Parented' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, Checkmark) == 0x000268, "Member 'UHUD_ContextualTips_Base_Proxy_C::Checkmark' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, Checkmark_Shadow) == 0x000270, "Member 'UHUD_ContextualTips_Base_Proxy_C::Checkmark_Shadow' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, ContextTutorialBall) == 0x000278, "Member 'UHUD_ContextualTips_Base_Proxy_C::ContextTutorialBall' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, ContextTutorialBallParented) == 0x000280, "Member 'UHUD_ContextualTips_Base_Proxy_C::ContextTutorialBallParented' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, ControllerTip_Text) == 0x000288, "Member 'UHUD_ContextualTips_Base_Proxy_C::ControllerTip_Text' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, IconKeyBinding) == 0x000290, "Member 'UHUD_ContextualTips_Base_Proxy_C::IconKeyBinding' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, Image_Timer) == 0x000298, "Member 'UHUD_ContextualTips_Base_Proxy_C::Image_Timer' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, Overlay_Container) == 0x0002A0, "Member 'UHUD_ContextualTips_Base_Proxy_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, Overlay_Dialog) == 0x0002A8, "Member 'UHUD_ContextualTips_Base_Proxy_C::Overlay_Dialog' has a wrong offset!");
static_assert(offsetof(UHUD_ContextualTips_Base_Proxy_C, RichTextBlock_Message) == 0x0002B0, "Member 'UHUD_ContextualTips_Base_Proxy_C::RichTextBlock_Message' has a wrong offset!");

}

