#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_XP_Feed_Entry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_XP_Feed_Entry.HUD_XP_Feed_Entry_C
// 0x0090 (0x02C8 - 0x0238)
class UHUD_XP_Feed_Entry_C final : public UAthenaXPFeedWidgetEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScaleOut_Backup;                                   // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleIn_Backup;                                    // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleOut;                                          // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleIn;                                           // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       AnimationsPanel;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Plus;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_xp;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flare;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Text_Number;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Source;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FWidgetTransform                       TransformCache;                                    // 0x0298(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FName                                   ScaleIn_Animation_Name;                            // 0x02B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ScaleOut_Animation_Name;                           // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void OpenWidget(const int32& XpValue, const class FText& DisplayName, bool bIsRested);
	void Event_Outro();
	void PlayFastOutro();
	void Event_Reset_Outro();
	void On_Scale_Out_Finished(class FName Param_Name);
	void ExecuteUbergraph_HUD_XP_Feed_Entry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_XP_Feed_Entry_C">();
	}
	static class UHUD_XP_Feed_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_XP_Feed_Entry_C>();
	}
};
static_assert(alignof(UHUD_XP_Feed_Entry_C) == 0x000008, "Wrong alignment on UHUD_XP_Feed_Entry_C");
static_assert(sizeof(UHUD_XP_Feed_Entry_C) == 0x0002C8, "Wrong size on UHUD_XP_Feed_Entry_C");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, UberGraphFrame) == 0x000238, "Member 'UHUD_XP_Feed_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleOut_Backup) == 0x000240, "Member 'UHUD_XP_Feed_Entry_C::ScaleOut_Backup' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleIn_Backup) == 0x000248, "Member 'UHUD_XP_Feed_Entry_C::ScaleIn_Backup' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleOut) == 0x000250, "Member 'UHUD_XP_Feed_Entry_C::ScaleOut' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleIn) == 0x000258, "Member 'UHUD_XP_Feed_Entry_C::ScaleIn' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, AnimationsPanel) == 0x000260, "Member 'UHUD_XP_Feed_Entry_C::AnimationsPanel' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, CommonTextBlock_Plus) == 0x000268, "Member 'UHUD_XP_Feed_Entry_C::CommonTextBlock_Plus' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, CommonTextBlock_xp) == 0x000270, "Member 'UHUD_XP_Feed_Entry_C::CommonTextBlock_xp' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, HorizontalBox_0) == 0x000278, "Member 'UHUD_XP_Feed_Entry_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, Image_Flare) == 0x000280, "Member 'UHUD_XP_Feed_Entry_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, Text_Number) == 0x000288, "Member 'UHUD_XP_Feed_Entry_C::Text_Number' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, Text_Source) == 0x000290, "Member 'UHUD_XP_Feed_Entry_C::Text_Source' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, TransformCache) == 0x000298, "Member 'UHUD_XP_Feed_Entry_C::TransformCache' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleIn_Animation_Name) == 0x0002B4, "Member 'UHUD_XP_Feed_Entry_C::ScaleIn_Animation_Name' has a wrong offset!");
static_assert(offsetof(UHUD_XP_Feed_Entry_C, ScaleOut_Animation_Name) == 0x0002BC, "Member 'UHUD_XP_Feed_Entry_C::ScaleOut_Animation_Name' has a wrong offset!");

}

