#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_InteractionPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.EventSetText
// 0x0018 (0x0018 - 0x0000)
struct HUD_InteractionPoint_C_EventSetText final
{
public:
	class FText                                   Param_DetailText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(HUD_InteractionPoint_C_EventSetText) == 0x000008, "Wrong alignment on HUD_InteractionPoint_C_EventSetText");
static_assert(sizeof(HUD_InteractionPoint_C_EventSetText) == 0x000018, "Wrong size on HUD_InteractionPoint_C_EventSetText");
static_assert(offsetof(HUD_InteractionPoint_C_EventSetText, Param_DetailText) == 0x000000, "Member 'HUD_InteractionPoint_C_EventSetText::Param_DetailText' has a wrong offset!");

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.SetDistantIcon
// 0x0090 (0x0090 - 0x0000)
struct HUD_InteractionPoint_C_SetDistantIcon final
{
public:
	struct FSlateBrush                            Icon;                                              // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Default;                                           // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideArrow;                                         // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_InteractionPoint_C_SetDistantIcon) == 0x000008, "Wrong alignment on HUD_InteractionPoint_C_SetDistantIcon");
static_assert(sizeof(HUD_InteractionPoint_C_SetDistantIcon) == 0x000090, "Wrong size on HUD_InteractionPoint_C_SetDistantIcon");
static_assert(offsetof(HUD_InteractionPoint_C_SetDistantIcon, Icon) == 0x000000, "Member 'HUD_InteractionPoint_C_SetDistantIcon::Icon' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_SetDistantIcon, Default) == 0x000088, "Member 'HUD_InteractionPoint_C_SetDistantIcon::Default' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_SetDistantIcon, HideArrow) == 0x000089, "Member 'HUD_InteractionPoint_C_SetDistantIcon::HideArrow' has a wrong offset!");

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.SetDetailIcon
// 0x0090 (0x0090 - 0x0000)
struct HUD_InteractionPoint_C_SetDetailIcon final
{
public:
	struct FSlateBrush                            Icon;                                              // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ShowWithText;                                      // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideArrow;                                         // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_InteractionPoint_C_SetDetailIcon) == 0x000008, "Wrong alignment on HUD_InteractionPoint_C_SetDetailIcon");
static_assert(sizeof(HUD_InteractionPoint_C_SetDetailIcon) == 0x000090, "Wrong size on HUD_InteractionPoint_C_SetDetailIcon");
static_assert(offsetof(HUD_InteractionPoint_C_SetDetailIcon, Icon) == 0x000000, "Member 'HUD_InteractionPoint_C_SetDetailIcon::Icon' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_SetDetailIcon, ShowWithText) == 0x000088, "Member 'HUD_InteractionPoint_C_SetDetailIcon::ShowWithText' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_SetDetailIcon, HideArrow) == 0x000089, "Member 'HUD_InteractionPoint_C_SetDetailIcon::HideArrow' has a wrong offset!");

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.EventClamp
// 0x000C (0x000C - 0x0000)
struct HUD_InteractionPoint_C_EventClamp final
{
public:
	bool                                          IsClamped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Position;                                          // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_InteractionPoint_C_EventClamp) == 0x000004, "Wrong alignment on HUD_InteractionPoint_C_EventClamp");
static_assert(sizeof(HUD_InteractionPoint_C_EventClamp) == 0x00000C, "Wrong size on HUD_InteractionPoint_C_EventClamp");
static_assert(offsetof(HUD_InteractionPoint_C_EventClamp, IsClamped) == 0x000000, "Member 'HUD_InteractionPoint_C_EventClamp::IsClamped' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_EventClamp, Position) == 0x000004, "Member 'HUD_InteractionPoint_C_EventClamp::Position' has a wrong offset!");

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.EventShowDetail
// 0x0001 (0x0001 - 0x0000)
struct HUD_InteractionPoint_C_EventShowDetail final
{
public:
	bool                                          ShowDetail;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_InteractionPoint_C_EventShowDetail) == 0x000001, "Wrong alignment on HUD_InteractionPoint_C_EventShowDetail");
static_assert(sizeof(HUD_InteractionPoint_C_EventShowDetail) == 0x000001, "Wrong size on HUD_InteractionPoint_C_EventShowDetail");
static_assert(offsetof(HUD_InteractionPoint_C_EventShowDetail, ShowDetail) == 0x000000, "Member 'HUD_InteractionPoint_C_EventShowDetail::ShowDetail' has a wrong offset!");

// Function HUD_InteractionPoint.HUD_InteractionPoint_C.ExecuteUbergraph_HUD_InteractionPoint
// 0x0210 (0x0210 - 0x0000)
struct HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BA[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BB[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_DetailText;                     // 0x0028(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BD[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	struct FSlateBrush                            K2Node_CustomEvent_Icon_1;                         // 0x00B0(0x0088)()
	bool                                          K2Node_CustomEvent_Default;                        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HideArrow_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BE[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_CustomEvent_Icon;                           // 0x0140(0x0088)()
	bool                                          K2Node_CustomEvent_ShowWithText;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HideArrow;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BF[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53C0[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isClamped;                      // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53C1[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_Position;                       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowDetail;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C2[0x2];                                     // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_6;                           // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue_1;        // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint) == 0x000008, "Wrong alignment on HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint");
static_assert(sizeof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint) == 0x000210, "Wrong size on HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, EntryPoint) == 0x000000, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable) == 0x00000C, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable) == 0x000010, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable_1) == 0x000014, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_1) == 0x000018, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable) == 0x000019, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_1) == 0x00001A, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_2) == 0x00001B, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_2) == 0x00001C, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_3) == 0x00001D, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_3) == 0x00001E, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_4) == 0x00001F, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_5) == 0x000020, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_6) == 0x000021, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_DetailText) == 0x000028, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_DetailText' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_byte_Variable_7) == 0x000040, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Split_LeftS) == 0x000058, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Split_RightS) == 0x000068, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Split_ReturnValue) == 0x000078, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_4) == 0x000079, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_Icon_1) == 0x0000B0, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_Icon_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_Default) == 0x000138, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_Default' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_HideArrow_1) == 0x000139, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_HideArrow_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_Icon) == 0x000140, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_ShowWithText) == 0x0001C8, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_ShowWithText' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_HideArrow) == 0x0001C9, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_HideArrow' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default) == 0x0001CA, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_1) == 0x0001CB, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_2) == 0x0001CC, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_3) == 0x0001D0, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable_2) == 0x0001D4, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable_3) == 0x0001D8, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_5) == 0x0001DC, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_4) == 0x0001E0, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable_4) == 0x0001E4, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_int_Variable_5) == 0x0001E8, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, Temp_bool_Variable_6) == 0x0001EC, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_isClamped) == 0x0001ED, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_isClamped' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_Position) == 0x0001F0, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_Position' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_CustomEvent_ShowDetail) == 0x0001F8, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_CustomEvent_ShowDetail' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_5) == 0x0001F9, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, K2Node_Select_Default_6) == 0x0001FC, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000200, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_PlayAnimationByName_ReturnValue) == 0x000208, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint, CallFunc_PlayAnimationByName_ReturnValue_1) == 0x000209, "Member 'HUD_InteractionPoint_C_ExecuteUbergraph_HUD_InteractionPoint::CallFunc_PlayAnimationByName_ReturnValue_1' has a wrong offset!");

}

