#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTabButtonReplay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function IconTabButtonReplay.IconTabButtonReplay_C.ExecuteUbergraph_IconTabButtonReplay
// 0x01F0 (0x01F0 - 0x0000)
struct IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C56[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C57[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0020(0x00A0)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C58[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00C8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0150(0x0088)()
	bool                                          CallFunc_GetSelected_ReturnValue_2;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C59[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay");
static_assert(sizeof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay) == 0x0001F0, "Wrong size on IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, EntryPoint) == 0x000000, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000008, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, K2Node_Event_IsDesignTime) == 0x000010, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetCurrentTextStyleClass_ReturnValue_1) == 0x000018, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetCurrentTextStyleClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, K2Node_Event_TabLabelInfo) == 0x000020, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C0, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetSelected_ReturnValue) == 0x0000C1, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetSelected_ReturnValue_1) == 0x0000C2, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, K2Node_MakeStruct_SlateBrush) == 0x0000C8, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, K2Node_MakeStruct_SlateBrush_1) == 0x000150, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetSelected_ReturnValue_2) == 0x0001D8, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetSelected_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetContext_ReturnValue) == 0x0001E0, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_GetCurrentInputType_ReturnValue) == 0x0001E8, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001E9, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay, CallFunc_BooleanAND_ReturnValue) == 0x0001EA, "Member 'IconTabButtonReplay_C_ExecuteUbergraph_IconTabButtonReplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.SetTabLabelInfo
// 0x00A0 (0x00A0 - 0x0000)
struct IconTabButtonReplay_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(IconTabButtonReplay_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_SetTabLabelInfo");
static_assert(sizeof(IconTabButtonReplay_C_SetTabLabelInfo) == 0x0000A0, "Wrong size on IconTabButtonReplay_C_SetTabLabelInfo");
static_assert(offsetof(IconTabButtonReplay_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'IconTabButtonReplay_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct IconTabButtonReplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IconTabButtonReplay_C_PreConstruct) == 0x000001, "Wrong alignment on IconTabButtonReplay_C_PreConstruct");
static_assert(sizeof(IconTabButtonReplay_C_PreConstruct) == 0x000001, "Wrong size on IconTabButtonReplay_C_PreConstruct");
static_assert(offsetof(IconTabButtonReplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'IconTabButtonReplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.Set Text
// 0x0038 (0x0038 - 0x0000)
struct IconTabButtonReplay_C_Set_Text final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5A[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IconTabButtonReplay_C_Set_Text) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_Set_Text");
static_assert(sizeof(IconTabButtonReplay_C_Set_Text) == 0x000038, "Wrong size on IconTabButtonReplay_C_Set_Text");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, Param_ButtonText) == 0x000000, "Member 'IconTabButtonReplay_C_Set_Text::Param_ButtonText' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'IconTabButtonReplay_C_Set_Text::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'IconTabButtonReplay_C_Set_Text::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'IconTabButtonReplay_C_Set_Text::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'IconTabButtonReplay_C_Set_Text::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Set_Text, CallFunc_Create_Basic_Tooltip_Output) == 0x000030, "Member 'IconTabButtonReplay_C_Set_Text::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.Set Icon
// 0x0088 (0x0088 - 0x0000)
struct IconTabButtonReplay_C_Set_Icon final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(IconTabButtonReplay_C_Set_Icon) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_Set_Icon");
static_assert(sizeof(IconTabButtonReplay_C_Set_Icon) == 0x000088, "Wrong size on IconTabButtonReplay_C_Set_Icon");
static_assert(offsetof(IconTabButtonReplay_C_Set_Icon, Param_IconBrush) == 0x000000, "Member 'IconTabButtonReplay_C_Set_Icon::Param_IconBrush' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.SetTutorialBorderStyle
// 0x0008 (0x0008 - 0x0000)
struct IconTabButtonReplay_C_SetTutorialBorderStyle final
{
public:
	class UClass*                                 BorderStyle;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IconTabButtonReplay_C_SetTutorialBorderStyle) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_SetTutorialBorderStyle");
static_assert(sizeof(IconTabButtonReplay_C_SetTutorialBorderStyle) == 0x000008, "Wrong size on IconTabButtonReplay_C_SetTutorialBorderStyle");
static_assert(offsetof(IconTabButtonReplay_C_SetTutorialBorderStyle, BorderStyle) == 0x000000, "Member 'IconTabButtonReplay_C_SetTutorialBorderStyle::BorderStyle' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.Update Bang State
// 0x0004 (0x0004 - 0x0000)
struct IconTabButtonReplay_C_Update_Bang_State final
{
public:
	bool                                          Param_bBangEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IconTabButtonReplay_C_Update_Bang_State) == 0x000001, "Wrong alignment on IconTabButtonReplay_C_Update_Bang_State");
static_assert(sizeof(IconTabButtonReplay_C_Update_Bang_State) == 0x000004, "Wrong size on IconTabButtonReplay_C_Update_Bang_State");
static_assert(offsetof(IconTabButtonReplay_C_Update_Bang_State, Param_bBangEnabled) == 0x000000, "Member 'IconTabButtonReplay_C_Update_Bang_State::Param_bBangEnabled' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Update_Bang_State, CallFunc_GetIsEnabled_ReturnValue) == 0x000001, "Member 'IconTabButtonReplay_C_Update_Bang_State::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Update_Bang_State, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'IconTabButtonReplay_C_Update_Bang_State::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_Update_Bang_State, CallFunc_BooleanAND_ReturnValue_1) == 0x000003, "Member 'IconTabButtonReplay_C_Update_Bang_State::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function IconTabButtonReplay.IconTabButtonReplay_C.SetChangeIconColorWhenSelected
// 0x0088 (0x0088 - 0x0000)
struct IconTabButtonReplay_C_SetChangeIconColorWhenSelected final
{
public:
	bool                                          ChangeColorWhenSelected;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            SelectedColor;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            UnselectedColor;                                   // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5D[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0060(0x0028)()
};
static_assert(alignof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected) == 0x000008, "Wrong alignment on IconTabButtonReplay_C_SetChangeIconColorWhenSelected");
static_assert(sizeof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected) == 0x000088, "Wrong size on IconTabButtonReplay_C_SetChangeIconColorWhenSelected");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, ChangeColorWhenSelected) == 0x000000, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::ChangeColorWhenSelected' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, SelectedColor) == 0x000008, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::SelectedColor' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, UnselectedColor) == 0x000030, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::UnselectedColor' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, Temp_bool_Variable) == 0x000058, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, CallFunc_GetSelected_ReturnValue) == 0x000059, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(IconTabButtonReplay_C_SetChangeIconColorWhenSelected, K2Node_Select_Default) == 0x000060, "Member 'IconTabButtonReplay_C_SetChangeIconColorWhenSelected::K2Node_Select_Default' has a wrong offset!");

}

