#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTabButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTabButton.IconTabButton_C
// 0x0158 (0x0CC8 - 0x0B70)
class UIconTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNormalBangWrapper_C*                   BangWrapper;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxShell;                                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0BA0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BB8(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5123[0x3];                                     // 0x0C41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x0C44(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x0C54(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x0C64(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x0C74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeIconColorWhenSelected;                       // 0x0C75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5124[0x2];                                     // 0x0C76(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            SelectedIconColor;                                 // 0x0C78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UnSelectedIconColor;                               // 0x0CA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Play_Hover_Sound();
	void SetChangeIconColorWhenSelected(bool ChangeColorWhenSelected, const struct FSlateColor& SelectedColor, const struct FSlateColor& UnselectedColor);
	void Update_Bang_State(bool Param_bBangEnabled, int32 Count);
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void ShowText();
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void Set_Text(const class FText& Param_ButtonText);
	void PreConstruct(bool IsDesignTime);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void BP_OnSelected();
	void BP_OnDeselected();
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnEnabled();
	void BP_OnDisabled();
	void OnCurrentTextStyleChanged();
	void ExecuteUbergraph_IconTabButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTabButton_C">();
	}
	static class UIconTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTabButton_C>();
	}
};
static_assert(alignof(UIconTabButton_C) == 0x000008, "Wrong alignment on UIconTabButton_C");
static_assert(sizeof(UIconTabButton_C) == 0x000CC8, "Wrong size on UIconTabButton_C");
static_assert(offsetof(UIconTabButton_C, UberGraphFrame) == 0x000B70, "Member 'UIconTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, BangWrapper) == 0x000B78, "Member 'UIconTabButton_C::BangWrapper' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, CenterButtonTextWidget) == 0x000B80, "Member 'UIconTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, ContentHB) == 0x000B88, "Member 'UIconTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, LeftSideImage) == 0x000B90, "Member 'UIconTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, SizeBoxShell) == 0x000B98, "Member 'UIconTabButton_C::SizeBoxShell' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, ButtonText) == 0x000BA0, "Member 'UIconTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, IconBrush) == 0x000BB8, "Member 'UIconTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, UseText) == 0x000C40, "Member 'UIconTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, SelectedIconTint) == 0x000C44, "Member 'UIconTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, DeselectedIconTint) == 0x000C54, "Member 'UIconTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, HoveredIconTint) == 0x000C64, "Member 'UIconTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, bBangEnabled) == 0x000C74, "Member 'UIconTabButton_C::bBangEnabled' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, ChangeIconColorWhenSelected) == 0x000C75, "Member 'UIconTabButton_C::ChangeIconColorWhenSelected' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, SelectedIconColor) == 0x000C78, "Member 'UIconTabButton_C::SelectedIconColor' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, UnSelectedIconColor) == 0x000CA0, "Member 'UIconTabButton_C::UnSelectedIconColor' has a wrong offset!");

}

