#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTabButtonReplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTabButtonReplay.IconTabButtonReplay_C
// 0x0180 (0x0CF0 - 0x0B70)
class UIconTabButtonReplay_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNormalBangWrapper_C*                   BangWrapper;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisabledImage;                                     // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxShell;                                      // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0BA8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BC0(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C54[0x3];                                     // 0x0C49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x0C4C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x0C5C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x0C6C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledIconTint;                                  // 0x0C7C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x0C8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeIconColorWhenSelected;                       // 0x0C8D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C55[0x2];                                     // 0x0C8E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            SelectedIconColor;                                 // 0x0C90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UnSelectedIconColor;                               // 0x0CB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             CameraButtonHoverSound;                            // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CameraButtonSelectSound;                           // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IconTabButtonReplay(int32 EntryPoint);
	void OnCurrentTextStyleChanged();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Construct();
	void BP_OnDeselected();
	void BP_OnSelected();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& Param_ButtonText);
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void ShowText();
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void Update_Bang_State(bool Param_bBangEnabled);
	void SetChangeIconColorWhenSelected(bool ChangeColorWhenSelected, const struct FSlateColor& SelectedColor, const struct FSlateColor& UnselectedColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTabButtonReplay_C">();
	}
	static class UIconTabButtonReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTabButtonReplay_C>();
	}
};
static_assert(alignof(UIconTabButtonReplay_C) == 0x000008, "Wrong alignment on UIconTabButtonReplay_C");
static_assert(sizeof(UIconTabButtonReplay_C) == 0x000CF0, "Wrong size on UIconTabButtonReplay_C");
static_assert(offsetof(UIconTabButtonReplay_C, UberGraphFrame) == 0x000B70, "Member 'UIconTabButtonReplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, BangWrapper) == 0x000B78, "Member 'UIconTabButtonReplay_C::BangWrapper' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, CenterButtonTextWidget) == 0x000B80, "Member 'UIconTabButtonReplay_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, ContentHB) == 0x000B88, "Member 'UIconTabButtonReplay_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, DisabledImage) == 0x000B90, "Member 'UIconTabButtonReplay_C::DisabledImage' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, LeftSideImage) == 0x000B98, "Member 'UIconTabButtonReplay_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, SizeBoxShell) == 0x000BA0, "Member 'UIconTabButtonReplay_C::SizeBoxShell' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, ButtonText) == 0x000BA8, "Member 'UIconTabButtonReplay_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, IconBrush) == 0x000BC0, "Member 'UIconTabButtonReplay_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, UseText) == 0x000C48, "Member 'UIconTabButtonReplay_C::UseText' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, SelectedIconTint) == 0x000C4C, "Member 'UIconTabButtonReplay_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, DeselectedIconTint) == 0x000C5C, "Member 'UIconTabButtonReplay_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, HoveredIconTint) == 0x000C6C, "Member 'UIconTabButtonReplay_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, DisabledIconTint) == 0x000C7C, "Member 'UIconTabButtonReplay_C::DisabledIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, bBangEnabled) == 0x000C8C, "Member 'UIconTabButtonReplay_C::bBangEnabled' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, ChangeIconColorWhenSelected) == 0x000C8D, "Member 'UIconTabButtonReplay_C::ChangeIconColorWhenSelected' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, SelectedIconColor) == 0x000C90, "Member 'UIconTabButtonReplay_C::SelectedIconColor' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, UnSelectedIconColor) == 0x000CB8, "Member 'UIconTabButtonReplay_C::UnSelectedIconColor' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, CameraButtonHoverSound) == 0x000CE0, "Member 'UIconTabButtonReplay_C::CameraButtonHoverSound' has a wrong offset!");
static_assert(offsetof(UIconTabButtonReplay_C, CameraButtonSelectSound) == 0x000CE8, "Member 'UIconTabButtonReplay_C::CameraButtonSelectSound' has a wrong offset!");

}

