#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTextButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTextButton.IconTextButton_C
// 0x0100 (0x0C70 - 0x0B70)
class UIconTextButton_C : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0B98(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BB0(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMouseKeyboardStyleSet;                            // 0x0C49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55EE[0x6];                                     // 0x0C4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideButtonText;                                // 0x0C50(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ETextJustify                                  ButtonTextJustification;                           // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bDisplayAllCaps;                                   // 0x0C69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_55EF[0x2];                                     // 0x0C6A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PressProgress;                                     // 0x0C6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IconTextButton(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PreConstruct(bool IsDesignTime);
	void OnCurrentTextStyleChanged();
	void Set_Text(const class FText& Param_ButtonText);
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void InitializeButton();
	void UpdateTextAndStyle(ECommonInputType InputType);
	void SetControllerStyle(class UClass* Param_ControllerInputStyle);
	void UpdateText();
	void UpdateStyle(bool UsingGamepad);
	void SetMouseKeyboardStyle(class UClass* Param_ControllerInputStyle);
	void UpdateContentAlignment();
	void SetContentAlignment(EHorizontalAlignment Param_ContentAlignment);
	void UpdateTextStyle();
	void SetInitialMouseKeyboardStyle();
	void SetTextInternal(const class FText& InButtonText);
	void ShowIcon(bool bShouldShow);
	void Get_Dynamic_Material(class UMaterialInstanceDynamic** Ret_Material);
	void GetPressProgress(float* Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTextButton_C">();
	}
	static class UIconTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTextButton_C>();
	}
};
static_assert(alignof(UIconTextButton_C) == 0x000008, "Wrong alignment on UIconTextButton_C");
static_assert(sizeof(UIconTextButton_C) == 0x000C70, "Wrong size on UIconTextButton_C");
static_assert(offsetof(UIconTextButton_C, UberGraphFrame) == 0x000B70, "Member 'UIconTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, CenterButtonTextWidget) == 0x000B78, "Member 'UIconTextButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ContentBorder) == 0x000B80, "Member 'UIconTextButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, LeftSideImage) == 0x000B88, "Member 'UIconTextButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, RightExtraContentSlot) == 0x000B90, "Member 'UIconTextButton_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ButtonText) == 0x000B98, "Member 'UIconTextButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, IconBrush) == 0x000BB0, "Member 'UIconTextButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ControllerInputStyle) == 0x000C38, "Member 'UIconTextButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, MouseKeyboardStyle) == 0x000C40, "Member 'UIconTextButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ContentAlignment) == 0x000C48, "Member 'UIconTextButton_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, bMouseKeyboardStyleSet) == 0x000C49, "Member 'UIconTextButton_C::bMouseKeyboardStyleSet' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, OverrideButtonText) == 0x000C50, "Member 'UIconTextButton_C::OverrideButtonText' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, ButtonTextJustification) == 0x000C68, "Member 'UIconTextButton_C::ButtonTextJustification' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, bDisplayAllCaps) == 0x000C69, "Member 'UIconTextButton_C::bDisplayAllCaps' has a wrong offset!");
static_assert(offsetof(UIconTextButton_C, PressProgress) == 0x000C6C, "Member 'UIconTextButton_C::PressProgress' has a wrong offset!");

}

