#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTextButtonReplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTextButtonReplay.IconTextButtonReplay_C
// 0x0130 (0x0CA0 - 0x0B70)
class UIconTextButtonReplay_C final : public UIconTextButtonSpectatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0BA0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BB8(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ButtonClickAction;                                 // 0x0C50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x0C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CDA[0x3];                                     // 0x0C61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HoveredColor;                                      // 0x0C64(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x0C74(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 PressedColor;                                      // 0x0C84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColor;                                     // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideIcon;                                    // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_IconTextButtonReplay(int32 EntryPoint);
	void SetText(const class FText& Text);
	void BP_OnDeselected();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Construct();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PreConstruct(bool IsDesignTime);
	void OnCurrentTextStyleChanged();
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void InitializeButton();
	void UpdateTextAndStyle(bool bUsingGamepad);
	void SetControllerStyle(class UClass* Param_ControllerInputStyle);
	void UpdateText();
	void UpdateStyle(bool UsingGamepad);
	void SetMouseKeyboardStyle(class UClass* Param_ControllerInputStyle);
	void UpdateContentAlignment();
	void SetContentAlignment(EHorizontalAlignment Param_ContentAlignment);
	void UpdateTextStyle();
	void ActivateButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTextButtonReplay_C">();
	}
	static class UIconTextButtonReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTextButtonReplay_C>();
	}
};
static_assert(alignof(UIconTextButtonReplay_C) == 0x000008, "Wrong alignment on UIconTextButtonReplay_C");
static_assert(sizeof(UIconTextButtonReplay_C) == 0x000CA0, "Wrong size on UIconTextButtonReplay_C");
static_assert(offsetof(UIconTextButtonReplay_C, UberGraphFrame) == 0x000B70, "Member 'UIconTextButtonReplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, Background) == 0x000B78, "Member 'UIconTextButtonReplay_C::Background' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, CenterButtonTextWidget) == 0x000B80, "Member 'UIconTextButtonReplay_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ContentBorder) == 0x000B88, "Member 'UIconTextButtonReplay_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, Image) == 0x000B90, "Member 'UIconTextButtonReplay_C::Image' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, RightExtraContentSlot) == 0x000B98, "Member 'UIconTextButtonReplay_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ButtonText) == 0x000BA0, "Member 'UIconTextButtonReplay_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, IconBrush) == 0x000BB8, "Member 'UIconTextButtonReplay_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ControllerInputStyle) == 0x000C40, "Member 'UIconTextButtonReplay_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, MouseKeyboardStyle) == 0x000C48, "Member 'UIconTextButtonReplay_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ButtonClickAction) == 0x000C50, "Member 'UIconTextButtonReplay_C::ButtonClickAction' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ContentAlignment) == 0x000C60, "Member 'UIconTextButtonReplay_C::ContentAlignment' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, HoveredColor) == 0x000C64, "Member 'UIconTextButtonReplay_C::HoveredColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, DefaultColor) == 0x000C74, "Member 'UIconTextButtonReplay_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, PressedColor) == 0x000C84, "Member 'UIconTextButtonReplay_C::PressedColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, SelectedColor) == 0x000C88, "Member 'UIconTextButtonReplay_C::SelectedColor' has a wrong offset!");
static_assert(offsetof(UIconTextButtonReplay_C, ShouldHideIcon) == 0x000C98, "Member 'UIconTextButtonReplay_C::ShouldHideIcon' has a wrong offset!");

}

