#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterestIndicatorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InterestIndicatorWidget.InterestIndicatorWidget_C
// 0x0048 (0x0318 - 0x02D0)
class UInterestIndicatorWidget_C final : public UFortActorIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_2;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 backgroundpulse;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           BottomCanvasPanelContainer;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DecriptionText;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Largespinring;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smallspinring;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InterestIndicatorWidget(int32 EntryPoint);
	void Destruct();
	void Construct();
	void SetDisplayText(const class FText& Description);
	void SetDisplayImage(class UTexture2D* Icon);
	void InitPointOfInterest(class AActor* PointOfInterest, const class FText& DisplayText, class UTexture2D* DisplayImage, const struct FLinearColor& ImageColor);
	void RemovePointOfInterest(class AActor* PointOfInterest, bool* Removed);

	class UCanvasPanel* GetCanvasPanelContainer(EFortActorIndicatorContainerWidget ContainerEnum) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InterestIndicatorWidget_C">();
	}
	static class UInterestIndicatorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterestIndicatorWidget_C>();
	}
};
static_assert(alignof(UInterestIndicatorWidget_C) == 0x000008, "Wrong alignment on UInterestIndicatorWidget_C");
static_assert(sizeof(UInterestIndicatorWidget_C) == 0x000318, "Wrong size on UInterestIndicatorWidget_C");
static_assert(offsetof(UInterestIndicatorWidget_C, UberGraphFrame) == 0x0002D0, "Member 'UInterestIndicatorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, NewAnimation_2) == 0x0002D8, "Member 'UInterestIndicatorWidget_C::NewAnimation_2' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, NewAnimation_1) == 0x0002E0, "Member 'UInterestIndicatorWidget_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, backgroundpulse) == 0x0002E8, "Member 'UInterestIndicatorWidget_C::backgroundpulse' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, BottomCanvasPanelContainer) == 0x0002F0, "Member 'UInterestIndicatorWidget_C::BottomCanvasPanelContainer' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, Center) == 0x0002F8, "Member 'UInterestIndicatorWidget_C::Center' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, DecriptionText) == 0x000300, "Member 'UInterestIndicatorWidget_C::DecriptionText' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, Largespinring) == 0x000308, "Member 'UInterestIndicatorWidget_C::Largespinring' has a wrong offset!");
static_assert(offsetof(UInterestIndicatorWidget_C, Smallspinring) == 0x000310, "Member 'UInterestIndicatorWidget_C::Smallspinring' has a wrong offset!");

}

