#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InZoneTitleBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InZoneTitleBar.InZoneTitleBar_C
// 0x0040 (0x0270 - 0x0230)
class UInZoneTitleBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FortniteLogo;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      MainMenuButton;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PartyFlash;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Top;                                               // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TouchZone;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWindowchromebuttons_C*                 Windowchromebuttons;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply On_TouchZone_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_InZoneTitleBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InZoneTitleBar_C">();
	}
	static class UInZoneTitleBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInZoneTitleBar_C>();
	}
};
static_assert(alignof(UInZoneTitleBar_C) == 0x000008, "Wrong alignment on UInZoneTitleBar_C");
static_assert(sizeof(UInZoneTitleBar_C) == 0x000270, "Wrong size on UInZoneTitleBar_C");
static_assert(offsetof(UInZoneTitleBar_C, UberGraphFrame) == 0x000230, "Member 'UInZoneTitleBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, FortniteLogo) == 0x000238, "Member 'UInZoneTitleBar_C::FortniteLogo' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, MainMenuButton) == 0x000240, "Member 'UInZoneTitleBar_C::MainMenuButton' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, PartyFlash) == 0x000248, "Member 'UInZoneTitleBar_C::PartyFlash' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, SafeZone_0) == 0x000250, "Member 'UInZoneTitleBar_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, Top) == 0x000258, "Member 'UInZoneTitleBar_C::Top' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, TouchZone) == 0x000260, "Member 'UInZoneTitleBar_C::TouchZone' has a wrong offset!");
static_assert(offsetof(UInZoneTitleBar_C, Windowchromebuttons) == 0x000268, "Member 'UInZoneTitleBar_C::Windowchromebuttons' has a wrong offset!");

}

