#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationGenericRewardHeader

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemPresentationGenericRewardHeader.ItemPresentationGenericRewardHeader_C
// 0x0018 (0x0298 - 0x0280)
class UItemPresentationGenericRewardHeader_C final : public UFortItemReceivedHeaderBase
{
public:
	class UWidgetAnimation*                       FadeAnim;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void HandleOutro();
	void HandleInitialState();
	void HandleIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemPresentationGenericRewardHeader_C">();
	}
	static class UItemPresentationGenericRewardHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemPresentationGenericRewardHeader_C>();
	}
};
static_assert(alignof(UItemPresentationGenericRewardHeader_C) == 0x000008, "Wrong alignment on UItemPresentationGenericRewardHeader_C");
static_assert(sizeof(UItemPresentationGenericRewardHeader_C) == 0x000298, "Wrong size on UItemPresentationGenericRewardHeader_C");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, FadeAnim) == 0x000280, "Member 'UItemPresentationGenericRewardHeader_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, InitialState) == 0x000288, "Member 'UItemPresentationGenericRewardHeader_C::InitialState' has a wrong offset!");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, IntroAnim) == 0x000290, "Member 'UItemPresentationGenericRewardHeader_C::IntroAnim' has a wrong offset!");

}

