#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInfoPresentationWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemInfoPresentationWidget.ItemInfoPresentationWidget_C.HandleOutro
// 0x0008 (0x0008 - 0x0000)
struct ItemInfoPresentationWidget_C_HandleOutro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInfoPresentationWidget_C_HandleOutro) == 0x000008, "Wrong alignment on ItemInfoPresentationWidget_C_HandleOutro");
static_assert(sizeof(ItemInfoPresentationWidget_C_HandleOutro) == 0x000008, "Wrong size on ItemInfoPresentationWidget_C_HandleOutro");
static_assert(offsetof(ItemInfoPresentationWidget_C_HandleOutro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ItemInfoPresentationWidget_C_HandleOutro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ItemInfoPresentationWidget.ItemInfoPresentationWidget_C.HandleInitialState
// 0x0008 (0x0008 - 0x0000)
struct ItemInfoPresentationWidget_C_HandleInitialState final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInfoPresentationWidget_C_HandleInitialState) == 0x000008, "Wrong alignment on ItemInfoPresentationWidget_C_HandleInitialState");
static_assert(sizeof(ItemInfoPresentationWidget_C_HandleInitialState) == 0x000008, "Wrong size on ItemInfoPresentationWidget_C_HandleInitialState");
static_assert(offsetof(ItemInfoPresentationWidget_C_HandleInitialState, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ItemInfoPresentationWidget_C_HandleInitialState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ItemInfoPresentationWidget.ItemInfoPresentationWidget_C.HandleIntro
// 0x0008 (0x0008 - 0x0000)
struct ItemInfoPresentationWidget_C_HandleIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInfoPresentationWidget_C_HandleIntro) == 0x000008, "Wrong alignment on ItemInfoPresentationWidget_C_HandleIntro");
static_assert(sizeof(ItemInfoPresentationWidget_C_HandleIntro) == 0x000008, "Wrong size on ItemInfoPresentationWidget_C_HandleIntro");
static_assert(offsetof(ItemInfoPresentationWidget_C_HandleIntro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ItemInfoPresentationWidget_C_HandleIntro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

