#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemPresentationScreen.ItemPresentationScreen_C
// 0x00E0 (0x0750 - 0x0670)
class UItemPresentationScreen_C final : public UFortItemPresentationScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PaidItemFadeInAll;                                 // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PaidItemFadeIn;                                    // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonScrollIn;                                    // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Equipped;                                          // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialStateSet;                                   // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnOwnedMessage;                                    // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collected;                                         // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ClaimMoreRewards;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefaultContent;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                EntryBoxDummy_PaidItems;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FakeHackGradient;                                  // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LeftsideContentSwitcher;                           // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PaidItemBacking;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RegularButtons;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_Buttons;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_FreeVsPaidItemsEntryBox;                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_FreeVsPaidItemsListView;                  // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWinterfest_CabinLogo_C*                Winterfest_CabinLogo;                              // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WinterfestAnimBoundVB;                             // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WinterfestButtons;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WinterfestContent;                                 // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWinterQuestPresentTag_C*               WinterQuestPresentTag;                             // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDelayIntro;                                       // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74B6[0x3];                                     // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeFloat;                                         // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bSwitchingPhases;                                  // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HandleFadeAnimFinished();
	void HandlePaidItemIntro();
	void StartFade(bool bCloseScreen);
	void PlayIntro();
	void HandleAnimationInitialState();
	void BP_OnActivated();
	void OnUpdateHeaderInformation(const struct FFortItemHeaderInformation& HeaderInformation);
	void OnUpdateItemInformation(const class UFortItem* FortItem);
	void OnUpdateOwnedItemText(bool bShowText);
	void OnUpdateItemEquipped();
	void OnInitialIconAnimation(bool bUsingListView);
	void OnDisplayEquipButton(bool bCanEquip);
	void OnCloseScreen();
	void OnUpdateNextButtonText(bool bShowNext);
	void OnFinishDisplayingHotItems(bool bShowOtherRewards);
	void OnDisplayItemsCollectedText(bool bCloseScreen);
	void SwitchToPaidItems();
	void ExecuteUbergraph_ItemPresentationScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemPresentationScreen_C">();
	}
	static class UItemPresentationScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemPresentationScreen_C>();
	}
};
static_assert(alignof(UItemPresentationScreen_C) == 0x000008, "Wrong alignment on UItemPresentationScreen_C");
static_assert(sizeof(UItemPresentationScreen_C) == 0x000750, "Wrong size on UItemPresentationScreen_C");
static_assert(offsetof(UItemPresentationScreen_C, UberGraphFrame) == 0x000670, "Member 'UItemPresentationScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, PaidItemFadeInAll) == 0x000678, "Member 'UItemPresentationScreen_C::PaidItemFadeInAll' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, PaidItemFadeIn) == 0x000680, "Member 'UItemPresentationScreen_C::PaidItemFadeIn' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, ButtonScrollIn) == 0x000688, "Member 'UItemPresentationScreen_C::ButtonScrollIn' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Fade) == 0x000690, "Member 'UItemPresentationScreen_C::Fade' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Equipped) == 0x000698, "Member 'UItemPresentationScreen_C::Equipped' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, InitialStateSet) == 0x0006A0, "Member 'UItemPresentationScreen_C::InitialStateSet' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, UnOwnedMessage) == 0x0006A8, "Member 'UItemPresentationScreen_C::UnOwnedMessage' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Collected) == 0x0006B0, "Member 'UItemPresentationScreen_C::Collected' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Intro) == 0x0006B8, "Member 'UItemPresentationScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, ClaimMoreRewards) == 0x0006C0, "Member 'UItemPresentationScreen_C::ClaimMoreRewards' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, DefaultContent) == 0x0006C8, "Member 'UItemPresentationScreen_C::DefaultContent' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, EntryBoxDummy_PaidItems) == 0x0006D0, "Member 'UItemPresentationScreen_C::EntryBoxDummy_PaidItems' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, FakeHackGradient) == 0x0006D8, "Member 'UItemPresentationScreen_C::FakeHackGradient' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, LeftsideContentSwitcher) == 0x0006E0, "Member 'UItemPresentationScreen_C::LeftsideContentSwitcher' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, PaidItemBacking) == 0x0006E8, "Member 'UItemPresentationScreen_C::PaidItemBacking' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, RegularButtons) == 0x0006F0, "Member 'UItemPresentationScreen_C::RegularButtons' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, SafeZone_0) == 0x0006F8, "Member 'UItemPresentationScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Switcher_Buttons) == 0x000700, "Member 'UItemPresentationScreen_C::Switcher_Buttons' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Switcher_FreeVsPaidItemsEntryBox) == 0x000708, "Member 'UItemPresentationScreen_C::Switcher_FreeVsPaidItemsEntryBox' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Switcher_FreeVsPaidItemsListView) == 0x000710, "Member 'UItemPresentationScreen_C::Switcher_FreeVsPaidItemsListView' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, Winterfest_CabinLogo) == 0x000718, "Member 'UItemPresentationScreen_C::Winterfest_CabinLogo' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, WinterfestAnimBoundVB) == 0x000720, "Member 'UItemPresentationScreen_C::WinterfestAnimBoundVB' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, WinterfestButtons) == 0x000728, "Member 'UItemPresentationScreen_C::WinterfestButtons' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, WinterfestContent) == 0x000730, "Member 'UItemPresentationScreen_C::WinterfestContent' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, WinterQuestPresentTag) == 0x000738, "Member 'UItemPresentationScreen_C::WinterQuestPresentTag' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, bDelayIntro) == 0x000740, "Member 'UItemPresentationScreen_C::bDelayIntro' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, TimeFloat) == 0x000744, "Member 'UItemPresentationScreen_C::TimeFloat' has a wrong offset!");
static_assert(offsetof(UItemPresentationScreen_C, bSwitchingPhases) == 0x000748, "Member 'UItemPresentationScreen_C::bSwitchingPhases' has a wrong offset!");

}

