#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsHeader

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemDetailsHeader.ItemDetailsHeader_C.UpdateItemsForWidgets
// 0x0190 (0x0190 - 0x0000)
struct ItemDetailsHeader_C_UpdateItemsForWidgets final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5052[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5053[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5054[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              K2Node_DynamicCast_AsFort_Weapon_Item_Definition;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5055[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5056[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortItemType>                         K2Node_MakeArray_Array_2;                          // 0x0058(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetSchematicResultType_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5057[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue_1; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5058[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityDataForItemDef_ReturnValue;    // 0x0088(0x0080)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Select_Default;                             // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetTier_ReturnValue;                      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5059[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Tier_To_Integer_Numeric_Tier;     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505A[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	int32                                         CallFunc_GetLoadedAmmo_ReturnValue;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505B[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0150(0x0018)()
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              K2Node_DynamicCast_AsFort_Weapon_Item_Definition_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDroppedItem_ReturnValue;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUniqueAmmo_ReturnValue;                // 0x017A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue_2;                    // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemTier                                 CallFunc_GetTier_ReturnValue_1;                    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505C[0x1];                                     // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Convert_Tier_To_Integer_Numeric_Tier_1;   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505D[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemDetailsHeader_C_UpdateItemsForWidgets) == 0x000008, "Wrong alignment on ItemDetailsHeader_C_UpdateItemsForWidgets");
static_assert(sizeof(ItemDetailsHeader_C_UpdateItemsForWidgets) == 0x000190, "Wrong size on ItemDetailsHeader_C_UpdateItemsForWidgets");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_MakeArray_Array) == 0x000008, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_bool_Variable) == 0x000018, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetType_ReturnValue) == 0x000019, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsMobileGame_ReturnValue) == 0x00001B, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsMobileGame_ReturnValue_1) == 0x00001C, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetSchematicCraftingResultBP_ReturnValue) == 0x000020, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetSchematicCraftingResultBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_DynamicCast_AsFort_Weapon_Item_Definition) == 0x000030, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_DynamicCast_AsFort_Weapon_Item_Definition' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_MakeArray_Array_1) == 0x000040, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsMobileGame_ReturnValue_2) == 0x000050, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Not_PreBool_ReturnValue_1) == 0x000051, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_MakeArray_Array_2) == 0x000058, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetSchematicResultType_ReturnValue) == 0x000068, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetSchematicResultType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetSchematicCraftingResultBP_ReturnValue_1) == 0x000070, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetSchematicCraftingResultBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetType_ReturnValue_1) == 0x000078, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007A, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsValid_ReturnValue_1) == 0x00007B, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000080, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BPGetRarityDataForItemDef_ReturnValue) == 0x000088, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BPGetRarityDataForItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BooleanOR_ReturnValue) == 0x000108, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_bool_Variable_1) == 0x000109, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable) == 0x00010A, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_Select_Default) == 0x00010B, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_1) == 0x00010C, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Array_Contains_ReturnValue) == 0x00010D, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BooleanAND_ReturnValue) == 0x00010E, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Array_Contains_ReturnValue_1) == 0x00010F, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BooleanAND_ReturnValue_1) == 0x000110, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_bool_Variable_2) == 0x000111, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BooleanAND_ReturnValue_2) == 0x000112, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_Select_Default_1) == 0x000113, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetTier_ReturnValue) == 0x000114, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Convert_Tier_To_Integer_Numeric_Tier) == 0x000118, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Convert_Tier_To_Integer_Numeric_Tier' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsValid_ReturnValue_2) == 0x00011C, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_2) == 0x00011D, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_3) == 0x00011E, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_bool_Variable_3) == 0x00011F, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_Select_Default_2) == 0x000120, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_4) == 0x000121, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_5) == 0x000122, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_bool_Variable_4) == 0x000123, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_6) == 0x000124, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_Select_Default_3) == 0x000125, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, Temp_byte_Variable_7) == 0x000126, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_Select_Default_4) == 0x000127, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetNumInStack_ReturnValue) == 0x000128, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetLoadedAmmo_ReturnValue) == 0x000148, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetLoadedAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000150, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetItemDefinitionBP_ReturnValue_1) == 0x000168, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetItemDefinitionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_DynamicCast_AsFort_Weapon_Item_Definition_1) == 0x000170, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_DynamicCast_AsFort_Weapon_Item_Definition_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_IsDroppedItem_ReturnValue) == 0x000179, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_IsDroppedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_HasUniqueAmmo_ReturnValue) == 0x00017A, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_HasUniqueAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetType_ReturnValue_2) == 0x00017B, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Array_Contains_ReturnValue_2) == 0x00017C, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_GetTier_ReturnValue_1) == 0x00017D, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_GetTier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Not_PreBool_ReturnValue_3) == 0x00017E, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Convert_Tier_To_Integer_Numeric_Tier_1) == 0x000180, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Convert_Tier_To_Integer_Numeric_Tier_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_BooleanOR_ReturnValue_1) == 0x000184, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_UpdateItemsForWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x000188, "Member 'ItemDetailsHeader_C_UpdateItemsForWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function ItemDetailsHeader.ItemDetailsHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemDetailsHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemDetailsHeader_C_PreConstruct) == 0x000001, "Wrong alignment on ItemDetailsHeader_C_PreConstruct");
static_assert(sizeof(ItemDetailsHeader_C_PreConstruct) == 0x000001, "Wrong size on ItemDetailsHeader_C_PreConstruct");
static_assert(offsetof(ItemDetailsHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ItemDetailsHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ItemDetailsHeader.ItemDetailsHeader_C.ExecuteUbergraph_ItemDetailsHeader
// 0x0020 (0x0020 - 0x0000)
struct ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader) == 0x000008, "Wrong alignment on ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader");
static_assert(sizeof(ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader) == 0x000020, "Wrong size on ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader");
static_assert(offsetof(ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader, EntryPoint) == 0x000000, "Member 'ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ItemDetailsHeader_C_ExecuteUbergraph_ItemDetailsHeader::K2Node_Event_IsDesignTime' has a wrong offset!");
