#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectionMainItemDetailsHostPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemInspectionMainItemDetailsHostPanel.ItemInspectionMainItemDetailsHostPanel_C.SetItemsDetailsVisibility
// 0x000A (0x000A - 0x0000)
struct ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility final
{
public:
	bool                                          DoNotShow;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideInsteadOfCollapse;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseTransitionAnimation;                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility) == 0x000001, "Wrong alignment on ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility");
static_assert(sizeof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility) == 0x00000A, "Wrong size on ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, DoNotShow) == 0x000000, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::DoNotShow' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, HideInsteadOfCollapse) == 0x000001, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::HideInsteadOfCollapse' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, UseTransitionAnimation) == 0x000002, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::UseTransitionAnimation' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, Temp_bool_Variable) == 0x000003, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, Temp_byte_Variable) == 0x000004, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, Temp_byte_Variable_1) == 0x000005, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, Temp_bool_Variable_1) == 0x000006, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, Temp_byte_Variable_2) == 0x000007, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, K2Node_Select_Default) == 0x000008, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility, K2Node_Select_Default_1) == 0x000009, "Member 'ItemInspectionMainItemDetailsHostPanel_C_SetItemsDetailsVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function ItemInspectionMainItemDetailsHostPanel.ItemInspectionMainItemDetailsHostPanel_C.GetItemDetailsVisibility
// 0x0002 (0x0002 - 0x0000)
struct ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility) == 0x000001, "Wrong alignment on ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility");
static_assert(sizeof(ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility) == 0x000002, "Wrong size on ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility, Param_IsVisible) == 0x000000, "Member 'ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'ItemInspectionMainItemDetailsHostPanel_C_GetItemDetailsVisibility::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

}

