#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationScreen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemPresentationScreen.ItemPresentationScreen_C.HandleFadeAnimFinished
// 0x0010 (0x0010 - 0x0000)
struct ItemPresentationScreen_C_HandleFadeAnimFinished final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_HandleFadeAnimFinished) == 0x000004, "Wrong alignment on ItemPresentationScreen_C_HandleFadeAnimFinished");
static_assert(sizeof(ItemPresentationScreen_C_HandleFadeAnimFinished) == 0x000010, "Wrong size on ItemPresentationScreen_C_HandleFadeAnimFinished");
static_assert(offsetof(ItemPresentationScreen_C_HandleFadeAnimFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemPresentationScreen_C_HandleFadeAnimFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.HandlePaidItemIntro
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationScreen_C_HandlePaidItemIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationScreen_C_HandlePaidItemIntro) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_HandlePaidItemIntro");
static_assert(sizeof(ItemPresentationScreen_C_HandlePaidItemIntro) == 0x000008, "Wrong size on ItemPresentationScreen_C_HandlePaidItemIntro");
static_assert(offsetof(ItemPresentationScreen_C_HandlePaidItemIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ItemPresentationScreen_C_HandlePaidItemIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.StartFade
// 0x0020 (0x0020 - 0x0000)
struct ItemPresentationScreen_C_StartFade final
{
public:
	bool                                          bCloseScreen;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74B7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74B8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationScreen_C_StartFade) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_StartFade");
static_assert(sizeof(ItemPresentationScreen_C_StartFade) == 0x000020, "Wrong size on ItemPresentationScreen_C_StartFade");
static_assert(offsetof(ItemPresentationScreen_C_StartFade, bCloseScreen) == 0x000000, "Member 'ItemPresentationScreen_C_StartFade::bCloseScreen' has a wrong offset!");
static_assert(offsetof(ItemPresentationScreen_C_StartFade, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ItemPresentationScreen_C_StartFade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemPresentationScreen_C_StartFade, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ItemPresentationScreen_C_StartFade::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.PlayIntro
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationScreen_C_PlayIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationScreen_C_PlayIntro) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_PlayIntro");
static_assert(sizeof(ItemPresentationScreen_C_PlayIntro) == 0x000008, "Wrong size on ItemPresentationScreen_C_PlayIntro");
static_assert(offsetof(ItemPresentationScreen_C_PlayIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ItemPresentationScreen_C_PlayIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.HandleAnimationInitialState
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationScreen_C_HandleAnimationInitialState final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationScreen_C_HandleAnimationInitialState) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_HandleAnimationInitialState");
static_assert(sizeof(ItemPresentationScreen_C_HandleAnimationInitialState) == 0x000008, "Wrong size on ItemPresentationScreen_C_HandleAnimationInitialState");
static_assert(offsetof(ItemPresentationScreen_C_HandleAnimationInitialState, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ItemPresentationScreen_C_HandleAnimationInitialState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnUpdateHeaderInformation
// 0x0098 (0x0098 - 0x0000)
struct ItemPresentationScreen_C_OnUpdateHeaderInformation final
{
public:
	struct FFortItemHeaderInformation             HeaderInformation;                                 // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ItemPresentationScreen_C_OnUpdateHeaderInformation) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_OnUpdateHeaderInformation");
static_assert(sizeof(ItemPresentationScreen_C_OnUpdateHeaderInformation) == 0x000098, "Wrong size on ItemPresentationScreen_C_OnUpdateHeaderInformation");
static_assert(offsetof(ItemPresentationScreen_C_OnUpdateHeaderInformation, HeaderInformation) == 0x000000, "Member 'ItemPresentationScreen_C_OnUpdateHeaderInformation::HeaderInformation' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnUpdateItemInformation
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationScreen_C_OnUpdateItemInformation final
{
public:
	const class UFortItem*                        FortItem;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemPresentationScreen_C_OnUpdateItemInformation) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_OnUpdateItemInformation");
static_assert(sizeof(ItemPresentationScreen_C_OnUpdateItemInformation) == 0x000008, "Wrong size on ItemPresentationScreen_C_OnUpdateItemInformation");
static_assert(offsetof(ItemPresentationScreen_C_OnUpdateItemInformation, FortItem) == 0x000000, "Member 'ItemPresentationScreen_C_OnUpdateItemInformation::FortItem' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnUpdateOwnedItemText
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnUpdateOwnedItemText final
{
public:
	bool                                          bShowText;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnUpdateOwnedItemText) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnUpdateOwnedItemText");
static_assert(sizeof(ItemPresentationScreen_C_OnUpdateOwnedItemText) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnUpdateOwnedItemText");
static_assert(offsetof(ItemPresentationScreen_C_OnUpdateOwnedItemText, bShowText) == 0x000000, "Member 'ItemPresentationScreen_C_OnUpdateOwnedItemText::bShowText' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnInitialIconAnimation
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnInitialIconAnimation final
{
public:
	bool                                          bUsingListView;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnInitialIconAnimation) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnInitialIconAnimation");
static_assert(sizeof(ItemPresentationScreen_C_OnInitialIconAnimation) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnInitialIconAnimation");
static_assert(offsetof(ItemPresentationScreen_C_OnInitialIconAnimation, bUsingListView) == 0x000000, "Member 'ItemPresentationScreen_C_OnInitialIconAnimation::bUsingListView' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnDisplayEquipButton
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnDisplayEquipButton final
{
public:
	bool                                          bCanEquip;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnDisplayEquipButton) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnDisplayEquipButton");
static_assert(sizeof(ItemPresentationScreen_C_OnDisplayEquipButton) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnDisplayEquipButton");
static_assert(offsetof(ItemPresentationScreen_C_OnDisplayEquipButton, bCanEquip) == 0x000000, "Member 'ItemPresentationScreen_C_OnDisplayEquipButton::bCanEquip' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnUpdateNextButtonText
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnUpdateNextButtonText final
{
public:
	bool                                          bShowNext;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnUpdateNextButtonText) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnUpdateNextButtonText");
static_assert(sizeof(ItemPresentationScreen_C_OnUpdateNextButtonText) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnUpdateNextButtonText");
static_assert(offsetof(ItemPresentationScreen_C_OnUpdateNextButtonText, bShowNext) == 0x000000, "Member 'ItemPresentationScreen_C_OnUpdateNextButtonText::bShowNext' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnFinishDisplayingHotItems
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnFinishDisplayingHotItems final
{
public:
	bool                                          bShowOtherRewards;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnFinishDisplayingHotItems) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnFinishDisplayingHotItems");
static_assert(sizeof(ItemPresentationScreen_C_OnFinishDisplayingHotItems) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnFinishDisplayingHotItems");
static_assert(offsetof(ItemPresentationScreen_C_OnFinishDisplayingHotItems, bShowOtherRewards) == 0x000000, "Member 'ItemPresentationScreen_C_OnFinishDisplayingHotItems::bShowOtherRewards' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.OnDisplayItemsCollectedText
// 0x0001 (0x0001 - 0x0000)
struct ItemPresentationScreen_C_OnDisplayItemsCollectedText final
{
public:
	bool                                          bCloseScreen;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_OnDisplayItemsCollectedText) == 0x000001, "Wrong alignment on ItemPresentationScreen_C_OnDisplayItemsCollectedText");
static_assert(sizeof(ItemPresentationScreen_C_OnDisplayItemsCollectedText) == 0x000001, "Wrong size on ItemPresentationScreen_C_OnDisplayItemsCollectedText");
static_assert(offsetof(ItemPresentationScreen_C_OnDisplayItemsCollectedText, bCloseScreen) == 0x000000, "Member 'ItemPresentationScreen_C_OnDisplayItemsCollectedText::bCloseScreen' has a wrong offset!");

// Function ItemPresentationScreen.ItemPresentationScreen_C.ExecuteUbergraph_ItemPresentationScreen
// 0x0268 (0x0268 - 0x0000)
struct ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74BA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0030(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74BB[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemPresentationGenericRewardHeader_C* K2Node_DynamicCast_AsItem_Presentation_Generic_Reward_Header; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74BC[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemPresentationGenericRewardHeader_C* K2Node_DynamicCast_AsItem_Presentation_Generic_Reward_Header_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74BD[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoPresentationWidget_C*          K2Node_DynamicCast_AsItem_Info_Presentation_Widget; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74BE[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemHeaderInformation             K2Node_Event_HeaderInformation;                    // 0x0080(0x0098)(ConstParm)
	const class UFortItem*                        K2Node_Event_FortItem;                             // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowText;                            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74BF[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74C0[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemPresentationEntry_C*               K2Node_DynamicCast_AsItem_Presentation_Entry;      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bUsingListView;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C1[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoPresentationWidget_C*          K2Node_DynamicCast_AsItem_Info_Presentation_Widget_1; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bCanEquip;                            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShowNext;                            // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C2[0x5];                                     // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShowOtherRewards;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bCloseScreen;                         // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C3[0x5];                                     // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button_1;                // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C4[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0190(0x0010)(NoDestructor)
	class UItemInfoPresentationWidget_C*          K2Node_DynamicCast_AsItem_Info_Presentation_Widget_2; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C5[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassTracker_C*                   K2Node_DynamicCast_AsBattle_Pass_Tracker;          // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C6[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassTracker_C*                   K2Node_DynamicCast_AsBattle_Pass_Tracker_1;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C7[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker;     // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C8[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_1;   // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74C9[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_2;   // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74CA[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassTracker_C*                   K2Node_DynamicCast_AsBattle_Pass_Tracker_2;        // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74CB[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassTracker_C*                   K2Node_DynamicCast_AsBattle_Pass_Tracker_3;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74CC[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_3;   // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74CD[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74CE[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74CF[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemPresentationEntry_C*               K2Node_DynamicCast_AsItem_Presentation_Entry_1;    // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen) == 0x000008, "Wrong alignment on ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen");
static_assert(sizeof(ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen) == 0x000268, "Wrong size on ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen");
static_assert(offsetof(ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen, EntryPoint) == 0x000000, "Member 'ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ItemPresentationScreen_C_ExecuteUbergraph_ItemPresentationScreen::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
