#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsHeaderOwnedCountText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ItemDetailsHeaderOwnedCountText.ItemDetailsHeaderOwnedCountText_C.SetOwnedText
// 0x0100 (0x0100 - 0x0000)
struct ItemDetailsHeaderOwnedCountText_C_SetOwnedText final
{
public:
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D9[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOwnedItemCount_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnedSurvivorCount_ReturnValue;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61DB[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00E8(0x0018)()
};
static_assert(alignof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText) == 0x000008, "Wrong alignment on ItemDetailsHeaderOwnedCountText_C_SetOwnedText");
static_assert(sizeof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText) == 0x000100, "Wrong size on ItemDetailsHeaderOwnedCountText_C_SetOwnedText");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetType_ReturnValue) == 0x000008, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetOwnedItemCount_ReturnValue) == 0x00001C, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetOwnedItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetContext_ReturnValue_1) == 0x000060, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, K2Node_MakeArray_Array) == 0x000068, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_GetOwnedSurvivorCount_ReturnValue) == 0x000078, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_GetOwnedSurvivorCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_Format_ReturnValue) == 0x000080, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, K2Node_MakeArray_Array_1) == 0x0000D8, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_SetOwnedText, CallFunc_Format_ReturnValue_1) == 0x0000E8, "Member 'ItemDetailsHeaderOwnedCountText_C_SetOwnedText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function ItemDetailsHeaderOwnedCountText.ItemDetailsHeaderOwnedCountText_C.ExecuteUbergraph_ItemDetailsHeaderOwnedCountText
// 0x00C0 (0x00C0 - 0x0000)
struct ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSchematicOrCraftedWeapon_ReturnValue;   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DC[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityDataForItemDef_ReturnValue;    // 0x0018(0x0080)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0098(0x0028)()
};
static_assert(alignof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText) == 0x000008, "Wrong alignment on ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText");
static_assert(sizeof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText) == 0x0000C0, "Wrong size on ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, EntryPoint) == 0x000000, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_GetType_ReturnValue) == 0x000004, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000006, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000007, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000009, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_BooleanOR_ReturnValue_1) == 0x00000A, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_BooleanOR_ReturnValue_2) == 0x00000B, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_IsSchematicOrCraftedWeapon_ReturnValue) == 0x00000D, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_IsSchematicOrCraftedWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, CallFunc_BPGetRarityDataForItemDef_ReturnValue) == 0x000018, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::CallFunc_BPGetRarityDataForItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText, K2Node_MakeStruct_SlateColor) == 0x000098, "Member 'ItemDetailsHeaderOwnedCountText_C_ExecuteUbergraph_ItemDetailsHeaderOwnedCountText::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

