#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsHeaderKeywordsListText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemDetailsHeaderKeywordsListText.ItemDetailsHeaderKeywordsListText_C.FormatItemDisplayTags
// 0x0120 (0x0120 - 0x0000)
struct ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags final
{
public:
	TArray<class FText>                           TagTexts;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FText                                   FormatedText;                                      // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   Result;                                            // 0x0028(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5990[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5991[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5992[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
};
static_assert(alignof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags) == 0x000008, "Wrong alignment on ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags");
static_assert(sizeof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags) == 0x000120, "Wrong size on ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, TagTexts) == 0x000000, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::TagTexts' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, FormatedText) == 0x000010, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::FormatedText' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, Result) == 0x000028, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::Result' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, Temp_int_Array_Index_Variable) == 0x000040, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_Array_Get_Item) == 0x000048, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_TextIsEmpty_ReturnValue) == 0x0000F0, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, K2Node_MakeArray_Array) == 0x0000F8, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags, CallFunc_Format_ReturnValue) == 0x000108, "Member 'ItemDetailsHeaderKeywordsListText_C_FormatItemDisplayTags::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ItemDetailsHeaderKeywordsListText.ItemDetailsHeaderKeywordsListText_C.ExecuteUbergraph_ItemDetailsHeaderKeywordsListText
// 0x0060 (0x0060 - 0x0000)
struct ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5993[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5994[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          CallFunc_GetHeroTypeBP_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetKeywordDisplayNames_ReturnValue;       // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5995[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatItemDisplayTags_FormatedText;       // 0x0040(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText) == 0x000008, "Wrong alignment on ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText");
static_assert(sizeof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText) == 0x000060, "Wrong size on ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, EntryPoint) == 0x000000, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_bool_Variable) == 0x000004, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_byte_Variable) == 0x000005, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_bool_Variable_1) == 0x000006, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_byte_Variable_1) == 0x000007, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_byte_Variable_2) == 0x000008, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, Temp_byte_Variable_3) == 0x000009, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, K2Node_DynamicCast_AsFort_Hero) == 0x000010, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, CallFunc_GetHeroTypeBP_ReturnValue) == 0x000020, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::CallFunc_GetHeroTypeBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, CallFunc_GetKeywordDisplayNames_ReturnValue) == 0x000028, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::CallFunc_GetKeywordDisplayNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, K2Node_Select_Default) == 0x000038, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, CallFunc_FormatItemDisplayTags_FormatedText) == 0x000040, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::CallFunc_FormatItemDisplayTags_FormatedText' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText, K2Node_Select_Default_1) == 0x000059, "Member 'ItemDetailsHeaderKeywordsListText_C_ExecuteUbergraph_ItemDetailsHeaderKeywordsListText::K2Node_Select_Default_1' has a wrong offset!");

}

