#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KairosSceneCapture

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "KairosSceneCapture_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class KairosSceneCapture.KairosCaptureStatics
// 0x0000 (0x0028 - 0x0028)
class UKairosCaptureStatics final : public UBlueprintFunctionLibrary
{
public:
	static class AKairosSceneManagerActor* GetSceneManager(const class UObject* WorldContextObject);
	static void ToggleAutoRotate(bool bIsAutoRotateAllowed);

	void PauseOrResumeSnippet(const struct FKairosSnippetParams& Params_0, const struct FWebJSResponse& Response);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosCaptureStatics">();
	}
	static class UKairosCaptureStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKairosCaptureStatics>();
	}
};
static_assert(alignof(UKairosCaptureStatics) == 0x000008, "Wrong alignment on UKairosCaptureStatics");
static_assert(sizeof(UKairosCaptureStatics) == 0x000028, "Wrong size on UKairosCaptureStatics");

// Class KairosSceneCapture.KairosConfig
// 0x0010 (0x0040 - 0x0030)
class UKairosConfig final : public UDataAsset
{
public:
	float                                         DefaultHeroScale;                                  // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4464[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AKairosHeroBase>            AvatarCaptureBlueprint;                            // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosConfig">();
	}
	static class UKairosConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKairosConfig>();
	}
};
static_assert(alignof(UKairosConfig) == 0x000008, "Wrong alignment on UKairosConfig");
static_assert(sizeof(UKairosConfig) == 0x000040, "Wrong size on UKairosConfig");
static_assert(offsetof(UKairosConfig, DefaultHeroScale) == 0x000030, "Member 'UKairosConfig::DefaultHeroScale' has a wrong offset!");
static_assert(offsetof(UKairosConfig, AvatarCaptureBlueprint) == 0x000038, "Member 'UKairosConfig::AvatarCaptureBlueprint' has a wrong offset!");

// Class KairosSceneCapture.KairosGameModeBase
// 0x0008 (0x02C8 - 0x02C0)
class AKairosGameModeBase final : public AGameModeBase
{
public:
	class UKairosConfig*                          DefaultConfig;                                     // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UKairosConfig* GetDefaultConfig();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosGameModeBase">();
	}
	static class AKairosGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosGameModeBase>();
	}
};
static_assert(alignof(AKairosGameModeBase) == 0x000008, "Wrong alignment on AKairosGameModeBase");
static_assert(sizeof(AKairosGameModeBase) == 0x0002C8, "Wrong size on AKairosGameModeBase");
static_assert(offsetof(AKairosGameModeBase, DefaultConfig) == 0x0002C0, "Member 'AKairosGameModeBase::DefaultConfig' has a wrong offset!");

// Class KairosSceneCapture.KairosHeroBase
// 0x0030 (0x0250 - 0x0220)
class AKairosHeroBase : public AActor
{
public:
	class FString                                 PlayerID;                                          // 0x0220(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBeingCaptured;                                  // 0x0230(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4465[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroAnimationState                     CurrentAnimationState;                             // 0x0240(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroSkeletonType                       SkeletonType;                                      // 0x0241(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4466[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CapturePawn;                                       // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool BeginCapture(const struct FKairosAnimationFramingInfo& FramingInfo, const struct FKairosCaptureParams& CaptureParams);
	bool EndCapture();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosHeroBase">();
	}
	static class AKairosHeroBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosHeroBase>();
	}
};
static_assert(alignof(AKairosHeroBase) == 0x000008, "Wrong alignment on AKairosHeroBase");
static_assert(sizeof(AKairosHeroBase) == 0x000250, "Wrong size on AKairosHeroBase");
static_assert(offsetof(AKairosHeroBase, PlayerID) == 0x000220, "Member 'AKairosHeroBase::PlayerID' has a wrong offset!");
static_assert(offsetof(AKairosHeroBase, bIsBeingCaptured) == 0x000230, "Member 'AKairosHeroBase::bIsBeingCaptured' has a wrong offset!");
static_assert(offsetof(AKairosHeroBase, SceneCaptureComponent2D) == 0x000238, "Member 'AKairosHeroBase::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AKairosHeroBase, CurrentAnimationState) == 0x000240, "Member 'AKairosHeroBase::CurrentAnimationState' has a wrong offset!");
static_assert(offsetof(AKairosHeroBase, SkeletonType) == 0x000241, "Member 'AKairosHeroBase::SkeletonType' has a wrong offset!");
static_assert(offsetof(AKairosHeroBase, CapturePawn) == 0x000248, "Member 'AKairosHeroBase::CapturePawn' has a wrong offset!");

// Class KairosSceneCapture.KairosPawn
// 0x0000 (0x0280 - 0x0280)
class AKairosPawn final : public APawn
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosPawn">();
	}
	static class AKairosPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosPawn>();
	}
};
static_assert(alignof(AKairosPawn) == 0x000008, "Wrong alignment on AKairosPawn");
static_assert(sizeof(AKairosPawn) == 0x000280, "Wrong size on AKairosPawn");

// Class KairosSceneCapture.KairosPlayerController
// 0x0000 (0x0570 - 0x0570)
class AKairosPlayerController final : public APlayerController
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosPlayerController">();
	}
	static class AKairosPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosPlayerController>();
	}
};
static_assert(alignof(AKairosPlayerController) == 0x000008, "Wrong alignment on AKairosPlayerController");
static_assert(sizeof(AKairosPlayerController) == 0x000570, "Wrong size on AKairosPlayerController");

// Class KairosSceneCapture.KairosSceneManagerActor
// 0x0180 (0x03A0 - 0x0220)
class AKairosSceneManagerActor final : public AActor
{
public:
	TMap<class FString, struct FKairosAvatarDisplayInfo> DisplayAvatars;                                    // 0x0220(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnedPawnHeadCaptureTransform;                   // 0x0270(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SnippetAudioComponent;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ActiveGroupWidget;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSnippetPaused;                                  // 0x02B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4468[0x1F];                                    // 0x02B1(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKairosSceneInfo                       ActiveSceneInfo;                                   // 0x02D0(0x0020)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4469[0xB0];                                    // 0x02F0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginEmotePlaybackForPlayer(const class FString& PlayerID, const class FString& EmoteId);
	const struct FKairosSceneInfo GetSceneInfo();
	void OLD_OnSceneSetupComplete(const struct FKairosSceneInfo& CompleteSceneInfoCopy);
	void PauseOrResumeSnippet(const class FString& PlayerID, bool bShouldPase);
	void StopAR();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosSceneManagerActor">();
	}
	static class AKairosSceneManagerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosSceneManagerActor>();
	}
};
static_assert(alignof(AKairosSceneManagerActor) == 0x000010, "Wrong alignment on AKairosSceneManagerActor");
static_assert(sizeof(AKairosSceneManagerActor) == 0x0003A0, "Wrong size on AKairosSceneManagerActor");
static_assert(offsetof(AKairosSceneManagerActor, DisplayAvatars) == 0x000220, "Member 'AKairosSceneManagerActor::DisplayAvatars' has a wrong offset!");
static_assert(offsetof(AKairosSceneManagerActor, SpawnedPawnHeadCaptureTransform) == 0x000270, "Member 'AKairosSceneManagerActor::SpawnedPawnHeadCaptureTransform' has a wrong offset!");
static_assert(offsetof(AKairosSceneManagerActor, SnippetAudioComponent) == 0x0002A0, "Member 'AKairosSceneManagerActor::SnippetAudioComponent' has a wrong offset!");
static_assert(offsetof(AKairosSceneManagerActor, ActiveGroupWidget) == 0x0002A8, "Member 'AKairosSceneManagerActor::ActiveGroupWidget' has a wrong offset!");
static_assert(offsetof(AKairosSceneManagerActor, bIsSnippetPaused) == 0x0002B0, "Member 'AKairosSceneManagerActor::bIsSnippetPaused' has a wrong offset!");
static_assert(offsetof(AKairosSceneManagerActor, ActiveSceneInfo) == 0x0002D0, "Member 'AKairosSceneManagerActor::ActiveSceneInfo' has a wrong offset!");

}

