#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyboardPresetRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeyboardPresetRotator.KeyboardPresetRotator_C
// 0x0040 (0x0298 - 0x0258)
class UKeyboardPresetRotator_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ButtonLeft;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonRight;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_0;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubDescription;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextRotator_C*                         TextRotator;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spacer_Width;                                      // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Show_Param_Name(bool Show);
	void Update_Size();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Update_Options(TArray<class FText>& NewParam);
	void Center_On_Widget();
	void Initialize();
	void Update_Row_Selector(int32 Currently_Selected);
	void Construct();
	void BndEvt__TextRotator_K2Node_ComponentBoundEvent_5_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_KeyboardPresetRotator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeyboardPresetRotator_C">();
	}
	static class UKeyboardPresetRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyboardPresetRotator_C>();
	}
};
static_assert(alignof(UKeyboardPresetRotator_C) == 0x000008, "Wrong alignment on UKeyboardPresetRotator_C");
static_assert(sizeof(UKeyboardPresetRotator_C) == 0x000298, "Wrong size on UKeyboardPresetRotator_C");
static_assert(offsetof(UKeyboardPresetRotator_C, UberGraphFrame) == 0x000258, "Member 'UKeyboardPresetRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, ButtonLeft) == 0x000260, "Member 'UKeyboardPresetRotator_C::ButtonLeft' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, ButtonRight) == 0x000268, "Member 'UKeyboardPresetRotator_C::ButtonRight' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, Description) == 0x000270, "Member 'UKeyboardPresetRotator_C::Description' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, Spacer_0) == 0x000278, "Member 'UKeyboardPresetRotator_C::Spacer_0' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, SubDescription) == 0x000280, "Member 'UKeyboardPresetRotator_C::SubDescription' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, TextRotator) == 0x000288, "Member 'UKeyboardPresetRotator_C::TextRotator' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, SelectedIndex) == 0x000290, "Member 'UKeyboardPresetRotator_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UKeyboardPresetRotator_C, Spacer_Width) == 0x000294, "Member 'UKeyboardPresetRotator_C::Spacer_Width' has a wrong offset!");

}

