#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerRegisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider) == 0x000008, "Wrong alignment on FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider");
static_assert(sizeof(FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider) == 0x000008, "Wrong size on FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider");
static_assert(offsetof(FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider, PointProvider) == 0x000000, "Member 'FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider::PointProvider' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerUnregisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider) == 0x000008, "Wrong alignment on FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider");
static_assert(sizeof(FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider) == 0x000008, "Wrong size on FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider");
static_assert(offsetof(FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider, PointProvider) == 0x000000, "Member 'FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider::PointProvider' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerProviderDebugActor
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor final
{
public:
	int32                                         ProviderIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor) == 0x000004, "Wrong alignment on FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor");
static_assert(sizeof(FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor) == 0x000004, "Wrong size on FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor");
static_assert(offsetof(FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor, ProviderIndex) == 0x000000, "Member 'FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor::ProviderIndex' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldManager.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded) == 0x000008, "Wrong alignment on FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded");
static_assert(sizeof(FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded) == 0x000028, "Wrong size on FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded");
static_assert(offsetof(FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded, PlaylistName) == 0x000000, "Member 'FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldManager.OnSpawnedActorDestroy
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnSpawnedActorDestroy final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldManager_OnSpawnedActorDestroy) == 0x000008, "Wrong alignment on FortAthenaLivingWorldManager_OnSpawnedActorDestroy");
static_assert(sizeof(FortAthenaLivingWorldManager_OnSpawnedActorDestroy) == 0x000008, "Wrong size on FortAthenaLivingWorldManager_OnSpawnedActorDestroy");
static_assert(offsetof(FortAthenaLivingWorldManager_OnSpawnedActorDestroy, DestroyedActor) == 0x000000, "Member 'FortAthenaLivingWorldManager_OnSpawnedActorDestroy::DestroyedActor' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetFiltersTags final
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldPointProviderInterface_GetFiltersTags) == 0x000008, "Wrong alignment on FortAthenaLivingWorldPointProviderInterface_GetFiltersTags");
static_assert(sizeof(FortAthenaLivingWorldPointProviderInterface_GetFiltersTags) == 0x000020, "Wrong size on FortAthenaLivingWorldPointProviderInterface_GetFiltersTags");
static_assert(offsetof(FortAthenaLivingWorldPointProviderInterface_GetFiltersTags, FilterTags) == 0x000000, "Member 'FortAthenaLivingWorldPointProviderInterface_GetFiltersTags::FilterTags' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetValidLocation
// 0x001C (0x001C - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetValidLocation final
{
public:
	struct FVector                                OutPosition;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutRotation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4221[0x3];                                     // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaLivingWorldPointProviderInterface_GetValidLocation) == 0x000004, "Wrong alignment on FortAthenaLivingWorldPointProviderInterface_GetValidLocation");
static_assert(sizeof(FortAthenaLivingWorldPointProviderInterface_GetValidLocation) == 0x00001C, "Wrong size on FortAthenaLivingWorldPointProviderInterface_GetValidLocation");
static_assert(offsetof(FortAthenaLivingWorldPointProviderInterface_GetValidLocation, OutPosition) == 0x000000, "Member 'FortAthenaLivingWorldPointProviderInterface_GetValidLocation::OutPosition' has a wrong offset!");
static_assert(offsetof(FortAthenaLivingWorldPointProviderInterface_GetValidLocation, OutRotation) == 0x00000C, "Member 'FortAthenaLivingWorldPointProviderInterface_GetValidLocation::OutRotation' has a wrong offset!");
static_assert(offsetof(FortAthenaLivingWorldPointProviderInterface_GetValidLocation, ReturnValue) == 0x000018, "Member 'FortAthenaLivingWorldPointProviderInterface_GetValidLocation::ReturnValue' has a wrong offset!");

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded) == 0x000008, "Wrong alignment on FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded");
static_assert(sizeof(FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded) == 0x000028, "Wrong size on FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded");
static_assert(offsetof(FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded, PlaylistName) == 0x000000, "Member 'FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerSpawn
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn) == 0x000008, "Wrong alignment on FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn");
static_assert(sizeof(FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn) == 0x000010, "Wrong size on FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn");
static_assert(offsetof(FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn, EventDataName) == 0x000000, "Member 'FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn::EventDataName' has a wrong offset!");

}

