#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardListViewWrapper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LeaderboardListViewWrapper.LeaderboardListViewWrapper_C.Set Bar Color
// 0x0010 (0x0010 - 0x0000)
struct LeaderboardListViewWrapper_C_Set_Bar_Color final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboardListViewWrapper_C_Set_Bar_Color) == 0x000004, "Wrong alignment on LeaderboardListViewWrapper_C_Set_Bar_Color");
static_assert(sizeof(LeaderboardListViewWrapper_C_Set_Bar_Color) == 0x000010, "Wrong size on LeaderboardListViewWrapper_C_Set_Bar_Color");
static_assert(offsetof(LeaderboardListViewWrapper_C_Set_Bar_Color, Color) == 0x000000, "Member 'LeaderboardListViewWrapper_C_Set_Bar_Color::Color' has a wrong offset!");

// Function LeaderboardListViewWrapper.LeaderboardListViewWrapper_C.Set Event
// 0x0020 (0x0020 - 0x0000)
struct LeaderboardListViewWrapper_C_Set_Event final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventWindowId;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboardListViewWrapper_C_Set_Event) == 0x000008, "Wrong alignment on LeaderboardListViewWrapper_C_Set_Event");
static_assert(sizeof(LeaderboardListViewWrapper_C_Set_Event) == 0x000020, "Wrong size on LeaderboardListViewWrapper_C_Set_Event");
static_assert(offsetof(LeaderboardListViewWrapper_C_Set_Event, EventId) == 0x000000, "Member 'LeaderboardListViewWrapper_C_Set_Event::EventId' has a wrong offset!");
static_assert(offsetof(LeaderboardListViewWrapper_C_Set_Event, EventWindowId) == 0x000010, "Member 'LeaderboardListViewWrapper_C_Set_Event::EventWindowId' has a wrong offset!");

// Function LeaderboardListViewWrapper.LeaderboardListViewWrapper_C.ExecuteUbergraph_LeaderboardListViewWrapper
// 0x0038 (0x0038 - 0x0000)
struct LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6247[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventId;                        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventWindowId;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper) == 0x000008, "Wrong alignment on LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper");
static_assert(sizeof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper) == 0x000038, "Wrong size on LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper");
static_assert(offsetof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper, EntryPoint) == 0x000000, "Member 'LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper, K2Node_CustomEvent_Color) == 0x000004, "Member 'LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper, K2Node_CustomEvent_EventId) == 0x000018, "Member 'LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper::K2Node_CustomEvent_EventId' has a wrong offset!");
static_assert(offsetof(LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper, K2Node_CustomEvent_EventWindowId) == 0x000028, "Member 'LeaderboardListViewWrapper_C_ExecuteUbergraph_LeaderboardListViewWrapper::K2Node_CustomEvent_EventWindowId' has a wrong offset!");

}

