#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaveButton.LeaveButton_C
// 0x0108 (0x0360 - 0x0258)
class ULeaveButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      Leave;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Update_Visibility;                                 // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 ButtonStyleOverride;                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerStyleOverride;                           // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseButtoneStyleOverride;                           // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideButtonText;                                // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6FD0[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonTextOverride;                                // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HordModeLeaveDescription;                          // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionAlone;                      // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionParty;                      // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionAlone;                  // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionParty;                  // 0x0318(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveTitle;                             // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULeaveDialog_C*                         LeaveDialog;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             LeaveDialogCancelled;                              // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnClicked__DelegateSignature();
	void Update_Visibility__DelegateSignature(bool Param_Visibility);
	void LeaveDialogCancelled__DelegateSignature();
	void ExecuteUbergraph_LeaveButton(int32 EntryPoint);
	void PerformLeave();
	void HandleLobbyEvents();
	void HandleCanceled();
	void HandleTeamMemberAdded(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void HandleLeft();
	void HandlePlayerStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void HandleTeamMemberRemoved(int32 PlayerIndex);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B(EFortDialogResult Result, class FName ResultName);
	void DialogResult_F5AF58094777CFEEC0BF28BEA620800C(EFortDialogResult Result, class FName ResultName);
	void GetLeaveActionText(class FText* Text);
	void IsConsideredInGame(bool* InGame);
	void UpdateState();
	void LeaveParty();
	void HasUnsavedQuestProgress(bool* Param_HasUnsavedQuestProgress);
	void GetButton(class UIconTextButton_C** Param_Leave);
	void SetText(const class FText& TextOverride);
	void Update_Style_State();
	void IsInNeighborhood(bool* bIsInNeighborhood);
	void GetDescriptionText(class FText* DescriptionText);
	void Change_Main_Menu_Music_State(bool Set_Lobby_Music_State);
	void GetBRConfirmationDialogText(class FText* TitleText, class FText* MessagText);
	void GetSTWConfirmationDialogText(bool bIsInNeighborhood, class FText* OutTitle, class FText* OutDescription, bool* bOutIsInParty);
	void GetSTWOutpostConfirmationDialogText(class FText* OutTitle, class FText* OutDescription);
	void BindDelegates();
	void UnbindDelegates();
	void ShowLeaveScreen();
	void ClearLeaveDialogDelegate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaveButton_C">();
	}
	static class ULeaveButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaveButton_C>();
	}
};
static_assert(alignof(ULeaveButton_C) == 0x000008, "Wrong alignment on ULeaveButton_C");
static_assert(sizeof(ULeaveButton_C) == 0x000360, "Wrong size on ULeaveButton_C");
static_assert(offsetof(ULeaveButton_C, UberGraphFrame) == 0x000258, "Member 'ULeaveButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, Leave) == 0x000260, "Member 'ULeaveButton_C::Leave' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, OnClicked) == 0x000268, "Member 'ULeaveButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, Update_Visibility) == 0x000278, "Member 'ULeaveButton_C::Update_Visibility' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ButtonStyleOverride) == 0x000288, "Member 'ULeaveButton_C::ButtonStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ControllerStyleOverride) == 0x000290, "Member 'ULeaveButton_C::ControllerStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, UseButtoneStyleOverride) == 0x000298, "Member 'ULeaveButton_C::UseButtoneStyleOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, OverrideButtonText) == 0x000299, "Member 'ULeaveButton_C::OverrideButtonText' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, ButtonTextOverride) == 0x0002A0, "Member 'ULeaveButton_C::ButtonTextOverride' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, HordModeLeaveDescription) == 0x0002B8, "Member 'ULeaveButton_C::HordModeLeaveDescription' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, MissionLeaveDescriptionAlone) == 0x0002D0, "Member 'ULeaveButton_C::MissionLeaveDescriptionAlone' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, MissionLeaveDescriptionParty) == 0x0002E8, "Member 'ULeaveButton_C::MissionLeaveDescriptionParty' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveDescriptionAlone) == 0x000300, "Member 'ULeaveButton_C::StormshieldLeaveDescriptionAlone' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveDescriptionParty) == 0x000318, "Member 'ULeaveButton_C::StormshieldLeaveDescriptionParty' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, StormshieldLeaveTitle) == 0x000330, "Member 'ULeaveButton_C::StormshieldLeaveTitle' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, LeaveDialog) == 0x000348, "Member 'ULeaveButton_C::LeaveDialog' has a wrong offset!");
static_assert(offsetof(ULeaveButton_C, LeaveDialogCancelled) == 0x000350, "Member 'ULeaveButton_C::LeaveDialogCancelled' has a wrong offset!");

}

