#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveDialog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LeaveDialog.LeaveDialog_C.OnMouseButtonDownTapToClose
// 0x03B0 (0x03B0 - 0x0000)
struct LeaveDialog_C_OnMouseButtonDownTapToClose final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsTouchEvent_ReturnValue;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_725B[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_725C[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F8(0x00B8)()
};
static_assert(alignof(LeaveDialog_C_OnMouseButtonDownTapToClose) == 0x000008, "Wrong alignment on LeaveDialog_C_OnMouseButtonDownTapToClose");
static_assert(sizeof(LeaveDialog_C_OnMouseButtonDownTapToClose) == 0x0003B0, "Wrong size on LeaveDialog_C_OnMouseButtonDownTapToClose");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, MyGeometry) == 0x000000, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::MyGeometry' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, MouseEvent) == 0x000038, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::MouseEvent' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, ReturnValue) == 0x0000A8, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_PointerEvent_IsTouchEvent_ReturnValue) == 0x000178, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_PointerEvent_IsTouchEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000179, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, Temp_bool_Variable) == 0x00017A, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_BooleanOR_ReturnValue) == 0x00017B, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Not_PreBool_ReturnValue) == 0x000238, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveDialog_C_OnMouseButtonDownTapToClose, K2Node_Select_Default) == 0x0002F8, "Member 'LeaveDialog_C_OnMouseButtonDownTapToClose::K2Node_Select_Default' has a wrong offset!");

}

