#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function LeaveButton.LeaveButton_C.Update Visibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LeaveButton_C_Update_Visibility__DelegateSignature final
{
public:
	bool                                          Param_Visibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_Update_Visibility__DelegateSignature) == 0x000001, "Wrong alignment on LeaveButton_C_Update_Visibility__DelegateSignature");
static_assert(sizeof(LeaveButton_C_Update_Visibility__DelegateSignature) == 0x000001, "Wrong size on LeaveButton_C_Update_Visibility__DelegateSignature");
static_assert(offsetof(LeaveButton_C_Update_Visibility__DelegateSignature, Param_Visibility) == 0x000000, "Member 'LeaveButton_C_Update_Visibility__DelegateSignature::Param_Visibility' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.ExecuteUbergraph_LeaveButton
// 0x0558 (0x0558 - 0x0000)
struct LeaveButton_C_ExecuteUbergraph_LeaveButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOutpostContext*                    CallFunc_GetContext_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress; // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD3[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD5[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULeaveWarningInfo_C*                    CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD7[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD8[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue_1;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredInGame_InGame_1;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result_1;                       // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD9[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName_1;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_TeamMemberInfo;                 // 0x00C8(0x0200)(ConstParm, HasGetValueTypeHash)
	class FText                                   CallFunc_GetBRConfirmationDialogText_TitleText;    // 0x02C8(0x0018)()
	class FText                                   CallFunc_GetBRConfirmationDialogText_MessagText;   // 0x02E0(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDA[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSTWOutpostConfirmationDialogText_OutTitle; // 0x0308(0x0018)()
	class FText                                   CallFunc_GetSTWOutpostConfirmationDialogText_OutDescription; // 0x0320(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDB[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_NewTeamMemberInfo;              // 0x0358(0x0200)(HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x000008, "Wrong alignment on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(sizeof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x000558, "Wrong size on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, EntryPoint) == 0x000000, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result) == 0x000004, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName) == 0x000008, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable) == 0x000020, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable) == 0x000028, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue_1) == 0x000038, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000048, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsConsideredInGame_InGame) == 0x000051, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsOutpostOwner_ReturnValue) == 0x000052, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress) == 0x000053, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue_2) == 0x000058, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetSubGame_ReturnValue) == 0x000068, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetUINavigationManager_ReturnValue) == 0x000070, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000080, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Event_IsDesignTime) == 0x000088, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Create_ReturnValue) == 0x000090, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable_1) == 0x000098, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable_1) == 0x00009C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A4, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue_3) == 0x0000A8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetUINavigationManager_ReturnValue_1) == 0x0000B0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetUINavigationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_PlayerIndex) == 0x0000B8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsConsideredInGame_InGame_1) == 0x0000BC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsConsideredInGame_InGame_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result_1) == 0x0000BD, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName_1) == 0x0000C0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_TeamMemberInfo) == 0x0000C8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetBRConfirmationDialogText_TitleText) == 0x0002C8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetBRConfirmationDialogText_TitleText' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetBRConfirmationDialogText_MessagText) == 0x0002E0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetBRConfirmationDialogText_MessagText' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x0002F8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue) == 0x000300, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetSTWOutpostConfirmationDialogText_OutTitle) == 0x000308, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetSTWOutpostConfirmationDialogText_OutTitle' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetSTWOutpostConfirmationDialogText_OutDescription) == 0x000320, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetSTWOutpostConfirmationDialogText_OutDescription' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue_1) == 0x000338, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000340, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue_1) == 0x000350, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_NewTeamMemberInfo) == 0x000358, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_NewTeamMemberInfo' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberAdded
// 0x0200 (0x0200 - 0x0000)
struct LeaveButton_C_HandleTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    NewTeamMemberInfo;                                 // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberAdded) == 0x000008, "Wrong alignment on LeaveButton_C_HandleTeamMemberAdded");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberAdded) == 0x000200, "Wrong size on LeaveButton_C_HandleTeamMemberAdded");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberAdded, NewTeamMemberInfo) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberAdded::NewTeamMemberInfo' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandlePlayerStateChanged
// 0x0200 (0x0200 - 0x0000)
struct LeaveButton_C_HandlePlayerStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0200)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_HandlePlayerStateChanged) == 0x000008, "Wrong alignment on LeaveButton_C_HandlePlayerStateChanged");
static_assert(sizeof(LeaveButton_C_HandlePlayerStateChanged) == 0x000200, "Wrong size on LeaveButton_C_HandlePlayerStateChanged");
static_assert(offsetof(LeaveButton_C_HandlePlayerStateChanged, TeamMemberInfo) == 0x000000, "Member 'LeaveButton_C_HandlePlayerStateChanged::TeamMemberInfo' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberRemoved
// 0x0004 (0x0004 - 0x0000)
struct LeaveButton_C_HandleTeamMemberRemoved final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong alignment on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong size on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberRemoved, PlayerIndex) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberRemoved::PlayerIndex' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LeaveButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong alignment on LeaveButton_C_PreConstruct");
static_assert(sizeof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong size on LeaveButton_C_PreConstruct");
static_assert(offsetof(LeaveButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LeaveButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B
// 0x000C (0x000C - 0x0000)
struct LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FDC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B) == 0x000004, "Wrong alignment on LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B");
static_assert(sizeof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B) == 0x00000C, "Wrong size on LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B");
static_assert(offsetof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B, ResultName) == 0x000004, "Member 'LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_F5AF58094777CFEEC0BF28BEA620800C
// 0x000C (0x000C - 0x0000)
struct LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FDD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C) == 0x000004, "Wrong alignment on LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C");
static_assert(sizeof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C) == 0x00000C, "Wrong size on LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C");
static_assert(offsetof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C, ResultName) == 0x000004, "Member 'LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.GetLeaveActionText
// 0x0210 (0x0210 - 0x0000)
struct LeaveButton_C_GetLeaveActionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlaylistType                             Temp_byte_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDF[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE0[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x0100(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE1[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x0120(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0138(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE2[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame_1;              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortPlaylistType                             CallFunc_GetPlaylistType_ReturnValue;              // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FE3[0x5];                                     // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_10;                             // 0x0170(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0188(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x01A0(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE4[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE5[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01D8(0x0018)()
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame_2;              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE6[0x6];                                     // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x01F8(0x0018)()
};
static_assert(alignof(LeaveButton_C_GetLeaveActionText) == 0x000008, "Wrong alignment on LeaveButton_C_GetLeaveActionText");
static_assert(sizeof(LeaveButton_C_GetLeaveActionText) == 0x000210, "Wrong size on LeaveButton_C_GetLeaveActionText");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Text) == 0x000000, "Member 'LeaveButton_C_GetLeaveActionText::Text' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable) == 0x000018, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable) == 0x000030, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_1) == 0x000038, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetSubGame_ReturnValue) == 0x000058, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_byte_Variable) == 0x000059, "Member 'LeaveButton_C_GetLeaveActionText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_2) == 0x000060, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_3) == 0x000078, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_4) == 0x000090, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_5) == 0x0000A8, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_6) == 0x0000C0, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetContext_ReturnValue_1) == 0x0000D8, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsInOutpostZone_ReturnValue) == 0x0000E0, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable_1) == 0x0000E1, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_7) == 0x0000E8, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_8) == 0x000100, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable_2) == 0x000118, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_9) == 0x000120, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default) == 0x000138, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetGameState_ReturnValue) == 0x000150, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame) == 0x000158, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000160, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame_1) == 0x000169, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetPlaylistType_ReturnValue) == 0x00016A, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetPlaylistType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_text_Variable_10) == 0x000170, "Member 'LeaveButton_C_GetLeaveActionText::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default_1) == 0x000188, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default_2) == 0x0001A0, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, Temp_bool_Variable_3) == 0x0001B8, "Member 'LeaveButton_C_GetLeaveActionText::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001C0, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x0001C8, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default_3) == 0x0001D8, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsOutpostOwner_ReturnValue) == 0x0001F0, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame_2) == 0x0001F1, "Member 'LeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame_2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetLeaveActionText, K2Node_Select_Default_4) == 0x0001F8, "Member 'LeaveButton_C_GetLeaveActionText::K2Node_Select_Default_4' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.IsConsideredInGame
// 0x0020 (0x0020 - 0x0000)
struct LeaveButton_C_IsConsideredInGame final
{
public:
	bool                                          InGame;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_IsConsideredInGame) == 0x000008, "Wrong alignment on LeaveButton_C_IsConsideredInGame");
static_assert(sizeof(LeaveButton_C_IsConsideredInGame) == 0x000020, "Wrong size on LeaveButton_C_IsConsideredInGame");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, InGame) == 0x000000, "Member 'LeaveButton_C_IsConsideredInGame::InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_IsInLobby_ReturnValue) == 0x000018, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_IsInZone_ReturnValue) == 0x000019, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsConsideredInGame, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'LeaveButton_C_IsConsideredInGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.UpdateState
// 0x0030 (0x0030 - 0x0000)
struct LeaveButton_C_UpdateState final
{
public:
	class FText                                   CallFunc_GetLeaveActionText_Text;                  // 0x0000(0x0018)()
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_UpdateState) == 0x000008, "Wrong alignment on LeaveButton_C_UpdateState");
static_assert(sizeof(LeaveButton_C_UpdateState) == 0x000030, "Wrong size on LeaveButton_C_UpdateState");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetLeaveActionText_Text) == 0x000000, "Member 'LeaveButton_C_UpdateState::CallFunc_GetLeaveActionText_Text' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_IsConsideredInGame_InGame) == 0x000018, "Member 'LeaveButton_C_UpdateState::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'LeaveButton_C_UpdateState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000028, "Member 'LeaveButton_C_UpdateState::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'LeaveButton_C_UpdateState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_UpdateState, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'LeaveButton_C_UpdateState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.LeaveParty
// 0x0008 (0x0008 - 0x0000)
struct LeaveButton_C_LeaveParty final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_LeaveParty) == 0x000008, "Wrong alignment on LeaveButton_C_LeaveParty");
static_assert(sizeof(LeaveButton_C_LeaveParty) == 0x000008, "Wrong size on LeaveButton_C_LeaveParty");
static_assert(offsetof(LeaveButton_C_LeaveParty, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'LeaveButton_C_LeaveParty::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HasUnsavedQuestProgress
// 0x0030 (0x0030 - 0x0000)
struct LeaveButton_C_HasUnsavedQuestProgress final
{
public:
	bool                                          Param_HasUnsavedQuestProgress;                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FEA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnsavedPrimaryMissionProgress_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_HasUnsavedQuestProgress) == 0x000008, "Wrong alignment on LeaveButton_C_HasUnsavedQuestProgress");
static_assert(sizeof(LeaveButton_C_HasUnsavedQuestProgress) == 0x000030, "Wrong size on LeaveButton_C_HasUnsavedQuestProgress");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, Param_HasUnsavedQuestProgress) == 0x000000, "Member 'LeaveButton_C_HasUnsavedQuestProgress::Param_HasUnsavedQuestProgress' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'LeaveButton_C_HasUnsavedQuestProgress::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'LeaveButton_C_HasUnsavedQuestProgress::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'LeaveButton_C_HasUnsavedQuestProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'LeaveButton_C_HasUnsavedQuestProgress::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_HasUnsavedQuestProgress, CallFunc_HasUnsavedPrimaryMissionProgress_ReturnValue) == 0x000028, "Member 'LeaveButton_C_HasUnsavedQuestProgress::CallFunc_HasUnsavedPrimaryMissionProgress_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct LeaveButton_C_GetButton final
{
public:
	class UIconTextButton_C*                      Param_Leave;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_GetButton) == 0x000008, "Wrong alignment on LeaveButton_C_GetButton");
static_assert(sizeof(LeaveButton_C_GetButton) == 0x000008, "Wrong size on LeaveButton_C_GetButton");
static_assert(offsetof(LeaveButton_C_GetButton, Param_Leave) == 0x000000, "Member 'LeaveButton_C_GetButton::Param_Leave' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct LeaveButton_C_SetText final
{
public:
	class FText                                   TextOverride;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LeaveButton_C_SetText) == 0x000008, "Wrong alignment on LeaveButton_C_SetText");
static_assert(sizeof(LeaveButton_C_SetText) == 0x000018, "Wrong size on LeaveButton_C_SetText");
static_assert(offsetof(LeaveButton_C_SetText, TextOverride) == 0x000000, "Member 'LeaveButton_C_SetText::TextOverride' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.IsInNeighborhood
// 0x0020 (0x0020 - 0x0000)
struct LeaveButton_C_IsInNeighborhood final
{
public:
	bool                                          bIsInNeighborhood;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FEB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDeployableBaseManager*             DeployableBaseManager;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDeployableBaseUseType                        CallFunc_GetDeployableBaseUseType_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FEC[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDeployableBaseManager*             CallFunc_GetCurrent_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_IsInNeighborhood) == 0x000008, "Wrong alignment on LeaveButton_C_IsInNeighborhood");
static_assert(sizeof(LeaveButton_C_IsInNeighborhood) == 0x000020, "Wrong size on LeaveButton_C_IsInNeighborhood");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, bIsInNeighborhood) == 0x000000, "Member 'LeaveButton_C_IsInNeighborhood::bIsInNeighborhood' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, DeployableBaseManager) == 0x000008, "Member 'LeaveButton_C_IsInNeighborhood::DeployableBaseManager' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, CallFunc_GetDeployableBaseUseType_ReturnValue) == 0x000010, "Member 'LeaveButton_C_IsInNeighborhood::CallFunc_GetDeployableBaseUseType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'LeaveButton_C_IsInNeighborhood::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'LeaveButton_C_IsInNeighborhood::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_IsInNeighborhood, CallFunc_GetCurrent_ReturnValue) == 0x000018, "Member 'LeaveButton_C_IsInNeighborhood::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.GetDescriptionText
// 0x0028 (0x0028 - 0x0000)
struct LeaveButton_C_GetDescriptionText final
{
public:
	class FText                                   DescriptionText;                                   // 0x0000(0x0018)(Parm, OutParm)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_GetDescriptionText) == 0x000008, "Wrong alignment on LeaveButton_C_GetDescriptionText");
static_assert(sizeof(LeaveButton_C_GetDescriptionText) == 0x000028, "Wrong size on LeaveButton_C_GetDescriptionText");
static_assert(offsetof(LeaveButton_C_GetDescriptionText, DescriptionText) == 0x000000, "Member 'LeaveButton_C_GetDescriptionText::DescriptionText' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetDescriptionText, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'LeaveButton_C_GetDescriptionText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetDescriptionText, CallFunc_GetSubGame_ReturnValue) == 0x000020, "Member 'LeaveButton_C_GetDescriptionText::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_GetDescriptionText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'LeaveButton_C_GetDescriptionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.Change Main Menu Music State
// 0x0020 (0x0020 - 0x0000)
struct LeaveButton_C_Change_Main_Menu_Music_State final
{
public:
	bool                                          Set_Lobby_Music_State;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FED[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_Change_Main_Menu_Music_State) == 0x000008, "Wrong alignment on LeaveButton_C_Change_Main_Menu_Music_State");
static_assert(sizeof(LeaveButton_C_Change_Main_Menu_Music_State) == 0x000020, "Wrong size on LeaveButton_C_Change_Main_Menu_Music_State");
static_assert(offsetof(LeaveButton_C_Change_Main_Menu_Music_State, Set_Lobby_Music_State) == 0x000000, "Member 'LeaveButton_C_Change_Main_Menu_Music_State::Set_Lobby_Music_State' has a wrong offset!");
