#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveDialog

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaveDialog.LeaveDialog_C
// 0x0030 (0x0518 - 0x04E8)
class ULeaveDialog_C final : public UFortLeaveDialog
{
public:
	class UCommonBorder*                          CommonBorder_43;                                   // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MobileCloseOverlay;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLeaveDialogClosed;                               // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          NewVar_0;                                          // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnLeaveDialogClosed__DelegateSignature();
	struct FEventReply OnMouseButtonDownTapToClose(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaveDialog_C">();
	}
	static class ULeaveDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaveDialog_C>();
	}
};
static_assert(alignof(ULeaveDialog_C) == 0x000008, "Wrong alignment on ULeaveDialog_C");
static_assert(sizeof(ULeaveDialog_C) == 0x000518, "Wrong size on ULeaveDialog_C");
static_assert(offsetof(ULeaveDialog_C, CommonBorder_43) == 0x0004E8, "Member 'ULeaveDialog_C::CommonBorder_43' has a wrong offset!");
static_assert(offsetof(ULeaveDialog_C, Lightbox) == 0x0004F0, "Member 'ULeaveDialog_C::Lightbox' has a wrong offset!");
static_assert(offsetof(ULeaveDialog_C, MobileCloseOverlay) == 0x0004F8, "Member 'ULeaveDialog_C::MobileCloseOverlay' has a wrong offset!");
static_assert(offsetof(ULeaveDialog_C, OnLeaveDialogClosed) == 0x000500, "Member 'ULeaveDialog_C::OnLeaveDialogClosed' has a wrong offset!");
static_assert(offsetof(ULeaveDialog_C, NewVar_0) == 0x000510, "Member 'ULeaveDialog_C::NewVar_0' has a wrong offset!");

}

