#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeavePlatformPartyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeavePlatformPartyButton.LeavePlatformPartyButton_C
// 0x0018 (0x0B88 - 0x0B70)
class ULeavePlatformPartyButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_41;                                // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LeavePlatformPartyButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void SetText(const class FText& New_Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeavePlatformPartyButton_C">();
	}
	static class ULeavePlatformPartyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeavePlatformPartyButton_C>();
	}
};
static_assert(alignof(ULeavePlatformPartyButton_C) == 0x000008, "Wrong alignment on ULeavePlatformPartyButton_C");
static_assert(sizeof(ULeavePlatformPartyButton_C) == 0x000B88, "Wrong size on ULeavePlatformPartyButton_C");
static_assert(offsetof(ULeavePlatformPartyButton_C, UberGraphFrame) == 0x000B70, "Member 'ULeavePlatformPartyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeavePlatformPartyButton_C, OnHover) == 0x000B78, "Member 'ULeavePlatformPartyButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(ULeavePlatformPartyButton_C, CommonTextBlock_41) == 0x000B80, "Member 'ULeavePlatformPartyButton_C::CommonTextBlock_41' has a wrong offset!");

}

