#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LetoFrontendJoinPrompt_Side

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LetoFrontendJoinPrompt_Side.LetoFrontendJoinPrompt_Side_C
// 0x0038 (0x0268 - 0x0230)
class ULetoFrontendJoinPrompt_Side_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro_NotActivated;                                // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro_Activated;                                   // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptBackground;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_LetoFrontendJoinPrompt_Side(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LetoFrontendJoinPrompt_Side_C">();
	}
	static class ULetoFrontendJoinPrompt_Side_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULetoFrontendJoinPrompt_Side_C>();
	}
};
static_assert(alignof(ULetoFrontendJoinPrompt_Side_C) == 0x000008, "Wrong alignment on ULetoFrontendJoinPrompt_Side_C");
static_assert(sizeof(ULetoFrontendJoinPrompt_Side_C) == 0x000268, "Wrong size on ULetoFrontendJoinPrompt_Side_C");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, UberGraphFrame) == 0x000230, "Member 'ULetoFrontendJoinPrompt_Side_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, Outro_NotActivated) == 0x000238, "Member 'ULetoFrontendJoinPrompt_Side_C::Outro_NotActivated' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, Outro_Activated) == 0x000240, "Member 'ULetoFrontendJoinPrompt_Side_C::Outro_Activated' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, Intro) == 0x000248, "Member 'ULetoFrontendJoinPrompt_Side_C::Intro' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, InputActionIconScale) == 0x000250, "Member 'ULetoFrontendJoinPrompt_Side_C::InputActionIconScale' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, InputActionWidget) == 0x000258, "Member 'ULetoFrontendJoinPrompt_Side_C::InputActionWidget' has a wrong offset!");
static_assert(offsetof(ULetoFrontendJoinPrompt_Side_C, PromptBackground) == 0x000260, "Member 'ULetoFrontendJoinPrompt_Side_C::PromptBackground' has a wrong offset!");

}

