#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelUpVisuals

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LevelUpVisuals.LevelUpVisuals_C
// 0x0098 (0x02C8 - 0x0230)
class ULevelUpVisuals_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hah;                                               // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_BattlePass;                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_LevelNumber;                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TopText;                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BallLightning;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_circulartriangleeffects;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HorizontalLightning;                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HotGlow;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PulseRingImage;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DispatchComplete;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DispatchShowReward;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Level;                                             // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DispatchShowReward__DelegateSignature();
	void DispatchComplete__DelegateSignature();
	void ExecuteUbergraph_LevelUpVisuals(int32 EntryPoint);
	void EventLayeredPrestige();
	void Play_XP_Intro_Sound();
	void EventComplete();
	void EventIntroAnimComplete();
	void EventStartAnim();
	void Construct();
	void FireLevelReward();
	void ToggleText();
	void Post100LayeredAnim();
	void SequenceEvent__ENTRYPOINTLevelUpVisuals_0();
	void SequenceEvent__ENTRYPOINTLevelUpVisuals_1();
	void SequenceEvent__ENTRYPOINTLevelUpVisuals_2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelUpVisuals_C">();
	}
	static class ULevelUpVisuals_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelUpVisuals_C>();
	}
};
static_assert(alignof(ULevelUpVisuals_C) == 0x000008, "Wrong alignment on ULevelUpVisuals_C");
static_assert(sizeof(ULevelUpVisuals_C) == 0x0002C8, "Wrong size on ULevelUpVisuals_C");
static_assert(offsetof(ULevelUpVisuals_C, UberGraphFrame) == 0x000230, "Member 'ULevelUpVisuals_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Hah) == 0x000238, "Member 'ULevelUpVisuals_C::Hah' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Outro) == 0x000240, "Member 'ULevelUpVisuals_C::Outro' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Intro) == 0x000248, "Member 'ULevelUpVisuals_C::Intro' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, CommonTextBlock_BattlePass) == 0x000250, "Member 'ULevelUpVisuals_C::CommonTextBlock_BattlePass' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, CommonTextBlock_LevelNumber) == 0x000258, "Member 'ULevelUpVisuals_C::CommonTextBlock_LevelNumber' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, CommonWidgetSwitcher_TopText) == 0x000260, "Member 'ULevelUpVisuals_C::CommonWidgetSwitcher_TopText' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_BallLightning) == 0x000268, "Member 'ULevelUpVisuals_C::Image_BallLightning' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_Border) == 0x000270, "Member 'ULevelUpVisuals_C::Image_Border' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_circulartriangleeffects) == 0x000278, "Member 'ULevelUpVisuals_C::Image_circulartriangleeffects' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_HorizontalLightning) == 0x000280, "Member 'ULevelUpVisuals_C::Image_HorizontalLightning' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_HotGlow) == 0x000288, "Member 'ULevelUpVisuals_C::Image_HotGlow' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Image_PulseRingImage) == 0x000290, "Member 'ULevelUpVisuals_C::Image_PulseRingImage' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, RetainerBox_0) == 0x000298, "Member 'ULevelUpVisuals_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, DispatchComplete) == 0x0002A0, "Member 'ULevelUpVisuals_C::DispatchComplete' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, DispatchShowReward) == 0x0002B0, "Member 'ULevelUpVisuals_C::DispatchShowReward' has a wrong offset!");
static_assert(offsetof(ULevelUpVisuals_C, Level) == 0x0002C0, "Member 'ULevelUpVisuals_C::Level' has a wrong offset!");

}

