#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGB_MANG_UseFactionScannerDoor

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LGB_MANG_UseFactionScannerDoor.LGB_MANG_UseFactionScannerDoor_C.ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor
// 0x01D0 (0x01D0 - 0x0000)
struct LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FA[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FC[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FD[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Activator;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80FF[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8100[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0080(0x0020)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8101[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00B8(0x0020)(ConstParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABGA_Athena_FakeLock_Scanner_Interior_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x00E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8102[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_FakeLock_Scanner_Interior_C* CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8103[0x1];                                     // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8104[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8105[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8106[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceBetweenActors_Distance_1;      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8107[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8108[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8109[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor) == 0x000008, "Wrong alignment on LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor");
static_assert(sizeof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor) == 0x0001D0, "Wrong size on LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, EntryPoint) == 0x000000, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_int_Array_Index_Variable) == 0x000030, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000038, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_Event_Activator) == 0x000048, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_Event_Activator' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000050, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_object_Variable) == 0x000068, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_object_Variable_1) == 0x000070, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000078, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_struct_Variable) == 0x000080, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000A0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_4) == 0x0000A1, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_SwitchEnum_CmpSuccess) == 0x0000A2, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_GameState) == 0x0000A8, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_Playlist) == 0x0000B0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_PlaylistContextTags) == 0x0000B8, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000D8, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000DC, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000E0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Array_Get_Item) == 0x000100, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000108, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_BreakVector_X) == 0x000114, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_BreakVector_Y) == 0x000118, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_BreakVector_Z) == 0x00011C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_MakeVector_ReturnValue) == 0x000120, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Normal_ReturnValue) == 0x00012C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000138, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000144, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_5) == 0x000145, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_IsValid_ReturnValue_6) == 0x000146, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00014C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, Temp_int_Loop_Counter_Variable) == 0x000150, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_GetDistanceBetweenActors_Distance) == 0x000154, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Add_IntInt_ReturnValue) == 0x00015C, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_BooleanAND_ReturnValue) == 0x000160, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_GetDistanceBetweenActors_Distance_1) == 0x000164, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_GetDistanceBetweenActors_Distance_1' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000168, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_DamagedActor) == 0x000170, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_Damage) == 0x000178, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_InstigatedBy) == 0x000180, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_DamageCauser) == 0x000188, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_HitLocation) == 0x000190, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_FHitComponent) == 0x0001A0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_BoneName) == 0x0001A8, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CustomEvent_Momentum) == 0x0001B0, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001BC, "Member 'LGB_MANG_UseFactionScannerDoor_C_ExecuteUbergraph_LGB_MANG_UseFactionScannerDoor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function LGB_MANG_UseFactionScannerDoor.LGB_MANG_UseFactionScannerDoor_C.OnDied_Event
// 0x0050 (0x0050 - 0x0000)
struct LGB_MANG_UseFactionScannerDoor_C_OnDied_Event final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_810A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_810B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event) == 0x000008, "Wrong alignment on LGB_MANG_UseFactionScannerDoor_C_OnDied_Event");
static_assert(sizeof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event) == 0x000050, "Wrong size on LGB_MANG_UseFactionScannerDoor_C_OnDied_Event");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, DamagedActor) == 0x000000, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::DamagedActor' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, Damage) == 0x000008, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::Damage' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, InstigatedBy) == 0x000010, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::InstigatedBy' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, DamageCauser) == 0x000018, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::DamageCauser' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, HitLocation) == 0x000020, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::HitLocation' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, FHitComponent) == 0x000030, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::FHitComponent' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, BoneName) == 0x000038, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::BoneName' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnDied_Event, Momentum) == 0x000040, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnDied_Event::Momentum' has a wrong offset!");

// Function LGB_MANG_UseFactionScannerDoor.LGB_MANG_UseFactionScannerDoor_C.OnExecute
// 0x0008 (0x0008 - 0x0000)
struct LGB_MANG_UseFactionScannerDoor_C_OnExecute final
{
public:
	class AActor*                                 Activator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LGB_MANG_UseFactionScannerDoor_C_OnExecute) == 0x000008, "Wrong alignment on LGB_MANG_UseFactionScannerDoor_C_OnExecute");
static_assert(sizeof(LGB_MANG_UseFactionScannerDoor_C_OnExecute) == 0x000008, "Wrong size on LGB_MANG_UseFactionScannerDoor_C_OnExecute");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnExecute, Activator) == 0x000000, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnExecute::Activator' has a wrong offset!");

// Function LGB_MANG_UseFactionScannerDoor.LGB_MANG_UseFactionScannerDoor_C.OnReady_EFA3505D4A86CDC10C24919E49DE134C
// 0x0030 (0x0030 - 0x0000)
struct LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C) == 0x000008, "Wrong alignment on LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C");
static_assert(sizeof(LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C) == 0x000030, "Wrong size on LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C, GameState) == 0x000000, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C::GameState' has a wrong offset!");
static_assert(offsetof(LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C, Playlist) == 0x000008, "Member 'LGB_MANG_UseFactionScannerDoor_C_OnReady_EFA3505D4A86CDC10C24919E49DE134C::Playlist' has a wrong offset!");
