#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamMenuButtonToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamMenuButtonToggle.LiveStreamMenuButtonToggle_C
// 0x0038 (0x0BA8 - 0x0B70)
class ULiveStreamMenuButtonToggle_C final : public ULiveStreamMenuToggleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Art;                                               // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spikes;                                            // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LiveStreamMenuButtonToggle(int32 EntryPoint);
	void RefreshButton(bool IsLiveStreamEnabled);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamMenuButtonToggle_C">();
	}
	static class ULiveStreamMenuButtonToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamMenuButtonToggle_C>();
	}
};
static_assert(alignof(ULiveStreamMenuButtonToggle_C) == 0x000008, "Wrong alignment on ULiveStreamMenuButtonToggle_C");
static_assert(sizeof(ULiveStreamMenuButtonToggle_C) == 0x000BA8, "Wrong size on ULiveStreamMenuButtonToggle_C");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, UberGraphFrame) == 0x000B70, "Member 'ULiveStreamMenuButtonToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Hover) == 0x000B78, "Member 'ULiveStreamMenuButtonToggle_C::Hover' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Art) == 0x000B80, "Member 'ULiveStreamMenuButtonToggle_C::Art' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, BackgroundImage) == 0x000B88, "Member 'ULiveStreamMenuButtonToggle_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, ButtonText) == 0x000B90, "Member 'ULiveStreamMenuButtonToggle_C::ButtonText' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, LiveViolator) == 0x000B98, "Member 'ULiveStreamMenuButtonToggle_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Spikes) == 0x000BA0, "Member 'ULiveStreamMenuButtonToggle_C::Spikes' has a wrong offset!");

}

