#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamLetEmKnow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamLetEmKnow.LiveStreamLetEmKnow_C
// 0x0018 (0x0248 - 0x0230)
class ULiveStreamLetEmKnow_C final : public ULiveStreamInMatchAd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroOutro;                                        // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Callout;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowAdvertisement();
	void ExecuteUbergraph_LiveStreamLetEmKnow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamLetEmKnow_C">();
	}
	static class ULiveStreamLetEmKnow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamLetEmKnow_C>();
	}
};
static_assert(alignof(ULiveStreamLetEmKnow_C) == 0x000008, "Wrong alignment on ULiveStreamLetEmKnow_C");
static_assert(sizeof(ULiveStreamLetEmKnow_C) == 0x000248, "Wrong size on ULiveStreamLetEmKnow_C");
static_assert(offsetof(ULiveStreamLetEmKnow_C, UberGraphFrame) == 0x000230, "Member 'ULiveStreamLetEmKnow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamLetEmKnow_C, IntroOutro) == 0x000238, "Member 'ULiveStreamLetEmKnow_C::IntroOutro' has a wrong offset!");
static_assert(offsetof(ULiveStreamLetEmKnow_C, Text_Callout) == 0x000240, "Member 'ULiveStreamLetEmKnow_C::Text_Callout' has a wrong offset!");

}

