#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamHUDElement

#include "Basic.hpp"


namespace SDK::Params
{

// Function LiveStreamHUDElement.LiveStreamHUDElement_C.OnComplete_74112BA8413888C7EAD38CA589F3B588
// 0x0008 (0x0008 - 0x0000)
struct LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588 final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588) == 0x000008, "Wrong alignment on LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588");
static_assert(sizeof(LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588) == 0x000008, "Wrong size on LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588");
static_assert(offsetof(LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588, UserWidget) == 0x000000, "Member 'LiveStreamHUDElement_C_OnComplete_74112BA8413888C7EAD38CA589F3B588::UserWidget' has a wrong offset!");

// Function LiveStreamHUDElement.LiveStreamHUDElement_C.ExecuteUbergraph_LiveStreamHUDElement
// 0x0060 (0x0060 - 0x0000)
struct LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6491[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULiveStreamStandalonePlayer*            K2Node_DynamicCast_AsLive_Stream_Standalone_Player; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6492[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement) == 0x000008, "Wrong alignment on LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement");
static_assert(sizeof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement) == 0x000060, "Wrong size on LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, EntryPoint) == 0x000000, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, K2Node_CustomEvent_UserWidget) == 0x000020, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, Temp_object_Variable) == 0x000028, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, K2Node_DynamicCast_AsLive_Stream_Standalone_Player) == 0x000030, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::K2Node_DynamicCast_AsLive_Stream_Standalone_Player' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_CreateWidgetAsync_ReturnValue) == 0x000048, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_CreateWidgetAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement, CallFunc_IsValid_ReturnValue_2) == 0x00005A, "Member 'LiveStreamHUDElement_C_ExecuteUbergraph_LiveStreamHUDElement::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

