#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalUserSettingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalUserSettingButton.LocalUserSettingButton_C
// 0x0020 (0x0BA8 - 0x0B88)
class ULocalUserSettingButton_C final : public UFortLocalUserSettingButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AnimatedArrow;                               // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LocalUserSettingButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalUserSettingButton_C">();
	}
	static class ULocalUserSettingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalUserSettingButton_C>();
	}
};
static_assert(alignof(ULocalUserSettingButton_C) == 0x000008, "Wrong alignment on ULocalUserSettingButton_C");
static_assert(sizeof(ULocalUserSettingButton_C) == 0x000BA8, "Wrong size on ULocalUserSettingButton_C");
static_assert(offsetof(ULocalUserSettingButton_C, UberGraphFrame) == 0x000B88, "Member 'ULocalUserSettingButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, OnHover) == 0x000B90, "Member 'ULocalUserSettingButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, Border_InteractionIndicator) == 0x000B98, "Member 'ULocalUserSettingButton_C::Border_InteractionIndicator' has a wrong offset!");
static_assert(offsetof(ULocalUserSettingButton_C, Image_AnimatedArrow) == 0x000BA0, "Member 'ULocalUserSettingButton_C::Image_AnimatedArrow' has a wrong offset!");

}

