#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalNotifications

#include "Basic.hpp"


namespace SDK
{

// Enum LocalNotifications.ELocalNotificationEventType
// NumValues: 0x0003
enum class ELocalNotificationEventType : uint8
{
	None                                     = 0,
	FirstLogin                               = 1,
	Max                                      = 2,
};

// Enum LocalNotifications.ELocalNotificationParams
// NumValues: 0x0006
enum class ELocalNotificationParams : uint8
{
	BestHour24ToNotify                       = 0,
	SpecificFireDateTime                     = 1,
	HoursSinceLastSession                    = 2,
	HoursAfterEvent_Max                      = 3,
	HoursAfterEvent_Min                      = 4,
	Max                                      = 5,
};

// Enum LocalNotifications.ELocalNotificationType
// NumValues: 0x0003
enum class ELocalNotificationType : uint8
{
	SpecificDateTime                         = 0,
	RangeDateTime                            = 1,
	Max                                      = 2,
};

// ScriptStruct LocalNotifications.LocalNotificationData
// 0x0090 (0x0090 - 0x0000)
struct FLocalNotificationData final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocalNotificationType                        Type;                                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocalNotificationEventType                   EventType;                                         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EBF[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELocalNotificationParams, class FString> ParamsByName;                                      // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	bool                                          LocalTime;                                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC0[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TitleKey;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyKey;                                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActivationEvent;                                   // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLocalNotificationData) == 0x000008, "Wrong alignment on FLocalNotificationData");
static_assert(sizeof(FLocalNotificationData) == 0x000090, "Wrong size on FLocalNotificationData");
static_assert(offsetof(FLocalNotificationData, Enable) == 0x000000, "Member 'FLocalNotificationData::Enable' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, Type) == 0x000001, "Member 'FLocalNotificationData::Type' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, EventType) == 0x000002, "Member 'FLocalNotificationData::EventType' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, ParamsByName) == 0x000008, "Member 'FLocalNotificationData::ParamsByName' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, LocalTime) == 0x000058, "Member 'FLocalNotificationData::LocalTime' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, TitleKey) == 0x000060, "Member 'FLocalNotificationData::TitleKey' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, BodyKey) == 0x000070, "Member 'FLocalNotificationData::BodyKey' has a wrong offset!");
static_assert(offsetof(FLocalNotificationData, ActivationEvent) == 0x000080, "Member 'FLocalNotificationData::ActivationEvent' has a wrong offset!");

}

