#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Robot_01_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Robot_01_AnimBP.M_MED_Robot_01_AnimBP_C
// 0x3D30 (0x4180 - 0x0450)
class UM_MED_Robot_01_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_48DC[0x8];                                     // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_48DD[0x8];                                     // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_21;                           // 0x0460(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_20;                           // 0x0610(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_19;                           // 0x07C0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_18;                           // 0x0970(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_17;                           // 0x0B20(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_16;                           // 0x0CD0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_15;                           // 0x0E80(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_14;                           // 0x1030(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_13;                           // 0x11E0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_12;                           // 0x1390(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_11;                           // 0x1540(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_10;                           // 0x16F0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_9;                            // 0x18A0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_8;                            // 0x1A50(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7;                            // 0x1C00(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_6;                            // 0x1DB0(0x01B0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x1F60(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x2068(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2170(0x0650)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x27C0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x28C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x29D0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2AD8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x2BE0(0x0108)()
	uint8                                         Pad_48DE[0x8];                                     // 0x2CE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_5;                            // 0x2CF0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4;                            // 0x2EA0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x3050(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x3200(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x33B0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x3560(0x01B0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4;              // 0x3710(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3;              // 0x3828(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2;              // 0x3940(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x3A58(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x3B70(0x0118)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x3C88(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x3D90(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x3E98(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3FA0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3FC0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x3FE0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x4120(0x0030)()
	struct FVector                                PistonJitter;                                      // 0x4150(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PistonRun;                                         // 0x415C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Random_Rotation_01;                                // 0x4168(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Random_Rotation_02;                                // 0x4174(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_M_MED_Robot_01_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Robot_01_AnimBP_C">();
	}
	static class UM_MED_Robot_01_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Robot_01_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Robot_01_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Robot_01_AnimBP_C");
static_assert(sizeof(UM_MED_Robot_01_AnimBP_C) == 0x004180, "Wrong size on UM_MED_Robot_01_AnimBP_C");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, UberGraphFrame) == 0x000450, "Member 'UM_MED_Robot_01_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_21) == 0x000460, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_21' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_20) == 0x000610, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_20' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_19) == 0x0007C0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_19' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_18) == 0x000970, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_18' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_17) == 0x000B20, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_17' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_16) == 0x000CD0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_15) == 0x000E80, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_14) == 0x001030, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_13) == 0x0011E0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_12) == 0x001390, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_11) == 0x001540, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_10) == 0x0016F0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_9) == 0x0018A0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_8) == 0x001A50, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_7) == 0x001C00, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_6) == 0x001DB0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_9) == 0x001F60, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_8) == 0x002068, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_RigidBody) == 0x002170, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_7) == 0x0027C0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_6) == 0x0028C8, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_5) == 0x0029D0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002AD8, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_3) == 0x002BE0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_5) == 0x002CF0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_4) == 0x002EA0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_3) == 0x003050, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_2) == 0x003200, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt_1) == 0x0033B0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LookAt) == 0x003560, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_BoneDrivenController_4) == 0x003710, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_BoneDrivenController_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_BoneDrivenController_3) == 0x003828, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_BoneDrivenController_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_BoneDrivenController_2) == 0x003940, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_BoneDrivenController_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_BoneDrivenController_1) == 0x003A58, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_BoneDrivenController_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_BoneDrivenController) == 0x003B70, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_2) == 0x003C88, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint_1) == 0x003D90, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Constraint) == 0x003E98, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x003FA0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x003FC0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x003FE0, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, AnimGraphNode_Root) == 0x004120, "Member 'UM_MED_Robot_01_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, PistonJitter) == 0x004150, "Member 'UM_MED_Robot_01_AnimBP_C::PistonJitter' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, PistonRun) == 0x00415C, "Member 'UM_MED_Robot_01_AnimBP_C::PistonRun' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, Random_Rotation_01) == 0x004168, "Member 'UM_MED_Robot_01_AnimBP_C::Random_Rotation_01' has a wrong offset!");
static_assert(offsetof(UM_MED_Robot_01_AnimBP_C, Random_Rotation_02) == 0x004174, "Member 'UM_MED_Robot_01_AnimBP_C::Random_Rotation_02' has a wrong offset!");

}

