#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Sandcastle_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Sandcastle_AnimBP.M_MED_Sandcastle_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Sandcastle_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Sandcastle_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Sandcastle_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Sandcastle_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Sandcastle_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'M_MED_Sandcastle_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function M_MED_Sandcastle_AnimBP.M_MED_Sandcastle_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Sandcastle_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Sandcastle_AnimBP.M_MED_Sandcastle_AnimBP_C.ExecuteUbergraph_M_MED_Sandcastle_AnimBP
// 0x0190 (0x0190 - 0x0000)
struct M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition;       // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_1;     // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_1;     // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_2;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_2;     // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_3;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_3;     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_582F[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5830[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_4; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_4; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_5; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_5; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_5;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5831[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_4;     // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_4;     // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_5;     // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_5;     // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_6;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_6;     // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_6;     // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformFromBoneSpace_OutPosition_7;     // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformFromBoneSpace_OutRotation_7;     // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_3;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_7;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP) == 0x000008, "Wrong alignment on M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP");
static_assert(sizeof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP) == 0x000190, "Wrong size on M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition) == 0x000014, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation) == 0x000020, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_1) == 0x00002C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_1) == 0x000038, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_2) == 0x000044, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_2) == 0x000050, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Vector_Distance_ReturnValue) == 0x00005C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_3) == 0x000060, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_3) == 0x00006C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000078, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Vector_Distance_ReturnValue_1) == 0x00007C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000080, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000084, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1) == 0x000090, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000098, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput) == 0x00009C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput) == 0x0000A0, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1) == 0x0000A4, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1) == 0x0000A8, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2) == 0x0000AC, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2) == 0x0000B0, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_SelectFloat_ReturnValue_1) == 0x0000B4, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3) == 0x0000B8, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3) == 0x0000BC, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000C0, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MakeVector_ReturnValue) == 0x0000C4, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_4) == 0x0000D0, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_4' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_4) == 0x0000D4, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_4' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_4) == 0x0000D8, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MakeVector_ReturnValue_1) == 0x0000DC, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_5) == 0x0000E8, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_5' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_5) == 0x0000EC, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_5' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_5) == 0x0000F0, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2) == 0x0000F8, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_4) == 0x000100, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_4' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_4) == 0x00010C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_4' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_5) == 0x000118, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_5' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_5) == 0x000124, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_5' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Vector_Distance_ReturnValue_2) == 0x00013C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Vector_Distance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_SelectVector_ReturnValue) == 0x000140, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_6) == 0x00014C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_6) == 0x000150, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_6' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_6) == 0x00015C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_6' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutPosition_7) == 0x000168, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutPosition_7' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_TransformFromBoneSpace_OutRotation_7) == 0x000174, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_TransformFromBoneSpace_OutRotation_7' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, K2Node_Event_DeltaTimeX) == 0x000180, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_Vector_Distance_ReturnValue_3) == 0x000184, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_Vector_Distance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_MapRangeClamped_ReturnValue_7) == 0x000188, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_MapRangeClamped_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP, CallFunc_SelectFloat_ReturnValue_2) == 0x00018C, "Member 'M_MED_Sandcastle_AnimBP_C_ExecuteUbergraph_M_MED_Sandcastle_AnimBP::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");

}

