#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Sandcastle_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Sandcastle_FaceAcc_AnimBP.M_MED_Sandcastle_FaceAcc_AnimBP_C
// 0x1BB0 (0x2000 - 0x0450)
class UM_MED_Sandcastle_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_7BF8[0x8];                                     // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_7BF9[0x8];                                     // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x05A0(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0BF0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C10(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x0C30(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0DE0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0F90(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1140(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x1170(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x1278(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1380(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1488(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1590(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x1698(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x17A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x18A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x19B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1AB8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1BC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1CC8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1DD0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1ED8(0x0108)()
	struct FVector                                WindVector;                                        // 0x1FE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IsTargetingAlpha;                                  // 0x1FEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadLookUpAlpha;                                   // 0x1FF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IsSkydivingAlpha;                                  // 0x1FF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadAndAimAlpha;                                   // 0x1FF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IsFrontEndStorePoseAlpha;                          // 0x1FFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void OnBeginTargeting();
	void OnEndTargeting();
	void OnEndSkydiving();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_M_MED_Sandcastle_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Sandcastle_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_Sandcastle_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Sandcastle_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Sandcastle_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Sandcastle_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_Sandcastle_FaceAcc_AnimBP_C) == 0x002000, "Wrong size on UM_MED_Sandcastle_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000450, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x0005A0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000BF0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C10, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_LookAt_2) == 0x000C30, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_LookAt_1) == 0x000DE0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_LookAt) == 0x000F90, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x001140, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x001170, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x001278, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x001380, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x001488, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x001590, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x001698, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x0017A0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x0018A8, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0019B0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001AB8, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001BC0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001CC8, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001DD0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001ED8, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, WindVector) == 0x001FE0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::WindVector' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, IsTargetingAlpha) == 0x001FEC, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::IsTargetingAlpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, HeadLookUpAlpha) == 0x001FF0, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::HeadLookUpAlpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, IsSkydivingAlpha) == 0x001FF4, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::IsSkydivingAlpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, HeadAndAimAlpha) == 0x001FF8, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::HeadAndAimAlpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Sandcastle_FaceAcc_AnimBP_C, IsFrontEndStorePoseAlpha) == 0x001FFC, "Member 'UM_MED_Sandcastle_FaceAcc_AnimBP_C::IsFrontEndStorePoseAlpha' has a wrong offset!");

}

