#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainTabsScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StoreOfferCosts_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainTabsScreen.MainTabsScreen_C.Determine If Any non-MTX offers are purchasable
// 0x00C0 (0x00C0 - 0x0000)
struct MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable final
{
public:
	bool                                          ShowBang;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowBang;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B4B[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B4C[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCardPackOffer>                 CallFunc_Get_Valid_Offers_Offers;                  // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCardPackOffer                         CallFunc_Array_Get_Item;                           // 0x0038(0x0078)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B4E[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalItemQuantityByDefinition_ReturnValue; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable) == 0x000008, "Wrong alignment on MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable");
static_assert(sizeof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable) == 0x0000C0, "Wrong size on MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, ShowBang) == 0x000000, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::ShowBang' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, bShowBang) == 0x000001, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::bShowBang' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Get_Valid_Offers_Offers) == 0x000020, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Get_Valid_Offers_Offers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Array_Get_Item) == 0x000038, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_BooleanAND_ReturnValue) == 0x0000B1, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_GetTotalItemQuantityByDefinition_ReturnValue) == 0x0000B4, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_GetTotalItemQuantityByDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B9, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000BA, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BB, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BC, "Member 'MainTabsScreen_C_Determine_If_Any_nonMinusMTX_offers_are_purchasable::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.CheckDisplayCriteria
// 0x00E8 (0x00E8 - 0x0000)
struct MainTabsScreen_C_CheckDisplayCriteria final
{
public:
	EStoreOfferCosts                              InCustomStoreOfferCost;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCardPackOffer                         InCardPackOffer;                                   // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bPassedDisplayCriteria;                            // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B50[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrencyBalance;                                   // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B51[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPrivateAccountInfo                CallFunc_GetLocalAccountInfo_Result;               // 0x00A0(0x0038)(NoDestructor)
	class UFortAccountItem*                       CallFunc_GetAccountItemWithDefinition_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B52[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_CheckDisplayCriteria) == 0x000008, "Wrong alignment on MainTabsScreen_C_CheckDisplayCriteria");
static_assert(sizeof(MainTabsScreen_C_CheckDisplayCriteria) == 0x0000E8, "Wrong size on MainTabsScreen_C_CheckDisplayCriteria");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, InCustomStoreOfferCost) == 0x000000, "Member 'MainTabsScreen_C_CheckDisplayCriteria::InCustomStoreOfferCost' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, InCardPackOffer) == 0x000008, "Member 'MainTabsScreen_C_CheckDisplayCriteria::InCardPackOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, bPassedDisplayCriteria) == 0x000080, "Member 'MainTabsScreen_C_CheckDisplayCriteria::bPassedDisplayCriteria' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CurrencyBalance) == 0x000084, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CurrencyBalance' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'MainTabsScreen_C_CheckDisplayCriteria::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000089, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GetContext_ReturnValue_1) == 0x000098, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GetLocalAccountInfo_Result) == 0x0000A0, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GetLocalAccountInfo_Result' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GetAccountItemWithDefinition_ReturnValue) == 0x0000D8, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GetAccountItemWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckDisplayCriteria, CallFunc_GetNumInStack_ReturnValue) == 0x0000E4, "Member 'MainTabsScreen_C_CheckDisplayCriteria::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.GetCustomStoreOfferCost
// 0x0080 (0x0080 - 0x0000)
struct MainTabsScreen_C_GetCustomStoreOfferCost final
{
public:
	struct FCardPackOffer                         InCardPackOffer;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	EStoreOfferCosts                              OutCustomStoreOfferCost;                           // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStoreOfferCosts                              CustomStoreOfferCost;                              // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_GetCustomStoreOfferCost) == 0x000008, "Wrong alignment on MainTabsScreen_C_GetCustomStoreOfferCost");
static_assert(sizeof(MainTabsScreen_C_GetCustomStoreOfferCost) == 0x000080, "Wrong size on MainTabsScreen_C_GetCustomStoreOfferCost");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, InCardPackOffer) == 0x000000, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::InCardPackOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, OutCustomStoreOfferCost) == 0x000078, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::OutCustomStoreOfferCost' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CustomStoreOfferCost) == 0x000079, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CustomStoreOfferCost' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00007A, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00007B, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00007C, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00007D, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_GetCustomStoreOfferCost, CallFunc_Greater_IntInt_ReturnValue) == 0x00007E, "Member 'MainTabsScreen_C_GetCustomStoreOfferCost::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.CheckHighestPriorityOffer
// 0x01A8 (0x01A8 - 0x0000)
struct MainTabsScreen_C_CheckHighestPriorityOffer final
{
public:
	TArray<struct FCardPackOffer>                 InOfferArray;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FCardPackOffer                         OutPriorityOffer;                                  // 0x0010(0x0078)(Parm, OutParm)
	bool                                          FoundOffer;                                        // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OfferFound;                                        // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B53[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCardPackOffer                         PriorityOffer;                                     // 0x0090(0x0078)(Edit, BlueprintVisible)
	int32                                         HighestDisplayPriority;                            // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCardPackOffer                         CallFunc_Array_Get_Item;                           // 0x0118(0x0078)()
	EStoreOfferCosts                              CallFunc_GetCustomStoreOfferCost_OutCustomStoreOfferCost; // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDisplayCriteria_bPassedDisplayCriteria; // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B54[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMetaIntOnOffer_ReturnValue;            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B55[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_CheckHighestPriorityOffer) == 0x000008, "Wrong alignment on MainTabsScreen_C_CheckHighestPriorityOffer");
static_assert(sizeof(MainTabsScreen_C_CheckHighestPriorityOffer) == 0x0001A8, "Wrong size on MainTabsScreen_C_CheckHighestPriorityOffer");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, InOfferArray) == 0x000000, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::InOfferArray' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, OutPriorityOffer) == 0x000010, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::OutPriorityOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, FoundOffer) == 0x000088, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::FoundOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, OfferFound) == 0x000089, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::OfferFound' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, PriorityOffer) == 0x000090, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::PriorityOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, HighestDisplayPriority) == 0x000108, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::HighestDisplayPriority' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, Temp_int_Array_Index_Variable) == 0x000110, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_Array_Get_Item) == 0x000118, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_GetCustomStoreOfferCost_OutCustomStoreOfferCost) == 0x000190, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_GetCustomStoreOfferCost_OutCustomStoreOfferCost' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_CheckDisplayCriteria_bPassedDisplayCriteria) == 0x000191, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_CheckDisplayCriteria_bPassedDisplayCriteria' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_GetMetaIntOnOffer_ReturnValue) == 0x000194, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_GetMetaIntOnOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CheckHighestPriorityOffer, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A0, "Member 'MainTabsScreen_C_CheckHighestPriorityOffer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Get Valid Offers
// 0x0260 (0x0260 - 0x0000)
struct MainTabsScreen_C_Get_Valid_Offers final
{
public:
	TArray<struct FCardPackOffer>                 Offers;                                            // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	struct FCardPackOffer                         TempOffer;                                         // 0x0010(0x0078)(Edit, BlueprintVisible)
	TArray<struct FCardPackOffer>                 UpgradeOffers;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FCardPackOffer>                 SharedDisplayOffers;                               // 0x0098(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FCardPackOffer>                 StandardOffers;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B56[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCardPackOffer                         CallFunc_CheckHighestPriorityOffer_outPriorityOffer; // 0x00C8(0x0078)()
	bool                                          CallFunc_CheckHighestPriorityOffer_FoundOffer;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B57[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCardPackOffer                         CallFunc_CheckHighestPriorityOffer_outPriorityOffer_1; // 0x0148(0x0078)()
	bool                                          CallFunc_CheckHighestPriorityOffer_FoundOffer_1;   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMetaBoolOnOffer_ReturnValue;           // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMetaBoolOnOffer_ReturnValue_1;         // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B58[0x1];                                     // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B59[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCardPackOffer                         CallFunc_Array_Get_Item;                           // 0x01E0(0x0078)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Get_Valid_Offers) == 0x000008, "Wrong alignment on MainTabsScreen_C_Get_Valid_Offers");
static_assert(sizeof(MainTabsScreen_C_Get_Valid_Offers) == 0x000260, "Wrong size on MainTabsScreen_C_Get_Valid_Offers");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, Offers) == 0x000000, "Member 'MainTabsScreen_C_Get_Valid_Offers::Offers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, TempOffer) == 0x000010, "Member 'MainTabsScreen_C_Get_Valid_Offers::TempOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, UpgradeOffers) == 0x000088, "Member 'MainTabsScreen_C_Get_Valid_Offers::UpgradeOffers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, SharedDisplayOffers) == 0x000098, "Member 'MainTabsScreen_C_Get_Valid_Offers::SharedDisplayOffers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, StandardOffers) == 0x0000A8, "Member 'MainTabsScreen_C_Get_Valid_Offers::StandardOffers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'MainTabsScreen_C_Get_Valid_Offers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'MainTabsScreen_C_Get_Valid_Offers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_CheckHighestPriorityOffer_outPriorityOffer) == 0x0000C8, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_CheckHighestPriorityOffer_outPriorityOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_CheckHighestPriorityOffer_FoundOffer) == 0x000140, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_CheckHighestPriorityOffer_FoundOffer' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_CheckHighestPriorityOffer_outPriorityOffer_1) == 0x000148, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_CheckHighestPriorityOffer_outPriorityOffer_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_CheckHighestPriorityOffer_FoundOffer_1) == 0x0001C0, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_CheckHighestPriorityOffer_FoundOffer_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_GetMetaBoolOnOffer_ReturnValue) == 0x0001C1, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_GetMetaBoolOnOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_GetMetaBoolOnOffer_ReturnValue_1) == 0x0001C2, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_GetMetaBoolOnOffer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Array_Add_ReturnValue) == 0x0001C4, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Array_Add_ReturnValue_1) == 0x0001C8, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_GetContext_ReturnValue) == 0x0001D0, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Array_Add_ReturnValue_2) == 0x0001D8, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Array_Length_ReturnValue) == 0x0001DC, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Get_Valid_Offers, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'MainTabsScreen_C_Get_Valid_Offers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Is Transform Feature Unlocked
// 0x0018 (0x0018 - 0x0000)
struct MainTabsScreen_C_Is_Transform_Feature_Unlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTagContainer_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTagContainer_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Is_Transform_Feature_Unlocked) == 0x000008, "Wrong alignment on MainTabsScreen_C_Is_Transform_Feature_Unlocked");
static_assert(sizeof(MainTabsScreen_C_Is_Transform_Feature_Unlocked) == 0x000018, "Wrong size on MainTabsScreen_C_Is_Transform_Feature_Unlocked");
static_assert(offsetof(MainTabsScreen_C_Is_Transform_Feature_Unlocked, ReturnValue) == 0x000000, "Member 'MainTabsScreen_C_Is_Transform_Feature_Unlocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Is_Transform_Feature_Unlocked, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MainTabsScreen_C_Is_Transform_Feature_Unlocked::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Is_Transform_Feature_Unlocked, CallFunc_HasGameplayTagContainer_ReturnValue) == 0x000010, "Member 'MainTabsScreen_C_Is_Transform_Feature_Unlocked::CallFunc_HasGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Is_Transform_Feature_Unlocked, CallFunc_HasGameplayTagContainer_ReturnValue_1) == 0x000011, "Member 'MainTabsScreen_C_Is_Transform_Feature_Unlocked::CallFunc_HasGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Is_Transform_Feature_Unlocked, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'MainTabsScreen_C_Is_Transform_Feature_Unlocked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleCardPackStore
// 0x000C (0x000C - 0x0000)
struct MainTabsScreen_C_HandleCardPackStore final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_HandleCardPackStore) == 0x000004, "Wrong alignment on MainTabsScreen_C_HandleCardPackStore");
static_assert(sizeof(MainTabsScreen_C_HandleCardPackStore) == 0x00000C, "Wrong size on MainTabsScreen_C_HandleCardPackStore");
static_assert(offsetof(MainTabsScreen_C_HandleCardPackStore, TabId) == 0x000000, "Member 'MainTabsScreen_C_HandleCardPackStore::TabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleCardPackStore, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'MainTabsScreen_C_HandleCardPackStore::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleCardPackStore, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000009, "Member 'MainTabsScreen_C_HandleCardPackStore::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleMtxStore
// 0x0008 (0x0008 - 0x0000)
struct MainTabsScreen_C_HandleMtxStore final
{
public:
	class FName                                   Tab_ID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_HandleMtxStore) == 0x000004, "Wrong alignment on MainTabsScreen_C_HandleMtxStore");
static_assert(sizeof(MainTabsScreen_C_HandleMtxStore) == 0x000008, "Wrong size on MainTabsScreen_C_HandleMtxStore");
static_assert(offsetof(MainTabsScreen_C_HandleMtxStore, Tab_ID) == 0x000000, "Member 'MainTabsScreen_C_HandleMtxStore::Tab_ID' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Handle Unclaimed Resources Updated
// 0x0001 (0x0001 - 0x0000)
struct MainTabsScreen_C_Handle_Unclaimed_Resources_Updated final
{
public:
	bool                                          CallFunc_Determine_Unclaimed_Resources_at_Threshold_Result; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Handle_Unclaimed_Resources_Updated) == 0x000001, "Wrong alignment on MainTabsScreen_C_Handle_Unclaimed_Resources_Updated");
static_assert(sizeof(MainTabsScreen_C_Handle_Unclaimed_Resources_Updated) == 0x000001, "Wrong size on MainTabsScreen_C_Handle_Unclaimed_Resources_Updated");
static_assert(offsetof(MainTabsScreen_C_Handle_Unclaimed_Resources_Updated, CallFunc_Determine_Unclaimed_Resources_at_Threshold_Result) == 0x000000, "Member 'MainTabsScreen_C_Handle_Unclaimed_Resources_Updated::CallFunc_Determine_Unclaimed_Resources_at_Threshold_Result' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Toggle Unclaimed Research Timer
// 0x0020 (0x0020 - 0x0000)
struct MainTabsScreen_C_Toggle_Unclaimed_Research_Timer final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7B5C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_Toggle_Unclaimed_Research_Timer) == 0x000008, "Wrong alignment on MainTabsScreen_C_Toggle_Unclaimed_Research_Timer");
static_assert(sizeof(MainTabsScreen_C_Toggle_Unclaimed_Research_Timer) == 0x000020, "Wrong size on MainTabsScreen_C_Toggle_Unclaimed_Research_Timer");
static_assert(offsetof(MainTabsScreen_C_Toggle_Unclaimed_Research_Timer, Enable) == 0x000000, "Member 'MainTabsScreen_C_Toggle_Unclaimed_Research_Timer::Enable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Toggle_Unclaimed_Research_Timer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MainTabsScreen_C_Toggle_Unclaimed_Research_Timer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Toggle_Unclaimed_Research_Timer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'MainTabsScreen_C_Toggle_Unclaimed_Research_Timer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Determine Unclaimed Resources at Threshold
// 0x0088 (0x0088 - 0x0000)
struct MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UnclaimedResearchMax;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnclaimedResearch;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B5E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectedResourceItem*             LocalResource;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B5F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B60[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetResourceCollectorRateInfo_RatePerSecond; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCollectorRateInfo_MaxCapacity; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemQuantityPair                  CallFunc_GetResourceCollectorRewardsEstimate_OutEstimate; // 0x0040(0x0014)(NoDestructor)
	uint8                                         Pad_7B61[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_2;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortCollectedResourceItem*>     CallFunc_GetAllResourceCollectors_ResourceCollectorsOwned; // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B62[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectedResourceItem*             CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold) == 0x000008, "Wrong alignment on MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold");
static_assert(sizeof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold) == 0x000088, "Wrong size on MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, Result) == 0x000000, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::Result' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, UnclaimedResearchMax) == 0x000004, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::UnclaimedResearchMax' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, UnclaimedResearch) == 0x000008, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::UnclaimedResearch' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, LocalResource) == 0x000010, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::LocalResource' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetResourceCollectorRateInfo_RatePerSecond) == 0x00002C, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetResourceCollectorRateInfo_RatePerSecond' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetResourceCollectorRateInfo_MaxCapacity) == 0x000030, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetResourceCollectorRateInfo_MaxCapacity' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetContext_ReturnValue_1) == 0x000038, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetResourceCollectorRewardsEstimate_OutEstimate) == 0x000040, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetResourceCollectorRewardsEstimate_OutEstimate' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetContext_ReturnValue_2) == 0x000058, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_GetAllResourceCollectors_ResourceCollectorsOwned) == 0x000060, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_GetAllResourceCollectors_ResourceCollectorsOwned' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000070, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Array_Get_Item) == 0x000078, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold, CallFunc_IsValid_ReturnValue) == 0x000085, "Member 'MainTabsScreen_C_Determine_Unclaimed_Resources_at_Threshold::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Store Tab Button Bang
// 0x0090 (0x0090 - 0x0000)
struct MainTabsScreen_C_Update_Store_Tab_Button_Bang final
{
public:
	class FName                                   Tab;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTabId;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBang;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B63[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B64[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Determine_If_Any_non_MTX_offers_are_purchasable_ShowBang; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B65[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B66[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCardPackItem*                      K2Node_DynamicCast_AsFort_Card_Pack_Item;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanStoreOpen_ReturnValue;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B67[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B68[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_Get_Tab_From_Id_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainTabIconButton_C*                   K2Node_DynamicCast_AsMain_Tab_Icon_Button;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Update_Store_Tab_Button_Bang) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Store_Tab_Button_Bang");
static_assert(sizeof(MainTabsScreen_C_Update_Store_Tab_Button_Bang) == 0x000090, "Wrong size on MainTabsScreen_C_Update_Store_Tab_Button_Bang");
static_assert(offsetof(MainTabsScreen_C_Update_Store_Tab_Button_Bang, Tab) == 0x000000, "Member 'MainTabsScreen_C_Update_Store_Tab_Button_Bang::Tab' has a wrong offset!");
