#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainTabTutorialBangWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainTabTutorialBangWrapper.MainTabTutorialBangWrapper_C
// 0x00D0 (0x0348 - 0x0278)
class UMainTabTutorialBangWrapper_C final : public UFortBangWrapper_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TutorialGlow;                                      // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BangBox;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BigBang;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BigBangCount;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CountText;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ModeSwitcher;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoMinusCount;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoMinusCountMinus1;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SmallBang;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SmallBangCount;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TutorialBorder;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseSmallVersion;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6922[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeature                                UIFeatureToReveal;                                 // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6923[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RevealFeatureStateText;                            // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             TabAdded;                                          // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             TabDialogClosed;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             StopTabCallout;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldSuppressBang;                                // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetShouldSuppressBang(bool Param_ShouldSuppressBang);
	void SetUIFeatureRevealData(EFortUIFeature UIFeature, const class FText& RevealText);
	void Adjust_Bang_Image_Translation(const struct FVector2D& Translation);
	void Update_Bang_Icon_Version(int32 InCount);
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void OnBangStateChanged(bool bEnabled, int32 Param_Count);
	void OnStopCallout();
	void OnStartCallout(class FName TutorialObjectiveName, ETutorialType TutorialType);
	void PreConstruct(bool IsDesignTime);
	void Tab_Reveal_Message_Closed();
	void ExecuteUbergraph_MainTabTutorialBangWrapper(int32 EntryPoint);
	void StopTabCallout__DelegateSignature();
	void TabDialogClosed__DelegateSignature();
	void TabAdded__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainTabTutorialBangWrapper_C">();
	}
	static class UMainTabTutorialBangWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainTabTutorialBangWrapper_C>();
	}
};
static_assert(alignof(UMainTabTutorialBangWrapper_C) == 0x000008, "Wrong alignment on UMainTabTutorialBangWrapper_C");
static_assert(sizeof(UMainTabTutorialBangWrapper_C) == 0x000348, "Wrong size on UMainTabTutorialBangWrapper_C");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, UberGraphFrame) == 0x000278, "Member 'UMainTabTutorialBangWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, TutorialGlow) == 0x000280, "Member 'UMainTabTutorialBangWrapper_C::TutorialGlow' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, BangBox) == 0x000288, "Member 'UMainTabTutorialBangWrapper_C::BangBox' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, BigBang) == 0x000290, "Member 'UMainTabTutorialBangWrapper_C::BigBang' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, BigBangCount) == 0x000298, "Member 'UMainTabTutorialBangWrapper_C::BigBangCount' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, CommonTextBlock_0) == 0x0002A0, "Member 'UMainTabTutorialBangWrapper_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, Content) == 0x0002A8, "Member 'UMainTabTutorialBangWrapper_C::Content' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, CountText) == 0x0002B0, "Member 'UMainTabTutorialBangWrapper_C::CountText' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, ModeSwitcher) == 0x0002B8, "Member 'UMainTabTutorialBangWrapper_C::ModeSwitcher' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, NoMinusCount) == 0x0002C0, "Member 'UMainTabTutorialBangWrapper_C::NoMinusCount' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, NoMinusCountMinus1) == 0x0002C8, "Member 'UMainTabTutorialBangWrapper_C::NoMinusCountMinus1' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, SmallBang) == 0x0002D0, "Member 'UMainTabTutorialBangWrapper_C::SmallBang' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, SmallBangCount) == 0x0002D8, "Member 'UMainTabTutorialBangWrapper_C::SmallBangCount' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, TutorialBorder) == 0x0002E0, "Member 'UMainTabTutorialBangWrapper_C::TutorialBorder' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, UseSmallVersion) == 0x0002E8, "Member 'UMainTabTutorialBangWrapper_C::UseSmallVersion' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, Count) == 0x0002EC, "Member 'UMainTabTutorialBangWrapper_C::Count' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, UIFeatureToReveal) == 0x0002F0, "Member 'UMainTabTutorialBangWrapper_C::UIFeatureToReveal' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, RevealFeatureStateText) == 0x0002F8, "Member 'UMainTabTutorialBangWrapper_C::RevealFeatureStateText' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, TabAdded) == 0x000310, "Member 'UMainTabTutorialBangWrapper_C::TabAdded' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, TabDialogClosed) == 0x000320, "Member 'UMainTabTutorialBangWrapper_C::TabDialogClosed' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, StopTabCallout) == 0x000330, "Member 'UMainTabTutorialBangWrapper_C::StopTabCallout' has a wrong offset!");
static_assert(offsetof(UMainTabTutorialBangWrapper_C, ShouldSuppressBang) == 0x000340, "Member 'UMainTabTutorialBangWrapper_C::ShouldSuppressBang' has a wrong offset!");

}

