#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantisRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum MantisRuntime.EFortMantisBranchPath
// NumValues: 0x0007
enum class EFortMantisBranchPath : uint8
{
	Default                                  = 0,
	Path_1                                   = 1,
	Path_2                                   = 2,
	Path_3                                   = 3,
	Path_4                                   = 4,
	Path_5                                   = 5,
	EFortMantisBranchPath_MAX                = 6,
};

// Enum MantisRuntime.EFortMantisBranchRule
// NumValues: 0x0004
enum class EFortMantisBranchRule : uint8
{
	Off                                      = 0,
	Any                                      = 1,
	Starter                                  = 2,
	EFortMantisBranchRule_MAX                = 3,
};

// Enum MantisRuntime.EFortMantisNotifyWindow
// NumValues: 0x0005
enum class EFortMantisNotifyWindow : uint8
{
	Invalid                                  = 0,
	Input                                    = 1,
	Execution                                = 2,
	Damage                                   = 3,
	EFortMantisNotifyWindow_MAX              = 4,
};

// Enum MantisRuntime.EFortMantisNotifyEvent
// NumValues: 0x0003
enum class EFortMantisNotifyEvent : uint8
{
	Invalid                                  = 0,
	Branch                                   = 1,
	EFortMantisNotifyEvent_MAX               = 2,
};

// ScriptStruct MantisRuntime.FortRootMotionSource_Mantis
// 0x0020 (0x00C0 - 0x00A0)
struct FFortRootMotionSource_Mantis final : public FRootMotionSource
{
public:
	float                                         CurrentTechniqueTime;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4355[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           TechniqueMontage;                                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LatestRepMovementLocation;                         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4356[0xC];                                     // 0x00B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortRootMotionSource_Mantis) == 0x000010, "Wrong alignment on FFortRootMotionSource_Mantis");
static_assert(sizeof(FFortRootMotionSource_Mantis) == 0x0000C0, "Wrong size on FFortRootMotionSource_Mantis");
static_assert(offsetof(FFortRootMotionSource_Mantis, CurrentTechniqueTime) == 0x000098, "Member 'FFortRootMotionSource_Mantis::CurrentTechniqueTime' has a wrong offset!");
static_assert(offsetof(FFortRootMotionSource_Mantis, TechniqueMontage) == 0x0000A0, "Member 'FFortRootMotionSource_Mantis::TechniqueMontage' has a wrong offset!");
static_assert(offsetof(FFortRootMotionSource_Mantis, LatestRepMovementLocation) == 0x0000A8, "Member 'FFortRootMotionSource_Mantis::LatestRepMovementLocation' has a wrong offset!");

// ScriptStruct MantisRuntime.FortMantisTargetData
// 0x0008 (0x0010 - 0x0008)
struct FFortMantisTargetData final : public FGameplayAbilityTargetData
{
public:
	int32                                         TechniqueDataIndex;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4357[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMantisTargetData) == 0x000008, "Wrong alignment on FFortMantisTargetData");
static_assert(sizeof(FFortMantisTargetData) == 0x000010, "Wrong size on FFortMantisTargetData");
static_assert(offsetof(FFortMantisTargetData, TechniqueDataIndex) == 0x000008, "Member 'FFortMantisTargetData::TechniqueDataIndex' has a wrong offset!");

// ScriptStruct MantisRuntime.FortMantisTechniqueBranch
// 0x0014 (0x0014 - 0x0000)
struct FFortMantisTechniqueBranch final
{
public:
	class FName                                   FromTechnique;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToTechnique;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchPath                         BranchPath;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4358[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMantisTechniqueBranch) == 0x000004, "Wrong alignment on FFortMantisTechniqueBranch");
static_assert(sizeof(FFortMantisTechniqueBranch) == 0x000014, "Wrong size on FFortMantisTechniqueBranch");
static_assert(offsetof(FFortMantisTechniqueBranch, FromTechnique) == 0x000000, "Member 'FFortMantisTechniqueBranch::FromTechnique' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueBranch, ToTechnique) == 0x000008, "Member 'FFortMantisTechniqueBranch::ToTechnique' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueBranch, BranchPath) == 0x000010, "Member 'FFortMantisTechniqueBranch::BranchPath' has a wrong offset!");

// ScriptStruct MantisRuntime.FortMantisTechniqueData
// 0x00B8 (0x00B8 - 0x0000)
struct FFortMantisTechniqueData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartsSequence;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndsSequence;                                     // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4359[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputWindowDelay;                                  // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRootMotion;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_435A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ActivationTagQuery;                                // 0x0020(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      OngoingTagQuery;                                   // 0x0068(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ApplicationTag;                                    // 0x00B0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFortMantisTechniqueData) == 0x000008, "Wrong alignment on FFortMantisTechniqueData");
static_assert(sizeof(FFortMantisTechniqueData) == 0x0000B8, "Wrong size on FFortMantisTechniqueData");
static_assert(offsetof(FFortMantisTechniqueData, Name) == 0x000000, "Member 'FFortMantisTechniqueData::Name' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, bStartsSequence) == 0x000008, "Member 'FFortMantisTechniqueData::bStartsSequence' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, bEndsSequence) == 0x000009, "Member 'FFortMantisTechniqueData::bEndsSequence' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, InputWindowDelay) == 0x00000C, "Member 'FFortMantisTechniqueData::InputWindowDelay' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, Montage) == 0x000010, "Member 'FFortMantisTechniqueData::Montage' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, bUseRootMotion) == 0x000018, "Member 'FFortMantisTechniqueData::bUseRootMotion' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, ActivationTagQuery) == 0x000020, "Member 'FFortMantisTechniqueData::ActivationTagQuery' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, OngoingTagQuery) == 0x000068, "Member 'FFortMantisTechniqueData::OngoingTagQuery' has a wrong offset!");
static_assert(offsetof(FFortMantisTechniqueData, ApplicationTag) == 0x0000B0, "Member 'FFortMantisTechniqueData::ApplicationTag' has a wrong offset!");

// ScriptStruct MantisRuntime.FortMantisMontageData
// 0x0018 (0x0018 - 0x0000)
struct FFortMantisMontageData final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_435B[0x10];                                    // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMantisMontageData) == 0x000008, "Wrong alignment on FFortMantisMontageData");
static_assert(sizeof(FFortMantisMontageData) == 0x000018, "Wrong size on FFortMantisMontageData");
static_assert(offsetof(FFortMantisMontageData, Montage) == 0x000000, "Member 'FFortMantisMontageData::Montage' has a wrong offset!");

}

