#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPRecap

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MatchXPRecap.MatchXPRecap_C.ExecuteUbergraph_MatchXPRecap
// 0x0060 (0x0060 - 0x0000)
struct MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58C1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C2[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchXPTotalEntry_C*                   K2Node_DynamicCast_AsMatch_XPTotal_Entry;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58C3[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap) == 0x000008, "Wrong alignment on MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap");
static_assert(sizeof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap) == 0x000060, "Wrong size on MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, EntryPoint) == 0x000000, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Array_Get_Item) == 0x000028, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, K2Node_DynamicCast_AsMatch_XPTotal_Entry) == 0x000038, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::K2Node_DynamicCast_AsMatch_XPTotal_Entry' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000044, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Max_ReturnValue) == 0x00004C, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000050, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000054, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000058, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, K2Node_CustomEvent_InVisibility) == 0x00005C, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005D, "Member 'MatchXPRecap_C_ExecuteUbergraph_MatchXPRecap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function MatchXPRecap.MatchXPRecap_C.SetNavigationOptionsVisibility
// 0x0001 (0x0001 - 0x0000)
struct MatchXPRecap_C_SetNavigationOptionsVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchXPRecap_C_SetNavigationOptionsVisibility) == 0x000001, "Wrong alignment on MatchXPRecap_C_SetNavigationOptionsVisibility");
static_assert(sizeof(MatchXPRecap_C_SetNavigationOptionsVisibility) == 0x000001, "Wrong size on MatchXPRecap_C_SetNavigationOptionsVisibility");
static_assert(offsetof(MatchXPRecap_C_SetNavigationOptionsVisibility, InVisibility) == 0x000000, "Member 'MatchXPRecap_C_SetNavigationOptionsVisibility::InVisibility' has a wrong offset!");

}

