#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPRecap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPRecap.MatchXPRecap_C
// 0x0040 (0x03E0 - 0x03A0)
class UMatchXPRecap_C final : public UFortMatchXPRecap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaReadyUpTooltipWidget_C*          AthenaReadyUpTooltipWidget;                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaWinnerList_C*                    AthenaWinnerList;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_RecapStats;                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameSpectatingPlayerName_C*        PostGameSpectatingPlayerName;                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RecapVertBox;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxNavigationOptions;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_XPTotalList;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchXPRecap(int32 EntryPoint);
	void SetNavigationOptionsVisibility(ESlateVisibility InVisibility);
	void AnimateXPTotals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPRecap_C">();
	}
	static class UMatchXPRecap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPRecap_C>();
	}
};
static_assert(alignof(UMatchXPRecap_C) == 0x000008, "Wrong alignment on UMatchXPRecap_C");
static_assert(sizeof(UMatchXPRecap_C) == 0x0003E0, "Wrong size on UMatchXPRecap_C");
static_assert(offsetof(UMatchXPRecap_C, UberGraphFrame) == 0x0003A0, "Member 'UMatchXPRecap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, AthenaReadyUpTooltipWidget) == 0x0003A8, "Member 'UMatchXPRecap_C::AthenaReadyUpTooltipWidget' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, AthenaWinnerList) == 0x0003B0, "Member 'UMatchXPRecap_C::AthenaWinnerList' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, CommonWidgetSwitcher_RecapStats) == 0x0003B8, "Member 'UMatchXPRecap_C::CommonWidgetSwitcher_RecapStats' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, PostGameSpectatingPlayerName) == 0x0003C0, "Member 'UMatchXPRecap_C::PostGameSpectatingPlayerName' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, RecapVertBox) == 0x0003C8, "Member 'UMatchXPRecap_C::RecapVertBox' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, SizeBoxNavigationOptions) == 0x0003D0, "Member 'UMatchXPRecap_C::SizeBoxNavigationOptions' has a wrong offset!");
static_assert(offsetof(UMatchXPRecap_C, VerticalBox_XPTotalList) == 0x0003D8, "Member 'UMatchXPRecap_C::VerticalBox_XPTotalList' has a wrong offset!");

}

