#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchXPTotalEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchXPTotalEntry.MatchXPTotalEntry_C
// 0x0040 (0x0310 - 0x02D0)
class UMatchXPTotalEntry_C final : public UFortMatchXPTotalEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_divider;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_XPType_1;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Divider;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Container;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        XpScoreAudio;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HandleXpScoreAudio;                                // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchXPTotalEntry(int32 EntryPoint);
	void Destruct();
	void UpdateXpScoreAudio();
	void StartIntro(float InitialDelay);
	void ResetAnim();
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchXPTotalEntry_C">();
	}
	static class UMatchXPTotalEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchXPTotalEntry_C>();
	}
};
static_assert(alignof(UMatchXPTotalEntry_C) == 0x000008, "Wrong alignment on UMatchXPTotalEntry_C");
static_assert(sizeof(UMatchXPTotalEntry_C) == 0x000310, "Wrong size on UMatchXPTotalEntry_C");
static_assert(offsetof(UMatchXPTotalEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UMatchXPTotalEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, Intro) == 0x0002D8, "Member 'UMatchXPTotalEntry_C::Intro' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, CommonBorder_divider) == 0x0002E0, "Member 'UMatchXPTotalEntry_C::CommonBorder_divider' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, CommonText_XPType_1) == 0x0002E8, "Member 'UMatchXPTotalEntry_C::CommonText_XPType_1' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, Image_Divider) == 0x0002F0, "Member 'UMatchXPTotalEntry_C::Image_Divider' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, SizeBox_Container) == 0x0002F8, "Member 'UMatchXPTotalEntry_C::SizeBox_Container' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, XpScoreAudio) == 0x000300, "Member 'UMatchXPTotalEntry_C::XpScoreAudio' has a wrong offset!");
static_assert(offsetof(UMatchXPTotalEntry_C, HandleXpScoreAudio) == 0x000308, "Member 'UMatchXPTotalEntry_C::HandleXpScoreAudio' has a wrong offset!");

}

