#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeatBallVehicle_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MeatBallVehicle_AnimBP.MeatBallVehicle_AnimBP_C
// 0x1490 (0x1890 - 0x0400)
class UMeatBallVehicle_AnimBP_C final : public UFortMeatballVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0408(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0438(0x0018)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0450(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x04F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0518(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0540(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0568(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0590(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x05E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0608(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0680(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x06B0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0728(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0758(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x07D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0800(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0878(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x08A8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0958(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0A48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0A70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0A98(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B10(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0B40(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0BB8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0BE8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0C00(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0C30(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0CE0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0D80(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0E20(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E98(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0F10(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0F88(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1048(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1150(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1170(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1190(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1298(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x13A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x14A8(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x15B0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1650(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16C8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1790(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1830(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1858(0x0028)()
	struct FRotator                               Jet_rotation;                                      // 0x1880(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MeatBallVehicle_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MeatBallVehicle_AnimBP_C">();
	}
	static class UMeatBallVehicle_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeatBallVehicle_AnimBP_C>();
	}
};
static_assert(alignof(UMeatBallVehicle_AnimBP_C) == 0x000010, "Wrong alignment on UMeatBallVehicle_AnimBP_C");
static_assert(sizeof(UMeatBallVehicle_AnimBP_C) == 0x001890, "Wrong size on UMeatBallVehicle_AnimBP_C");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, UberGraphFrame) == 0x000400, "Member 'UMeatBallVehicle_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_Root) == 0x000408, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x000438, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000450, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x0004F0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000518, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000540, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000568, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000590, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0005B8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0005E0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000608, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_6) == 0x000680, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0006B0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_5) == 0x000728, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000758, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0007D0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000800, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_3) == 0x000878, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0008A8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000958, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000A20, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000A48, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000A70, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000A98, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_2) == 0x000B10, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000B40, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000BB8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_IdentityPose) == 0x000BE8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateResult) == 0x000C00, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_StateMachine) == 0x000C30, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000CE0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000D80, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000E20, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000E98, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000F10, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000F88, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001048, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001150, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001170, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001190, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001298, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0013A0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0014A8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0015B0, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001650, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0016C8, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001790, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001830, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001858, "Member 'UMeatBallVehicle_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UMeatBallVehicle_AnimBP_C, Jet_rotation) == 0x001880, "Member 'UMeatBallVehicle_AnimBP_C::Jet_rotation' has a wrong offset!");

}

