#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mechanical_Engineer_Female_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mechanical_Engineer_Female_AnimBP.Mechanical_Engineer_Female_AnimBP_C
// 0x0CB0 (0x1100 - 0x0450)
class UMechanical_Engineer_Female_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_75F9[0x8];                                     // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0458(0x0088)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0520(0x0030)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0550(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0990(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0FE0(0x0108)()
	struct FRotator                               Gear_rot;                                          // 0x10E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75FA[0x4];                                     // 0x10F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Skel_mesh;                                         // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_Mechanical_Engineer_Female_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mechanical_Engineer_Female_AnimBP_C">();
	}
	static class UMechanical_Engineer_Female_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMechanical_Engineer_Female_AnimBP_C>();
	}
};
static_assert(alignof(UMechanical_Engineer_Female_AnimBP_C) == 0x000010, "Wrong alignment on UMechanical_Engineer_Female_AnimBP_C");
static_assert(sizeof(UMechanical_Engineer_Female_AnimBP_C) == 0x001100, "Wrong size on UMechanical_Engineer_Female_AnimBP_C");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, UberGraphFrame) == 0x000450, "Member 'UMechanical_Engineer_Female_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000458, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0004E0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000500, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_Root) == 0x000520, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x000550, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_RigidBody) == 0x000990, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000FE0, "Member 'UMechanical_Engineer_Female_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, Gear_rot) == 0x0010E8, "Member 'UMechanical_Engineer_Female_AnimBP_C::Gear_rot' has a wrong offset!");
static_assert(offsetof(UMechanical_Engineer_Female_AnimBP_C, Skel_mesh) == 0x0010F8, "Member 'UMechanical_Engineer_Female_AnimBP_C::Skel_mesh' has a wrong offset!");

}

