#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MenuScreen_Athena.MenuScreen_Athena_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MenuScreen_Athena_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MenuScreen_Athena_C_AnimGraph) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_AnimGraph");
static_assert(sizeof(MenuScreen_Athena_C_AnimGraph) == 0x000010, "Wrong size on MenuScreen_Athena_C_AnimGraph");
static_assert(offsetof(MenuScreen_Athena_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'MenuScreen_Athena_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.HidePropsForBlend
// 0x0040 (0x0040 - 0x0000)
struct MenuScreen_Athena_C_HidePropsForBlend final
{
public:
	class UAnimMontage*                           NewMontage;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79C4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuScreen_Athena_C_HidePropsForBlend) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_HidePropsForBlend");
static_assert(sizeof(MenuScreen_Athena_C_HidePropsForBlend) == 0x000040, "Wrong size on MenuScreen_Athena_C_HidePropsForBlend");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, NewMontage) == 0x000000, "Member 'MenuScreen_Athena_C_HidePropsForBlend::NewMontage' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x000008, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'MenuScreen_Athena_C_HidePropsForBlend::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MenuScreen_Athena_C_HidePropsForBlend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue) == 0x000030, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_HidePropsForBlend, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'MenuScreen_Athena_C_HidePropsForBlend::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MenuScreen_Athena_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuScreen_Athena_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MenuScreen_Athena_C_BlueprintUpdateAnimation");
static_assert(sizeof(MenuScreen_Athena_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MenuScreen_Athena_C_BlueprintUpdateAnimation");
static_assert(offsetof(MenuScreen_Athena_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MenuScreen_Athena_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.OnMontageStarted_Event_HideProps
// 0x0008 (0x0008 - 0x0000)
struct MenuScreen_Athena_C_OnMontageStarted_Event_HideProps final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuScreen_Athena_C_OnMontageStarted_Event_HideProps) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_OnMontageStarted_Event_HideProps");
static_assert(sizeof(MenuScreen_Athena_C_OnMontageStarted_Event_HideProps) == 0x000008, "Wrong size on MenuScreen_Athena_C_OnMontageStarted_Event_HideProps");
static_assert(offsetof(MenuScreen_Athena_C_OnMontageStarted_Event_HideProps, Montage) == 0x000000, "Member 'MenuScreen_Athena_C_OnMontageStarted_Event_HideProps::Montage' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.OnMontageBlendingOut_Event_HideProps
// 0x0010 (0x0010 - 0x0000)
struct MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps");
static_assert(sizeof(MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps) == 0x000010, "Wrong size on MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps");
static_assert(offsetof(MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps, Montage) == 0x000000, "Member 'MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps::Montage' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps, bInterrupted) == 0x000008, "Member 'MenuScreen_Athena_C_OnMontageBlendingOut_Event_HideProps::bInterrupted' has a wrong offset!");

// Function MenuScreen_Athena.MenuScreen_Athena_C.ExecuteUbergraph_MenuScreen_Athena
// 0x0148 (0x0148 - 0x0000)
struct MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79C5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* Montage)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C6[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79C7[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79C8[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79C9[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CA[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CB[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CC[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CD[0x1];                                     // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CE[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UB_MasterPetAnimBP_C*                   K2Node_DynamicCast_AsB_Master_Pet_Anim_BP;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79CF[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UB_MasterPetAnimBP_C*                   K2Node_DynamicCast_AsB_Master_Pet_Anim_BP_1;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D0[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D1[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D2[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_1;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D3[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D4[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkydiving_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D5[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFrontendAnimMontageIdleOverride_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsActive_ReturnValue_1;           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D6[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D7[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena) == 0x000008, "Wrong alignment on MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena");
static_assert(sizeof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena) == 0x000148, "Wrong size on MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, EntryPoint) == 0x000000, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'MenuScreen_Athena_C_ExecuteUbergraph_MenuScreen_Athena::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
