#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimalSquadMember

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinimalSquadMember.MinimalSquadMember_C
// 0x0048 (0x0BE8 - 0x0BA0)
class UMinimalSquadMember_C final : public UAthenaMinimalSquadMemberEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StyleNotReady;                                     // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleSitOut;                                       // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleEmpty;                                        // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnReady;                                           // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Meeple;                                      // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocalUserIndicator;                                // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MeepleContainer;                                   // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyFlash;                                        // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetEmptyVisuals();
	void SetSitOutVisuals();
	void SetNotReadyVisuals();
	void SetReadyVisuals();
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void ExecuteUbergraph_MinimalSquadMember(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinimalSquadMember_C">();
	}
	static class UMinimalSquadMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinimalSquadMember_C>();
	}
};
static_assert(alignof(UMinimalSquadMember_C) == 0x000008, "Wrong alignment on UMinimalSquadMember_C");
static_assert(sizeof(UMinimalSquadMember_C) == 0x000BE8, "Wrong size on UMinimalSquadMember_C");
static_assert(offsetof(UMinimalSquadMember_C, UberGraphFrame) == 0x000BA0, "Member 'UMinimalSquadMember_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleNotReady) == 0x000BA8, "Member 'UMinimalSquadMember_C::StyleNotReady' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleSitOut) == 0x000BB0, "Member 'UMinimalSquadMember_C::StyleSitOut' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, StyleEmpty) == 0x000BB8, "Member 'UMinimalSquadMember_C::StyleEmpty' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, OnReady) == 0x000BC0, "Member 'UMinimalSquadMember_C::OnReady' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, Image_Meeple) == 0x000BC8, "Member 'UMinimalSquadMember_C::Image_Meeple' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, LocalUserIndicator) == 0x000BD0, "Member 'UMinimalSquadMember_C::LocalUserIndicator' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, MeepleContainer) == 0x000BD8, "Member 'UMinimalSquadMember_C::MeepleContainer' has a wrong offset!");
static_assert(offsetof(UMinimalSquadMember_C, ReadyFlash) == 0x000BE0, "Member 'UMinimalSquadMember_C::ReadyFlash' has a wrong offset!");

}

