#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniChallengeNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniChallengeNotification.MiniChallengeNotification_C
// 0x0018 (0x02B8 - 0x02A0)
class UMiniChallengeNotification_C final : public UFortNotificationEntry_MiniChallenge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void StartNotificationOutro();
	void StartNotificationIntro();
	void MiniChallengeToastFinished();
	void TriggerXpToast_Event_0();
	void Construct();
	void WidgetAnimationEvt_Outro_K2Node_WidgetAnimationEvent_0();
	void Play_Inro_Sound();
	void ExecuteUbergraph_MiniChallengeNotification(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniChallengeNotification_C">();
	}
	static class UMiniChallengeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniChallengeNotification_C>();
	}
};
static_assert(alignof(UMiniChallengeNotification_C) == 0x000008, "Wrong alignment on UMiniChallengeNotification_C");
static_assert(sizeof(UMiniChallengeNotification_C) == 0x0002B8, "Wrong size on UMiniChallengeNotification_C");
static_assert(offsetof(UMiniChallengeNotification_C, UberGraphFrame) == 0x0002A0, "Member 'UMiniChallengeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMiniChallengeNotification_C, Intro) == 0x0002A8, "Member 'UMiniChallengeNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UMiniChallengeNotification_C, Outro) == 0x0002B0, "Member 'UMiniChallengeNotification_C::Outro' has a wrong offset!");

}

