#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameButtons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MinigameButtonsState_structs.hpp"
#include "MinigameButtonsStateConfiguration_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "MinigameButtonsWidgetSwitcherConfiguration_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinigameButtons.MinigameButtons_C
// 0x0140 (0x0370 - 0x0230)
class UMinigameButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        ButtonSwitcher;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton2;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton2;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             StartButtonClicked;                                // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonClicked;                                  // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             StartButtonHovered;                                // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonHovered;                                  // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UIconTextButton_C*                      CurrentButton;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameButtonsState                         ButtonState;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7475[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMinigameButtonsState, struct FMinigameButtonsStateConfiguration> ButtonConfigurations;                              // 0x02B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             StartButtonUnhovered;                              // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonUnhovered;                                // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMinigameButtonsWidgetSwitcherConfiguration CurrentWidgetSwitcherConfiguration;                // 0x0320(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FMinigameButtonsWidgetSwitcherConfiguration> WidgetSwitcherConfigurations;                      // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void StartButtonClicked__DelegateSignature();
	void EndButtonClicked__DelegateSignature();
	void StartButtonHovered__DelegateSignature(class UCommonButton* Button);
	void EndButtonHovered__DelegateSignature(class UCommonButton* Button);
	void StartButtonUnhovered__DelegateSignature(class UCommonButton* Button);
	void EndButtonUnhovered__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_MinigameButtons(int32 EntryPoint);
	void OnInitialized();
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetWidgetSwitcherIndex(int32 Param_Index);
	void BndEvt__EndGameButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void UpdateButtons();
	void CenterOnCurrentButton();
	void SetButtonState(EMinigameButtonsState Value);
	void UpdateButtonsFromButtonState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameButtons_C">();
	}
	static class UMinigameButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinigameButtons_C>();
	}
};
static_assert(alignof(UMinigameButtons_C) == 0x000008, "Wrong alignment on UMinigameButtons_C");
static_assert(sizeof(UMinigameButtons_C) == 0x000370, "Wrong size on UMinigameButtons_C");
static_assert(offsetof(UMinigameButtons_C, UberGraphFrame) == 0x000230, "Member 'UMinigameButtons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonSwitcher) == 0x000238, "Member 'UMinigameButtons_C::ButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton) == 0x000240, "Member 'UMinigameButtons_C::EndGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton2) == 0x000248, "Member 'UMinigameButtons_C::EndGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton) == 0x000250, "Member 'UMinigameButtons_C::StartGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton2) == 0x000258, "Member 'UMinigameButtons_C::StartGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonClicked) == 0x000260, "Member 'UMinigameButtons_C::StartButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonClicked) == 0x000270, "Member 'UMinigameButtons_C::EndButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonHovered) == 0x000280, "Member 'UMinigameButtons_C::StartButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonHovered) == 0x000290, "Member 'UMinigameButtons_C::EndButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentButton) == 0x0002A0, "Member 'UMinigameButtons_C::CurrentButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonState) == 0x0002A8, "Member 'UMinigameButtons_C::ButtonState' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonConfigurations) == 0x0002B0, "Member 'UMinigameButtons_C::ButtonConfigurations' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonUnhovered) == 0x000300, "Member 'UMinigameButtons_C::StartButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonUnhovered) == 0x000310, "Member 'UMinigameButtons_C::EndButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentWidgetSwitcherConfiguration) == 0x000320, "Member 'UMinigameButtons_C::CurrentWidgetSwitcherConfiguration' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, WidgetSwitcherConfigurations) == 0x000360, "Member 'UMinigameButtons_C::WidgetSwitcherConfigurations' has a wrong offset!");

}

