#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissedInvitesActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissedInvitesActionMenu.MissedInvitesActionMenu_C
// 0x0050 (0x0368 - 0x0318)
class UMissedInvitesActionMenu_C final : public UFortMissedInvitesActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_143;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_119;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Platform;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MissedInvitesActionMenu(int32 EntryPoint);
	void OnOpened();
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissedInvitesActionMenu_C">();
	}
	static class UMissedInvitesActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissedInvitesActionMenu_C>();
	}
};
static_assert(alignof(UMissedInvitesActionMenu_C) == 0x000008, "Wrong alignment on UMissedInvitesActionMenu_C");
static_assert(sizeof(UMissedInvitesActionMenu_C) == 0x000368, "Wrong size on UMissedInvitesActionMenu_C");
static_assert(offsetof(UMissedInvitesActionMenu_C, UberGraphFrame) == 0x000318, "Member 'UMissedInvitesActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, ConfirmationOpened) == 0x000320, "Member 'UMissedInvitesActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Opened) == 0x000328, "Member 'UMissedInvitesActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Border_OnlineStatusIndicator) == 0x000330, "Member 'UMissedInvitesActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, CommonRichTextBlock) == 0x000338, "Member 'UMissedInvitesActionMenu_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, CommonRichTextBlock_143) == 0x000340, "Member 'UMissedInvitesActionMenu_C::CommonRichTextBlock_143' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, EntryBorder) == 0x000348, "Member 'UMissedInvitesActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Image_119) == 0x000350, "Member 'UMissedInvitesActionMenu_C::Image_119' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Image_Platform) == 0x000358, "Member 'UMissedInvitesActionMenu_C::Image_Platform' has a wrong offset!");
static_assert(offsetof(UMissedInvitesActionMenu_C, Text_DisplayName) == 0x000360, "Member 'UMissedInvitesActionMenu_C::Text_DisplayName' has a wrong offset!");

}

