#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionRewardEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionRewardEntry.MissionRewardEntry_C
// 0x0038 (0x0278 - 0x0240)
class UMissionRewardEntry_C final : public UAthenaChallengeRewardDisplayEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CompletionCheck;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RenderOpacityOvr;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionBorder;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextVisibilityOvr;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HideCompletion;                                    // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideBorder;                                        // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ShowCompletionCheck();
	void HideCompletionCheck();
	void HideSelectionBorder();
	void ShowSelectionBorder();
	void Construct();
	void ExecuteUbergraph_MissionRewardEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionRewardEntry_C">();
	}
	static class UMissionRewardEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionRewardEntry_C>();
	}
};
static_assert(alignof(UMissionRewardEntry_C) == 0x000008, "Wrong alignment on UMissionRewardEntry_C");
static_assert(sizeof(UMissionRewardEntry_C) == 0x000278, "Wrong size on UMissionRewardEntry_C");
static_assert(offsetof(UMissionRewardEntry_C, UberGraphFrame) == 0x000240, "Member 'UMissionRewardEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, Hover) == 0x000248, "Member 'UMissionRewardEntry_C::Hover' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, CompletionCheck) == 0x000250, "Member 'UMissionRewardEntry_C::CompletionCheck' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, RenderOpacityOvr) == 0x000258, "Member 'UMissionRewardEntry_C::RenderOpacityOvr' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, SelectionBorder) == 0x000260, "Member 'UMissionRewardEntry_C::SelectionBorder' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, TextVisibilityOvr) == 0x000268, "Member 'UMissionRewardEntry_C::TextVisibilityOvr' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, HideCompletion) == 0x000270, "Member 'UMissionRewardEntry_C::HideCompletion' has a wrong offset!");
static_assert(offsetof(UMissionRewardEntry_C, HideBorder) == 0x000271, "Member 'UMissionRewardEntry_C::HideBorder' has a wrong offset!");

}

