#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoistyPropPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MoistyPropPrompt.MoistyPropPrompt_C
// 0x0050 (0x02F8 - 0x02A8)
class UMoistyPropPrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Backplate;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star1;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_star2;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_fabulous;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MoistyPropPrompt(int32 EntryPoint);
	void CloseWidget();
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MoistyPropPrompt_C">();
	}
	static class UMoistyPropPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoistyPropPrompt_C>();
	}
};
static_assert(alignof(UMoistyPropPrompt_C) == 0x000008, "Wrong alignment on UMoistyPropPrompt_C");
static_assert(sizeof(UMoistyPropPrompt_C) == 0x0002F8, "Wrong size on UMoistyPropPrompt_C");
static_assert(offsetof(UMoistyPropPrompt_C, UberGraphFrame) == 0x0002A8, "Member 'UMoistyPropPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Outro) == 0x0002B0, "Member 'UMoistyPropPrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Intro) == 0x0002B8, "Member 'UMoistyPropPrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Image_Backplate) == 0x0002C0, "Member 'UMoistyPropPrompt_C::Image_Backplate' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Image_Shadow) == 0x0002C8, "Member 'UMoistyPropPrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Image_star1) == 0x0002D0, "Member 'UMoistyPropPrompt_C::Image_star1' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Image_star2) == 0x0002D8, "Member 'UMoistyPropPrompt_C::Image_star2' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Text_Description) == 0x0002E0, "Member 'UMoistyPropPrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Text_fabulous) == 0x0002E8, "Member 'UMoistyPropPrompt_C::Text_fabulous' has a wrong offset!");
static_assert(offsetof(UMoistyPropPrompt_C, Text_Title) == 0x0002F0, "Member 'UMoistyPropPrompt_C::Text_Title' has a wrong offset!");

}

