#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NameLoadoutPopup

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NameLoadoutPopup.NameLoadoutPopup_C
// 0x0028 (0x04B8 - 0x0490)
class UNameLoadoutPopup_C final : public UFortNameLoadoutPopup
{
public:
	class UImage*                                 Image_66;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NameLoadoutPopup_C">();
	}
	static class UNameLoadoutPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNameLoadoutPopup_C>();
	}
};
static_assert(alignof(UNameLoadoutPopup_C) == 0x000008, "Wrong alignment on UNameLoadoutPopup_C");
static_assert(sizeof(UNameLoadoutPopup_C) == 0x0004B8, "Wrong size on UNameLoadoutPopup_C");
static_assert(offsetof(UNameLoadoutPopup_C, Image_66) == 0x000490, "Member 'UNameLoadoutPopup_C::Image_66' has a wrong offset!");
static_assert(offsetof(UNameLoadoutPopup_C, Image_Separator_Down) == 0x000498, "Member 'UNameLoadoutPopup_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(UNameLoadoutPopup_C, Image_Separator_Up) == 0x0004A0, "Member 'UNameLoadoutPopup_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(UNameLoadoutPopup_C, Lightbox) == 0x0004A8, "Member 'UNameLoadoutPopup_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UNameLoadoutPopup_C, ShortDescriptionText) == 0x0004B0, "Member 'UNameLoadoutPopup_C::ShortDescriptionText' has a wrong offset!");

}

