#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoTilted_PowerTransformer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NeoTilted_PowerTransformer.NeoTilted_PowerTransformer_C
// 0x0018 (0x0BD8 - 0x0BC0)
class ANeoTilted_PowerTransformer_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_Electric_ON_Hit;                            // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Damage;                                     // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NeoTilted_PowerTransformer(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NeoTilted_PowerTransformer_C">();
	}
	static class ANeoTilted_PowerTransformer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoTilted_PowerTransformer_C>();
	}
};
static_assert(alignof(ANeoTilted_PowerTransformer_C) == 0x000008, "Wrong alignment on ANeoTilted_PowerTransformer_C");
static_assert(sizeof(ANeoTilted_PowerTransformer_C) == 0x000BD8, "Wrong size on ANeoTilted_PowerTransformer_C");
static_assert(offsetof(ANeoTilted_PowerTransformer_C, UberGraphFrame) == 0x000BC0, "Member 'ANeoTilted_PowerTransformer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANeoTilted_PowerTransformer_C, Effect_Electric_ON_Hit) == 0x000BC8, "Member 'ANeoTilted_PowerTransformer_C::Effect_Electric_ON_Hit' has a wrong offset!");
static_assert(offsetof(ANeoTilted_PowerTransformer_C, Effect_Damage) == 0x000BD0, "Member 'ANeoTilted_PowerTransformer_C::Effect_Damage' has a wrong offset!");

}

