#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewLevelWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function NewLevelWidget.NewLevelWidget_C.ShowWidget
// 0x0004 (0x0004 - 0x0000)
struct NewLevelWidget_C_ShowWidget final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewLevelWidget_C_ShowWidget) == 0x000004, "Wrong alignment on NewLevelWidget_C_ShowWidget");
static_assert(sizeof(NewLevelWidget_C_ShowWidget) == 0x000004, "Wrong size on NewLevelWidget_C_ShowWidget");
static_assert(offsetof(NewLevelWidget_C_ShowWidget, NewLevel) == 0x000000, "Member 'NewLevelWidget_C_ShowWidget::NewLevel' has a wrong offset!");

// Function NewLevelWidget.NewLevelWidget_C.EventMoveforEoM
// 0x0008 (0x0008 - 0x0000)
struct NewLevelWidget_C_EventMoveforEoM final
{
public:
	class FName                                   Placement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewLevelWidget_C_EventMoveforEoM) == 0x000004, "Wrong alignment on NewLevelWidget_C_EventMoveforEoM");
static_assert(sizeof(NewLevelWidget_C_EventMoveforEoM) == 0x000008, "Wrong size on NewLevelWidget_C_EventMoveforEoM");
static_assert(offsetof(NewLevelWidget_C_EventMoveforEoM, Placement) == 0x000000, "Member 'NewLevelWidget_C_EventMoveforEoM::Placement' has a wrong offset!");

// Function NewLevelWidget.NewLevelWidget_C.ExecuteUbergraph_NewLevelWidget
// 0x0070 (0x0070 - 0x0000)
struct NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_NewLevel;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Placement;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429F[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName WidgetPlacement)>  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A0[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget) == 0x000008, "Wrong alignment on NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget");
static_assert(sizeof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget) == 0x000070, "Wrong size on NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, EntryPoint) == 0x000000, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, K2Node_Event_NewLevel) == 0x000014, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::K2Node_Event_NewLevel' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, K2Node_CustomEvent_Placement) == 0x000038, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::K2Node_CustomEvent_Placement' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'NewLevelWidget_C_ExecuteUbergraph_NewLevelWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

