#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "NiagaraCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x0068 - 0x0058)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraTrack">();
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraTrack");
static_assert(sizeof(UMovieSceneNiagaraTrack) == 0x000068, "Wrong size on UMovieSceneNiagaraTrack");
static_assert(offsetof(UMovieSceneNiagaraTrack, Sections) == 0x000058, "Member 'UMovieSceneNiagaraTrack::Sections' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0028 (0x0090 - 0x0068)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0068(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraParameterTrack">();
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraParameterTrack, Parameter) == 0x000068, "Member 'UMovieSceneNiagaraParameterTrack::Parameter' has a wrong offset!");

// Class Niagara.NiagaraDataInterface
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_40F0[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
static_assert(alignof(UNiagaraDataInterface) == 0x000008, "Wrong alignment on UNiagaraDataInterface");
static_assert(sizeof(UNiagaraDataInterface) == 0x000030, "Wrong size on UNiagaraDataInterface");

// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0028 (0x0058 - 0x0030)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	TArray<float>                                 ShaderLUT;                                         // 0x0030(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMinTime;                                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMaxTime;                                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTInvTimeRange;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTNumSamplesMinusOne;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseLUT : 1;                                       // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_40F1[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurveBase">();
	}
	static class UNiagaraDataInterfaceCurveBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurveBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCurveBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCurveBase");
static_assert(sizeof(UNiagaraDataInterfaceCurveBase) == 0x000058, "Wrong size on UNiagaraDataInterfaceCurveBase");
static_assert(offsetof(UNiagaraDataInterfaceCurveBase, ShaderLUT) == 0x000030, "Member 'UNiagaraDataInterfaceCurveBase::ShaderLUT' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCurveBase, LUTMinTime) == 0x000040, "Member 'UNiagaraDataInterfaceCurveBase::LUTMinTime' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCurveBase, LUTMaxTime) == 0x000044, "Member 'UNiagaraDataInterfaceCurveBase::LUTMaxTime' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCurveBase, LUTInvTimeRange) == 0x000048, "Member 'UNiagaraDataInterfaceCurveBase::LUTInvTimeRange' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCurveBase, LUTNumSamplesMinusOne) == 0x00004C, "Member 'UNiagaraDataInterfaceCurveBase::LUTNumSamplesMinusOne' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceColorCurve
// 0x0200 (0x0258 - 0x0058)
class UNiagaraDataInterfaceColorCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             RedCurve;                                          // 0x0058(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             GreenCurve;                                        // 0x00D8(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             BlueCurve;                                         // 0x0158(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             AlphaCurve;                                        // 0x01D8(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceColorCurve">();
	}
	static class UNiagaraDataInterfaceColorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceColorCurve>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceColorCurve) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceColorCurve");
static_assert(sizeof(UNiagaraDataInterfaceColorCurve) == 0x000258, "Wrong size on UNiagaraDataInterfaceColorCurve");
static_assert(offsetof(UNiagaraDataInterfaceColorCurve, RedCurve) == 0x000058, "Member 'UNiagaraDataInterfaceColorCurve::RedCurve' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceColorCurve, GreenCurve) == 0x0000D8, "Member 'UNiagaraDataInterfaceColorCurve::GreenCurve' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceColorCurve, BlueCurve) == 0x000158, "Member 'UNiagaraDataInterfaceColorCurve::BlueCurve' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceColorCurve, AlphaCurve) == 0x0001D8, "Member 'UNiagaraDataInterfaceColorCurve::AlphaCurve' has a wrong offset!");

// Class Niagara.NiagaraRendererProperties
// 0x0048 (0x0070 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40F2[0x22];                                    // 0x004E(0x0022)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRendererProperties");
static_assert(sizeof(UNiagaraRendererProperties) == 0x000070, "Wrong size on UNiagaraRendererProperties");
static_assert(offsetof(UNiagaraRendererProperties, Platforms) == 0x000028, "Member 'UNiagaraRendererProperties::Platforms' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, SortOrderHint) == 0x000048, "Member 'UNiagaraRendererProperties::SortOrderHint' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bIsEnabled) == 0x00004C, "Member 'UNiagaraRendererProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bMotionBlurEnabled) == 0x00004D, "Member 'UNiagaraRendererProperties::bMotionBlurEnabled' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraBoolParameterTrack">();
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraBoolParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraBoolParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraBoolParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraBoolParameterTrack");

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraColorParameterTrack">();
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraColorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraColorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraColorParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraColorParameterTrack");

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraFloatParameterTrack">();
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraFloatParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraFloatParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraFloatParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraFloatParameterTrack");

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraIntegerParameterTrack">();
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraIntegerParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraIntegerParameterTrack");

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F0 - 0x00E0)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40F3[0x3];                                     // 0x00ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemSpawnSection">();
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemSpawnSection) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemSpawnSection");
static_assert(sizeof(UMovieSceneNiagaraSystemSpawnSection) == 0x0000F0, "Wrong size on UMovieSceneNiagaraSystemSpawnSection");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionStartBehavior) == 0x0000E0, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionStartBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEvaluateBehavior) == 0x0000E4, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEvaluateBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEndBehavior) == 0x0000E8, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEndBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, AgeUpdateMode) == 0x0000EC, "Member 'UMovieSceneNiagaraSystemSpawnSection::AgeUpdateMode' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0000 (0x0068 - 0x0068)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemTrack">();
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemTrack");
static_assert(sizeof(UMovieSceneNiagaraSystemTrack) == 0x000068, "Wrong size on UMovieSceneNiagaraSystemTrack");

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0008 (0x0098 - 0x0090)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	int32                                         ChannelsUsed;                                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40F4[0x4];                                     // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraVectorParameterTrack">();
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraVectorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraVectorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraVectorParameterTrack) == 0x000098, "Wrong size on UMovieSceneNiagaraVectorParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraVectorParameterTrack, ChannelsUsed) == 0x000090, "Member 'UMovieSceneNiagaraVectorParameterTrack::ChannelsUsed' has a wrong offset!");

// Class Niagara.NiagaraActor
// 0x0010 (0x0230 - 0x0220)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyOnSystemFinish : 1;                        // 0x0228(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_40F5[0x7];                                     // 0x0229(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);
	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
static_assert(alignof(ANiagaraActor) == 0x000008, "Wrong alignment on ANiagaraActor");
static_assert(sizeof(ANiagaraActor) == 0x000230, "Wrong size on ANiagaraActor");
static_assert(offsetof(ANiagaraActor, NiagaraComponent) == 0x000220, "Member 'ANiagaraActor::NiagaraComponent' has a wrong offset!");

// Class Niagara.NiagaraComponent
// 0x0170 (0x05A0 - 0x0430)
class UNiagaraComponent : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0430(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40F6[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0440(0x00C8)(NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x0508(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_7A : 7;                                     // 0x0008(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_40F7[0x2B];                                    // 0x0509(0x002B)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x0534(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x0534(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x0534(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x0534(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_40F8[0x3];                                     // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40F9[0x4];                                     // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSystemFinished;                                  // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x0550(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x0562(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40FA[0x3D];                                    // 0x0563(0x003D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	class UNiagaraDataInterface* GetDataInterface(const class FString& Param_Name);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetForceSolo(bool bInForceSolo);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);
	void SetTickBehavior(ENiagaraTickBehavior NewTickBehavior);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	float GetMaxSimTime() const;
	int32 GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	float GetSeekDelta() const;
	ENiagaraTickBehavior GetTickBehavior() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
static_assert(alignof(UNiagaraComponent) == 0x000010, "Wrong alignment on UNiagaraComponent");
static_assert(sizeof(UNiagaraComponent) == 0x0005A0, "Wrong size on UNiagaraComponent");
static_assert(offsetof(UNiagaraComponent, Asset) == 0x000430, "Member 'UNiagaraComponent::Asset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, TickBehavior) == 0x000438, "Member 'UNiagaraComponent::TickBehavior' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OverrideParameters) == 0x000440, "Member 'UNiagaraComponent::OverrideParameters' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, MaxTimeBeforeForceUpdateTransform) == 0x000538, "Member 'UNiagaraComponent::MaxTimeBeforeForceUpdateTransform' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OnSystemFinished) == 0x000540, "Member 'UNiagaraComponent::OnSystemFinished' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachParent) == 0x000550, "Member 'UNiagaraComponent::AutoAttachParent' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachSocketName) == 0x000558, "Member 'UNiagaraComponent::AutoAttachSocketName' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachLocationRule) == 0x000560, "Member 'UNiagaraComponent::AutoAttachLocationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachRotationRule) == 0x000561, "Member 'UNiagaraComponent::AutoAttachRotationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachScaleRule) == 0x000562, "Member 'UNiagaraComponent::AutoAttachScaleRule' has a wrong offset!");

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0028(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4103[0x8];                                     // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentPool">();
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};
static_assert(alignof(UNiagaraComponentPool) == 0x000008, "Wrong alignment on UNiagaraComponentPool");
static_assert(sizeof(UNiagaraComponentPool) == 0x000080, "Wrong size on UNiagaraComponentPool");
static_assert(offsetof(UNiagaraComponentPool, WorldParticleSystemPools) == 0x000028, "Member 'UNiagaraComponentPool::WorldParticleSystemPools' has a wrong offset!");

// Class Niagara.NiagaraComponentSettings
// 0x00F0 (0x0118 - 0x0028)
class UNiagaraComponentSettings final : public UObject
{
public:
	TSet<class FName>                             SuppressActivationList;                            // 0x0028(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             ForceAutoPooolingList;                             // 0x0078(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<struct FNiagaraEmitterNameSettingsRef>   SuppressEmitterList;                               // 0x00C8(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentSettings">();
	}
	static class UNiagaraComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentSettings>();
	}
};
static_assert(alignof(UNiagaraComponentSettings) == 0x000008, "Wrong alignment on UNiagaraComponentSettings");
static_assert(sizeof(UNiagaraComponentSettings) == 0x000118, "Wrong size on UNiagaraComponentSettings");
static_assert(offsetof(UNiagaraComponentSettings, SuppressActivationList) == 0x000028, "Member 'UNiagaraComponentSettings::SuppressActivationList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, ForceAutoPooolingList) == 0x000078, "Member 'UNiagaraComponentSettings::ForceAutoPooolingList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, SuppressEmitterList) == 0x0000C8, "Member 'UNiagaraComponentSettings::SuppressEmitterList' has a wrong offset!");

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraConvertInPlaceUtilityBase">();
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};
static_assert(alignof(UNiagaraConvertInPlaceUtilityBase) == 0x000008, "Wrong alignment on UNiagaraConvertInPlaceUtilityBase");
static_assert(sizeof(UNiagaraConvertInPlaceUtilityBase) == 0x000028, "Wrong size on UNiagaraConvertInPlaceUtilityBase");

// Class Niagara.NiagaraDataInterfaceArray
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceArray : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_4104[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateGPU();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArray">();
	}
	static class UNiagaraDataInterfaceArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArray>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArray) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArray");
static_assert(sizeof(UNiagaraDataInterfaceArray) == 0x000040, "Wrong size on UNiagaraDataInterfaceArray");

// Class Niagara.NiagaraDataInterfaceArrayFloat
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayFloat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<float>                                 FloatData;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat">();
	}
	static class UNiagaraDataInterfaceArrayFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayFloat");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat, FloatData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayFloat::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat2
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayFloat2 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector2D>                      FloatData;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat2">();
	}
	static class UNiagaraDataInterfaceArrayFloat2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat2>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat2) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat2");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat2) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayFloat2");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat2, FloatData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayFloat2::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat3
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayFloat3 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector>                        FloatData;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat3">();
	}
	static class UNiagaraDataInterfaceArrayFloat3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat3>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat3) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat3");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat3) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayFloat3");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat3, FloatData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayFloat3::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat4
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayFloat4 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector4>                       FloatData;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat4">();
	}
	static class UNiagaraDataInterfaceArrayFloat4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat4>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat4) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat4");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat4) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayFloat4");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat4, FloatData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayFloat4::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayColor
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayColor final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FLinearColor>                   ColorData;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayColor">();
	}
	static class UNiagaraDataInterfaceArrayColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayColor>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayColor) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayColor");
static_assert(sizeof(UNiagaraDataInterfaceArrayColor) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayColor");
static_assert(offsetof(UNiagaraDataInterfaceArrayColor, ColorData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayColor::ColorData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayQuat
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayQuat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FQuat>                          QuatData;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayQuat">();
	}
	static class UNiagaraDataInterfaceArrayQuat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayQuat>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayQuat) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayQuat");
static_assert(sizeof(UNiagaraDataInterfaceArrayQuat) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayQuat");
static_assert(offsetof(UNiagaraDataInterfaceArrayQuat, QuatData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayQuat::QuatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterfaceArrayFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<bool> GetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FLinearColor> GetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<float> GetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<int32> GetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FQuat> GetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector> GetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector2D> GetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static TArray<struct FVector4> GetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, class FName OverrideName);
	static void SetNiagaraArrayBool(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<bool>& ArrayData);
	static void SetNiagaraArrayColor(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FLinearColor>& ArrayData);
	static void SetNiagaraArrayFloat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<float>& ArrayData);
	static void SetNiagaraArrayInt32(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<int32>& ArrayData);
	static void SetNiagaraArrayQuat(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FQuat>& ArrayData);
	static void SetNiagaraArrayVector(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector>& ArrayData);
	static void SetNiagaraArrayVector2D(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector2D>& ArrayData);
	static void SetNiagaraArrayVector4(class UNiagaraComponent* NiagaraSystem, class FName OverrideName, const TArray<struct FVector4>& ArrayData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFunctionLibrary">();
	}
	static class UNiagaraDataInterfaceArrayFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFunctionLibrary>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFunctionLibrary) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFunctionLibrary");
static_assert(sizeof(UNiagaraDataInterfaceArrayFunctionLibrary) == 0x000028, "Wrong size on UNiagaraDataInterfaceArrayFunctionLibrary");

// Class Niagara.NiagaraDataInterfaceArrayInt32
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayInt32 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<int32>                                 IntData;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayInt32">();
	}
	static class UNiagaraDataInterfaceArrayInt32* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayInt32>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayInt32) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayInt32");
static_assert(sizeof(UNiagaraDataInterfaceArrayInt32) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayInt32");
static_assert(offsetof(UNiagaraDataInterfaceArrayInt32, IntData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayInt32::IntData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayBool
// 0x0010 (0x0050 - 0x0040)
class UNiagaraDataInterfaceArrayBool final : public UNiagaraDataInterfaceArray
{
public:
	TArray<bool>                                  BoolData;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayBool">();
	}
	static class UNiagaraDataInterfaceArrayBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayBool>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayBool) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayBool");
static_assert(sizeof(UNiagaraDataInterfaceArrayBool) == 0x000050, "Wrong size on UNiagaraDataInterfaceArrayBool");
static_assert(offsetof(UNiagaraDataInterfaceArrayBool, BoolData) == 0x000040, "Member 'UNiagaraDataInterfaceArrayBool::BoolData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioSubmix
// 0x0008 (0x0038 - 0x0030)
class UNiagaraDataInterfaceAudioSubmix : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSubmix">();
	}
	static class UNiagaraDataInterfaceAudioSubmix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSubmix>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioSubmix) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioSubmix");
static_assert(sizeof(UNiagaraDataInterfaceAudioSubmix) == 0x000038, "Wrong size on UNiagaraDataInterfaceAudioSubmix");
static_assert(offsetof(UNiagaraDataInterfaceAudioSubmix, Submix) == 0x000030, "Member 'UNiagaraDataInterfaceAudioSubmix::Submix' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceAudioOscilloscope final : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Resolution;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScopeInMilliseconds;                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioOscilloscope">();
	}
	static class UNiagaraDataInterfaceAudioOscilloscope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioOscilloscope>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioOscilloscope) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioOscilloscope");
static_assert(sizeof(UNiagaraDataInterfaceAudioOscilloscope) == 0x000040, "Wrong size on UNiagaraDataInterfaceAudioOscilloscope");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, Submix) == 0x000030, "Member 'UNiagaraDataInterfaceAudioOscilloscope::Submix' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, Resolution) == 0x000038, "Member 'UNiagaraDataInterfaceAudioOscilloscope::Resolution' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, ScopeInMilliseconds) == 0x00003C, "Member 'UNiagaraDataInterfaceAudioOscilloscope::ScopeInMilliseconds' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioPlayer
// 0x0020 (0x0050 - 0x0030)
class UNiagaraDataInterfaceAudioPlayer final : public UNiagaraDataInterface
{
public:
	class USoundBase*                             SoundToPlay;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      Attenuation;                                       // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      Concurrency;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitPlaysPerTick;                                // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4105[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlaysPerTick;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioPlayer">();
	}
	static class UNiagaraDataInterfaceAudioPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioPlayer>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioPlayer) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioPlayer");
static_assert(sizeof(UNiagaraDataInterfaceAudioPlayer) == 0x000050, "Wrong size on UNiagaraDataInterfaceAudioPlayer");
static_assert(offsetof(UNiagaraDataInterfaceAudioPlayer, SoundToPlay) == 0x000030, "Member 'UNiagaraDataInterfaceAudioPlayer::SoundToPlay' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioPlayer, Attenuation) == 0x000038, "Member 'UNiagaraDataInterfaceAudioPlayer::Attenuation' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioPlayer, Concurrency) == 0x000040, "Member 'UNiagaraDataInterfaceAudioPlayer::Concurrency' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioPlayer, bLimitPlaysPerTick) == 0x000048, "Member 'UNiagaraDataInterfaceAudioPlayer::bLimitPlaysPerTick' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioPlayer, MaxPlaysPerTick) == 0x00004C, "Member 'UNiagaraDataInterfaceAudioPlayer::MaxPlaysPerTick' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAudioSpectrum final : public UNiagaraDataInterfaceAudioSubmix
{
public:
	int32                                         Resolution;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumFrequency;                                  // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumFrequency;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseFloorDb;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSpectrum">();
	}
	static class UNiagaraDataInterfaceAudioSpectrum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSpectrum>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioSpectrum) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioSpectrum");
static_assert(sizeof(UNiagaraDataInterfaceAudioSpectrum) == 0x000048, "Wrong size on UNiagaraDataInterfaceAudioSpectrum");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, Resolution) == 0x000038, "Member 'UNiagaraDataInterfaceAudioSpectrum::Resolution' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, MinimumFrequency) == 0x00003C, "Member 'UNiagaraDataInterfaceAudioSpectrum::MinimumFrequency' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, MaximumFrequency) == 0x000040, "Member 'UNiagaraDataInterfaceAudioSpectrum::MaximumFrequency' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, NoiseFloorDb) == 0x000044, "Member 'UNiagaraDataInterfaceAudioSpectrum::NoiseFloorDb' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceCamera
// 0x0008 (0x0038 - 0x0030)
class UNiagaraDataInterfaceCamera final : public UNiagaraDataInterface
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireCurrentFrameData;                          // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4106[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCamera">();
	}
	static class UNiagaraDataInterfaceCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCamera>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCamera) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCamera");
static_assert(sizeof(UNiagaraDataInterfaceCamera) == 0x000038, "Wrong size on UNiagaraDataInterfaceCamera");
static_assert(offsetof(UNiagaraDataInterfaceCamera, PlayerControllerIndex) == 0x000030, "Member 'UNiagaraDataInterfaceCamera::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCamera, bRequireCurrentFrameData) == 0x000034, "Member 'UNiagaraDataInterfaceCamera::bRequireCurrentFrameData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceCollisionQuery
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceCollisionQuery final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_4107[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCollisionQuery">();
	}
	static class UNiagaraDataInterfaceCollisionQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCollisionQuery>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCollisionQuery) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCollisionQuery");
static_assert(sizeof(UNiagaraDataInterfaceCollisionQuery) == 0x000040, "Wrong size on UNiagaraDataInterfaceCollisionQuery");

// Class Niagara.NiagaraDataInterfaceCurlNoise
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceCurlNoise final : public UNiagaraDataInterface
{
public:
	uint32                                        Seed;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4108[0xC];                                     // 0x0034(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurlNoise">();
	}
	static class UNiagaraDataInterfaceCurlNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurlNoise>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCurlNoise) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCurlNoise");
static_assert(sizeof(UNiagaraDataInterfaceCurlNoise) == 0x000040, "Wrong size on UNiagaraDataInterfaceCurlNoise");
static_assert(offsetof(UNiagaraDataInterfaceCurlNoise, Seed) == 0x000030, "Member 'UNiagaraDataInterfaceCurlNoise::Seed' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceCurve
// 0x0080 (0x00D8 - 0x0058)
class UNiagaraDataInterfaceCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             Curve;                                             // 0x0058(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCurve">();
	}
	static class UNiagaraDataInterfaceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurve>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCurve) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCurve");
static_assert(sizeof(UNiagaraDataInterfaceCurve) == 0x0000D8, "Wrong size on UNiagaraDataInterfaceCurve");
static_assert(offsetof(UNiagaraDataInterfaceCurve, Curve) == 0x000058, "Member 'UNiagaraDataInterfaceCurve::Curve' has a wrong offset!");

// Class Niagara.NiagaraParticleCallbackHandler
// 0x0000 (0x0028 - 0x0028)
class INiagaraParticleCallbackHandler final : public IInterface
{
public:
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraParticleCallbackHandler">();
	}
	static class INiagaraParticleCallbackHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraParticleCallbackHandler>();
	}
};
static_assert(alignof(INiagaraParticleCallbackHandler) == 0x000008, "Wrong alignment on INiagaraParticleCallbackHandler");
static_assert(sizeof(INiagaraParticleCallbackHandler) == 0x000028, "Wrong size on INiagaraParticleCallbackHandler");

// Class Niagara.NiagaraDataInterfaceExport
// 0x0028 (0x0058 - 0x0030)
class UNiagaraDataInterfaceExport final : public UNiagaraDataInterface
{
public:
	struct FNiagaraUserParameterBinding           CallbackHandlerParameter;                          // 0x0030(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceExport">();
	}
	static class UNiagaraDataInterfaceExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceExport>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceExport) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceExport");
static_assert(sizeof(UNiagaraDataInterfaceExport) == 0x000058, "Wrong size on UNiagaraDataInterfaceExport");
static_assert(offsetof(UNiagaraDataInterfaceExport, CallbackHandlerParameter) == 0x000030, "Member 'UNiagaraDataInterfaceExport::CallbackHandlerParameter' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x00A0 (0x00D0 - 0x0030)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	TSet<int32>                                   OutputShaderStages;                                // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<int32>                                   IterationShaderStages;                             // 0x0080(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRWBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRWBase");
static_assert(sizeof(UNiagaraDataInterfaceRWBase) == 0x0000D0, "Wrong size on UNiagaraDataInterfaceRWBase");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, OutputShaderStages) == 0x000030, "Member 'UNiagaraDataInterfaceRWBase::OutputShaderStages' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, IterationShaderStages) == 0x000080, "Member 'UNiagaraDataInterfaceRWBase::IterationShaderStages' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceGrid2D
// 0x0020 (0x00F0 - 0x00D0)
class UNiagaraDataInterfaceGrid2D : public UNiagaraDataInterfaceRWBase
{
public:
	int32                                         NumCellsX;                                         // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsY;                                         // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsMaxAxis;                                   // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
