#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ExecuteUbergraph_NPC_Pawn_Parent
// 0x02A0 (0x02A0 - 0x0000)
struct NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50F5[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50F6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50F7[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0028(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0054(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x00F0(0x0018)()
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50F8[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50F9[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0120(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x014C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x01E8(0x0018)()
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50FA[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50FB[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bVisible)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FC[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue_1;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50FD[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_1;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_NPC_AlertLevel                           CallFunc_NPC_GetAlertLevelInfo_AlertLevel;         // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag;      // 0x024C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_GetAlertLevelInfo_ValidDataFound;     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50FE[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50FF[0x6];                                     // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_2;           // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5100[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Vehicle;                        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory; // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent");
static_assert(sizeof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent) == 0x0002A0, "Wrong size on NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, EntryPoint) == 0x000000, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_1) == 0x000010, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget) == 0x000018, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_2) == 0x000021, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage_1) == 0x000024, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags_1) == 0x000028, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum_1) == 0x000048, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo_1) == 0x000054, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy_1) == 0x0000E0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser_1) == 0x0000E8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext_1) == 0x0000F0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetHealth_ReturnValue) == 0x000108, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_1) == 0x00010C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetMaxHealth_ReturnValue) == 0x000110, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000114, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage) == 0x000118, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags) == 0x000120, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum) == 0x000140, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo) == 0x00014C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy) == 0x0001D8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser) == 0x0001E0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext) == 0x0001E8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetDistanceBetweenActors_Distance) == 0x000200, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Less_FloatFloat_ReturnValue) == 0x000204, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000205, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetCurrent_ReturnValue) == 0x000208, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000210, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000214, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EndPlayReason) == 0x000224, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetCurrent_ReturnValue_1) == 0x000228, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetCurrent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000230, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000238, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_1) == 0x000240, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_4) == 0x000249, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsVisible_ReturnValue) == 0x00024A, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_AlertLevel) == 0x00024B, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_AlertLevel' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag) == 0x00024C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_ValidDataFound) == 0x000254, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_ValidDataFound' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000258, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_bVisible) == 0x000268, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_5) == 0x000269, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_2) == 0x000270, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_2) == 0x000278, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000280, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_3) == 0x000281, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_Vehicle) == 0x000288, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_Velocity) == 0x000290, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory) == 0x00029C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC ParentLaunchVehicle
// 0x0018 (0x0018 - 0x0000)
struct NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle final
{
public:
	class AActor*                                 Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle");
static_assert(sizeof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle) == 0x000018, "Wrong size on NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle, Vehicle) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle::Vehicle' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle, Velocity) == 0x000008, "Member 'NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle::Velocity' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.WidgetVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_WidgetVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_WidgetVisibilityChanged) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_WidgetVisibilityChanged");
static_assert(sizeof(NPC_Pawn_Parent_C_WidgetVisibilityChanged) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_WidgetVisibilityChanged");
static_assert(offsetof(NPC_Pawn_Parent_C_WidgetVisibilityChanged, bVisible) == 0x000000, "Member 'NPC_Pawn_Parent_C_WidgetVisibilityChanged::bVisible' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_ReceiveEndPlay");
static_assert(sizeof(NPC_Pawn_Parent_C_ReceiveEndPlay) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_ReceiveEndPlay");
static_assert(offsetof(NPC_Pawn_Parent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'NPC_Pawn_Parent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnDamagePlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct NPC_Pawn_Parent_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5101[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(NPC_Pawn_Parent_C_OnDamagePlayEffects) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_OnDamagePlayEffects");
static_assert(sizeof(NPC_Pawn_Parent_C_OnDamagePlayEffects) == 0x0000E8, "Wrong size on NPC_Pawn_Parent_C_OnDamagePlayEffects");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, Damage) == 0x000000, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, DamageTags) == 0x000008, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, Momentum) == 0x000028, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, HitInfo) == 0x000034, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, InstigatedBy) == 0x0000C0, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, DamageCauser) == 0x0000C8, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamagePlayEffects, EffectContext) == 0x0000D0, "Member 'NPC_Pawn_Parent_C_OnDamagePlayEffects::EffectContext' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct NPC_Pawn_Parent_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5102[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(NPC_Pawn_Parent_C_OnDamageServer) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_OnDamageServer");
static_assert(sizeof(NPC_Pawn_Parent_C_OnDamageServer) == 0x0000E8, "Wrong size on NPC_Pawn_Parent_C_OnDamageServer");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, Damage) == 0x000000, "Member 'NPC_Pawn_Parent_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, DamageTags) == 0x000008, "Member 'NPC_Pawn_Parent_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, Momentum) == 0x000028, "Member 'NPC_Pawn_Parent_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, HitInfo) == 0x000034, "Member 'NPC_Pawn_Parent_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'NPC_Pawn_Parent_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'NPC_Pawn_Parent_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'NPC_Pawn_Parent_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ShouldUpdateSkeletalMesh
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh");
static_assert(sizeof(NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh");
static_assert(offsetof(NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh, ReturnValue) == 0x000000, "Member 'NPC_Pawn_Parent_C_ShouldUpdateSkeletalMesh::ReturnValue' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC ApplyRecentlyDamagedTag
// 0x0020 (0x0020 - 0x0000)
struct NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag final
{
public:
	class UClass*                                 RecentlyDamagedOverride;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag");
static_assert(sizeof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag) == 0x000020, "Wrong size on NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, RecentlyDamagedOverride) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::RecentlyDamagedOverride' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_IsValidClass_ReturnValue) == 0x000009, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_IsValidClass_ReturnValue_1) == 0x00000A, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_IsValid_ReturnValue) == 0x00000B, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00000C, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000014, "Member 'NPC_Pawn_Parent_C_NPC_ApplyRecentlyDamagedTag::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC GetAlertLevelInfo
// 0x001C (0x001C - 0x0000)
struct NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo final
{
public:
	Enum_NPC_AlertLevel                           AlertLevel;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5103[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AlertLevelTag;                                     // 0x0004(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidDataFound;                                    // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5104[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo) == 0x000004, "Wrong alignment on NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo");
static_assert(sizeof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo) == 0x00001C, "Wrong size on NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo, AlertLevel) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo::AlertLevel' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo, AlertLevelTag) == 0x000004, "Member 'NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo::AlertLevelTag' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo, ValidDataFound) == 0x00000C, "Member 'NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo::ValidDataFound' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo, CallFunc_Map_Find_Value) == 0x000010, "Member 'NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'NPC_Pawn_Parent_C_NPC_GetAlertLevelInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnRep_NPC_AlertLevel
// 0x0060 (0x0060 - 0x0000)
struct NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5105[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           CallFunc_NPC_GetAlertLevelInfo_AlertLevel;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5106[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag;      // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_GetAlertLevelInfo_ValidDataFound;     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5107[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel");
static_assert(sizeof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel) == 0x000060, "Wrong size on NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_HasAuthority_ReturnValue_1) == 0x000001, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_GetCurrent_ReturnValue) == 0x000008, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_NPC_GetAlertLevelInfo_AlertLevel) == 0x000010, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_NPC_GetAlertLevelInfo_AlertLevel' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag) == 0x000014, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_NPC_GetAlertLevelInfo_ValidDataFound) == 0x00001C, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_NPC_GetAlertLevelInfo_ValidDataFound' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_GetTagName_ReturnValue) == 0x000020, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000028, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_BuildString_Name_ReturnValue) == 0x000040, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel, CallFunc_BuildString_Name_ReturnValue_1) == 0x000050, "Member 'NPC_Pawn_Parent_C_OnRep_NPC_AlertLevel::CallFunc_BuildString_Name_ReturnValue_1' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC SetBestLootRarityInInventory
// 0x0118 (0x0118 - 0x0000)
struct NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory final
{
public:
	EFortRarity                                   Param_NPC_BestLootRarityInInventory;               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   NPC_BestLootRarityInventoryFound;                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5108[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5109[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_510A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GetItemsFromInventoryOwner_InventoryOwner_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UFortWorldItem*>                 CallFunc_GetItemsFromInventoryOwner_Items;         // 0x0040(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItem*                         CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_510B[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue_1;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_510C[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory");
static_assert(sizeof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory) == 0x000118, "Wrong size on NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, Param_NPC_BestLootRarityInInventory) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::Param_NPC_BestLootRarityInInventory' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, NPC_BestLootRarityInventoryFound) == 0x000001, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::NPC_BestLootRarityInventoryFound' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, Temp_int_Array_Index_Variable) == 0x000024, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Greater_ByteByte_ReturnValue) == 0x000028, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetItemsFromInventoryOwner_InventoryOwner_CastInput) == 0x000030, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetItemsFromInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetItemsFromInventoryOwner_Items) == 0x000040, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetItemsFromInventoryOwner_Items' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetEnumeratorName_ReturnValue) == 0x000050, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Array_Get_Item) == 0x000058, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_BuildString_Name_ReturnValue) == 0x000060, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetRarity_ReturnValue) == 0x000098, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x0000B0, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C8, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D8, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E8, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Greater_ByteByte_ReturnValue_1) == 0x0000F8, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Greater_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000100, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'NPC_Pawn_Parent_C_NPC_SetBestLootRarityInInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC PawnDebugMessage
// 0x0088 (0x0088 - 0x0000)
struct NPC_Pawn_Parent_C_NPC_PawnDebugMessage final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OnlyWhenDebug;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_510D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_510E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
