#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuSliderReplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature");
static_assert(sizeof(OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature");
static_assert(offsetof(OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'OptionsMenuSliderReplay_C_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.ExecuteUbergraph_OptionsMenuSliderReplay
// 0x0188 (0x0188 - 0x0000)
struct OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0010(0x0070)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSliderValueText_ValueText;             // 0x0138(0x0018)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMouseCapture_ReturnValue;              // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay");
static_assert(sizeof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay) == 0x000188, "Wrong size on OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, EntryPoint) == 0x000000, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_Event_MouseEvent_1) == 0x000010, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000080, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_Event_MyGeometry) == 0x000088, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_ComponentBoundEvent_Value_1) == 0x000130, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_ComponentBoundEvent_Value) == 0x000134, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_GetSliderValueText_ValueText) == 0x000138, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_GetSliderValueText_ValueText' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_MakeStruct_LinearColor) == 0x000150, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_MakeStruct_LinearColor_1) == 0x000160, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_GetValue_ReturnValue) == 0x000170, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_GetValue_ReturnValue_1) == 0x000174, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000178, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_GetValue_ReturnValue_2) == 0x000180, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_GetValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, CallFunc_HasMouseCapture_ReturnValue) == 0x000184, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::CallFunc_HasMouseCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay, K2Node_Event_IsDesignTime) == 0x000185, "Member 'OptionsMenuSliderReplay_C_ExecuteUbergraph_OptionsMenuSliderReplay::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuSliderReplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuSliderReplay_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsMenuSliderReplay_C_PreConstruct");
static_assert(sizeof(OptionsMenuSliderReplay_C_PreConstruct) == 0x000001, "Wrong size on OptionsMenuSliderReplay_C_PreConstruct");
static_assert(offsetof(OptionsMenuSliderReplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsMenuSliderReplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'OptionsMenuSliderReplay_C_BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct OptionsMenuSliderReplay_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSliderReplay_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_OnMouseEnter");
static_assert(sizeof(OptionsMenuSliderReplay_C_OnMouseEnter) == 0x0000A8, "Wrong size on OptionsMenuSliderReplay_C_OnMouseEnter");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsMenuSliderReplay_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsMenuSliderReplay_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct OptionsMenuSliderReplay_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuSliderReplay_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_OnMouseLeave");
static_assert(sizeof(OptionsMenuSliderReplay_C_OnMouseLeave) == 0x000070, "Wrong size on OptionsMenuSliderReplay_C_OnMouseLeave");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsMenuSliderReplay_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.Update Slider
// 0x0048 (0x0048 - 0x0000)
struct OptionsMenuSliderReplay_C_Update_Slider final
{
public:
	class FText                                   Slider_Text;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Slider_Value;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_Hover_Text;                                  // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonTextBlock*                       Tooltip_Text_Block;                                // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Min_Max_Value;                                     // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_Update_Slider) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_Update_Slider");
static_assert(sizeof(OptionsMenuSliderReplay_C_Update_Slider) == 0x000048, "Wrong size on OptionsMenuSliderReplay_C_Update_Slider");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider, Slider_Text) == 0x000000, "Member 'OptionsMenuSliderReplay_C_Update_Slider::Slider_Text' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider, Slider_Value) == 0x000018, "Member 'OptionsMenuSliderReplay_C_Update_Slider::Slider_Value' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider, Param_Hover_Text) == 0x000020, "Member 'OptionsMenuSliderReplay_C_Update_Slider::Param_Hover_Text' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider, Tooltip_Text_Block) == 0x000038, "Member 'OptionsMenuSliderReplay_C_Update_Slider::Tooltip_Text_Block' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider, Min_Max_Value) == 0x000040, "Member 'OptionsMenuSliderReplay_C_Update_Slider::Min_Max_Value' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.Center On Widget
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuSliderReplay_C_Center_On_Widget final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_Center_On_Widget) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_Center_On_Widget");
static_assert(sizeof(OptionsMenuSliderReplay_C_Center_On_Widget) == 0x000008, "Wrong size on OptionsMenuSliderReplay_C_Center_On_Widget");
static_assert(offsetof(OptionsMenuSliderReplay_C_Center_On_Widget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'OptionsMenuSliderReplay_C_Center_On_Widget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct OptionsMenuSliderReplay_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(OptionsMenuSliderReplay_C_OnFocusReceived) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_OnFocusReceived");
static_assert(sizeof(OptionsMenuSliderReplay_C_OnFocusReceived) == 0x0001B0, "Wrong size on OptionsMenuSliderReplay_C_OnFocusReceived");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'OptionsMenuSliderReplay_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'OptionsMenuSliderReplay_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'OptionsMenuSliderReplay_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'OptionsMenuSliderReplay_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.GetSliderValueText
// 0x0130 (0x0130 - 0x0000)
struct OptionsMenuSliderReplay_C_GetSliderValueText final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValueText;                                         // 0x0008(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7D[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(OptionsMenuSliderReplay_C_GetSliderValueText) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_GetSliderValueText");
static_assert(sizeof(OptionsMenuSliderReplay_C_GetSliderValueText) == 0x000130, "Wrong size on OptionsMenuSliderReplay_C_GetSliderValueText");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, Value) == 0x000000, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::Value' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, ValueText) == 0x000008, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::ValueText' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, CallFunc_BreakVector2D_Y) == 0x0000A4, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A8, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000B0, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, K2Node_MakeArray_Array) == 0x000108, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetSliderValueText, CallFunc_Format_ReturnValue) == 0x000118, "Member 'OptionsMenuSliderReplay_C_GetSliderValueText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.Update Slider Value
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenuSliderReplay_C_Update_Slider_Value final
{
public:
	float                                         NormalizedValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSliderValueText_ValueText;             // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_Update_Slider_Value) == 0x000008, "Wrong alignment on OptionsMenuSliderReplay_C_Update_Slider_Value");
static_assert(sizeof(OptionsMenuSliderReplay_C_Update_Slider_Value) == 0x000028, "Wrong size on OptionsMenuSliderReplay_C_Update_Slider_Value");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider_Value, NormalizedValue) == 0x000000, "Member 'OptionsMenuSliderReplay_C_Update_Slider_Value::NormalizedValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider_Value, CallFunc_GetSliderValueText_ValueText) == 0x000008, "Member 'OptionsMenuSliderReplay_C_Update_Slider_Value::CallFunc_GetSliderValueText_ValueText' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_Update_Slider_Value, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'OptionsMenuSliderReplay_C_Update_Slider_Value::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.GetMappedValue
// 0x0014 (0x0014 - 0x0000)
struct OptionsMenuSliderReplay_C_GetMappedValue final
{
public:
	float                                         MappedValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_GetMappedValue) == 0x000004, "Wrong alignment on OptionsMenuSliderReplay_C_GetMappedValue");
static_assert(sizeof(OptionsMenuSliderReplay_C_GetMappedValue) == 0x000014, "Wrong size on OptionsMenuSliderReplay_C_GetMappedValue");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetMappedValue, MappedValue) == 0x000000, "Member 'OptionsMenuSliderReplay_C_GetMappedValue::MappedValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetMappedValue, CallFunc_BreakVector2D_X) == 0x000004, "Member 'OptionsMenuSliderReplay_C_GetMappedValue::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetMappedValue, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'OptionsMenuSliderReplay_C_GetMappedValue::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetMappedValue, CallFunc_GetValue_ReturnValue) == 0x00000C, "Member 'OptionsMenuSliderReplay_C_GetMappedValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_GetMappedValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'OptionsMenuSliderReplay_C_GetMappedValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function OptionsMenuSliderReplay.OptionsMenuSliderReplay_C.UpdateSliderValueUnmapped
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped final
{
public:
	float                                         UnmappedValue;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped) == 0x000004, "Wrong alignment on OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped");
static_assert(sizeof(OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped) == 0x000010, "Wrong size on OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped");
static_assert(offsetof(OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped, UnmappedValue) == 0x000000, "Member 'OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped::UnmappedValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped, CallFunc_BreakVector2D_X) == 0x000004, "Member 'OptionsMenuSliderReplay_C_UpdateSliderValueUnmapped::CallFunc_BreakVector2D_X' has a wrong offset!");
