#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuSliderReplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuSliderReplay.OptionsMenuSliderReplay_C
// 0x00D8 (0x0308 - 0x0230)
class UOptionsMenuSliderReplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LabelSizeBox;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          MenuSlider;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SliderBackground;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderText;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SliderValue;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SliderChanged;                                     // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               Slider_Texture;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Hover_Text;                                        // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinIntegralDigits;                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxIntegralDigits;                                 // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinFractionalDigits;                               // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFractionalDigits;                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowLightMaterial;                                 // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F77[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MinMaxValue;                                       // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F78[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValuePrefixText;                                   // 0x02C0(0x0018)(Edit, BlueprintVisible)
	class FText                                   ValueSuffixText;                                   // 0x02D8(0x0018)(Edit, BlueprintVisible)
	bool                                          MouseDragUpdates;                                  // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F79[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SliderSound;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Label_Width;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SliderChanged__DelegateSignature(float Slider_Value);
	void ExecuteUbergraph_OptionsMenuSliderReplay(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_107_OnControllerCaptureEndEvent__DelegateSignature();
	void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_86_OnMouseCaptureEndEvent__DelegateSignature();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Update_Slider(const class FText& Slider_Text, float Slider_Value, const class FText& Param_Hover_Text, class UCommonTextBlock* Tooltip_Text_Block, const struct FVector2D& Min_Max_Value);
	void Center_On_Widget();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void GetSliderValueText(float Value, class FText* ValueText);
	void Update_Slider_Value(float NormalizedValue);
	void GetMappedValue(float* MappedValue);
	void UpdateSliderValueUnmapped(float UnmappedValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuSliderReplay_C">();
	}
	static class UOptionsMenuSliderReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuSliderReplay_C>();
	}
};
static_assert(alignof(UOptionsMenuSliderReplay_C) == 0x000008, "Wrong alignment on UOptionsMenuSliderReplay_C");
static_assert(sizeof(UOptionsMenuSliderReplay_C) == 0x000308, "Wrong size on UOptionsMenuSliderReplay_C");
static_assert(offsetof(UOptionsMenuSliderReplay_C, UberGraphFrame) == 0x000230, "Member 'UOptionsMenuSliderReplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, Button_0) == 0x000238, "Member 'UOptionsMenuSliderReplay_C::Button_0' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, LabelSizeBox) == 0x000240, "Member 'UOptionsMenuSliderReplay_C::LabelSizeBox' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MenuSlider) == 0x000248, "Member 'UOptionsMenuSliderReplay_C::MenuSlider' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, SliderBackground) == 0x000250, "Member 'UOptionsMenuSliderReplay_C::SliderBackground' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, SliderText) == 0x000258, "Member 'UOptionsMenuSliderReplay_C::SliderText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, SliderValue) == 0x000260, "Member 'UOptionsMenuSliderReplay_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, SliderChanged) == 0x000268, "Member 'UOptionsMenuSliderReplay_C::SliderChanged' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, Slider_Texture) == 0x000278, "Member 'UOptionsMenuSliderReplay_C::Slider_Texture' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, Tab_Tooltip_Text) == 0x000280, "Member 'UOptionsMenuSliderReplay_C::Tab_Tooltip_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, Hover_Text) == 0x000288, "Member 'UOptionsMenuSliderReplay_C::Hover_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MinIntegralDigits) == 0x0002A0, "Member 'UOptionsMenuSliderReplay_C::MinIntegralDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MaxIntegralDigits) == 0x0002A4, "Member 'UOptionsMenuSliderReplay_C::MaxIntegralDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MinFractionalDigits) == 0x0002A8, "Member 'UOptionsMenuSliderReplay_C::MinFractionalDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MaxFractionalDigits) == 0x0002AC, "Member 'UOptionsMenuSliderReplay_C::MaxFractionalDigits' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, ShowLightMaterial) == 0x0002B0, "Member 'UOptionsMenuSliderReplay_C::ShowLightMaterial' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MinMaxValue) == 0x0002B4, "Member 'UOptionsMenuSliderReplay_C::MinMaxValue' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, ValuePrefixText) == 0x0002C0, "Member 'UOptionsMenuSliderReplay_C::ValuePrefixText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, ValueSuffixText) == 0x0002D8, "Member 'UOptionsMenuSliderReplay_C::ValueSuffixText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, MouseDragUpdates) == 0x0002F0, "Member 'UOptionsMenuSliderReplay_C::MouseDragUpdates' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, SliderSound) == 0x0002F8, "Member 'UOptionsMenuSliderReplay_C::SliderSound' has a wrong offset!");
static_assert(offsetof(UOptionsMenuSliderReplay_C, Label_Width) == 0x000300, "Member 'UOptionsMenuSliderReplay_C::Label_Width' has a wrong offset!");

}

