#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OverrideScalarParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct OverrideScalarParam.OverrideScalarParam
// 0x0010 (0x0010 - 0x0000)
struct FOverrideScalarParam final
{
public:
	class FName                                   ParamName_3_46BD3C8D477D840B35306B8CE74876D6;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value_6_7FA5309641F7AD62DF223D89FA8050A9;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_8_98075C3243551D723016A88DB09F001B;       // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FOverrideScalarParam) == 0x000004, "Wrong alignment on FOverrideScalarParam");
static_assert(sizeof(FOverrideScalarParam) == 0x000010, "Wrong size on FOverrideScalarParam");
static_assert(offsetof(FOverrideScalarParam, ParamName_3_46BD3C8D477D840B35306B8CE74876D6) == 0x000000, "Member 'FOverrideScalarParam::ParamName_3_46BD3C8D477D840B35306B8CE74876D6' has a wrong offset!");
static_assert(offsetof(FOverrideScalarParam, Value_6_7FA5309641F7AD62DF223D89FA8050A9) == 0x000008, "Member 'FOverrideScalarParam::Value_6_7FA5309641F7AD62DF223D89FA8050A9' has a wrong offset!");
static_assert(offsetof(FOverrideScalarParam, Override_8_98075C3243551D723016A88DB09F001B) == 0x00000C, "Member 'FOverrideScalarParam::Override_8_98075C3243551D723016A88DB09F001B' has a wrong offset!");

}

