#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OverrideVectorParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct OverrideVectorParam.OverrideVectorParam
// 0x0018 (0x0018 - 0x0000)
struct FOverrideVectorParam final
{
public:
	class FName                                   ParamName_3_46BD3C8D477D840B35306B8CE74876D6;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Value_7_7FA5309641F7AD62DF223D89FA8050A9;          // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override_9_89C6AF9C4C6227977A336C92FD242C55;       // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FOverrideVectorParam) == 0x000004, "Wrong alignment on FOverrideVectorParam");
static_assert(sizeof(FOverrideVectorParam) == 0x000018, "Wrong size on FOverrideVectorParam");
static_assert(offsetof(FOverrideVectorParam, ParamName_3_46BD3C8D477D840B35306B8CE74876D6) == 0x000000, "Member 'FOverrideVectorParam::ParamName_3_46BD3C8D477D840B35306B8CE74876D6' has a wrong offset!");
static_assert(offsetof(FOverrideVectorParam, Value_7_7FA5309641F7AD62DF223D89FA8050A9) == 0x000008, "Member 'FOverrideVectorParam::Value_7_7FA5309641F7AD62DF223D89FA8050A9' has a wrong offset!");
static_assert(offsetof(FOverrideVectorParam, Override_9_89C6AF9C4C6227977A336C92FD242C55) == 0x000014, "Member 'FOverrideVectorParam::Override_9_89C6AF9C4C6227977A336C92FD242C55' has a wrong offset!");

}

