#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParentBuildingContainerBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DayPhaseFloats_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ParentBuildingContainerBlueprint.ParentBuildingContainerBlueprint_C
// 0x00E0 (0x0DE8 - 0x0D08)
class AParentBuildingContainerBlueprint_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DebugWind;                                         // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C0[0x7];                                     // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             IntenseWindMaterialsForPreview;                    // 0x0D18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wind_Intensity_Debug_Mesh;                         // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0D30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Debug_TempMaterial;                                // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugWindYaw;                                      // 0x0D48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Debug_Wind_Intensity;                              // 0x0D4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_Max_Actor_Scale;                               // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C1[0x3];                                     // 0x0D51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Max_Scale;                                         // 0x0D54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x0D58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x0D59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_; // 0x0D5A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C2[0x5];                                     // 0x0D5B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AlternateShadowStaticMesh;                         // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Emissive_and_Lights_Over_Time;             // 0x0D68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C3[0x7];                                     // 0x0D69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CodeControlled_EmissiveColor;                      // 0x0D70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<float>                                 CodeControlled_LightConeOpacity;                   // 0x0D80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Light_Intensity_Over_Time_of_Day_;                 // 0x0D90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Day_Phase_Transition_Length;                       // 0x0DA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Emissive_Intensity_Over_Time_of_Day;               // 0x0DA4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volumetric_Light_Scattering_Intensity;             // 0x0DB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Volumetric_Shadows;                           // 0x0DB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls; // 0x0DB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls; // 0x0DBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C4[0x5];                                     // 0x0DBB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LightAnimationCurve;                               // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_Animation_Curve_Animation_Length;   // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CodeControlled_NumberOfMaterials;                  // 0x0DCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 NewVar_0;                                          // 0x0DD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Random_Time_Scale_Percent;                         // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_CurrentPlayLength;                  // 0x0DE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ParentBuildingContainerBlueprint(int32 EntryPoint);
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void Loop_Animation_Curve();
	void OnSetSearched();
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParentBuildingContainerBlueprint_C">();
	}
	static class AParentBuildingContainerBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParentBuildingContainerBlueprint_C>();
	}
};
static_assert(alignof(AParentBuildingContainerBlueprint_C) == 0x000008, "Wrong alignment on AParentBuildingContainerBlueprint_C");
static_assert(sizeof(AParentBuildingContainerBlueprint_C) == 0x000DE8, "Wrong size on AParentBuildingContainerBlueprint_C");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, UberGraphFrame) == 0x000D08, "Member 'AParentBuildingContainerBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, DebugWind) == 0x000D10, "Member 'AParentBuildingContainerBlueprint_C::DebugWind' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, IntenseWindMaterialsForPreview) == 0x000D18, "Member 'AParentBuildingContainerBlueprint_C::IntenseWindMaterialsForPreview' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Wind_Intensity_Debug_Mesh) == 0x000D28, "Member 'AParentBuildingContainerBlueprint_C::Wind_Intensity_Debug_Mesh' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, OriginalMaterials) == 0x000D30, "Member 'AParentBuildingContainerBlueprint_C::OriginalMaterials' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Debug_TempMaterial) == 0x000D40, "Member 'AParentBuildingContainerBlueprint_C::Debug_TempMaterial' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, DebugWindYaw) == 0x000D48, "Member 'AParentBuildingContainerBlueprint_C::DebugWindYaw' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Debug_Wind_Intensity) == 0x000D4C, "Member 'AParentBuildingContainerBlueprint_C::Debug_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Set_Max_Actor_Scale) == 0x000D50, "Member 'AParentBuildingContainerBlueprint_C::Set_Max_Actor_Scale' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Max_Scale) == 0x000D54, "Member 'AParentBuildingContainerBlueprint_C::Max_Scale' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Disable_TOD_Lights_and_Material_Emissive_Values) == 0x000D58, "Member 'AParentBuildingContainerBlueprint_C::Disable_TOD_Lights_and_Material_Emissive_Values' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active) == 0x000D59, "Member 'AParentBuildingContainerBlueprint_C::Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_) == 0x000D5A, "Member 'AParentBuildingContainerBlueprint_C::Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, AlternateShadowStaticMesh) == 0x000D60, "Member 'AParentBuildingContainerBlueprint_C::AlternateShadowStaticMesh' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Animate_Emissive_and_Lights_Over_Time) == 0x000D68, "Member 'AParentBuildingContainerBlueprint_C::Animate_Emissive_and_Lights_Over_Time' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, CodeControlled_EmissiveColor) == 0x000D70, "Member 'AParentBuildingContainerBlueprint_C::CodeControlled_EmissiveColor' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, CodeControlled_LightConeOpacity) == 0x000D80, "Member 'AParentBuildingContainerBlueprint_C::CodeControlled_LightConeOpacity' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Light_Intensity_Over_Time_of_Day_) == 0x000D90, "Member 'AParentBuildingContainerBlueprint_C::Light_Intensity_Over_Time_of_Day_' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Day_Phase_Transition_Length) == 0x000DA0, "Member 'AParentBuildingContainerBlueprint_C::Day_Phase_Transition_Length' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Emissive_Intensity_Over_Time_of_Day) == 0x000DA4, "Member 'AParentBuildingContainerBlueprint_C::Emissive_Intensity_Over_Time_of_Day' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Volumetric_Light_Scattering_Intensity) == 0x000DB4, "Member 'AParentBuildingContainerBlueprint_C::Volumetric_Light_Scattering_Intensity' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Cast_Volumetric_Shadows) == 0x000DB8, "Member 'AParentBuildingContainerBlueprint_C::Cast_Volumetric_Shadows' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls) == 0x000DB9, "Member 'AParentBuildingContainerBlueprint_C::Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls) == 0x000DBA, "Member 'AParentBuildingContainerBlueprint_C::Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, LightAnimationCurve) == 0x000DC0, "Member 'AParentBuildingContainerBlueprint_C::LightAnimationCurve' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, CodeControlled_Animation_Curve_Animation_Length) == 0x000DC8, "Member 'AParentBuildingContainerBlueprint_C::CodeControlled_Animation_Curve_Animation_Length' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, CodeControlled_NumberOfMaterials) == 0x000DCC, "Member 'AParentBuildingContainerBlueprint_C::CodeControlled_NumberOfMaterials' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, NewVar_0) == 0x000DD0, "Member 'AParentBuildingContainerBlueprint_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, Random_Time_Scale_Percent) == 0x000DE0, "Member 'AParentBuildingContainerBlueprint_C::Random_Time_Scale_Percent' has a wrong offset!");
static_assert(offsetof(AParentBuildingContainerBlueprint_C, CodeControlled_CurrentPlayLength) == 0x000DE4, "Member 'AParentBuildingContainerBlueprint_C::CodeControlled_CurrentPlayLength' has a wrong offset!");

}

