#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyDisplayManagerBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ResetPreScaleLocations
// 0x0230 (0x0230 - 0x0000)
struct PartyDisplayManagerBP_C_ResetPreScaleLocations final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x008C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0118(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x01A4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PartyDisplayManagerBP_C_ResetPreScaleLocations) == 0x000004, "Wrong alignment on PartyDisplayManagerBP_C_ResetPreScaleLocations");
static_assert(sizeof(PartyDisplayManagerBP_C_ResetPreScaleLocations) == 0x000230, "Wrong size on PartyDisplayManagerBP_C_ResetPreScaleLocations");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00008C, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000118, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetPreScaleLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x0001A4, "Member 'PartyDisplayManagerBP_C_ResetPreScaleLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.RestoreTeleportMIDsInProgress
// 0x0058 (0x0058 - 0x0000)
struct PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress final
{
public:
	const class AFortPlayerPawn*                  Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB2[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue; // 0x0020(0x0028)(HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyMemberLocation                      CallFunc_GetPartyMemberLocation_LocationOut;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberLocation_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress");
static_assert(sizeof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress) == 0x000058, "Wrong size on PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex) == 0x000008, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue) == 0x00000C, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000010, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_IsValid_ReturnValue_1) == 0x00001A, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue) == 0x000020, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberLocation_LocationOut) == 0x000050, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberLocation_LocationOut' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, CallFunc_GetPartyMemberLocation_ReturnValue) == 0x000051, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::CallFunc_GetPartyMemberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress, K2Node_SwitchEnum_CmpSuccess) == 0x000052, "Member 'PartyDisplayManagerBP_C_RestoreTeleportMIDsInProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.HandlePartyMemberInProgressDisplayChanges
// 0x00D8 (0x00D8 - 0x0000)
struct PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsParticle_System_Component;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB4[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB5[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB6[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CB7[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB8[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_3; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_4; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_5; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_6; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_7; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_8; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_9; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_10; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CB9[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges");
static_assert(sizeof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges) == 0x0000D8, "Wrong size on PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000008, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetChildrenComponents_Children) == 0x000018, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Array_Index_Variable) == 0x000028, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Array_Get_Item) == 0x000030, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsParticle_System_Component) == 0x000038, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsParticle_System_Component' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsPrimitive_Component) == 0x000048, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetNumMaterials_ReturnValue) == 0x000058, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, Temp_int_Variable) == 0x000068, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_GetMaterial_ReturnValue) == 0x000070, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000078, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000081, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000088, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000090, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x00009C, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x0000A0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_2) == 0x0000A4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_3) == 0x0000A8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_4) == 0x0000AC, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_5) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_6) == 0x0000B4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_7) == 0x0000B8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_8) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_9) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_K2_GetScalarParameterValue_ReturnValue_10) == 0x0000C4, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_K2_GetScalarParameterValue_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'PartyDisplayManagerBP_C_HandlePartyMemberInProgressDisplayChanges::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.PartyMemberInProgressCheck
// 0x0070 (0x0070 - 0x0000)
struct PartyDisplayManagerBP_C_PartyMemberInProgressCheck final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CBA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CBB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyInProgressEnabled_ReturnValue;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CBC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue; // 0x0040(0x0028)(HasGetValueTypeHash)
	EFortPartyMemberLocation                      CallFunc_GetPartyMemberLocation_LocationOut;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyMemberLocation_ReturnValue;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_PartyMemberInProgressCheck");
static_assert(sizeof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck) == 0x000070, "Wrong size on PartyDisplayManagerBP_C_PartyMemberInProgressCheck");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, Pawn) == 0x000000, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::Pawn' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, PlayerIndex) == 0x000008, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex) == 0x00000C, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberIndexByPlayerPawn_OutPlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberIndexByPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000018, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000028, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_IsPartyInProgressEnabled_ReturnValue) == 0x000030, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_IsPartyInProgressEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue) == 0x000040, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPlayerIdFromPartyMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberLocation_LocationOut) == 0x000068, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberLocation_LocationOut' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, CallFunc_GetPartyMemberLocation_ReturnValue) == 0x000069, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::CallFunc_GetPartyMemberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_PartyMemberInProgressCheck, K2Node_SwitchEnum_CmpSuccess) == 0x00006A, "Member 'PartyDisplayManagerBP_C_PartyMemberInProgressCheck::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetMeshForCurrentDisplayedItem
// 0x0048 (0x0048 - 0x0000)
struct PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem final
{
public:
	class UMeshComponent*                         OutDisplayedMesh;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICustomCharacterPartOwnerInterface> CallFunc_GetCustomizationRootSkeletalMeshComponent_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_GetCustomizationRootSkeletalMeshComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerParachute*                   K2Node_DynamicCast_AsFort_Player_Parachute;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CBD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetParachuteRootMesh_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem");
static_assert(sizeof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem) == 0x000048, "Wrong size on PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, OutDisplayedMesh) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::OutDisplayedMesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue) == 0x000008, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_GetCustomizationRootSkeletalMeshComponent_self_CastInput) == 0x000010, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_GetCustomizationRootSkeletalMeshComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_GetCustomizationRootSkeletalMeshComponent_ReturnValue) == 0x000020, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_GetCustomizationRootSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, K2Node_DynamicCast_AsFort_Player_Parachute) == 0x000028, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::K2Node_DynamicCast_AsFort_Player_Parachute' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_GetParachuteRootMesh_ReturnValue) == 0x000038, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_GetParachuteRootMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem, CallFunc_IsValid_ReturnValue_2) == 0x000042, "Member 'PartyDisplayManagerBP_C_GetMeshForCurrentDisplayedItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetItemDefinitionToShow
// 0x0028 (0x0028 - 0x0000)
struct PartyDisplayManagerBP_C_GetItemDefinitionToShow final
{
public:
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CBE[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetItemDefinitionToShow) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_GetItemDefinitionToShow");
static_assert(sizeof(PartyDisplayManagerBP_C_GetItemDefinitionToShow) == 0x000028, "Wrong size on PartyDisplayManagerBP_C_GetItemDefinitionToShow");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, ItemDefinition) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, CallFunc_GetSchematicCraftingResultBP_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::CallFunc_GetSchematicCraftingResultBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, Temp_bool_Variable) == 0x00001A, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemDefinitionToShow, K2Node_Select_Default) == 0x000020, "Member 'PartyDisplayManagerBP_C_GetItemDefinitionToShow::K2Node_Select_Default' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetUIOverrideVisuals
// 0x00D0 (0x00D0 - 0x0000)
struct PartyDisplayManagerBP_C_SetUIOverrideVisuals final
{
public:
	class UTexture2D*                             Large_Texture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Rarity;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CBF[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0018(0x0080)()
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC0[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC1[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue_1;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue_2;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC2[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue_3;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_3;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x0000D0, "Wrong size on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Large_Texture) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Large_Texture' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Item) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Item' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Rarity) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Rarity' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_BPGetRarityData_ReturnValue) == 0x000018, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_GetPersistentName_ReturnValue) == 0x000098, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue) == 0x0000A8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000B8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_1) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_2) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0000C4, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x0000C5, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue_3) == 0x0000C8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue_3) == 0x0000CC, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue_3' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetWeaponPlacementTransform
// 0x0100 (0x0100 - 0x0000)
struct PartyDisplayManagerBP_C_GetWeaponPlacementTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC3[0xF];                                     // 0x0091(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(sizeof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x000100, "Wrong size on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue_1) == 0x0000A0, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_ComposeTransforms_ReturnValue) == 0x0000D0, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.UpdatePreviewMeshTransforms
// 0x00D0 (0x00D0 - 0x0000)
struct PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms final
{
public:
	struct FTransform                             CallFunc_GetPreviewMeshWorldTransform_ReturnValue; // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0030(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(sizeof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x0000D0, "Wrong size on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_GetPreviewMeshWorldTransform_ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_GetPreviewMeshWorldTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000030, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetItemPreviewOffset
// 0x01D0 (0x01D0 - 0x0000)
struct PartyDisplayManagerBP_C_GetItemPreviewOffset final
{
public:
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC4[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC5[0xF];                                     // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetPreviewMeshOffset_ReturnValue;         // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue_1;    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC6[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default;                             // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC7[0xC];                                     // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetItemPreviewOffset) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetItemPreviewOffset");
static_assert(sizeof(PartyDisplayManagerBP_C_GetItemPreviewOffset) == 0x0001D0, "Wrong size on PartyDisplayManagerBP_C_GetItemPreviewOffset");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, ItemDefinition) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, Temp_bool_Variable) == 0x000040, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::Temp_bool_Variable' has a wrong offset!");
