#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Particle_Deco

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Particle_Deco.Particle_Deco_C.ExecuteUbergraph_Particle_Deco
// 0x001C (0x001C - 0x0000)
struct Particle_Deco_C_ExecuteUbergraph_Particle_Deco final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F92[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DropChance_DropResult;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco) == 0x000004, "Wrong alignment on Particle_Deco_C_ExecuteUbergraph_Particle_Deco");
static_assert(sizeof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco) == 0x00001C, "Wrong size on Particle_Deco_C_ExecuteUbergraph_Particle_Deco");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, EntryPoint) == 0x000000, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::EntryPoint' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_IsValid_ReturnValue_1) == 0x000007, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_HasAuthority_ReturnValue_2) == 0x000008, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_FClamp_ReturnValue) == 0x00000C, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_FClamp_ReturnValue_1) == 0x000014, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_ExecuteUbergraph_Particle_Deco, CallFunc_DropChance_DropResult) == 0x000018, "Member 'Particle_Deco_C_ExecuteUbergraph_Particle_Deco::CallFunc_DropChance_DropResult' has a wrong offset!");

// Function Particle_Deco.Particle_Deco_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Particle_Deco_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PseudoRandomScale_RandomScale;            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Particle_Deco_C_UserConstructionScript) == 0x000008, "Wrong alignment on Particle_Deco_C_UserConstructionScript");
static_assert(sizeof(Particle_Deco_C_UserConstructionScript) == 0x000030, "Wrong size on Particle_Deco_C_UserConstructionScript");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_PseudoRandomScale_RandomScale) == 0x00000C, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_PseudoRandomScale_RandomScale' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000018, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_ClampVectorSize_ReturnValue) == 0x000020, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'Particle_Deco_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Particle_Deco.Particle_Deco_C.MaterialEditorSine
// 0x0018 (0x0018 - 0x0000)
struct Particle_Deco_C_MaterialEditorSine final
{
public:
	float                                         LookUpValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Period;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Particle_Deco_C_MaterialEditorSine) == 0x000004, "Wrong alignment on Particle_Deco_C_MaterialEditorSine");
static_assert(sizeof(Particle_Deco_C_MaterialEditorSine) == 0x000018, "Wrong size on Particle_Deco_C_MaterialEditorSine");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, LookUpValue) == 0x000000, "Member 'Particle_Deco_C_MaterialEditorSine::LookUpValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, Period) == 0x000004, "Member 'Particle_Deco_C_MaterialEditorSine::Period' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, ReturnValue) == 0x000008, "Member 'Particle_Deco_C_MaterialEditorSine::ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'Particle_Deco_C_MaterialEditorSine::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'Particle_Deco_C_MaterialEditorSine::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_MaterialEditorSine, CallFunc_DegSin_ReturnValue) == 0x000014, "Member 'Particle_Deco_C_MaterialEditorSine::CallFunc_DegSin_ReturnValue' has a wrong offset!");

// Function Particle_Deco.Particle_Deco_C.PseudoRandomScale
// 0x00D8 (0x00D8 - 0x0000)
struct Particle_Deco_C_PseudoRandomScale final
{
public:
	struct FVector                                ActorLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param_ParticleScale;                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomScale;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaterialEditorSine_ReturnValue;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaterialEditorSine_ReturnValue_1;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaterialEditorSine_ReturnValue_2;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Particle_Deco_C_PseudoRandomScale) == 0x000004, "Wrong alignment on Particle_Deco_C_PseudoRandomScale");
static_assert(sizeof(Particle_Deco_C_PseudoRandomScale) == 0x0000D8, "Wrong size on Particle_Deco_C_PseudoRandomScale");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, ActorLocation) == 0x000000, "Member 'Particle_Deco_C_PseudoRandomScale::ActorLocation' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, Param_ParticleScale) == 0x00000C, "Member 'Particle_Deco_C_PseudoRandomScale::Param_ParticleScale' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, RandomScale) == 0x000018, "Member 'Particle_Deco_C_PseudoRandomScale::RandomScale' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_VectorFloat_ReturnValue) == 0x000024, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000030, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_X) == 0x00003C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_Y) == 0x000040, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_Z) == 0x000044, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_X_1) == 0x000048, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_Y_1) == 0x00004C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_BreakVector_Z_1) == 0x000050, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_FCeil_ReturnValue) == 0x000054, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_FCeil_ReturnValue_1) == 0x000058, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000060, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000064, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000068, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000074, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000078, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00007C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_MaterialEditorSine_ReturnValue) == 0x000080, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_MaterialEditorSine_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000084, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000088, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_MaterialEditorSine_ReturnValue_1) == 0x00008C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_MaterialEditorSine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000090, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000094, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_MaterialEditorSine_ReturnValue_2) == 0x000098, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_MaterialEditorSine_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x00009C, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0000A0, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Fraction_ReturnValue) == 0x0000A4, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_NormalizeToRange_ReturnValue) == 0x0000AC, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000B0, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x0000B4, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x0000B8, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_FClamp_ReturnValue) == 0x0000BC, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_FClamp_ReturnValue_1) == 0x0000C0, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x0000C4, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_FClamp_ReturnValue_2) == 0x0000C8, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Particle_Deco_C_PseudoRandomScale, CallFunc_MakeVector_ReturnValue) == 0x0000CC, "Member 'Particle_Deco_C_PseudoRandomScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

