#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartySuggestionButton.PartySuggestionButton_C
// 0x0130 (0x0CD8 - 0x0BA8)
class UPartySuggestionButton_C final : public UFortPartySuggestionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RequestAccepted;                                   // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MouseHovered;                                      // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderOfDarkenedText;                              // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_ActionPrompt;                                   // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_SquiglyTail;                                     // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SparklyTraingles;                                  // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7800[0x7];                                     // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal;                             // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal_Tail;                        // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x0C18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         SS_0_Stiffness;                                    // 0x0C20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Damping;                                      // 0x0C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_0_Mass;                                         // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_NewVal;                         // 0x0C2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_ShapeChange_Target;                         // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_ShapeParam;                                    // 0x0C34(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7801[0x4];                                     // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_MainBorder_Normal;                               // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Normal_Tail;                          // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight;                            // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight_Tail;                       // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder;                               // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder_Tail;                          // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Border;                                    // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Tail;                                      // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_SparkleTraingles;                              // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_SparkleTriangles;                                // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_R_Param;                                 // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_InnerColorParam;                      // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_OuterColorParam;                      // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_L_Param;                                 // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_TriangleColor_A;                      // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x0CB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Spring_Scale_NewVal;                               // 0x0CC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spring_Scale_Target;                               // 0x0CC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_1_Mass;                                         // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_1_Damping;                                      // 0x0CCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SS_1_Stiffness;                                    // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpringInterpAnims;                             // 0x0CD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsInvited;                                         // 0x0CD5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNewSuggestionInQueue;                             // 0x0CD6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetupMIDReferences();
	void SetMainMIDs(class UMaterialInstanceDynamic* BorderMID, class UMaterialInstanceDynamic* TailMID, class UMaterialInstanceDynamic* SparklesMID);
	void InitPhysAnim();
	void InitMIDs();
	void HandleOutroAnimationFinished();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PlayIntro();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnDisplayInfoUpdated(bool bIsInvited, bool bIsPlaying);
	void OnSuggestionAccepted();
	void OnDismissSuggestion();
	void OnNewSuggestionAdded();
	void PlayOutro();
	void OnInitialized();
	void OnSuggestionChanged();
	void ExecuteUbergraph_PartySuggestionButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartySuggestionButton_C">();
	}
	static class UPartySuggestionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartySuggestionButton_C>();
	}
};
static_assert(alignof(UPartySuggestionButton_C) == 0x000008, "Wrong alignment on UPartySuggestionButton_C");
static_assert(sizeof(UPartySuggestionButton_C) == 0x000CD8, "Wrong size on UPartySuggestionButton_C");
static_assert(offsetof(UPartySuggestionButton_C, UberGraphFrame) == 0x000BA8, "Member 'UPartySuggestionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, RequestAccepted) == 0x000BB0, "Member 'UPartySuggestionButton_C::RequestAccepted' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MouseHovered) == 0x000BB8, "Member 'UPartySuggestionButton_C::MouseHovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Outro) == 0x000BC0, "Member 'UPartySuggestionButton_C::Outro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Hovered) == 0x000BC8, "Member 'UPartySuggestionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Intro) == 0x000BD0, "Member 'UPartySuggestionButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Border_0) == 0x000BD8, "Member 'UPartySuggestionButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, BorderOfDarkenedText) == 0x000BE0, "Member 'UPartySuggestionButton_C::BorderOfDarkenedText' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, HB_ActionPrompt) == 0x000BE8, "Member 'UPartySuggestionButton_C::HB_ActionPrompt' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, I_SquiglyTail) == 0x000BF0, "Member 'UPartySuggestionButton_C::I_SquiglyTail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SparklyTraingles) == 0x000BF8, "Member 'UPartySuggestionButton_C::SparklyTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bIsHovered) == 0x000C00, "Member 'UPartySuggestionButton_C::bIsHovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal) == 0x000C08, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal_Tail) == 0x000C10, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_ShapeChange) == 0x000C18, "Member 'UPartySuggestionButton_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Stiffness) == 0x000C20, "Member 'UPartySuggestionButton_C::SS_0_Stiffness' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Damping) == 0x000C24, "Member 'UPartySuggestionButton_C::SS_0_Damping' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Mass) == 0x000C28, "Member 'UPartySuggestionButton_C::SS_0_Mass' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_NewVal) == 0x000C2C, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_NewVal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_Target) == 0x000C30, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_ShapeParam) == 0x000C34, "Member 'UPartySuggestionButton_C::MID_ShapeParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal) == 0x000C40, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal_Tail) == 0x000C48, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight) == 0x000C50, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight_Tail) == 0x000C58, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder) == 0x000C60, "Member 'UPartySuggestionButton_C::MID_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder_Tail) == 0x000C68, "Member 'UPartySuggestionButton_C::MID_HighlightBorder_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Border) == 0x000C70, "Member 'UPartySuggestionButton_C::MID_Cur_Border' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Tail) == 0x000C78, "Member 'UPartySuggestionButton_C::MID_Cur_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_SparkleTraingles) == 0x000C80, "Member 'UPartySuggestionButton_C::MID_SparkleTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_SparkleTriangles) == 0x000C88, "Member 'UPartySuggestionButton_C::M_SparkleTriangles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_R_Param) == 0x000C90, "Member 'UPartySuggestionButton_C::MID_Color_R_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_InnerColorParam) == 0x000C98, "Member 'UPartySuggestionButton_C::MID_Sparkles_InnerColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_OuterColorParam) == 0x000CA0, "Member 'UPartySuggestionButton_C::MID_Sparkles_OuterColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_L_Param) == 0x000CA8, "Member 'UPartySuggestionButton_C::MID_Color_L_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_TriangleColor_A) == 0x000CB0, "Member 'UPartySuggestionButton_C::MID_Sparkles_TriangleColor_A' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_Scale) == 0x000CB8, "Member 'UPartySuggestionButton_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_Scale_NewVal) == 0x000CC0, "Member 'UPartySuggestionButton_C::Spring_Scale_NewVal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_Scale_Target) == 0x000CC4, "Member 'UPartySuggestionButton_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_1_Mass) == 0x000CC8, "Member 'UPartySuggestionButton_C::SS_1_Mass' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_1_Damping) == 0x000CCC, "Member 'UPartySuggestionButton_C::SS_1_Damping' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_1_Stiffness) == 0x000CD0, "Member 'UPartySuggestionButton_C::SS_1_Stiffness' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bUseSpringInterpAnims) == 0x000CD4, "Member 'UPartySuggestionButton_C::bUseSpringInterpAnims' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, IsInvited) == 0x000CD5, "Member 'UPartySuggestionButton_C::IsInvited' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bNewSuggestionInQueue) == 0x000CD6, "Member 'UPartySuggestionButton_C::bNewSuggestionInQueue' has a wrong offset!");

}

