#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassengerImpulseWeaponComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PassengerImpulseWeaponComponent.PassengerImpulseWeaponComponent_C
// 0x0068 (0x0118 - 0x00B0)
class UPassengerImpulseWeaponComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UClass*>                         ImpluseWeaponClasses;                              // 0x00B8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PassengerPawn;                                     // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ImpulsePower;                                      // 0x00D0(0x0020)(Edit, BlueprintVisible)
	struct FVector                                ImpulseVector;                                     // 0x00F0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8423[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPassengerFiredImpulseWeapon;                     // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AFortWeaponRanged*                      ImpulseWeapon;                                     // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPassengerFiredImpulseWeapon__DelegateSignature();
	void ExecuteUbergraph_PassengerImpulseWeaponComponent(int32 EntryPoint);
	void ApplyImpulse();
	void OnImpluseWeaponProjectileSpawned();
	void OnPassengerWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PreviousWeapon);
	void IsAnImpulseWeapon(class AFortWeapon* Weapon, bool* bReturnValue, class AFortWeaponRanged** Param_ImpulseWeapon);
	void SetPassengerPawn(class AFortPlayerPawn* NewPassengerPawn);
	void CalculateImpulse(struct FVector* Impulse);
	void OnRep_ImpulseVector();
	void SetImpulseWeapon(class AFortWeaponRanged* NewImpulseWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassengerImpulseWeaponComponent_C">();
	}
	static class UPassengerImpulseWeaponComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassengerImpulseWeaponComponent_C>();
	}
};
static_assert(alignof(UPassengerImpulseWeaponComponent_C) == 0x000008, "Wrong alignment on UPassengerImpulseWeaponComponent_C");
static_assert(sizeof(UPassengerImpulseWeaponComponent_C) == 0x000118, "Wrong size on UPassengerImpulseWeaponComponent_C");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UPassengerImpulseWeaponComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, ImpluseWeaponClasses) == 0x0000B8, "Member 'UPassengerImpulseWeaponComponent_C::ImpluseWeaponClasses' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, PassengerPawn) == 0x0000C8, "Member 'UPassengerImpulseWeaponComponent_C::PassengerPawn' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, ImpulsePower) == 0x0000D0, "Member 'UPassengerImpulseWeaponComponent_C::ImpulsePower' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, ImpulseVector) == 0x0000F0, "Member 'UPassengerImpulseWeaponComponent_C::ImpulseVector' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, OnPassengerFiredImpulseWeapon) == 0x000100, "Member 'UPassengerImpulseWeaponComponent_C::OnPassengerFiredImpulseWeapon' has a wrong offset!");
static_assert(offsetof(UPassengerImpulseWeaponComponent_C, ImpulseWeapon) == 0x000110, "Member 'UPassengerImpulseWeaponComponent_C::ImpulseWeapon' has a wrong offset!");

}

