#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PendingAccountMergeNotification

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PendingAccountMergeNotification.PendingAccountMergeNotification_C
// 0x0030 (0x0BA0 - 0x0B70)
class UPendingAccountMergeNotification_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_48;                             // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_42;                                      // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_45;                                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Hovered(bool Param_IsHovered);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnClicked();
	void Destruct();
	void OnInputChanged(ECommonInputType bNewInputType);
	void ExecuteUbergraph_PendingAccountMergeNotification(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PendingAccountMergeNotification_C">();
	}
	static class UPendingAccountMergeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPendingAccountMergeNotification_C>();
	}
};
static_assert(alignof(UPendingAccountMergeNotification_C) == 0x000008, "Wrong alignment on UPendingAccountMergeNotification_C");
static_assert(sizeof(UPendingAccountMergeNotification_C) == 0x000BA0, "Wrong size on UPendingAccountMergeNotification_C");
static_assert(offsetof(UPendingAccountMergeNotification_C, UberGraphFrame) == 0x000B70, "Member 'UPendingAccountMergeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Hover) == 0x000B78, "Member 'UPendingAccountMergeNotification_C::Hover' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Border_1) == 0x000B80, "Member 'UPendingAccountMergeNotification_C::Border_1' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, CommonActionWidget_48) == 0x000B88, "Member 'UPendingAccountMergeNotification_C::CommonActionWidget_48' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_42) == 0x000B90, "Member 'UPendingAccountMergeNotification_C::TextBlock_42' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_45) == 0x000B98, "Member 'UPendingAccountMergeNotification_C::TextBlock_45' has a wrong offset!");

}

