#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsBall_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PhysicsBall_Master.PhysicsBall_Master_C.ExecuteUbergraph_PhysicsBall_Master
// 0x0498 (0x0498 - 0x0000)
struct PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& ImpactResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             K2Node_CustomEvent_ImpactResult;                   // 0x0014(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A41[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00E0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A42[0x2];                                     // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A43[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStart;                               // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A44[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A45[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCollision_OutResult_1;                  // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A46[0x2];                                     // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude_1;               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A47[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A48[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue_1;      // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A49[0x2];                                     // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVelocityUnderSimulationThreshold_ReturnValue; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInterpolationComplete_ReturnValue;      // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x026E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x026F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A4A[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0290(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6A4B[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A4C[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APhysicsBall_Master_C*                  K2Node_DynamicCast_AsPhysics_Ball_Master;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A4D[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_2;                // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4E[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_TouchingPawn;                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A4F[0x2];                                     // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_CustomEvent_WaterBody;                      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_CustomEvent_WaterInteractionComponent;      // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsFirstBody;                   // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A50[0x3];                                     // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0384(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A51[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A52[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A53[0x3];                                     // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x040C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master");
static_assert(sizeof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master) == 0x000498, "Wrong size on PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, EntryPoint) == 0x000000, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CustomEvent_ImpactResult) == 0x000014, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CustomEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_MyComp) == 0x0000A0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_Other) == 0x0000A8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_OtherComp) == 0x0000B0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_bSelfMoved) == 0x0000B8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_HitLocation) == 0x0000BC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_HitNormal) == 0x0000C8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_NormalImpulse) == 0x0000D4, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_Hit) == 0x0000E0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_bBlockingHit) == 0x00016C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_bInitialOverlap) == 0x00016D, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_Time) == 0x000170, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_Distance) == 0x000174, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_ImpactPoint) == 0x000184, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_ImpactNormal) == 0x00019C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_HitItem) == 0x0001C8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_FaceIndex) == 0x0001CC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_TraceStart) == 0x0001D0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BreakHitResult_TraceEnd) == 0x0001DC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_VSize_ReturnValue) == 0x0001E8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001EC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001F8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_OnCollision_OutResult) == 0x000204, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_OnCollision_OutMagnitude) == 0x000208, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_bStart) == 0x00020C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_bStart' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_SelectFloat_ReturnValue) == 0x000210, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000214, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_Not_PreBool_ReturnValue) == 0x000218, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00021C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_HasAuthority_ReturnValue) == 0x000228, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_OnCollision_OutResult_1) == 0x000229, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_OnCollision_OutResult_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_OnCollision_OutMagnitude_1) == 0x00022C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_OnCollision_OutMagnitude_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BooleanOR_ReturnValue) == 0x000230, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetVelocity_ReturnValue) == 0x000234, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000240, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsDedicatedServer_ReturnValue) == 0x000241, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000244, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetVelocity_ReturnValue_1) == 0x000250, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_NotEqual_VectorVector_ReturnValue_1) == 0x00025C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_NotEqual_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00025D, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000260, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsVelocityUnderSimulationThreshold_ReturnValue) == 0x00026C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsVelocityUnderSimulationThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsInterpolationComplete_ReturnValue) == 0x00026D, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsInterpolationComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00026E, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_BooleanAND_ReturnValue) == 0x00026F, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000270, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x000278, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x000280, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000288, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_bFromSweep) == 0x00028C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_SweepResult) == 0x000290, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_AsPawn) == 0x000320, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_bSuccess) == 0x000328, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_AsPhysics_Ball_Master) == 0x000330, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_AsPhysics_Ball_Master' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00033C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetVelocity_ReturnValue_2) == 0x000348, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetVelocity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CustomEvent_TouchingPawn) == 0x000358, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CustomEvent_TouchingPawn' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_AsFort_Pawn) == 0x000360, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_DynamicCast_bSuccess_2) == 0x000368, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000369, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_Event_DeltaSeconds) == 0x00036C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CustomEvent_WaterBody) == 0x000370, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CustomEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CustomEvent_WaterInteractionComponent) == 0x000378, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CustomEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CustomEvent_bIsFirstBody) == 0x000380, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CustomEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000384, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation) == 0x000394, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal) == 0x0003A0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition) == 0x0003AC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterDepth) == 0x0003B8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx) == 0x0003BC, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_GetLastWaterSurfaceInfo_WaterVelocity) == 0x0003C0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_GetLastWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0003D0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0003D8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_WaterBody) == 0x0003E0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0003E8, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0003F0, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0003F4, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000400, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master, CallFunc_MakeHitResult_ReturnValue) == 0x00040C, "Member 'PhysicsBall_Master_C_ExecuteUbergraph_PhysicsBall_Master::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature, Param_WaterInteractionComponent) == 0x000008, "Member 'PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'PhysicsBall_Master_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.Water Collision
// 0x0018 (0x0018 - 0x0000)
struct PhysicsBall_Master_C_Water_Collision final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhysicsBall_Master_C_Water_Collision) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_Water_Collision");
static_assert(sizeof(PhysicsBall_Master_C_Water_Collision) == 0x000018, "Wrong size on PhysicsBall_Master_C_Water_Collision");
static_assert(offsetof(PhysicsBall_Master_C_Water_Collision, WaterBody) == 0x000000, "Member 'PhysicsBall_Master_C_Water_Collision::WaterBody' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_Water_Collision, Param_WaterInteractionComponent) == 0x000008, "Member 'PhysicsBall_Master_C_Water_Collision::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_Water_Collision, bIsFirstBody) == 0x000010, "Member 'PhysicsBall_Master_C_Water_Collision::bIsFirstBody' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.OnPawnTouchedMe
// 0x0008 (0x0008 - 0x0000)
struct PhysicsBall_Master_C_OnPawnTouchedMe final
{
public:
	class APawn*                                  TouchingPawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhysicsBall_Master_C_OnPawnTouchedMe) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_OnPawnTouchedMe");
static_assert(sizeof(PhysicsBall_Master_C_OnPawnTouchedMe) == 0x000008, "Wrong size on PhysicsBall_Master_C_OnPawnTouchedMe");
static_assert(offsetof(PhysicsBall_Master_C_OnPawnTouchedMe, TouchingPawn) == 0x000000, "Member 'PhysicsBall_Master_C_OnPawnTouchedMe::TouchingPawn' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A54[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PhysicsBall_Master_C_BndEvt__SphereCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.OnReplicatedVelocityStartOrStop
// 0x0001 (0x0001 - 0x0000)
struct PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop) == 0x000001, "Wrong alignment on PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop");
static_assert(sizeof(PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop) == 0x000001, "Wrong size on PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop");
static_assert(offsetof(PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop, bStart) == 0x000000, "Member 'PhysicsBall_Master_C_OnReplicatedVelocityStartOrStop::bStart' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct PhysicsBall_Master_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A55[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PhysicsBall_Master_C_ReceiveHit) == 0x000008, "Wrong alignment on PhysicsBall_Master_C_ReceiveHit");
static_assert(sizeof(PhysicsBall_Master_C_ReceiveHit) == 0x0000D0, "Wrong size on PhysicsBall_Master_C_ReceiveHit");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, MyComp) == 0x000000, "Member 'PhysicsBall_Master_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, Other) == 0x000008, "Member 'PhysicsBall_Master_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, OtherComp) == 0x000010, "Member 'PhysicsBall_Master_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'PhysicsBall_Master_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'PhysicsBall_Master_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, HitNormal) == 0x000028, "Member 'PhysicsBall_Master_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'PhysicsBall_Master_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveHit, Hit) == 0x000040, "Member 'PhysicsBall_Master_C_ReceiveHit::Hit' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.ProjectileStop
// 0x008C (0x008C - 0x0000)
struct PhysicsBall_Master_C_ProjectileStop final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PhysicsBall_Master_C_ProjectileStop) == 0x000004, "Wrong alignment on PhysicsBall_Master_C_ProjectileStop");
static_assert(sizeof(PhysicsBall_Master_C_ProjectileStop) == 0x00008C, "Wrong size on PhysicsBall_Master_C_ProjectileStop");
static_assert(offsetof(PhysicsBall_Master_C_ProjectileStop, ImpactResult) == 0x000000, "Member 'PhysicsBall_Master_C_ProjectileStop::ImpactResult' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PhysicsBall_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhysicsBall_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on PhysicsBall_Master_C_ReceiveTick");
static_assert(sizeof(PhysicsBall_Master_C_ReceiveTick) == 0x000004, "Wrong size on PhysicsBall_Master_C_ReceiveTick");
static_assert(offsetof(PhysicsBall_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PhysicsBall_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.UpdateDirectionAndRotationRate
// 0x0004 (0x0004 - 0x0000)
struct PhysicsBall_Master_C_UpdateDirectionAndRotationRate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhysicsBall_Master_C_UpdateDirectionAndRotationRate) == 0x000004, "Wrong alignment on PhysicsBall_Master_C_UpdateDirectionAndRotationRate");
static_assert(sizeof(PhysicsBall_Master_C_UpdateDirectionAndRotationRate) == 0x000004, "Wrong size on PhysicsBall_Master_C_UpdateDirectionAndRotationRate");
static_assert(offsetof(PhysicsBall_Master_C_UpdateDirectionAndRotationRate, DeltaSeconds) == 0x000000, "Member 'PhysicsBall_Master_C_UpdateDirectionAndRotationRate::DeltaSeconds' has a wrong offset!");

// Function PhysicsBall_Master.PhysicsBall_Master_C.ApplyImpulseToBall
// 0x00C4 (0x00C4 - 0x0000)
struct PhysicsBall_Master_C_ApplyImpulseToBall final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
