#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup_Truck_Veh_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pickup_Truck_Veh_AnimBP.Pickup_Truck_Veh_AnimBP_C
// 0x0AE0 (0x0E80 - 0x03A0)
class UPickup_Truck_Veh_AnimBP_C final : public UFortGoatVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x03F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0500(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0608(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0710(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0818(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0920(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A28(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C38(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D40(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E48(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0E68(0x0018)()

public:
	void ExecuteUbergraph_Pickup_Truck_Veh_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickup_Truck_Veh_AnimBP_C">();
	}
	static class UPickup_Truck_Veh_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickup_Truck_Veh_AnimBP_C>();
	}
};
static_assert(alignof(UPickup_Truck_Veh_AnimBP_C) == 0x000010, "Wrong alignment on UPickup_Truck_Veh_AnimBP_C");
static_assert(sizeof(UPickup_Truck_Veh_AnimBP_C) == 0x000E80, "Wrong size on UPickup_Truck_Veh_AnimBP_C");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, UberGraphFrame) == 0x0003A0, "Member 'UPickup_Truck_Veh_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_Root) == 0x0003A8, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003D8, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x0003F8, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x000500, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x000608, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000710, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000818, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000920, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000A28, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000B30, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000C38, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000D40, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000E48, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPickup_Truck_Veh_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x000E68, "Member 'UPickup_Truck_Veh_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

