#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_FlareGun_Sk_animBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pistol_FlareGun_Sk_animBP.Pistol_FlareGun_Sk_animBP_C
// 0x00A0 (0x0310 - 0x0270)
class UPistol_FlareGun_Sk_animBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5470[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x02A8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02C0(0x0048)()

public:
	void ExecuteUbergraph_Pistol_FlareGun_Sk_animBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pistol_FlareGun_Sk_animBP_C">();
	}
	static class UPistol_FlareGun_Sk_animBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPistol_FlareGun_Sk_animBP_C>();
	}
};
static_assert(alignof(UPistol_FlareGun_Sk_animBP_C) == 0x000010, "Wrong alignment on UPistol_FlareGun_Sk_animBP_C");
static_assert(sizeof(UPistol_FlareGun_Sk_animBP_C) == 0x000310, "Wrong size on UPistol_FlareGun_Sk_animBP_C");
static_assert(offsetof(UPistol_FlareGun_Sk_animBP_C, UberGraphFrame) == 0x000270, "Member 'UPistol_FlareGun_Sk_animBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPistol_FlareGun_Sk_animBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UPistol_FlareGun_Sk_animBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPistol_FlareGun_Sk_animBP_C, AnimGraphNode_LocalRefPose) == 0x0002A8, "Member 'UPistol_FlareGun_Sk_animBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UPistol_FlareGun_Sk_animBP_C, AnimGraphNode_Slot) == 0x0002C0, "Member 'UPistol_FlareGun_Sk_animBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

