#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerSurveyPanel.PlayerSurveyPanel_C.ExecuteUbergraph_PlayerSurveyPanel
// 0x0038 (0x0038 - 0x0000)
struct PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6450[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6451[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel) == 0x000008, "Wrong alignment on PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel");
static_assert(sizeof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel) == 0x000038, "Wrong size on PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, EntryPoint) == 0x000000, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, Temp_bool_Variable) == 0x000004, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, Temp_float_Variable) == 0x000018, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, Temp_float_Variable_1) == 0x00001C, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, CallFunc_IsMobilePlatform_ReturnValue) == 0x000030, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel, K2Node_Select_Default) == 0x000034, "Member 'PlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel::K2Node_Select_Default' has a wrong offset!");

}

