#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerMultipleChoiceWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget
// 0x0028 (0x0028 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentAnswer_bOutIsSet;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerSurveyAnswerMultipleChoice  CallFunc_GetCurrentAnswer_OutAnswer;               // 0x0008(0x0010)(NoDestructor)
	struct FFortPlayerSurveyAnswerContainerChangeEventInfo K2Node_Event_EventInfo;                            // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642F[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_ButtonIndex_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ButtonIndex;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget) == 0x000028, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, EntryPoint) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, CallFunc_GetCurrentAnswer_bOutIsSet) == 0x000004, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::CallFunc_GetCurrentAnswer_bOutIsSet' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, CallFunc_GetCurrentAnswer_OutAnswer) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::CallFunc_GetCurrentAnswer_OutAnswer' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, K2Node_Event_EventInfo) == 0x000018, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::K2Node_Event_EventInfo' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, K2Node_Event_ButtonIndex_1) == 0x00001C, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::K2Node_Event_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget, K2Node_Event_ButtonIndex) == 0x000020, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget::K2Node_Event_ButtonIndex' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.HandleButtonFocused
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused) == 0x000004, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused) == 0x000004, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused, ButtonIndex) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonFocused::ButtonIndex' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.HandleButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked) == 0x000004, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked) == 0x000004, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked, ButtonIndex) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleButtonClicked::ButtonIndex' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.HandleAnswerChanged
// 0x0001 (0x0001 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged final
{
public:
	struct FFortPlayerSurveyAnswerContainerChangeEventInfo EventInfo;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged) == 0x000001, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged) == 0x000001, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged, EventInfo) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandleAnswerChanged::EventInfo' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.HandlePlayerRequestAnswer
// 0x0020 (0x0020 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer final
{
public:
	int32                                         AnswerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6430[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetStopwatchTime_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFortPlayerSurveyAnswerMultipleChoice  K2Node_MakeStruct_FortPlayerSurveyAnswerMultipleChoice; // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer) == 0x000020, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer, AnswerIndex) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer::AnswerIndex' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer, CallFunc_GetStopwatchTime_ReturnValue) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer::CallFunc_GetStopwatchTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer, K2Node_MakeStruct_FortPlayerSurveyAnswerMultipleChoice) == 0x000010, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_HandlePlayerRequestAnswer::K2Node_MakeStruct_FortPlayerSurveyAnswerMultipleChoice' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.UpdateEntryBoxContents
// 0x0088 (0x0088 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents final
{
public:
	class UWidget*                                ChoiceWidget;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerSurveyQuestionMultipleChoice* CurrentQuestion;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6431[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerSurveyMultipleChoiceListItemWidgetInterface_C> K2Node_DynamicCast_AsPlayer_Survey_Multiple_Choice_List_Item_Widget_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6432[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_DynamicCast_AsCommon_Button;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6433[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6434[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerSurveyQuestionChoice        CallFunc_Array_Get_Item;                           // 0x0050(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6435[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6436[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerSurveyQuestionMultipleChoice* CallFunc_GetCurrentQuestion_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents) == 0x000088, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, ChoiceWidget) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::ChoiceWidget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CurrentQuestion) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CurrentQuestion' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, K2Node_DynamicCast_AsPlayer_Survey_Multiple_Choice_List_Item_Widget_Interface) == 0x000018, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::K2Node_DynamicCast_AsPlayer_Survey_Multiple_Choice_List_Item_Widget_Interface' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, K2Node_DynamicCast_AsCommon_Button) == 0x000030, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::K2Node_DynamicCast_AsCommon_Button' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Array_Get_Item) == 0x000050, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_GetCurrentQuestion_ReturnValue) == 0x000078, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_GetCurrentQuestion_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents, CallFunc_BP_CreateEntry_ReturnValue) == 0x000080, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_UpdateEntryBoxContents::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.ScrollSelectedItemIntoView
// 0x0030 (0x0030 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView final
{
public:
	bool                                          FallBackToDefault;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AnimateScroll;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideScrollDestination;                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6437[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                WidgetToFocus;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                DefaultFocusedWidget;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDescendantScrollDestination                  Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDescendantScrollDestination                  K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6438[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDefaultFocusedWidget_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDefaultFocusedWidgetPostDummy_Widget;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView) == 0x000030, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, FallBackToDefault) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::FallBackToDefault' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, AnimateScroll) == 0x000001, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::AnimateScroll' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, OverrideScrollDestination) == 0x000002, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::OverrideScrollDestination' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, WidgetToFocus) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::WidgetToFocus' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, DefaultFocusedWidget) == 0x000010, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::DefaultFocusedWidget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, Temp_byte_Variable) == 0x000018, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, Temp_bool_Variable) == 0x00001A, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, CallFunc_IsValid_ReturnValue_1) == 0x00001B, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, K2Node_Select_Default) == 0x00001C, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00001D, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, CallFunc_GetDefaultFocusedWidget_ReturnValue) == 0x000020, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::CallFunc_GetDefaultFocusedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView, CallFunc_GetDefaultFocusedWidgetPostDummy_Widget) == 0x000028, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_ScrollSelectedItemIntoView::CallFunc_GetDefaultFocusedWidgetPostDummy_Widget' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.GetDefaultFocusedWidget
// 0x0038 (0x0038 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6439[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                TargetWidget;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentAnswer_bOutIsSet;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643A[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerSurveyAnswerMultipleChoice  CallFunc_GetCurrentAnswer_OutAnswer;               // 0x0020(0x0010)(NoDestructor)
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget) == 0x000038, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, ReturnValue) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, DefaultIndex) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::DefaultIndex' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, TargetWidget) == 0x000010, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::TargetWidget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, SelectedIndex) == 0x000018, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::SelectedIndex' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, CallFunc_GetCurrentAnswer_bOutIsSet) == 0x00001E, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::CallFunc_GetCurrentAnswer_bOutIsSet' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, CallFunc_GetCurrentAnswer_OutAnswer) == 0x000020, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::CallFunc_GetCurrentAnswer_OutAnswer' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000030, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidget::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.GetSubtitleText
// 0x0018 (0x0018 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText) == 0x000018, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText, ReturnValue) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetSubtitleText::ReturnValue' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.GetDefaultFocusedWidgetPostDummy
// 0x0038 (0x0038 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDefaultInitialChoiceIndex_Index;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643C[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy) == 0x000008, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy) == 0x000038, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, Param_Navigation) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::Param_Navigation' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, Widget) == 0x000008, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::Widget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, Param_Index) == 0x000010, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::Param_Index' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, CallFunc_GetDefaultInitialChoiceIndex_Index) == 0x000014, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::CallFunc_GetDefaultInitialChoiceIndex_Index' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, CallFunc_GetAllEntries_ReturnValue) == 0x000018, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy, CallFunc_Array_Get_Item) == 0x000030, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultFocusedWidgetPostDummy::CallFunc_Array_Get_Item' has a wrong offset!");

// Function PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C.GetDefaultInitialChoiceIndex
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex) == 0x000004, "Wrong alignment on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex");
static_assert(sizeof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex) == 0x000004, "Wrong size on PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex");
static_assert(offsetof(PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex, Param_Index) == 0x000000, "Member 'PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C_GetDefaultInitialChoiceIndex::Param_Index' has a wrong offset!");

}

