#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyMultipleChoiceStandardListItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem
// 0x0028 (0x0028 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerSurveyQuestionChoice        K2Node_Event_Value_1;                              // 0x0008(0x0018)()
	int32                                         K2Node_Event_Value;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem) == 0x000008, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem) == 0x000028, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem, EntryPoint) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem, K2Node_Event_Value_1) == 0x000008, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem, K2Node_Event_Value) == 0x000020, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem::K2Node_Event_Value' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.SetIndex
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex) == 0x000004, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex) == 0x000004, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex, Value) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_SetIndex::Value' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.SetChoiceData
// 0x0018 (0x0018 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData final
{
public:
	struct FFortPlayerSurveyQuestionChoice        Value;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData) == 0x000008, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData) == 0x000018, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData, Value) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_SetChoiceData::Value' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.UpdateChoiceIndexText
// 0x0018 (0x0018 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText final
{
public:
	class FText                                   CallFunc_MakeChoiceIndexText_Text;                 // 0x0000(0x0018)()
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText) == 0x000008, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText) == 0x000018, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText, CallFunc_MakeChoiceIndexText_Text) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_UpdateChoiceIndexText::CallFunc_MakeChoiceIndexText_Text' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.UpdateCheckBox
// 0x0001 (0x0001 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox final
{
public:
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox) == 0x000001, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox) == 0x000001, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox, CallFunc_GetSelected_ReturnValue) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_UpdateCheckBox::CallFunc_GetSelected_ReturnValue' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.UpdateTextStyle
// 0x0020 (0x0020 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle final
{
public:
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle) == 0x000008, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle) == 0x000020, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle, CallFunc_GetCurrentTextStyle_ReturnValue) == 0x000008, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle::CallFunc_GetCurrentTextStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle, CallFunc_GetColor_OutColor) == 0x000010, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_UpdateTextStyle::CallFunc_GetColor_OutColor' has a wrong offset!");

// Function PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C.MakeChoiceIndexText
// 0x0090 (0x0090 - 0x0000)
struct PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63AD[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText) == 0x000008, "Wrong alignment on PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText");
static_assert(sizeof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText) == 0x000090, "Wrong size on PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, Param_Index) == 0x000000, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::Param_Index' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, Text) == 0x000008, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::Text' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, K2Node_MakeArray_Array) == 0x000068, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText, CallFunc_Format_ReturnValue) == 0x000078, "Member 'PlayerSurveyMultipleChoiceStandardListItem_C_MakeChoiceIndexText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

