#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Athena_Generic_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C.ShootingTargetReactToJump__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature final
{
public:
	class AFortPlayerPawnAthena*                  JumpingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature) == 0x000008, "Wrong alignment on PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature");
static_assert(sizeof(PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature) == 0x000008, "Wrong size on PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature, JumpingPlayer) == 0x000000, "Member 'PlayerPawn_Athena_Generic_Parent_C_ShootingTargetReactToJump__DelegateSignature::JumpingPlayer' has a wrong offset!");

// Function PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C.OnPlayHit__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x001C(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature) == 0x000008, "Wrong alignment on PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature");
static_assert(sizeof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature) == 0x0000A8, "Wrong size on PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature, SelfActor) == 0x000000, "Member 'PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature::SelfActor' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature, OtherActor) == 0x000008, "Member 'PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature, NormalImpulse) == 0x000010, "Member 'PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature, Hit) == 0x00001C, "Member 'PlayerPawn_Athena_Generic_Parent_C_OnPlayHit__DelegateSignature::Hit' has a wrong offset!");

// Function PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C.ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent
// 0x0070 (0x0070 - 0x0000)
struct PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563F[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5640[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5641[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HalfHeightAdjust_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent) == 0x000010, "Wrong alignment on PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent");
static_assert(sizeof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent) == 0x000070, "Wrong size on PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, EntryPoint) == 0x000000, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, Temp_struct_Variable) == 0x000010, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000040, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, K2Node_Event_HalfHeightAdjust_1) == 0x000054, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::K2Node_Event_HalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, K2Node_Event_ScaledHalfHeightAdjust_1) == 0x000058, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::K2Node_Event_ScaledHalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, K2Node_Event_HalfHeightAdjust) == 0x00005C, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::K2Node_Event_HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent, K2Node_Event_ScaledHalfHeightAdjust) == 0x000060, "Member 'PlayerPawn_Athena_Generic_Parent_C_ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent::K2Node_Event_ScaledHalfHeightAdjust' has a wrong offset!");

// Function PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C.K2_OnEndCrouch
// 0x0008 (0x0008 - 0x0000)
struct PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch final
{
public:
	float                                         HalfHeightAdjust;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledHalfHeightAdjust;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch) == 0x000004, "Wrong alignment on PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch");
static_assert(sizeof(PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch) == 0x000008, "Wrong size on PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch, HalfHeightAdjust) == 0x000000, "Member 'PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch::HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch, ScaledHalfHeightAdjust) == 0x000004, "Member 'PlayerPawn_Athena_Generic_Parent_C_K2_OnEndCrouch::ScaledHalfHeightAdjust' has a wrong offset!");

// Function PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C.K2_OnStartCrouch
// 0x0008 (0x0008 - 0x0000)
struct PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch final
{
public:
	float                                         HalfHeightAdjust;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledHalfHeightAdjust;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch) == 0x000004, "Wrong alignment on PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch");
static_assert(sizeof(PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch) == 0x000008, "Wrong size on PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch, HalfHeightAdjust) == 0x000000, "Member 'PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch::HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch, ScaledHalfHeightAdjust) == 0x000004, "Member 'PlayerPawn_Athena_Generic_Parent_C_K2_OnStartCrouch::ScaledHalfHeightAdjust' has a wrong offset!");

}

