#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerMultipleSelectionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerMultipleSelectionWidget.PlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C
// 0x00F8 (0x0428 - 0x0330)
class UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C final : public UFortPlayerSurveyButtonListMultipleSelectionAnswerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    Action_ActionDisplay;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       ChoicesEntryBox;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           ChoicesScrollBox;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DummyButton;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SelectionCountTextBlock;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionDisplay;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  ChoiceButtons;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text_Subtitle;                                     // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_NoLimit;                       // 0x0390(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_MinLimit;                      // 0x03A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_MaxLimit;                      // 0x03C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SelectionCountStyle_Valid;                         // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelectionCountStyle_Invalid;                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_ActionDisplay_ToggleOff;                      // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_ActionDisplay_ToggleOn;                       // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 ActionDisplayStyle_CannotToggle;                   // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ActionDisplayStyle_CanToggle;                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleSelectionWidget(int32 EntryPoint);
	void HandleFocusChanged();
	void HandleButtonClicked(int32 ButtonIndex);
	void HandleQuestionChanged();
	void HandleAnswerChanged(const struct FFortPlayerSurveyAnswerContainerChangeEventInfo& EventInfo);
	void HandleCommitCurrentAnswer();
	void Construct();
	void HandlePlayerRequestAnswer(TArray<struct FFortPlayerSurveyAnswerMultipleSelectionSingleAnswer>& AnswerChoices);
	void UpdateEntryBoxContents();
	void ScrollSelectedItemIntoView(bool FallBackToDefault, bool AnimateScroll, bool OverrideScrollDestination);
	void HandlePlayerRequestToggleChoice(int32 Param_Index);
	void UpdateSelectionCountText();
	void UpdateValidDisplay();
	void UpdateQuestionAnswerDisplay();
	void UpdateActionDisplay();

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;
	void GetDefaultFocusedWidgetPostDummy(EUINavigation Param_Navigation, class UWidget** Widget) const;
	void GetDefaultInitialChoiceIndex(int32* Param_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C">();
	}
	static class UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C");
static_assert(sizeof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C) == 0x000428, "Wrong size on UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, UberGraphFrame) == 0x000330, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Action_ActionDisplay) == 0x000338, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Action_ActionDisplay' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoicesEntryBox) == 0x000340, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoicesEntryBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoicesScrollBox) == 0x000348, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoicesScrollBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, DummyButton) == 0x000350, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::DummyButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountTextBlock) == 0x000358, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay) == 0x000360, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoiceButtons) == 0x000368, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoiceButtons' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_Subtitle) == 0x000378, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_NoLimit) == 0x000390, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_NoLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_MinLimit) == 0x0003A8, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_MinLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_MaxLimit) == 0x0003C0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_MaxLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountStyle_Valid) == 0x0003D8, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountStyle_Valid' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountStyle_Invalid) == 0x0003E0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountStyle_Invalid' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay_ToggleOff) == 0x0003E8, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay_ToggleOff' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay_ToggleOn) == 0x000400, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay_ToggleOn' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ActionDisplayStyle_CannotToggle) == 0x000418, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ActionDisplayStyle_CannotToggle' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ActionDisplayStyle_CanToggle) == 0x000420, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ActionDisplayStyle_CanToggle' has a wrong offset!");

}

