#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerRatingWidget.PlayerSurveyPanelContentsAnswerRatingWidget_C
// 0x0060 (0x0398 - 0x0338)
class UPlayerSurveyPanelContentsAnswerRatingWidget_C final : public UFortSurveyNumericalChoiceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_1;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_2;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_3;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_4;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_5;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  RatingButtons;                                     // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text_Subtitle;                                     // 0x0380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerRatingWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void HandleCommitCurrentAnswer();
	void HandleButtonFocused(int32 ButtonIndex);
	void HandleButtonClicked(int32 ButtonIndex);
	void OnInitialized();
	class UWidget* GetDefaultFocusedWidgetPostDummy(EUINavigation Param_Navigation);

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContentsAnswerRatingWidget_C">();
	}
	static class UPlayerSurveyPanelContentsAnswerRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerRatingWidget_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContentsAnswerRatingWidget_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanelContentsAnswerRatingWidget_C");
static_assert(sizeof(UPlayerSurveyPanelContentsAnswerRatingWidget_C) == 0x000398, "Wrong size on UPlayerSurveyPanelContentsAnswerRatingWidget_C");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, UberGraphFrame) == 0x000338, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, CommonActionWidget_0) == 0x000340, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::CommonActionWidget_0' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_1) == 0x000348, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_1' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_2) == 0x000350, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_2' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_3) == 0x000358, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_3' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_4) == 0x000360, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_4' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_5) == 0x000368, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_5' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButtons) == 0x000370, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButtons' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, Text_Subtitle) == 0x000380, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::Text_Subtitle' has a wrong offset!");

}

