#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerDiscovered

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerDiscovered.PlayerDiscovered_C.ExecuteUbergraph_PlayerDiscovered
// 0x0138 (0x0138 - 0x0000)
struct PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_691D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0038(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0058(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691E[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0098(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LocalizedLocationName;                // 0x00C0(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsNamedLocation;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6920[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6921[0x1];                                     // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0118(0x001C)(NoDestructor)
};
static_assert(alignof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered) == 0x000008, "Wrong alignment on PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered");
static_assert(sizeof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered) == 0x000138, "Wrong size on PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, EntryPoint) == 0x000000, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CustomEvent_GameState) == 0x000028, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CustomEvent_Playlist) == 0x000030, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CustomEvent_PlaylistContextTags) == 0x000038, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_struct_Variable) == 0x000058, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_object_Variable) == 0x000078, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_object_Variable_1) == 0x000080, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000088, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000098, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_HasAnyTags_ReturnValue) == 0x0000B8, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Event_LocalizedLocationName) == 0x0000C0, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Event_LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Event_bIsNamedLocation) == 0x0000D8, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Event_bIsNamedLocation' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000D9, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_int_Variable) == 0x0000F8, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_int_Variable_1) == 0x0000FC, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000100, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_IsMobileGame_ReturnValue) == 0x000101, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, Temp_bool_Variable) == 0x000102, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_Select_Default) == 0x000104, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_BreakVector2D_X) == 0x000108, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_BreakVector2D_Y) == 0x00010C, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, CallFunc_MakeVector2D_ReturnValue) == 0x000110, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered, K2Node_MakeStruct_WidgetTransform) == 0x000118, "Member 'PlayerDiscovered_C_ExecuteUbergraph_PlayerDiscovered::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function PlayerDiscovered.PlayerDiscovered_C.OnNewDiscovery
// 0x0020 (0x0020 - 0x0000)
struct PlayerDiscovered_C_OnNewDiscovery final
{
public:
	class FText                                   LocalizedLocationName;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsNamedLocation;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerDiscovered_C_OnNewDiscovery) == 0x000008, "Wrong alignment on PlayerDiscovered_C_OnNewDiscovery");
static_assert(sizeof(PlayerDiscovered_C_OnNewDiscovery) == 0x000020, "Wrong size on PlayerDiscovered_C_OnNewDiscovery");
static_assert(offsetof(PlayerDiscovered_C_OnNewDiscovery, LocalizedLocationName) == 0x000000, "Member 'PlayerDiscovered_C_OnNewDiscovery::LocalizedLocationName' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_OnNewDiscovery, bIsNamedLocation) == 0x000018, "Member 'PlayerDiscovered_C_OnNewDiscovery::bIsNamedLocation' has a wrong offset!");

// Function PlayerDiscovered.PlayerDiscovered_C.OnReady_B498D6844B33E66A7C160F972A87F88A
// 0x0030 (0x0030 - 0x0000)
struct PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A) == 0x000008, "Wrong alignment on PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A");
static_assert(sizeof(PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A) == 0x000030, "Wrong size on PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A");
static_assert(offsetof(PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A, GameState) == 0x000000, "Member 'PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A::GameState' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A, Playlist) == 0x000008, "Member 'PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A::Playlist' has a wrong offset!");
static_assert(offsetof(PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A, PlaylistContextTags) == 0x000010, "Member 'PlayerDiscovered_C_OnReady_B498D6844B33E66A7C160F972A87F88A::PlaylistContextTags' has a wrong offset!");

}

