#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerMultipleChoiceWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerMultipleChoiceWidget.PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C
// 0x0048 (0x0368 - 0x0320)
class UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C final : public UFortPlayerSurveyButtonGroupMultipleChoiceAnswerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicEntryBox*                       ChoicesEntryBox;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           ChoicesScrollBox;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DummyButton;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  ChoiceButtons;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text_Subtitle;                                     // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleChoiceWidget(int32 EntryPoint);
	void HandleButtonFocused(int32 ButtonIndex);
	void HandleButtonClicked(int32 ButtonIndex);
	void HandleQuestionChanged();
	void HandleAnswerChanged(const struct FFortPlayerSurveyAnswerContainerChangeEventInfo& EventInfo);
	void HandleCommitCurrentAnswer();
	void Construct();
	void HandlePlayerRequestAnswer(int32 AnswerIndex);
	void UpdateEntryBoxContents();
	void ScrollSelectedItemIntoView(bool FallBackToDefault, bool AnimateScroll, bool OverrideScrollDestination);

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;
	void GetDefaultFocusedWidgetPostDummy(EUINavigation Param_Navigation, class UWidget** Widget) const;
	void GetDefaultInitialChoiceIndex(int32* Param_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C">();
	}
	static class UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C");
static_assert(sizeof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C) == 0x000368, "Wrong size on UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, UberGraphFrame) == 0x000320, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, ChoicesEntryBox) == 0x000328, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::ChoicesEntryBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, ChoicesScrollBox) == 0x000330, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::ChoicesScrollBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, DummyButton) == 0x000338, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::DummyButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, ChoiceButtons) == 0x000340, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::ChoiceButtons' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C, Text_Subtitle) == 0x000350, "Member 'UPlayerSurveyPanelContentsAnswerMultipleChoiceWidget_C::Text_Subtitle' has a wrong offset!");

}

