#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerBattlePassXpAndReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerBattlePassXpAndReward.PlayerBattlePassXpAndReward_C
// 0x0028 (0x02B8 - 0x0290)
class UPlayerBattlePassXpAndReward_C final : public UFortAccountWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaPlayerLevelCompact_C*            AthenaPlayerLevel;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonNameLabel;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SeasonNumber;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowSeasonText;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowSeasonNumberText;                             // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetupReward(class UWidget* Container, class UTextBlock* RewardText, class UDailyQuestRewardInfo_C* RewardInfoWidget, bool HasReward, const struct FFortItemQuantityPair& RewardItem, int32 LevelRewarded);
	void Refresh(struct FFortPublicAccountInfo& FortPublicAccountInfo);
	void PreConstruct(bool IsDesignTime);
	void OnAccountInfoChanged(const struct FFortPublicAccountInfo& Result);
	void ExecuteUbergraph_PlayerBattlePassXpAndReward(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerBattlePassXpAndReward_C">();
	}
	static class UPlayerBattlePassXpAndReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerBattlePassXpAndReward_C>();
	}
};
static_assert(alignof(UPlayerBattlePassXpAndReward_C) == 0x000008, "Wrong alignment on UPlayerBattlePassXpAndReward_C");
static_assert(sizeof(UPlayerBattlePassXpAndReward_C) == 0x0002B8, "Wrong size on UPlayerBattlePassXpAndReward_C");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, UberGraphFrame) == 0x000290, "Member 'UPlayerBattlePassXpAndReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, AthenaPlayerLevel) == 0x000298, "Member 'UPlayerBattlePassXpAndReward_C::AthenaPlayerLevel' has a wrong offset!");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, SeasonNameLabel) == 0x0002A0, "Member 'UPlayerBattlePassXpAndReward_C::SeasonNameLabel' has a wrong offset!");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, Text_SeasonNumber) == 0x0002A8, "Member 'UPlayerBattlePassXpAndReward_C::Text_SeasonNumber' has a wrong offset!");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, ShowSeasonText) == 0x0002B0, "Member 'UPlayerBattlePassXpAndReward_C::ShowSeasonText' has a wrong offset!");
static_assert(offsetof(UPlayerBattlePassXpAndReward_C, bShowSeasonNumberText) == 0x0002B1, "Member 'UPlayerBattlePassXpAndReward_C::bShowSeasonNumberText' has a wrong offset!");

}

