#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupCenterMessageModalPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PopupCenterMessageModalPanel.PopupCenterMessageModalPanel_C
// 0x0048 (0x0498 - 0x0450)
class UPopupCenterMessageModalPanel_C final : public UFortPopUpCenterMessageModalPanel
{
public:
	class UCommonTextBlock*                       CenterMessageText;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MessageOverlay;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   WaitingForPlayersText;                             // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   WaitingForOutpostOwnerText;                        // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           MatchTimerHandle;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateState(ECenterPopupMessageStateEnum NewState);
	void LeaveZone();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PopupCenterMessageModalPanel_C">();
	}
	static class UPopupCenterMessageModalPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopupCenterMessageModalPanel_C>();
	}
};
static_assert(alignof(UPopupCenterMessageModalPanel_C) == 0x000008, "Wrong alignment on UPopupCenterMessageModalPanel_C");
static_assert(sizeof(UPopupCenterMessageModalPanel_C) == 0x000498, "Wrong size on UPopupCenterMessageModalPanel_C");
static_assert(offsetof(UPopupCenterMessageModalPanel_C, CenterMessageText) == 0x000450, "Member 'UPopupCenterMessageModalPanel_C::CenterMessageText' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageModalPanel_C, MessageOverlay) == 0x000458, "Member 'UPopupCenterMessageModalPanel_C::MessageOverlay' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageModalPanel_C, WaitingForPlayersText) == 0x000460, "Member 'UPopupCenterMessageModalPanel_C::WaitingForPlayersText' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageModalPanel_C, WaitingForOutpostOwnerText) == 0x000478, "Member 'UPopupCenterMessageModalPanel_C::WaitingForOutpostOwnerText' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageModalPanel_C, MatchTimerHandle) == 0x000490, "Member 'UPopupCenterMessageModalPanel_C::MatchTimerHandle' has a wrong offset!");

}

