#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupCenterMessageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PopupCenterMessageWidget.PopupCenterMessageWidget_C
// 0x0018 (0x02E8 - 0x02D0)
class UPopupCenterMessageWidget_C final : public UFortHUDCenterPopupMessageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPopupCenterMessageModalPanel_C*        CenterPopupModal;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateStateTimer;                                  // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PopupCenterMessageWidget(int32 EntryPoint);
	void Destruct();
	void UpdateStateEvent();
	void Construct();
	void OnModalDisplayed(ECenterPopupMessageStateEnum NewState, class UCommonActivatablePanel* ModalPopup);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PopupCenterMessageWidget_C">();
	}
	static class UPopupCenterMessageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopupCenterMessageWidget_C>();
	}
};
static_assert(alignof(UPopupCenterMessageWidget_C) == 0x000008, "Wrong alignment on UPopupCenterMessageWidget_C");
static_assert(sizeof(UPopupCenterMessageWidget_C) == 0x0002E8, "Wrong size on UPopupCenterMessageWidget_C");
static_assert(offsetof(UPopupCenterMessageWidget_C, UberGraphFrame) == 0x0002D0, "Member 'UPopupCenterMessageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageWidget_C, CenterPopupModal) == 0x0002D8, "Member 'UPopupCenterMessageWidget_C::CenterPopupModal' has a wrong offset!");
static_assert(offsetof(UPopupCenterMessageWidget_C, UpdateStateTimer) == 0x0002E0, "Member 'UPopupCenterMessageWidget_C::UpdateStateTimer' has a wrong offset!");

}

