#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameBottomBarWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameBottomBarWidget.PostGameBottomBarWidget_C
// 0x0018 (0x02B0 - 0x0298)
class UPostGameBottomBarWidget_C final : public UFortHUDElementWidget
{
public:
	class UBorder*                                Border_BottomBorder;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_topbar;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameBottomBarWidget_C">();
	}
	static class UPostGameBottomBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameBottomBarWidget_C>();
	}
};
static_assert(alignof(UPostGameBottomBarWidget_C) == 0x000008, "Wrong alignment on UPostGameBottomBarWidget_C");
static_assert(sizeof(UPostGameBottomBarWidget_C) == 0x0002B0, "Wrong size on UPostGameBottomBarWidget_C");
static_assert(offsetof(UPostGameBottomBarWidget_C, Border_BottomBorder) == 0x000298, "Member 'UPostGameBottomBarWidget_C::Border_BottomBorder' has a wrong offset!");
static_assert(offsetof(UPostGameBottomBarWidget_C, Image_topbar) == 0x0002A0, "Member 'UPostGameBottomBarWidget_C::Image_topbar' has a wrong offset!");
static_assert(offsetof(UPostGameBottomBarWidget_C, SafeZone_1) == 0x0002A8, "Member 'UPostGameBottomBarWidget_C::SafeZone_1' has a wrong offset!");

}

