#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimarySkewButton_NoShadow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PrimarySkewButton_NoShadow.PrimarySkewButton_NoShadow_C
// 0x0058 (0x0BC8 - 0x0B70)
class UPrimarySkewButton_NoShadow_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_ButtonContent;                           // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ToUpper;                                           // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          XL;                                                // 0x0BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C68[0x6];                                     // 0x0BA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonNameText;                                    // 0x0BA8(0x0018)(Edit, BlueprintVisible)
	bool                                          WonkType;                                          // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnClicked();
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PrimarySkewButton_NoShadow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrimarySkewButton_NoShadow_C">();
	}
	static class UPrimarySkewButton_NoShadow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimarySkewButton_NoShadow_C>();
	}
};
static_assert(alignof(UPrimarySkewButton_NoShadow_C) == 0x000008, "Wrong alignment on UPrimarySkewButton_NoShadow_C");
static_assert(sizeof(UPrimarySkewButton_NoShadow_C) == 0x000BC8, "Wrong size on UPrimarySkewButton_NoShadow_C");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, UberGraphFrame) == 0x000B70, "Member 'UPrimarySkewButton_NoShadow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, Pressed) == 0x000B78, "Member 'UPrimarySkewButton_NoShadow_C::Pressed' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, Hover) == 0x000B80, "Member 'UPrimarySkewButton_NoShadow_C::Hover' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, CenterButtonTextWidget) == 0x000B88, "Member 'UPrimarySkewButton_NoShadow_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, Image_ButtonTop) == 0x000B90, "Member 'UPrimarySkewButton_NoShadow_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, NamedSlot_ButtonContent) == 0x000B98, "Member 'UPrimarySkewButton_NoShadow_C::NamedSlot_ButtonContent' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, ToUpper) == 0x000BA0, "Member 'UPrimarySkewButton_NoShadow_C::ToUpper' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, XL) == 0x000BA1, "Member 'UPrimarySkewButton_NoShadow_C::XL' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, ButtonNameText) == 0x000BA8, "Member 'UPrimarySkewButton_NoShadow_C::ButtonNameText' has a wrong offset!");
static_assert(offsetof(UPrimarySkewButton_NoShadow_C, WonkType) == 0x000BC0, "Member 'UPrimarySkewButton_NoShadow_C::WonkType' has a wrong offset!");

}

