#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_DangerGrape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_DangerGrape.Prj_Athena_DangerGrape_C.ExecuteUbergraph_Prj_Athena_DangerGrape
// 0x0230 (0x0230 - 0x0000)
struct Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBB[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBC[0xC];                                     // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBD[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x00B8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_5EBE[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EBF[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0188(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC0[0x2];                                     // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape) == 0x000010, "Wrong alignment on Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape");
static_assert(sizeof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape) == 0x000230, "Wrong size on Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, EntryPoint) == 0x000000, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_IsServer_ReturnValue) == 0x000006, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_GetInstigator_ReturnValue) == 0x000020, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_ComponentBoundEvent_WaterBody) == 0x000090, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000098, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0000A0, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A4, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000B0, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_Hit_1) == 0x0000B8, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_MyComp) == 0x000148, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_Other) == 0x000150, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_OtherComp) == 0x000158, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_bSelfMoved) == 0x000160, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_HitLocation) == 0x000164, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_HitNormal) == 0x000170, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_NormalImpulse) == 0x00017C, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, K2Node_Event_Hit) == 0x000188, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_Dot_VectorVector_ReturnValue) == 0x000214, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, Temp_bool_IsClosed_Variable) == 0x000218, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000219, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00021C, "Member 'Prj_Athena_DangerGrape_C_ExecuteUbergraph_Prj_Athena_DangerGrape::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function Prj_Athena_DangerGrape.Prj_Athena_DangerGrape_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Prj_Athena_DangerGrape_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EC1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_DangerGrape_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_Athena_DangerGrape_C_ReceiveHit");
static_assert(sizeof(Prj_Athena_DangerGrape_C_ReceiveHit) == 0x0000D0, "Wrong size on Prj_Athena_DangerGrape_C_ReceiveHit");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_ReceiveHit, Hit) == 0x000040, "Member 'Prj_Athena_DangerGrape_C_ReceiveHit::Hit' has a wrong offset!");

// Function Prj_Athena_DangerGrape.Prj_Athena_DangerGrape_C.OnStop
// 0x008C (0x008C - 0x0000)
struct Prj_Athena_DangerGrape_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_DangerGrape_C_OnStop) == 0x000004, "Wrong alignment on Prj_Athena_DangerGrape_C_OnStop");
static_assert(sizeof(Prj_Athena_DangerGrape_C_OnStop) == 0x00008C, "Wrong size on Prj_Athena_DangerGrape_C_OnStop");
static_assert(offsetof(Prj_Athena_DangerGrape_C_OnStop, Hit) == 0x000000, "Member 'Prj_Athena_DangerGrape_C_OnStop::Hit' has a wrong offset!");

// Function Prj_Athena_DangerGrape.Prj_Athena_DangerGrape_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, Param_WaterInteractionComponent) == 0x000008, "Member 'Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_Athena_DangerGrape_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

}

