#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Nice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prj_Athena_Bucket_Old_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_Bucket_Nice.Prj_Athena_Bucket_Nice_C
// 0x0018 (0x0958 - 0x0940)
class APrj_Athena_Bucket_Nice_C final : public APrj_Athena_Bucket_Old_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Bucket_Nice_C;           // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Trail;                                             // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnOffTrail;                                      // 0x0950(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_Prj_Athena_Bucket_Nice(int32 EntryPoint);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnRep_TurnOffTrail();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_Bucket_Nice_C">();
	}
	static class APrj_Athena_Bucket_Nice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Bucket_Nice_C>();
	}
};
static_assert(alignof(APrj_Athena_Bucket_Nice_C) == 0x000008, "Wrong alignment on APrj_Athena_Bucket_Nice_C");
static_assert(sizeof(APrj_Athena_Bucket_Nice_C) == 0x000958, "Wrong size on APrj_Athena_Bucket_Nice_C");
static_assert(offsetof(APrj_Athena_Bucket_Nice_C, UberGraphFrame_Prj_Athena_Bucket_Nice_C) == 0x000940, "Member 'APrj_Athena_Bucket_Nice_C::UberGraphFrame_Prj_Athena_Bucket_Nice_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Nice_C, Trail) == 0x000948, "Member 'APrj_Athena_Bucket_Nice_C::Trail' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Nice_C, TurnOffTrail) == 0x000950, "Member 'APrj_Athena_Bucket_Nice_C::TurnOffTrail' has a wrong offset!");

}

