#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_GliderGrappler_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_GliderGrappler_Parent.Prj_Athena_GliderGrappler_Parent_C.ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent
// 0x00C0 (0x00C0 - 0x0000)
struct Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_FortPawn;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component_2; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3E[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPawn* FortPawn)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E3F[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E40[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E41[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E42[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent) == 0x000008, "Wrong alignment on Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent");
static_assert(sizeof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent) == 0x0000C0, "Wrong size on Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, EntryPoint) == 0x000000, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_RowToBool_ReturnValue) == 0x000004, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000010, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetRemainingAmmo_ReturnValue) == 0x00002C, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000038, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_AsFort_Ability_System_Component_1) == 0x000040, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_AsFort_Ability_System_Component_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_CustomEvent_FortPawn) == 0x000050, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_CustomEvent_FortPawn' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000058, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000060, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_AsFort_Ability_System_Component_2) == 0x000068, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_AsFort_Ability_System_Component_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000088, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, Temp_bool_IsClosed_Variable) == 0x000090, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x000094, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_IsValid_ReturnValue_1) == 0x00009C, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0000A0, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000A8, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x0000B0, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x0000B4, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1) == 0x0000B8, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0000BC, "Member 'Prj_Athena_GliderGrappler_Parent_C_ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Prj_Athena_GliderGrappler_Parent.Prj_Athena_GliderGrappler_Parent_C.Teleported - Return abilities and stop
// 0x0008 (0x0008 - 0x0000)
struct Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop final
{
public:
	class AFortPawn*                              FortPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop) == 0x000008, "Wrong alignment on Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop");
static_assert(sizeof(Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop) == 0x000008, "Wrong size on Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop");
static_assert(offsetof(Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop, FortPawn) == 0x000000, "Member 'Prj_Athena_GliderGrappler_Parent_C_Teleported_Minus_Return_abilities_and_stop::FortPawn' has a wrong offset!");

}

