#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_HappyGhost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_HappyGhost.Prj_Athena_HappyGhost_C
// 0x0160 (0x0A88 - 0x0928)
class APrj_Athena_HappyGhost_C final : public AFortAttachableProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0928(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Athena_HappyGhost_Wire_C*            Rope;                                              // 0x0948(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        FortPawn;                                          // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HappyGhost_Athena_C*                 WeaponActor;                                       // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReelinPlayRate;                                    // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_ProjSpawned;                                 // 0x0964(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC7[0x4];                                     // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        FX_SpawnItems;                                     // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_SpawnItems;                                  // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnItemsTraceOffset;                             // 0x0980(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             WaterHit;                                          // 0x098C(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UParticleSystem*                        WaterImpactFX;                                     // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      WaterHitMat;                                       // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitFishReelInRate;                                 // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemSpawnDelay;                                    // 0x0A2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Hit_Player_Sound;                                  // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Hit_World_Sound;                                   // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Hit_Fish_Sound;                                    // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemAttachMinDist;                                 // 0x0A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC8[0x4];                                     // 0x0A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            TempItemToAttach;                                  // 0x0A50(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemAttachDistanceRequirement;                     // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC9[0x4];                                     // 0x0A5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_Vehicle;                                        // 0x0A60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HitReelInRate;                                     // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_HappyGhost(int32 EntryPoint);
	void CustomPickupAttach(class AFortPickup* FortPickup);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void SpawnItemsFX();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void HandleCost();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SendQuestEvent(class AActor* Hit_Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_HappyGhost_C">();
	}
	static class APrj_Athena_HappyGhost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_HappyGhost_C>();
	}
};
static_assert(alignof(APrj_Athena_HappyGhost_C) == 0x000008, "Wrong alignment on APrj_Athena_HappyGhost_C");
static_assert(sizeof(APrj_Athena_HappyGhost_C) == 0x000A88, "Wrong size on APrj_Athena_HappyGhost_C");
static_assert(offsetof(APrj_Athena_HappyGhost_C, UberGraphFrame) == 0x000928, "Member 'APrj_Athena_HappyGhost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, ParticleSystem) == 0x000930, "Member 'APrj_Athena_HappyGhost_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, StaticMesh) == 0x000938, "Member 'APrj_Athena_HappyGhost_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, PlayerPawn) == 0x000940, "Member 'APrj_Athena_HappyGhost_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Rope) == 0x000948, "Member 'APrj_Athena_HappyGhost_C::Rope' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, FortPawn) == 0x000950, "Member 'APrj_Athena_HappyGhost_C::FortPawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, WeaponActor) == 0x000958, "Member 'APrj_Athena_HappyGhost_C::WeaponActor' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, ReelinPlayRate) == 0x000960, "Member 'APrj_Athena_HappyGhost_C::ReelinPlayRate' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Event_ProjSpawned) == 0x000964, "Member 'APrj_Athena_HappyGhost_C::Event_ProjSpawned' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, FX_SpawnItems) == 0x000970, "Member 'APrj_Athena_HappyGhost_C::FX_SpawnItems' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Sound_SpawnItems) == 0x000978, "Member 'APrj_Athena_HappyGhost_C::Sound_SpawnItems' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, SpawnItemsTraceOffset) == 0x000980, "Member 'APrj_Athena_HappyGhost_C::SpawnItemsTraceOffset' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, WaterHit) == 0x00098C, "Member 'APrj_Athena_HappyGhost_C::WaterHit' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, WaterImpactFX) == 0x000A18, "Member 'APrj_Athena_HappyGhost_C::WaterImpactFX' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, WaterHitMat) == 0x000A20, "Member 'APrj_Athena_HappyGhost_C::WaterHitMat' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, HitFishReelInRate) == 0x000A28, "Member 'APrj_Athena_HappyGhost_C::HitFishReelInRate' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, ItemSpawnDelay) == 0x000A2C, "Member 'APrj_Athena_HappyGhost_C::ItemSpawnDelay' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Hit_Player_Sound) == 0x000A30, "Member 'APrj_Athena_HappyGhost_C::Hit_Player_Sound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Hit_World_Sound) == 0x000A38, "Member 'APrj_Athena_HappyGhost_C::Hit_World_Sound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, Hit_Fish_Sound) == 0x000A40, "Member 'APrj_Athena_HappyGhost_C::Hit_Fish_Sound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, ItemAttachMinDist) == 0x000A48, "Member 'APrj_Athena_HappyGhost_C::ItemAttachMinDist' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, TempItemToAttach) == 0x000A50, "Member 'APrj_Athena_HappyGhost_C::TempItemToAttach' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, ItemAttachDistanceRequirement) == 0x000A58, "Member 'APrj_Athena_HappyGhost_C::ItemAttachDistanceRequirement' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, TC_Vehicle) == 0x000A60, "Member 'APrj_Athena_HappyGhost_C::TC_Vehicle' has a wrong offset!");
static_assert(offsetof(APrj_Athena_HappyGhost_C, HitReelInRate) == 0x000A80, "Member 'APrj_Athena_HappyGhost_C::HitReelInRate' has a wrong offset!");

}

