#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Wumba

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_Wumba.Prj_Athena_Wumba_C.ExecuteUbergraph_Prj_Athena_Wumba
// 0x03B0 (0x03B0 - 0x0000)
struct Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BA7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BA8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BA9[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BAA[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BAB[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BAC[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BAD[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x00E4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BAE[0x2];                                     // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BAF[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB0[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB1[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue_1;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForCollisionInRadius_bVehicleCollisionDetected; // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB2[0x1];                                     // 0x022F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0238(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB3[0x2];                                     // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB4[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB5[0x2];                                     // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB6[0x1];                                     // 0x0397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba) == 0x000010, "Wrong alignment on Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba");
static_assert(sizeof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba) == 0x0003B0, "Wrong size on Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, EntryPoint) == 0x000000, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_GetInstigator_ReturnValue) == 0x000020, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_ComponentBoundEvent_WaterBody) == 0x000038, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000040, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000048, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_IsServer_ReturnValue) == 0x000050, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_MakeRotator_ReturnValue) == 0x000054, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x0000A0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000A8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000B4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000C0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000C8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0000D8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, Temp_bool_Has_Been_Initd_Variable) == 0x0000E0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_Event_Hit_1) == 0x0000E4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_bBlockingHit) == 0x000170, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_bInitialOverlap) == 0x000171, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Time) == 0x000174, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Distance) == 0x000178, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Location) == 0x00017C, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_ImpactPoint) == 0x000188, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Normal) == 0x000194, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_PhysMat) == 0x0001B0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitActor) == 0x0001B8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitComponent) == 0x0001C0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitBoneName) == 0x0001C8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitItem) == 0x0001D0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_FaceIndex) == 0x0001D4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_TraceStart) == 0x0001D8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_TraceEnd) == 0x0001E4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0001F0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000208, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_SpawnPickupInWorld_ReturnValue_1) == 0x000220, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_SpawnPickupInWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_Dot_VectorVector_ReturnValue) == 0x000228, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_CheckForCollisionInRadius_bVehicleCollisionDetected) == 0x00022C, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_CheckForCollisionInRadius_bVehicleCollisionDetected' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00022D, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_IsServer_ReturnValue_1) == 0x00022E, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000230, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_Event_Hit) == 0x000238, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002C4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002C5, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Time_1) == 0x0002C8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Distance_1) == 0x0002CC, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Location_1) == 0x0002D0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002DC, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_Normal_1) == 0x0002E8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002F4, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_PhysMat_1) == 0x000300, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitActor_1) == 0x000308, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitComponent_1) == 0x000310, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitBoneName_1) == 0x000318, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_HitItem_1) == 0x000320, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_FaceIndex_1) == 0x000324, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_TraceStart_1) == 0x000328, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_BreakHitResult_TraceEnd_1) == 0x000334, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_FinishSpawningActor_ReturnValue) == 0x000340, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000348, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_bSuccess_2) == 0x000358, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x000360, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, K2Node_DynamicCast_bSuccess_3) == 0x000370, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, Temp_bool_Variable) == 0x000371, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000374, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_SpawnEmitterAtLocation_ReturnValue_2) == 0x000380, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_SpawnEmitterAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000388, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000394, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000395, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, Temp_bool_Variable_1) == 0x000396, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000398, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0003A0, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba, Temp_bool_IsClosed_Variable) == 0x0003A8, "Member 'Prj_Athena_Wumba_C_ExecuteUbergraph_Prj_Athena_Wumba::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function Prj_Athena_Wumba.Prj_Athena_Wumba_C.OnStop
// 0x008C (0x008C - 0x0000)
struct Prj_Athena_Wumba_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_Wumba_C_OnStop) == 0x000004, "Wrong alignment on Prj_Athena_Wumba_C_OnStop");
static_assert(sizeof(Prj_Athena_Wumba_C_OnStop) == 0x00008C, "Wrong size on Prj_Athena_Wumba_C_OnStop");
static_assert(offsetof(Prj_Athena_Wumba_C_OnStop, Hit) == 0x000000, "Member 'Prj_Athena_Wumba_C_OnStop::Hit' has a wrong offset!");

// Function Prj_Athena_Wumba.Prj_Athena_Wumba_C.OnBounce
// 0x008C (0x008C - 0x0000)
struct Prj_Athena_Wumba_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_Wumba_C_OnBounce) == 0x000004, "Wrong alignment on Prj_Athena_Wumba_C_OnBounce");
static_assert(sizeof(Prj_Athena_Wumba_C_OnBounce) == 0x00008C, "Wrong size on Prj_Athena_Wumba_C_OnBounce");
static_assert(offsetof(Prj_Athena_Wumba_C_OnBounce, Hit) == 0x000000, "Member 'Prj_Athena_Wumba_C_OnBounce::Hit' has a wrong offset!");

// Function Prj_Athena_Wumba.Prj_Athena_Wumba_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, Param_WaterInteractionComponent) == 0x000008, "Member 'Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_Athena_Wumba_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Prj_Athena_Wumba.Prj_Athena_Wumba_C.CheckForCollisionInRadius
// 0x0098 (0x0098 - 0x0000)
struct Prj_Athena_Wumba_C_CheckForCollisionInRadius final
{
public:
	struct FVector                                SpherePos;                                         // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVehicleCollisionDetected;                         // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BB7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BB8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BB9[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BBA[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HidingProp_C*                        K2Node_DynamicCast_AsB_Hiding_Prop;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BBB[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BBC[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_Wumba_C_CheckForCollisionInRadius) == 0x000008, "Wrong alignment on Prj_Athena_Wumba_C_CheckForCollisionInRadius");
static_assert(sizeof(Prj_Athena_Wumba_C_CheckForCollisionInRadius) == 0x000098, "Wrong size on Prj_Athena_Wumba_C_CheckForCollisionInRadius");
static_assert(offsetof(Prj_Athena_Wumba_C_CheckForCollisionInRadius, SpherePos) == 0x000000, "Member 'Prj_Athena_Wumba_C_CheckForCollisionInRadius::SpherePos' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_CheckForCollisionInRadius, bVehicleCollisionDetected) == 0x00000C, "Member 'Prj_Athena_Wumba_C_CheckForCollisionInRadius::bVehicleCollisionDetected' has a wrong offset!");
static_assert(offsetof(Prj_Athena_Wumba_C_CheckForCollisionInRadius, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Prj_Athena_Wumba_C_CheckForCollisionInRadius::Temp_int_Array_Index_Variable' has a wrong offset!");
