#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Professor_Pup_Male_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function Professor_Pup_Male_Axe_AnimBP.Professor_Pup_Male_Axe_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Professor_Pup_Male_Axe_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Professor_Pup_Male_Axe_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Professor_Pup_Male_Axe_AnimBP_C_AnimGraph");
static_assert(sizeof(Professor_Pup_Male_Axe_AnimBP_C_AnimGraph) == 0x000020, "Wrong size on Professor_Pup_Male_Axe_AnimBP_C_AnimGraph");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Professor_Pup_Male_Axe_AnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'Professor_Pup_Male_Axe_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Professor_Pup_Male_Axe_AnimBP.Professor_Pup_Male_Axe_AnimBP_C.spinFunction
// 0x0028 (0x0028 - 0x0000)
struct Professor_Pup_Male_Axe_AnimBP_C_SpinFunction final
{
public:
	float                                         Spin;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Output;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpinVar;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5826[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction) == 0x000004, "Wrong alignment on Professor_Pup_Male_Axe_AnimBP_C_SpinFunction");
static_assert(sizeof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction) == 0x000028, "Wrong size on Professor_Pup_Male_Axe_AnimBP_C_SpinFunction");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, Spin) == 0x000000, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::Spin' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, Speed) == 0x000004, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::Speed' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, Output) == 0x000008, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::Output' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, SpinVar) == 0x00000C, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::SpinVar' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_SpinFunction, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000024, "Member 'Professor_Pup_Male_Axe_AnimBP_C_SpinFunction::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function Professor_Pup_Male_Axe_AnimBP.Professor_Pup_Male_Axe_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Professor_Pup_Male_Axe_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Professor_Pup_Male_Axe_AnimBP.Professor_Pup_Male_Axe_AnimBP_C.ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP
// 0x0140 (0x0140 - 0x0000)
struct Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5827[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPositionHistory                       K2Node_MakeStruct_PositionHistory;                 // 0x0010(0x0030)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5828[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5829[0xF];                                     // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ConvertTransformToRelative_ReturnValue;   // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_CalculateVelocityFromPositionHistory_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_spinFunction_output;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP) == 0x000010, "Wrong alignment on Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP");
static_assert(sizeof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP) == 0x000140, "Wrong size on Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, EntryPoint) == 0x000000, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, K2Node_MakeStruct_PositionHistory) == 0x000010, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::K2Node_MakeStruct_PositionHistory' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_GetAttachParent_ReturnValue) == 0x000048, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_GetSocketTransform_ReturnValue) == 0x000060, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000090, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_ConvertTransformToRelative_ReturnValue) == 0x0000C0, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_ConvertTransformToRelative_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x0000F0, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_BreakTransform_Location) == 0x0000FC, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000108, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_BreakTransform_Scale) == 0x000114, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_K2_CalculateVelocityFromPositionHistory_ReturnValue) == 0x000120, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_K2_CalculateVelocityFromPositionHistory_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, K2Node_Event_DeltaTimeX) == 0x000124, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_Ease_ReturnValue) == 0x000128, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_FInterpTo_ReturnValue) == 0x00012C, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP, CallFunc_spinFunction_output) == 0x000130, "Member 'Professor_Pup_Male_Axe_AnimBP_C_ExecuteUbergraph_Professor_Pup_Male_Axe_AnimBP::CallFunc_spinFunction_output' has a wrong offset!");

}

