#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Athena_StaticGenerator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.ExecuteUbergraph_Prop_Athena_StaticGenerator
// 0x02E0 (0x02E0 - 0x0000)
struct Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Active;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8791[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8792[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8793[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8794[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0060(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x008C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0128(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8795[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8796[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0178(0x0020)()
	bool                                          Temp_bool_Variable_1;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8797[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8798[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8799[0x2];                                     // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879A[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879B[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0208(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0210(0x0020)(ConstParm)
	class AFortSafeZoneIndicator*                 CallFunc_GetSafeZoneIndicator_ReturnValue;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879C[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879D[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879E[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSafeZoneRadius_ReturnValue;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSafeZoneCenter_ReturnValue;            // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue_1;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879F[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_Sentry_Parent_C*            CallFunc_Array_Get_Item;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A0[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_EventName;              // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_EmitterTime;            // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ParticleCount;          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator) == 0x000010, "Wrong alignment on Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator) == 0x0002E0, "Wrong size on Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, EntryPoint) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CustomEvent_Active) == 0x000004, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_bool_Variable) == 0x000014, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000038, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_object_Variable) == 0x000040, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_object_Variable_1) == 0x000050, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_Damage) == 0x000058, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_DamageTags) == 0x000060, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_Momentum) == 0x000080, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_HitInfo) == 0x00008C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_InstigatedBy) == 0x000118, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_DamageCauser) == 0x000120, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Event_EffectContext) == 0x000128, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetHealth_ReturnValue) == 0x000144, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000149, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000150, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000158, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_struct_Variable) == 0x00015C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00016C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_struct_Variable_1) == 0x000178, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_bool_Variable_1) == 0x000198, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_BreakColor_R) == 0x00019C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_BreakColor_G) == 0x0001A0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_BreakColor_B) == 0x0001A4, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_BreakColor_A) == 0x0001A8, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Select_Default) == 0x0001AC, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_MakeStruct_Vector4) == 0x0001C0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_MakeStruct_Vector4' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_RowToBool_ReturnValue) == 0x0001D0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IsValid_ReturnValue_1) == 0x0001D1, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001D4, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetGameState_ReturnValue) == 0x0001D8, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0001F0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CustomEvent_GameState) == 0x000200, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CustomEvent_Playlist) == 0x000208, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CustomEvent_PlaylistContextTags) == 0x000210, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetSafeZoneIndicator_ReturnValue) == 0x000230, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetSafeZoneIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IsValid_ReturnValue_2) == 0x000238, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000240, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000248, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_CreateDelegate_OutputDelegate_2) == 0x00024C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x00025C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000260, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x000268, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetSafeZoneRadius_ReturnValue) == 0x00026C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetSafeZoneRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetSafeZoneCenter_ReturnValue) == 0x000270, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetSafeZoneCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetHealth_ReturnValue_1) == 0x00027C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x000280, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetMaxHealth_ReturnValue) == 0x000284, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000288, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_float_Variable) == 0x00028C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_float_Variable_1) == 0x000290, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_Select_Default_1) == 0x000294, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_GetValueAtLevel_ReturnValue) == 0x000298, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00029C, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, Temp_int_Array_Index_Variable) == 0x0002A0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002A4, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_Array_Get_Item) == 0x0002A8, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IsValid_ReturnValue_3) == 0x0002B0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0002B1, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_ComponentBoundEvent_EventName) == 0x0002B4, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_ComponentBoundEvent_EventName' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_ComponentBoundEvent_EmitterTime) == 0x0002BC, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_ComponentBoundEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, K2Node_ComponentBoundEvent_ParticleCount) == 0x0002C0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::K2Node_ComponentBoundEvent_ParticleCount' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002C4, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x0002D0, "Member 'Prop_Athena_StaticGenerator_C_ExecuteUbergraph_Prop_Athena_StaticGenerator::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.SetActiveState
// 0x0004 (0x0004 - 0x0000)
struct Prop_Athena_StaticGenerator_C_SetActiveState final
{
public:
	int32                                         Param_Active;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_SetActiveState) == 0x000004, "Wrong alignment on Prop_Athena_StaticGenerator_C_SetActiveState");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_SetActiveState) == 0x000004, "Wrong size on Prop_Athena_StaticGenerator_C_SetActiveState");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_SetActiveState, Param_Active) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_SetActiveState::Param_Active' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleCount;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature) == 0x000010, "Wrong size on Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature, EventName) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature, ParticleCount) == 0x00000C, "Member 'Prop_Athena_StaticGenerator_C_BndEvt__LoopFX_K2Node_ComponentBoundEvent_0_ParticleBurstSignature__DelegateSignature::ParticleCount' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct Prop_Athena_StaticGenerator_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87A1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_OnDamageServer) == 0x000008, "Wrong alignment on Prop_Athena_StaticGenerator_C_OnDamageServer");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_OnDamageServer) == 0x0000E8, "Wrong size on Prop_Athena_StaticGenerator_C_OnDamageServer");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, Damage) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, DamageTags) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, Momentum) == 0x000028, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, HitInfo) == 0x000034, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'Prop_Athena_StaticGenerator_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.OnReady_E1DEEF4D490076A7BF9178B195376EE6
// 0x0030 (0x0030 - 0x0000)
struct Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6) == 0x000008, "Wrong alignment on Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6) == 0x000030, "Wrong size on Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6, GameState) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6::GameState' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6, Playlist) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6::Playlist' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6, PlaylistContextTags) == 0x000010, "Member 'Prop_Athena_StaticGenerator_C_OnReady_E1DEEF4D490076A7BF9178B195376EE6::PlaylistContextTags' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Prop_Athena_StaticGenerator_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A2[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87A3[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_UserConstructionScript) == 0x000010, "Wrong alignment on Prop_Athena_StaticGenerator_C_UserConstructionScript");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_UserConstructionScript) == 0x000030, "Wrong size on Prop_Athena_StaticGenerator_C_UserConstructionScript");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_BreakColor_R) == 0x000004, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_BreakColor_G) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_BreakColor_B) == 0x00000C, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, CallFunc_BreakColor_A) == 0x000010, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_UserConstructionScript, K2Node_MakeStruct_Vector4) == 0x000020, "Member 'Prop_Athena_StaticGenerator_C_UserConstructionScript::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.OnRep_Active
// 0x0050 (0x0050 - 0x0000)
struct Prop_Athena_StaticGenerator_C_OnRep_Active final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A4[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A5[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_OnRep_Active) == 0x000008, "Wrong alignment on Prop_Athena_StaticGenerator_C_OnRep_Active");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_OnRep_Active) == 0x000050, "Wrong size on Prop_Athena_StaticGenerator_C_OnRep_Active");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00000C, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000018, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000028, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, Temp_bool_Variable) == 0x000030, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, Temp_bool_Variable_1) == 0x000031, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_IsServer_ReturnValue) == 0x000032, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000033, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, K2Node_Select_Default) == 0x000038, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, K2Node_Select_Default_1) == 0x000040, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_OnRep_Active, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'Prop_Athena_StaticGenerator_C_OnRep_Active::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct Prop_Athena_StaticGenerator_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87A6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Athena_StaticGenerator_C_ShouldDie) == 0x000008, "Wrong alignment on Prop_Athena_StaticGenerator_C_ShouldDie");
static_assert(sizeof(Prop_Athena_StaticGenerator_C_ShouldDie) == 0x000020, "Wrong size on Prop_Athena_StaticGenerator_C_ShouldDie");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ShouldDie, Damage) == 0x000000, "Member 'Prop_Athena_StaticGenerator_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Prop_Athena_StaticGenerator_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Prop_Athena_StaticGenerator_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Athena_StaticGenerator_C_ShouldDie, ReturnValue) == 0x000018, "Member 'Prop_Athena_StaticGenerator_C_ShouldDie::ReturnValue' has a wrong offset!");

// Function Prop_Athena_StaticGenerator.Prop_Athena_StaticGenerator_C.UpdateMaterial
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_Athena_StaticGenerator_C_UpdateMaterial final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A8[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
