#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C
// 0x0100 (0x0CC0 - 0x0BC0)
class AProp_QuestInteractable_Parent_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   AmbientLight;                                      // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientSound;                                      // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Shrink_ShrinkTime_1E385A0F44FE3164DD4AF38B26935263; // 0x0BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Shrink__Direction_1E385A0F44FE3164DD4AF38B26935263; // 0x0BDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5028[0x3];                                     // 0x0BDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Shrink;                                            // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InteractText;                                      // 0x0BE8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FUniqueNetIdRepl>               AllPlayerAccountWhoHaveInteracted;                 // 0x0C00(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestBackendObjectiveName;                         // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             SuccessSound;                                      // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SuccessFX;                                         // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MeshShrinkOnSuccess;                               // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5029[0x7];                                     // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   AllPlayersWhoHaveInteracted;                       // 0x0C38(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	bool                                          QuestCompleted;                                    // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502A[0x7];                                     // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              InteractingPawn;                                   // 0x0C50(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ListenForAllQuestUpdates;                          // 0x0C58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLocallyValid;                                    // 0x0C59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LetChildBPHideProp;                                // 0x0C5A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RunQuestObjectiveCompletionOnServer;               // 0x0C5B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldStayVisibleAfterQuestCompletion;             // 0x0C5C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502B[0x3];                                     // 0x0C5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CosmeticCustomTag;                                 // 0x0C60(0x0020)(Edit, BlueprintVisible)
	bool                                          ShouldPlayFXOnPlayer;                              // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502C[0x7];                                     // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   SuccessFF;                                         // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestShared;                                    // 0x0C90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          QuestAlreadyFinished;                              // 0x0C91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502D[0x6];                                     // 0x0C92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BlockedPlaylistTags;                               // 0x0C98(0x0020)(Edit, BlueprintVisible)
	bool                                          DisableLightAndSoundComponents;                    // 0x0CB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ForceDebugOn;                                      // 0x0CB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NeverHide;                                         // 0x0CBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_QuestInteractable_Parent(int32 EntryPoint);
	void DebugModeForceInteract(class ABuildingActor* SelfActor, class AFortPawn* Param_InteractingPawn);
	void Server_QuestObjectiveUpdated(class AFortPlayerController* Controller, const class UFortQuestItemDefinition* QuestDef, class FName BackendName, int32 CompletionCount, bool ObjectiveCompleted, bool Param_QuestCompleted);
	void Server_QuestObjectiveCompleted(class AFortPawn* Param_InteractingPawn);
	void ReceiveBeginPlay();
	void ThisQuestObjectiveComplete(class AFortPawn* IneractingPawn);
	void PlaySuccessFX();
	void BlueprintOnInteract(const class AFortPawn* Param_InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void QuestInitializedAndValid();
	void Quest_Initialized_and_Not_Valid();
	void QuestUpdatedFromAnywhere();
	void PlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void ParentQuestUpdated();
	void Shrink__UpdateFunc();
	void Shrink__FinishedFunc();
	void UserConstructionScript();
	void HideQuestProp();
	void ShowQuestProp();

	bool BlueprintCanInteract(const class AFortPawn* Param_InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* Param_InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_QuestInteractable_Parent_C">();
	}
	static class AProp_QuestInteractable_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_QuestInteractable_Parent_C>();
	}
};
static_assert(alignof(AProp_QuestInteractable_Parent_C) == 0x000008, "Wrong alignment on AProp_QuestInteractable_Parent_C");
static_assert(sizeof(AProp_QuestInteractable_Parent_C) == 0x000CC0, "Wrong size on AProp_QuestInteractable_Parent_C");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, UberGraphFrame) == 0x000BC0, "Member 'AProp_QuestInteractable_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, AmbientLight) == 0x000BC8, "Member 'AProp_QuestInteractable_Parent_C::AmbientLight' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, AmbientSound) == 0x000BD0, "Member 'AProp_QuestInteractable_Parent_C::AmbientSound' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, Shrink_ShrinkTime_1E385A0F44FE3164DD4AF38B26935263) == 0x000BD8, "Member 'AProp_QuestInteractable_Parent_C::Shrink_ShrinkTime_1E385A0F44FE3164DD4AF38B26935263' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, Shrink__Direction_1E385A0F44FE3164DD4AF38B26935263) == 0x000BDC, "Member 'AProp_QuestInteractable_Parent_C::Shrink__Direction_1E385A0F44FE3164DD4AF38B26935263' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, Shrink) == 0x000BE0, "Member 'AProp_QuestInteractable_Parent_C::Shrink' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, InteractText) == 0x000BE8, "Member 'AProp_QuestInteractable_Parent_C::InteractText' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, AllPlayerAccountWhoHaveInteracted) == 0x000C00, "Member 'AProp_QuestInteractable_Parent_C::AllPlayerAccountWhoHaveInteracted' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, QuestItem) == 0x000C10, "Member 'AProp_QuestInteractable_Parent_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, QuestBackendObjectiveName) == 0x000C18, "Member 'AProp_QuestInteractable_Parent_C::QuestBackendObjectiveName' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, SuccessSound) == 0x000C20, "Member 'AProp_QuestInteractable_Parent_C::SuccessSound' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, SuccessFX) == 0x000C28, "Member 'AProp_QuestInteractable_Parent_C::SuccessFX' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, MeshShrinkOnSuccess) == 0x000C30, "Member 'AProp_QuestInteractable_Parent_C::MeshShrinkOnSuccess' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, AllPlayersWhoHaveInteracted) == 0x000C38, "Member 'AProp_QuestInteractable_Parent_C::AllPlayersWhoHaveInteracted' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, QuestCompleted) == 0x000C48, "Member 'AProp_QuestInteractable_Parent_C::QuestCompleted' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, InteractingPawn) == 0x000C50, "Member 'AProp_QuestInteractable_Parent_C::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, ListenForAllQuestUpdates) == 0x000C58, "Member 'AProp_QuestInteractable_Parent_C::ListenForAllQuestUpdates' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, IsLocallyValid) == 0x000C59, "Member 'AProp_QuestInteractable_Parent_C::IsLocallyValid' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, LetChildBPHideProp) == 0x000C5A, "Member 'AProp_QuestInteractable_Parent_C::LetChildBPHideProp' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, RunQuestObjectiveCompletionOnServer) == 0x000C5B, "Member 'AProp_QuestInteractable_Parent_C::RunQuestObjectiveCompletionOnServer' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, ShouldStayVisibleAfterQuestCompletion) == 0x000C5C, "Member 'AProp_QuestInteractable_Parent_C::ShouldStayVisibleAfterQuestCompletion' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, CosmeticCustomTag) == 0x000C60, "Member 'AProp_QuestInteractable_Parent_C::CosmeticCustomTag' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, ShouldPlayFXOnPlayer) == 0x000C80, "Member 'AProp_QuestInteractable_Parent_C::ShouldPlayFXOnPlayer' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, SuccessFF) == 0x000C88, "Member 'AProp_QuestInteractable_Parent_C::SuccessFF' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, bIsQuestShared) == 0x000C90, "Member 'AProp_QuestInteractable_Parent_C::bIsQuestShared' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, QuestAlreadyFinished) == 0x000C91, "Member 'AProp_QuestInteractable_Parent_C::QuestAlreadyFinished' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, BlockedPlaylistTags) == 0x000C98, "Member 'AProp_QuestInteractable_Parent_C::BlockedPlaylistTags' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, DisableLightAndSoundComponents) == 0x000CB8, "Member 'AProp_QuestInteractable_Parent_C::DisableLightAndSoundComponents' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, ForceDebugOn) == 0x000CB9, "Member 'AProp_QuestInteractable_Parent_C::ForceDebugOn' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Parent_C, NeverHide) == 0x000CBA, "Member 'AProp_QuestInteractable_Parent_C::NeverHide' has a wrong offset!");

}

