#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_DancingFish1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.ExecuteUbergraph_Prop_QuestInteractable_DancingFish1
// 0x0318 (0x0318 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_688A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688B[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688C[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688D[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688E[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688F[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x00B0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6890[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6891[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6892[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6893[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6894[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x01A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1; // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6895[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingEmote_ReturnValue;               // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6896[0x2];                                     // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6897[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0228(0x0020)(ConstParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6898[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_1; // 0x0250(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6899[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item_2;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689A[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689B[0x1];                                     // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_689C[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_2; // 0x02A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_3;                         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x02C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1; // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1; // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1; // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689D[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue_3; // 0x02E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item_4;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x02FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689E[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1) == 0x000008, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1) == 0x000318, "Wrong size on Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, EntryPoint) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest) == 0x000010, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_NotifyName_1) == 0x000014, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_NotifyName) == 0x00001C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_name_Variable) == 0x000034, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_bool_IsClosed_Variable) == 0x00006C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_bool_Has_Been_Initd_Variable) == 0x00006D, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_HasAuthority_ReturnValue) == 0x000078, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_4) == 0x00007C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_HasAuthority_ReturnValue_1) == 0x00008C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OverlappedComponent_1) == 0x000090, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherActor_1) == 0x000098, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherComp_1) == 0x0000A0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherBodyIndex_1) == 0x0000A8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_bFromSweep) == 0x0000AC, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_SweepResult) == 0x0000B0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OverlappedComponent) == 0x000140, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherActor) == 0x000148, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherComp) == 0x000150, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_OtherBodyIndex) == 0x000158, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_5) == 0x00015C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_AddUnique_ReturnValue) == 0x000178, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_RemoveItem_ReturnValue) == 0x00017C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000184, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_6) == 0x000190, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_NotifyName_2) == 0x0001A0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x0001A8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001C0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001C8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_int_Array_Index_Variable) == 0x0001E4, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetGameState_ReturnValue_1) == 0x0001E8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0001F8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1) == 0x000201, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckCreativeMode_CanCompleteQuest_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetController_ReturnValue) == 0x000208, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000210, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_IsPlayingEmote_ReturnValue) == 0x000219, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_IsPlayingEmote_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_PlaylistName) == 0x00021C, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_PlaylistContextTags) == 0x000228, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, Temp_bool_True_if_break_was_hit_Variable) == 0x000248, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Not_PreBool_ReturnValue) == 0x000249, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetLocalFortPlayerControllers_ReturnValue_1) == 0x000250, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetLocalFortPlayerControllers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_BooleanAND_ReturnValue) == 0x000260, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Get_Item_2) == 0x000268, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000270, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetQuestManager_ReturnValue) == 0x000280, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_NotifyName_3) == 0x000288, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000290, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000291, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x000292, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_8) == 0x000294, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetLocalFortPlayerControllers_ReturnValue_2) == 0x0002A8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetLocalFortPlayerControllers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Get_Item_3) == 0x0002B8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002C0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1) == 0x0002D0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1) == 0x0002D1, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1) == 0x0002D2, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_BooleanOR_ReturnValue) == 0x0002D3, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002D8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_GetLocalFortPlayerControllers_ReturnValue_3) == 0x0002E0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_GetLocalFortPlayerControllers_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_Get_Item_4) == 0x0002F0, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0002F8, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, K2Node_CustomEvent_NotifyName_4) == 0x0002FC, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000308, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1, CallFunc_IsValid_ReturnValue) == 0x000310, "Member 'Prop_QuestInteractable_DancingFish1_C_ExecuteUbergraph_Prop_QuestInteractable_DancingFish1::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded) == 0x000008, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded) == 0x000028, "Wrong size on Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'Prop_QuestInteractable_DancingFish1_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.PawnLeftFishArea
// 0x0020 (0x0020 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea) == 0x000008, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea) == 0x000020, "Wrong size on Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea, OverlappedComponent) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea, OtherActor) == 0x000008, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea, OtherComp) == 0x000010, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea, OtherBodyIndex) == 0x000018, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnLeftFishArea::OtherBodyIndex' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.PawnNearFish
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_PawnNearFish final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689F[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish) == 0x000008, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_PawnNearFish");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish) == 0x0000B0, "Wrong size on Prop_QuestInteractable_DancingFish1_C_PawnNearFish");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, OverlappedComponent) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, OtherActor) == 0x000008, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, OtherComp) == 0x000010, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, OtherBodyIndex) == 0x000018, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, bFromSweep) == 0x00001C, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_PawnNearFish, SweepResult) == 0x000020, "Member 'Prop_QuestInteractable_DancingFish1_C_PawnNearFish::SweepResult' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.OnCompleted_3661630A4F18274EB4211B8B151FD8BF
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF) == 0x000004, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF) == 0x000008, "Wrong size on Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF, NotifyName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_OnCompleted_3661630A4F18274EB4211B8B151FD8BF::NotifyName' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.OnBlendOut_3661630A4F18274EB4211B8B151FD8BF
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF) == 0x000004, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF) == 0x000008, "Wrong size on Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF, NotifyName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_OnBlendOut_3661630A4F18274EB4211B8B151FD8BF::NotifyName' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.OnInterrupted_3661630A4F18274EB4211B8B151FD8BF
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF) == 0x000004, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF) == 0x000008, "Wrong size on Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF, NotifyName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_OnInterrupted_3661630A4F18274EB4211B8B151FD8BF::NotifyName' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF) == 0x000004, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF) == 0x000008, "Wrong size on Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF, NotifyName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_OnNotifyBegin_3661630A4F18274EB4211B8B151FD8BF::NotifyName' has a wrong offset!");

// Function Prop_QuestInteractable_DancingFish1.Prop_QuestInteractable_DancingFish1_C.OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF) == 0x000004, "Wrong alignment on Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF");
static_assert(sizeof(Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF) == 0x000008, "Wrong size on Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF");
static_assert(offsetof(Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF, NotifyName) == 0x000000, "Member 'Prop_QuestInteractable_DancingFish1_C_OnNotifyEnd_3661630A4F18274EB4211B8B151FD8BF::NotifyName' has a wrong offset!");

}

