#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_ClockHandSet_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_ClockHandSet_Parent.Prop_ClockHandSet_Parent_C
// 0x0020 (0x0BE0 - 0x0BC0)
class AProp_ClockHandSet_Parent_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               MinHandOffset;                                     // 0x0BC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               HourHandOffset;                                    // 0x0BD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_ClockHandSet_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetTime();
	void GetHourHand(class UStaticMeshComponent** Hand);
	void GetMinHand(class UStaticMeshComponent** Hand);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_ClockHandSet_Parent_C">();
	}
	static class AProp_ClockHandSet_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_ClockHandSet_Parent_C>();
	}
};
static_assert(alignof(AProp_ClockHandSet_Parent_C) == 0x000008, "Wrong alignment on AProp_ClockHandSet_Parent_C");
static_assert(sizeof(AProp_ClockHandSet_Parent_C) == 0x000BE0, "Wrong size on AProp_ClockHandSet_Parent_C");
static_assert(offsetof(AProp_ClockHandSet_Parent_C, UberGraphFrame) == 0x000BC0, "Member 'AProp_ClockHandSet_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_ClockHandSet_Parent_C, MinHandOffset) == 0x000BC8, "Member 'AProp_ClockHandSet_Parent_C::MinHandOffset' has a wrong offset!");
static_assert(offsetof(AProp_ClockHandSet_Parent_C, HourHandOffset) == 0x000BD4, "Member 'AProp_ClockHandSet_Parent_C::HourHandOffset' has a wrong offset!");

}

