#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_Letters_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prop_QuestInteractable_Letters_Parent.Prop_QuestInteractable_Letters_Parent_C.ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent
// 0x03D0 (0x03D0 - 0x0000)
struct Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744A[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744B[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_IneractingPawn;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744C[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0090(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x011C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744D[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744E[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744F[0xF];                                     // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7450[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7451[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABA_FORTNITE_NonSequential_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7452[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0288(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7453[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7454[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7455[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7456[0x3];                                     // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0370(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_Array_Get_Item_1;                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedObjective_ReturnValue;        // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x039E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7457[0x1];                                     // 0x039F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestItemDefinition*>       K2Node_Select_Default_2;                           // 0x03A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UFortQuestItemDefinition*>       K2Node_Select_Default_3;                           // 0x03B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent) == 0x000010, "Wrong alignment on Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent");
static_assert(sizeof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent) == 0x0003D0, "Wrong size on Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, EntryPoint) == 0x000000, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_RLerp_ReturnValue) == 0x00000C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_bool_Variable) == 0x000038, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_bool_Variable_1) == 0x000039, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_VLerp_ReturnValue) == 0x00003C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_bool_Variable_2) == 0x000049, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_bool_Variable_3) == 0x00004A, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_Event_IneractingPawn) == 0x000050, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_Event_IneractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000064, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OverlappedComponent_1) == 0x000070, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherActor_1) == 0x000078, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherComp_1) == 0x000080, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000088, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_bFromSweep) == 0x00008C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_SweepResult) == 0x000090, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00011C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A8, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001B4, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue) == 0x0001C0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C4, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0001D0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001D4, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_2) == 0x0001E0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_MakeTransform_ReturnValue) == 0x0001F0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_3) == 0x000220, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000228, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_4) == 0x000230, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000238, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000240, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000241, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, Temp_int_Array_Index_Variable) == 0x000244, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OverlappedComponent) == 0x000248, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherActor) == 0x000250, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherComp) == 0x000258, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CustomEvent_OtherBodyIndex) == 0x000260, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000264, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_RLerp_ReturnValue_1) == 0x000270, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_VLerp_ReturnValue_1) == 0x00027C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000288, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000314, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000324, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_GetGameState_ReturnValue) == 0x000338, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_IsMobilePlatform_ReturnValue) == 0x000340, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000348, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_DynamicCast_bSuccess) == 0x000350, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_GetNumericCVar_OutValue) == 0x000354, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_GetNumericCVar_ReturnValue) == 0x000358, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_Select_Default) == 0x00035C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_FMax_ReturnValue) == 0x000360, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_Select_Default_1) == 0x000364, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000368, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00036C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000370, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Array_Get_Item) == 0x000380, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x000388, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Array_Get_Item_1) == 0x000390, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Array_Length_ReturnValue) == 0x000398, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_HasCompletedObjective_ReturnValue) == 0x00039C, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_HasCompletedObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x00039D, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_SwitchInteger_CmpSuccess) == 0x00039E, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_Select_Default_2) == 0x0003A0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, K2Node_Select_Default_3) == 0x0003B0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Array_AddUnique_ReturnValue) == 0x0003C0, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Array_Length_ReturnValue_1) == 0x0003C4, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003C8, "Member 'Prop_QuestInteractable_Letters_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function Prop_QuestInteractable_Letters_Parent.Prop_QuestInteractable_Letters_Parent_C.PawnFarEnoughToEndBobbing
// 0x0020 (0x0020 - 0x0000)
struct Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing");
static_assert(sizeof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing) == 0x000020, "Wrong size on Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing, OverlappedComponent) == 0x000000, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing, OtherActor) == 0x000008, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing, OtherComp) == 0x000010, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing, OtherBodyIndex) == 0x000018, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnFarEnoughToEndBobbing::OtherBodyIndex' has a wrong offset!");

// Function Prop_QuestInteractable_Letters_Parent.Prop_QuestInteractable_Letters_Parent_C.PawnCloseEnoughToTriggerBobbing
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7458[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing");
static_assert(sizeof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing) == 0x0000B0, "Wrong size on Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, OverlappedComponent) == 0x000000, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, OtherActor) == 0x000008, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, OtherComp) == 0x000010, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, OtherBodyIndex) == 0x000018, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, bFromSweep) == 0x00001C, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing, SweepResult) == 0x000020, "Member 'Prop_QuestInteractable_Letters_Parent_C_PawnCloseEnoughToTriggerBobbing::SweepResult' has a wrong offset!");

// Function Prop_QuestInteractable_Letters_Parent.Prop_QuestInteractable_Letters_Parent_C.ThisQuestObjectiveComplete
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete final
{
public:
	class AFortPawn*                              IneractingPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete");
static_assert(sizeof(Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete) == 0x000008, "Wrong size on Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete");
static_assert(offsetof(Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete, IneractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Letters_Parent_C_ThisQuestObjectiveComplete::IneractingPawn' has a wrong offset!");

}

