#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Apollo_LilyPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_Apollo_LilyPad.Prop_Apollo_LilyPad_C
// 0x0058 (0x0C18 - 0x0BC0)
class AProp_Apollo_LilyPad_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Jump_Collision;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Ceiling;                                           // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8568[0x3];                                     // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BounceHeight;                                      // 0x0BD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpHeight;                                        // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalBounceJumpHeight;                             // 0x0BDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   LaunchForceFeedback;                               // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        OverlapPawn;                                       // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  OverlapController;                                 // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerLaunched;                                 // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LilypadSound;                                      // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaJackalVehicle*               OverlapVehicle;                                    // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewVar_0;                                          // 0x0C10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prop_Apollo_LilyPad(int32 EntryPoint);
	void BounceAnim();
	void CustomEvent();
	void Reset_Bounce_Sound();
	void BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CeilingCheck(bool* Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_Apollo_LilyPad_C">();
	}
	static class AProp_Apollo_LilyPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_Apollo_LilyPad_C>();
	}
};
static_assert(alignof(AProp_Apollo_LilyPad_C) == 0x000008, "Wrong alignment on AProp_Apollo_LilyPad_C");
static_assert(sizeof(AProp_Apollo_LilyPad_C) == 0x000C18, "Wrong size on AProp_Apollo_LilyPad_C");
static_assert(offsetof(AProp_Apollo_LilyPad_C, UberGraphFrame) == 0x000BC0, "Member 'AProp_Apollo_LilyPad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, Jump_Collision) == 0x000BC8, "Member 'AProp_Apollo_LilyPad_C::Jump_Collision' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, Ceiling) == 0x000BD0, "Member 'AProp_Apollo_LilyPad_C::Ceiling' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, BounceHeight) == 0x000BD4, "Member 'AProp_Apollo_LilyPad_C::BounceHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, JumpHeight) == 0x000BD8, "Member 'AProp_Apollo_LilyPad_C::JumpHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, FinalBounceJumpHeight) == 0x000BDC, "Member 'AProp_Apollo_LilyPad_C::FinalBounceJumpHeight' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, LaunchForceFeedback) == 0x000BE0, "Member 'AProp_Apollo_LilyPad_C::LaunchForceFeedback' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, OverlapPawn) == 0x000BE8, "Member 'AProp_Apollo_LilyPad_C::OverlapPawn' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, OverlapController) == 0x000BF0, "Member 'AProp_Apollo_LilyPad_C::OverlapController' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, GE_PlayerLaunched) == 0x000BF8, "Member 'AProp_Apollo_LilyPad_C::GE_PlayerLaunched' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, LilypadSound) == 0x000C00, "Member 'AProp_Apollo_LilyPad_C::LilypadSound' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, OverlapVehicle) == 0x000C08, "Member 'AProp_Apollo_LilyPad_C::OverlapVehicle' has a wrong offset!");
static_assert(offsetof(AProp_Apollo_LilyPad_C, NewVar_0) == 0x000C10, "Member 'AProp_Apollo_LilyPad_C::NewVar_0' has a wrong offset!");

}

