#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Athena_BuriedChest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.ExecuteUbergraph_Prop_Athena_BuriedChest
// 0x03A0 (0x03A0 - 0x0000)
struct Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65E4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65E5[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0050(0x0020)()
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E6[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E7[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E8[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65E9[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetWeaponDataItemType_ReturnValue;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65EA[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Athena_BuriedChest_Chest_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65EB[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0140(0x0020)(ConstParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65EC[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue_1;              // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65ED[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65EE[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65EF[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F0[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue_2;              // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65F1[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65F2[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ChestLoc;                       // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_ChestRot;                       // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0308(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0397(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest) == 0x000010, "Wrong alignment on Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest");
static_assert(sizeof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest) == 0x0003A0, "Wrong size on Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, EntryPoint) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, Temp_object_Variable) == 0x000008, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, Temp_object_Variable_1) == 0x000010, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000018, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, Temp_int_Variable) == 0x000034, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000044, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, Temp_struct_Variable) == 0x000050, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_DamagedActor) == 0x000080, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_Damage) == 0x000088, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_InstigatedBy) == 0x000090, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_DamageCauser) == 0x000098, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_HitLocation) == 0x0000A0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_FHitComponent) == 0x0000B0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_BoneName) == 0x0000B8, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_Momentum) == 0x0000C0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_DynamicCast_AsFort_Weapon) == 0x000108, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_DynamicCast_AsFort_Weapon' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_GetWeaponDataItemType_ReturnValue) == 0x000111, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_GetWeaponDataItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsServer_ReturnValue_1) == 0x000121, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_Location) == 0x000124, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_GameState) == 0x000130, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_Playlist) == 0x000138, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_PlaylistContextTags) == 0x000140, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000160, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00016C, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotFromZX_ReturnValue) == 0x000178, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Roll) == 0x000194, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Pitch) == 0x000198, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Yaw) == 0x00019C, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001A4, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotFromZX_ReturnValue_1) == 0x0001B0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotFromZX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001BC, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Roll_1) == 0x0001C8, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Pitch_1) == 0x0001CC, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Yaw_1) == 0x0001D0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotator_ReturnValue) == 0x0001D4, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001E0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeTransform_ReturnValue_1) == 0x0001F0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000220, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Subtract_IntInt_ReturnValue) == 0x00022C, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000230, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Roll_2) == 0x000234, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Pitch_2) == 0x000238, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Yaw_2) == 0x00023C, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_FloatFloat_ReturnValue) == 0x000240, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000244, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotator_ReturnValue_1) == 0x000248, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000254, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000260, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000270, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000278, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000284, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000290, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0002A0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_IntInt_ReturnValue) == 0x0002A8, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0002AC, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotFromZX_ReturnValue_2) == 0x0002B8, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotFromZX_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsServer_ReturnValue_2) == 0x0002C4, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Roll_3) == 0x0002C8, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Pitch_3) == 0x0002CC, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_BreakRotator_Yaw_3) == 0x0002D0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_MakeRotator_ReturnValue_2) == 0x0002D4, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0002E0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0002E4, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_ChestLoc) == 0x0002F0, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_ChestLoc' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, K2Node_CustomEvent_ChestRot) == 0x0002FC, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::K2Node_CustomEvent_ChestRot' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000308, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000394, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000395, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsValid_ReturnValue_1) == 0x000396, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest, CallFunc_IsValid_ReturnValue_2) == 0x000397, "Member 'Prop_Athena_BuriedChest_C_ExecuteUbergraph_Prop_Athena_BuriedChest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.ClientMoveChestRot
// 0x000C (0x000C - 0x0000)
struct Prop_Athena_BuriedChest_C_ClientMoveChestRot final
{
public:
	struct FRotator                               ChestRot;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_ClientMoveChestRot) == 0x000004, "Wrong alignment on Prop_Athena_BuriedChest_C_ClientMoveChestRot");
static_assert(sizeof(Prop_Athena_BuriedChest_C_ClientMoveChestRot) == 0x00000C, "Wrong size on Prop_Athena_BuriedChest_C_ClientMoveChestRot");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ClientMoveChestRot, ChestRot) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_ClientMoveChestRot::ChestRot' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.ClientMoveChestLoc
// 0x000C (0x000C - 0x0000)
struct Prop_Athena_BuriedChest_C_ClientMoveChestLoc final
{
public:
	struct FVector                                ChestLoc;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_ClientMoveChestLoc) == 0x000004, "Wrong alignment on Prop_Athena_BuriedChest_C_ClientMoveChestLoc");
static_assert(sizeof(Prop_Athena_BuriedChest_C_ClientMoveChestLoc) == 0x00000C, "Wrong size on Prop_Athena_BuriedChest_C_ClientMoveChestLoc");
static_assert(offsetof(Prop_Athena_BuriedChest_C_ClientMoveChestLoc, ChestLoc) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_ClientMoveChestLoc::ChestLoc' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.TriggerDigFX
// 0x000C (0x000C - 0x0000)
struct Prop_Athena_BuriedChest_C_TriggerDigFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_TriggerDigFX) == 0x000004, "Wrong alignment on Prop_Athena_BuriedChest_C_TriggerDigFX");
static_assert(sizeof(Prop_Athena_BuriedChest_C_TriggerDigFX) == 0x00000C, "Wrong size on Prop_Athena_BuriedChest_C_TriggerDigFX");
static_assert(offsetof(Prop_Athena_BuriedChest_C_TriggerDigFX, Location) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_TriggerDigFX::Location' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.OnDamageTaken
// 0x0050 (0x0050 - 0x0000)
struct Prop_Athena_BuriedChest_C_OnDamageTaken final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_OnDamageTaken) == 0x000008, "Wrong alignment on Prop_Athena_BuriedChest_C_OnDamageTaken");
static_assert(sizeof(Prop_Athena_BuriedChest_C_OnDamageTaken) == 0x000050, "Wrong size on Prop_Athena_BuriedChest_C_OnDamageTaken");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, DamagedActor) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::DamagedActor' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, Damage) == 0x000008, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::Damage' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, InstigatedBy) == 0x000010, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, DamageCauser) == 0x000018, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::DamageCauser' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, HitLocation) == 0x000020, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, FHitComponent) == 0x000030, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::FHitComponent' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, BoneName) == 0x000038, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::BoneName' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnDamageTaken, Momentum) == 0x000040, "Member 'Prop_Athena_BuriedChest_C_OnDamageTaken::Momentum' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.OnReady_063C028E4FA3620116C853828C1FABF5
// 0x0030 (0x0030 - 0x0000)
struct Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5) == 0x000008, "Wrong alignment on Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5");
static_assert(sizeof(Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5) == 0x000030, "Wrong size on Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5, GameState) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5::GameState' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5, Playlist) == 0x000008, "Member 'Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5::Playlist' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5, PlaylistContextTags) == 0x000010, "Member 'Prop_Athena_BuriedChest_C_OnReady_063C028E4FA3620116C853828C1FABF5::PlaylistContextTags' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.FindPlacementNormal
// 0x0140 (0x0140 - 0x0000)
struct Prop_Athena_BuriedChest_C_FindPlacementNormal final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0034(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65F5[0x1];                                     // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F6[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_Athena_BuriedChest_C_FindPlacementNormal) == 0x000008, "Wrong alignment on Prop_Athena_BuriedChest_C_FindPlacementNormal");
static_assert(sizeof(Prop_Athena_BuriedChest_C_FindPlacementNormal) == 0x000140, "Wrong size on Prop_Athena_BuriedChest_C_FindPlacementNormal");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, Temp_object_Variable) == 0x000000, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_Add_VectorVector_ReturnValue) == 0x00001C, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_LineTraceSingle_OutHit) == 0x000034, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_LineTraceSingle_ReturnValue) == 0x0000C0, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C1, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C2, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_Time) == 0x0000C4, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_Distance) == 0x0000C8, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_Location) == 0x0000CC, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D8, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_Normal) == 0x0000E4, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F0, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_PhysMat) == 0x000100, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_HitActor) == 0x000108, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_HitComponent) == 0x000110, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_HitBoneName) == 0x000118, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_HitItem) == 0x000120, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_FaceIndex) == 0x000124, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_TraceStart) == 0x000128, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_Athena_BuriedChest_C_FindPlacementNormal, CallFunc_BreakHitResult_TraceEnd) == 0x000134, "Member 'Prop_Athena_BuriedChest_C_FindPlacementNormal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function Prop_Athena_BuriedChest.Prop_Athena_BuriedChest_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct Prop_Athena_BuriedChest_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65F7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
