#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.ExecuteUbergraph_Prop_QuestInteractable_Parent
// 0x01D8 (0x01D8 - 0x0000)
struct Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_502E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PlaylistName;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0028(0x0020)(ConstParm)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0058(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5030[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5031[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5032[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5033[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5034[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_4; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_2;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5035[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0100(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5036[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_IneractingPawn;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5037[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn_1;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanProgressQuestInCurrentZone_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1; // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1; // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5038[0x2];                                     // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_CustomEvent_Controller;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortQuestItemDefinition*         K2Node_CustomEvent_QuestDef;                       // 0x0130(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BackendName;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CompletionCount;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ObjectiveCompleted;             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_QuestCompleted;                 // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5039[0x1];                                     // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPlayerController* Controller, class UFortQuestItemDefinition* QuestDef, class FName BackendName, int32 CompletionCount, bool ObjectiveCompleted, bool QuestCompleted)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortPlayerController* Controller, class UFortQuestItemDefinition* QuestDef, class FName BackendName, int32 CompletionCount, bool ObjectiveCompleted, bool QuestCompleted)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503A[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503B[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503C[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABuildingActor* SelfActor, class AFortPawn* InteractingPawn)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_CustomEvent_SelfActor;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503D[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_5; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective_1; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController_1; // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent) == 0x0001D8, "Wrong size on Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, EntryPoint) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_PlaylistName) == 0x000020, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_PlaylistName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000028, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000048, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000058, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000078, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000080, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1) == 0x000088, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000090, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective) == 0x000099, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController) == 0x00009A, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x0000A0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2) == 0x0000B0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_HasAnyTags_ReturnValue) == 0x0000B8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetQuestManager_ReturnValue_1) == 0x0000C0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3) == 0x0000C8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_AsFort_Player_Controller_Athena_1) == 0x0000D0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_AsFort_Player_Controller_Athena_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_4) == 0x0000E0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetQuestManager_ReturnValue_2) == 0x0000E8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetQuestManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x0000F0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x0000F1, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x0000F2, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_BooleanOR_ReturnValue) == 0x0000F3, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_Event_InteractingPawn) == 0x0000F8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000100, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_IneractingPawn) == 0x000108, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_IneractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_HasAuthority_ReturnValue_1) == 0x000110, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_InteractingPawn_1) == 0x000118, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_InteractingPawn_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_CanProgressQuestInCurrentZone_ReturnValue) == 0x000120, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_CanProgressQuestInCurrentZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1) == 0x000121, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1) == 0x000122, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1) == 0x000123, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x000124, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x000125, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_Controller) == 0x000128, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_QuestDef) == 0x000130, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_QuestDef' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_BackendName) == 0x000138, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_BackendName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_CompletionCount) == 0x000140, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_CompletionCount' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_ObjectiveCompleted) == 0x000144, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_QuestCompleted) == 0x000145, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_BooleanOR_ReturnValue_1) == 0x000146, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000158, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000168, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000169, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00016C, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_HasAuthority_ReturnValue_2) == 0x00017C, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetController_ReturnValue) == 0x000180, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000188, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000194, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_VLerp_ReturnValue) == 0x0001A4, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_SelfActor) == 0x0001B0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, K2Node_CustomEvent_InteractingPawn) == 0x0001B8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::K2Node_CustomEvent_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_HasAuthority_ReturnValue_3) == 0x0001C0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_BooleanOR_ReturnValue_2) == 0x0001C1, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_5) == 0x0001C8, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective_1) == 0x0001D0, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective_1' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent, CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController_1) == 0x0001D1, "Member 'Prop_QuestInteractable_Parent_C_ExecuteUbergraph_Prop_QuestInteractable_Parent::CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController_1' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.DebugModeForceInteract
// 0x0010 (0x0010 - 0x0000)
struct Prop_QuestInteractable_Parent_C_DebugModeForceInteract final
{
public:
	class ABuildingActor*                         SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Param_InteractingPawn;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_DebugModeForceInteract) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_DebugModeForceInteract");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_DebugModeForceInteract) == 0x000010, "Wrong size on Prop_QuestInteractable_Parent_C_DebugModeForceInteract");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_DebugModeForceInteract, SelfActor) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_DebugModeForceInteract::SelfActor' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_DebugModeForceInteract, Param_InteractingPawn) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_DebugModeForceInteract::Param_InteractingPawn' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.Server_QuestObjectiveUpdated
// 0x0020 (0x0020 - 0x0000)
struct Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated final
{
public:
	class AFortPlayerController*                  Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortQuestItemDefinition*         QuestDef;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackendName;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompletionCount;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ObjectiveCompleted;                                // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_QuestCompleted;                              // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated) == 0x000020, "Wrong size on Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, Controller) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::Controller' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, QuestDef) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::QuestDef' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, BackendName) == 0x000010, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::BackendName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, CompletionCount) == 0x000018, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::CompletionCount' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, ObjectiveCompleted) == 0x00001C, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated, Param_QuestCompleted) == 0x00001D, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveUpdated::Param_QuestCompleted' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.Server_QuestObjectiveCompleted
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted final
{
public:
	class AFortPawn*                              Param_InteractingPawn;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted) == 0x000008, "Wrong size on Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted, Param_InteractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_Server_QuestObjectiveCompleted::Param_InteractingPawn' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.ThisQuestObjectiveComplete
// 0x0008 (0x0008 - 0x0000)
struct Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete final
{
public:
	class AFortPawn*                              IneractingPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete) == 0x000008, "Wrong size on Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete, IneractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_ThisQuestObjectiveComplete::IneractingPawn' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Prop_QuestInteractable_Parent_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_BlueprintOnInteract");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_BlueprintOnInteract) == 0x000010, "Wrong size on Prop_QuestInteractable_Parent_C_BlueprintOnInteract");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintOnInteract, Param_InteractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_BlueprintOnInteract::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.PlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct Prop_QuestInteractable_Parent_C_PlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_PlaylistLoaded) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_PlaylistLoaded");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_PlaylistLoaded) == 0x000028, "Wrong size on Prop_QuestInteractable_Parent_C_PlaylistLoaded");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_PlaylistLoaded, PlaylistName) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_PlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_PlaylistLoaded, PlaylistContextTags) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_PlaylistLoaded::PlaylistContextTags' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.BlueprintCanInteract
// 0x0078 (0x0078 - 0x0000)
struct Prop_QuestInteractable_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          LocalVar_InteractQuestValid;                       // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0010(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503F[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5040[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5041[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0058(0x0020)()
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_BlueprintCanInteract");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract) == 0x000078, "Wrong size on Prop_QuestInteractable_Parent_C_BlueprintCanInteract");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, Param_InteractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, LocalVar_InteractQuestValid) == 0x00000B, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::LocalVar_InteractQuestValid' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, Temp_struct_Variable) == 0x000010, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_HasAuthority_ReturnValue) == 0x000031, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000034, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_HasAllTags_ReturnValue) == 0x000038, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000039, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000040, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintCanInteract, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000058, "Member 'Prop_QuestInteractable_Parent_C_BlueprintCanInteract::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");

// Function Prop_QuestInteractable_Parent.Prop_QuestInteractable_Parent_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5042[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString");
static_assert(sizeof(Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString, Param_InteractingPawn) == 0x000000, "Member 'Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'Prop_QuestInteractable_Parent_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
