#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_QuestInteractable_Letters_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Prop_QuestInteractable_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_QuestInteractable_Letters_Parent.Prop_QuestInteractable_Letters_Parent_C
// 0x00E0 (0x0DA0 - 0x0CC0)
class AProp_QuestInteractable_Letters_Parent_C final : public AProp_QuestInteractable_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_QuestInteractable_Letters_Parent_C; // 0x0CC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_GodBeam;                                         // 0x0CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       EndSpinExitOverlap;                                // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fortnite_Letter;                                // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StartSpinOverlap;                                  // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pop_Up_and_Down_GrowTime_BE3C9F7B49ACE94AC85D1B8E96A7C078; // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pop_Up_and_Down__Direction_BE3C9F7B49ACE94AC85D1B8E96A7C078; // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7445[0x3];                                     // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pop_Up_and_Down;                                   // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Drop_DropTime_945E1BDB4B79DE81B068A0BE6A074D74;    // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Drop__Direction_945E1BDB4B79DE81B068A0BE6A074D74;  // 0x0CFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7446[0x3];                                     // 0x0CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Drop;                                              // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BobAndSpin_Spin_723B279745C430D5597138A36F40421F;  // 0x0D08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BobAndSpin_Bob_723B279745C430D5597138A36F40421F;   // 0x0D0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BobAndSpin__Direction_723B279745C430D5597138A36F40421F; // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7447[0x7];                                     // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BobAndSpin;                                        // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LetterInitialLocation;                             // 0x0D20(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LetterInitialRotation;                             // 0x0D2C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                LetterCurrentLocation;                             // 0x0D38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LetterCurrentRotation;                             // 0x0D44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Max_Draw_Distance_StW;                             // 0x0D50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Draw_Distance_Athena;                          // 0x0D54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Draw_Distance_Bacchus;                         // 0x0D58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7448[0x4];                                     // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestItemDefinition*>       All_Quests;                                        // 0x0D60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Current_Letter_Int;                                // 0x0D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7449[0x4];                                     // 0x0D74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestItemDefinition*>       Completed_Quests;                                  // 0x0D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UFortQuestItemDefinition*>       Completed_Quests_Test;                             // 0x0D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          DebugLetters;                                      // 0x0D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_QuestInteractable_Letters_Parent(int32 EntryPoint);
	void SetMaxDrawDistance();
	void Set_Letter_at_Beginning();
	void PawnFarEnoughToEndBobbing(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void QuestUpdatedFromAnywhere();
	void PawnCloseEnoughToTriggerBobbing(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void QuestInitializedAndValid();
	void ThisQuestObjectiveComplete(class AFortPawn* IneractingPawn);
	void Pop_Up_and_Down__UpdateFunc();
	void Pop_Up_and_Down__FinishedFunc();
	void Drop__UpdateFunc();
	void Drop__FinishedFunc();
	void BobAndSpin__UpdateFunc();
	void BobAndSpin__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_QuestInteractable_Letters_Parent_C">();
	}
	static class AProp_QuestInteractable_Letters_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_QuestInteractable_Letters_Parent_C>();
	}
};
static_assert(alignof(AProp_QuestInteractable_Letters_Parent_C) == 0x000008, "Wrong alignment on AProp_QuestInteractable_Letters_Parent_C");
static_assert(sizeof(AProp_QuestInteractable_Letters_Parent_C) == 0x000DA0, "Wrong size on AProp_QuestInteractable_Letters_Parent_C");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, UberGraphFrame_Prop_QuestInteractable_Letters_Parent_C) == 0x000CC0, "Member 'AProp_QuestInteractable_Letters_Parent_C::UberGraphFrame_Prop_QuestInteractable_Letters_Parent_C' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, P_GodBeam) == 0x000CC8, "Member 'AProp_QuestInteractable_Letters_Parent_C::P_GodBeam' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, EndSpinExitOverlap) == 0x000CD0, "Member 'AProp_QuestInteractable_Letters_Parent_C::EndSpinExitOverlap' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, SM_Fortnite_Letter) == 0x000CD8, "Member 'AProp_QuestInteractable_Letters_Parent_C::SM_Fortnite_Letter' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, StartSpinOverlap) == 0x000CE0, "Member 'AProp_QuestInteractable_Letters_Parent_C::StartSpinOverlap' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Pop_Up_and_Down_GrowTime_BE3C9F7B49ACE94AC85D1B8E96A7C078) == 0x000CE8, "Member 'AProp_QuestInteractable_Letters_Parent_C::Pop_Up_and_Down_GrowTime_BE3C9F7B49ACE94AC85D1B8E96A7C078' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Pop_Up_and_Down__Direction_BE3C9F7B49ACE94AC85D1B8E96A7C078) == 0x000CEC, "Member 'AProp_QuestInteractable_Letters_Parent_C::Pop_Up_and_Down__Direction_BE3C9F7B49ACE94AC85D1B8E96A7C078' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Pop_Up_and_Down) == 0x000CF0, "Member 'AProp_QuestInteractable_Letters_Parent_C::Pop_Up_and_Down' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Drop_DropTime_945E1BDB4B79DE81B068A0BE6A074D74) == 0x000CF8, "Member 'AProp_QuestInteractable_Letters_Parent_C::Drop_DropTime_945E1BDB4B79DE81B068A0BE6A074D74' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Drop__Direction_945E1BDB4B79DE81B068A0BE6A074D74) == 0x000CFC, "Member 'AProp_QuestInteractable_Letters_Parent_C::Drop__Direction_945E1BDB4B79DE81B068A0BE6A074D74' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Drop) == 0x000D00, "Member 'AProp_QuestInteractable_Letters_Parent_C::Drop' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, BobAndSpin_Spin_723B279745C430D5597138A36F40421F) == 0x000D08, "Member 'AProp_QuestInteractable_Letters_Parent_C::BobAndSpin_Spin_723B279745C430D5597138A36F40421F' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, BobAndSpin_Bob_723B279745C430D5597138A36F40421F) == 0x000D0C, "Member 'AProp_QuestInteractable_Letters_Parent_C::BobAndSpin_Bob_723B279745C430D5597138A36F40421F' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, BobAndSpin__Direction_723B279745C430D5597138A36F40421F) == 0x000D10, "Member 'AProp_QuestInteractable_Letters_Parent_C::BobAndSpin__Direction_723B279745C430D5597138A36F40421F' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, BobAndSpin) == 0x000D18, "Member 'AProp_QuestInteractable_Letters_Parent_C::BobAndSpin' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, LetterInitialLocation) == 0x000D20, "Member 'AProp_QuestInteractable_Letters_Parent_C::LetterInitialLocation' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, LetterInitialRotation) == 0x000D2C, "Member 'AProp_QuestInteractable_Letters_Parent_C::LetterInitialRotation' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, LetterCurrentLocation) == 0x000D38, "Member 'AProp_QuestInteractable_Letters_Parent_C::LetterCurrentLocation' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, LetterCurrentRotation) == 0x000D44, "Member 'AProp_QuestInteractable_Letters_Parent_C::LetterCurrentRotation' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Max_Draw_Distance_StW) == 0x000D50, "Member 'AProp_QuestInteractable_Letters_Parent_C::Max_Draw_Distance_StW' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Max_Draw_Distance_Athena) == 0x000D54, "Member 'AProp_QuestInteractable_Letters_Parent_C::Max_Draw_Distance_Athena' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Max_Draw_Distance_Bacchus) == 0x000D58, "Member 'AProp_QuestInteractable_Letters_Parent_C::Max_Draw_Distance_Bacchus' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, All_Quests) == 0x000D60, "Member 'AProp_QuestInteractable_Letters_Parent_C::All_Quests' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Current_Letter_Int) == 0x000D70, "Member 'AProp_QuestInteractable_Letters_Parent_C::Current_Letter_Int' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Completed_Quests) == 0x000D78, "Member 'AProp_QuestInteractable_Letters_Parent_C::Completed_Quests' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, Completed_Quests_Test) == 0x000D88, "Member 'AProp_QuestInteractable_Letters_Parent_C::Completed_Quests_Test' has a wrong offset!");
static_assert(offsetof(AProp_QuestInteractable_Letters_Parent_C, DebugLetters) == 0x000D98, "Member 'AProp_QuestInteractable_Letters_Parent_C::DebugLetters' has a wrong offset!");

}

