#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PunchCardNotification

#include "Basic.hpp"


namespace SDK::Params
{

// Function PunchCardNotification.PunchCardNotification_C.XpSubNotification_Event_0
// 0x0008 (0x0008 - 0x0000)
struct PunchCardNotification_C_XpSubNotification_Event_0 final
{
public:
	class UXpSubNotification_C*                   Param_XpSubNotification;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PunchCardNotification_C_XpSubNotification_Event_0) == 0x000008, "Wrong alignment on PunchCardNotification_C_XpSubNotification_Event_0");
static_assert(sizeof(PunchCardNotification_C_XpSubNotification_Event_0) == 0x000008, "Wrong size on PunchCardNotification_C_XpSubNotification_Event_0");
static_assert(offsetof(PunchCardNotification_C_XpSubNotification_Event_0, Param_XpSubNotification) == 0x000000, "Member 'PunchCardNotification_C_XpSubNotification_Event_0::Param_XpSubNotification' has a wrong offset!");

// Function PunchCardNotification.PunchCardNotification_C.ExecuteUbergraph_PunchCardNotification
// 0x0030 (0x0030 - 0x0000)
struct PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7080[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UXpSubNotification_C*                   K2Node_CustomEvent_XpSubNotification;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification) == 0x000008, "Wrong alignment on PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification");
static_assert(sizeof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification) == 0x000030, "Wrong size on PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification");
static_assert(offsetof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification, EntryPoint) == 0x000000, "Member 'PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification, K2Node_CustomEvent_XpSubNotification) == 0x000008, "Member 'PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification::K2Node_CustomEvent_XpSubNotification' has a wrong offset!");
static_assert(offsetof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'PunchCardNotification_C_ExecuteUbergraph_PunchCardNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

