#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quad_Base_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Quad_Base_AnimBP_Base.Quad_Base_AnimBP_Base_C.ExecuteUbergraph_Quad_Base_AnimBP_Base
// 0x0004 (0x0004 - 0x0000)
struct Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base) == 0x000004, "Wrong alignment on Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base");
static_assert(sizeof(Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base) == 0x000004, "Wrong size on Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base");
static_assert(offsetof(Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base, EntryPoint) == 0x000000, "Member 'Quad_Base_AnimBP_Base_C_ExecuteUbergraph_Quad_Base_AnimBP_Base::EntryPoint' has a wrong offset!");

// Function Quad_Base_AnimBP_Base.Quad_Base_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Quad_Base_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Quad_Base_AnimBP_Base_C_AnimGraph) == 0x000008, "Wrong alignment on Quad_Base_AnimBP_Base_C_AnimGraph");
static_assert(sizeof(Quad_Base_AnimBP_Base_C_AnimGraph) == 0x000010, "Wrong size on Quad_Base_AnimBP_Base_C_AnimGraph");
static_assert(offsetof(Quad_Base_AnimBP_Base_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Quad_Base_AnimBP_Base_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

