#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestInteractable_Midas_Statue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuestInteractable_Midas_Statue.QuestInteractable_Midas_Statue_C
// 0x00B8 (0x0868 - 0x07B0)
class AQuestInteractable_Midas_Statue_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Midas_Lama_Statue;                              // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractCylinder;                                  // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UQuestInteractableComponent*            QuestInteractable;                                 // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PlayerNearTrigger;                                 // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackComponent*                ForceFeedback;                                     // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Sound;                                     // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          PCsOnQuest;                                        // 0x07E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AQuestVisual*>                   QuestVisuals;                                      // 0x0800(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          PCsThatCompletedQuest_Server;                      // 0x0810(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractMeshPlane_SetByRef;                        // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractLocation;                            // 0x0828(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77E8[0x4];                                     // 0x0834(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     InteractMaterial_SetByRef;                         // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectiveName;                                     // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             SuccessSound;                                      // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SuccessFX;                                         // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   SuccessFeedback;                                   // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractable;                                     // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_QuestInteractable_Midas_Statue(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_2_SimpleDynamicMulticastDelegate__DelegateSignature();
	void OnVisualCreated(class AQuestVisual* QuestVisual);
	void BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_3_SimpleDynamicMulticastDelegate__DelegateSignature();
	void BndEvt__QuestInteractable_K2Node_ComponentBoundEvent_4_SimpleDynamicMulticastDelegate__DelegateSignature();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void OnQuestsUpdated();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestInteractable_Midas_Statue_C">();
	}
	static class AQuestInteractable_Midas_Statue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AQuestInteractable_Midas_Statue_C>();
	}
};
static_assert(alignof(AQuestInteractable_Midas_Statue_C) == 0x000008, "Wrong alignment on AQuestInteractable_Midas_Statue_C");
static_assert(sizeof(AQuestInteractable_Midas_Statue_C) == 0x000868, "Wrong size on AQuestInteractable_Midas_Statue_C");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, UberGraphFrame) == 0x0007B0, "Member 'AQuestInteractable_Midas_Statue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, SM_Midas_Lama_Statue) == 0x0007B8, "Member 'AQuestInteractable_Midas_Statue_C::SM_Midas_Lama_Statue' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, InteractCylinder) == 0x0007C0, "Member 'AQuestInteractable_Midas_Statue_C::InteractCylinder' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, QuestInteractable) == 0x0007C8, "Member 'AQuestInteractable_Midas_Statue_C::QuestInteractable' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, PlayerNearTrigger) == 0x0007D0, "Member 'AQuestInteractable_Midas_Statue_C::PlayerNearTrigger' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, ForceFeedback) == 0x0007D8, "Member 'AQuestInteractable_Midas_Statue_C::ForceFeedback' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, Ambient_Sound) == 0x0007E0, "Member 'AQuestInteractable_Midas_Statue_C::Ambient_Sound' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, PCsOnQuest) == 0x0007E8, "Member 'AQuestInteractable_Midas_Statue_C::PCsOnQuest' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, QuestItem) == 0x0007F8, "Member 'AQuestInteractable_Midas_Statue_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, QuestVisuals) == 0x000800, "Member 'AQuestInteractable_Midas_Statue_C::QuestVisuals' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, PCsThatCompletedQuest_Server) == 0x000810, "Member 'AQuestInteractable_Midas_Statue_C::PCsThatCompletedQuest_Server' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, InteractMeshPlane_SetByRef) == 0x000820, "Member 'AQuestInteractable_Midas_Statue_C::InteractMeshPlane_SetByRef' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, MobileInteractLocation) == 0x000828, "Member 'AQuestInteractable_Midas_Statue_C::MobileInteractLocation' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, InteractMaterial_SetByRef) == 0x000838, "Member 'AQuestInteractable_Midas_Statue_C::InteractMaterial_SetByRef' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, ObjectiveName) == 0x000840, "Member 'AQuestInteractable_Midas_Statue_C::ObjectiveName' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, SuccessSound) == 0x000848, "Member 'AQuestInteractable_Midas_Statue_C::SuccessSound' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, SuccessFX) == 0x000850, "Member 'AQuestInteractable_Midas_Statue_C::SuccessFX' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, SuccessFeedback) == 0x000858, "Member 'AQuestInteractable_Midas_Statue_C::SuccessFeedback' has a wrong offset!");
static_assert(offsetof(AQuestInteractable_Midas_Statue_C, bInteractable) == 0x000860, "Member 'AQuestInteractable_Midas_Statue_C::bInteractable' has a wrong offset!");

}

