#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestsCountIconTabButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.SetTutorialNameID
// 0x0008 (0x0008 - 0x0000)
struct QuestsCountIconTabButton_C_SetTutorialNameID final
{
public:
	class FName                                   InTutorialBangID;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsCountIconTabButton_C_SetTutorialNameID) == 0x000004, "Wrong alignment on QuestsCountIconTabButton_C_SetTutorialNameID");
static_assert(sizeof(QuestsCountIconTabButton_C_SetTutorialNameID) == 0x000008, "Wrong size on QuestsCountIconTabButton_C_SetTutorialNameID");
static_assert(offsetof(QuestsCountIconTabButton_C_SetTutorialNameID, InTutorialBangID) == 0x000000, "Member 'QuestsCountIconTabButton_C_SetTutorialNameID::InTutorialBangID' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.Update Bang State
// 0x000C (0x000C - 0x0000)
struct QuestsCountIconTabButton_C_Update_Bang_State final
{
public:
	bool                                          Param_bBangEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F99[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestsCountIconTabButton_C_Update_Bang_State) == 0x000004, "Wrong alignment on QuestsCountIconTabButton_C_Update_Bang_State");
static_assert(sizeof(QuestsCountIconTabButton_C_Update_Bang_State) == 0x00000C, "Wrong size on QuestsCountIconTabButton_C_Update_Bang_State");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Bang_State, Param_bBangEnabled) == 0x000000, "Member 'QuestsCountIconTabButton_C_Update_Bang_State::Param_bBangEnabled' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Bang_State, Count) == 0x000004, "Member 'QuestsCountIconTabButton_C_Update_Bang_State::Count' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Bang_State, CallFunc_GetIsEnabled_ReturnValue) == 0x000008, "Member 'QuestsCountIconTabButton_C_Update_Bang_State::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Bang_State, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'QuestsCountIconTabButton_C_Update_Bang_State::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.Update Text
// 0x0080 (0x0080 - 0x0000)
struct QuestsCountIconTabButton_C_Update_Text final
{
public:
	int32                                         QuestCount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9B[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9C[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestCategory*>             CallFunc_GetCurrentQuestsCategories_Categories;    // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9D[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9E[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestCategory*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA0[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsCountIconTabButton_C_Update_Text) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_Update_Text");
static_assert(sizeof(QuestsCountIconTabButton_C_Update_Text) == 0x000080, "Wrong size on QuestsCountIconTabButton_C_Update_Text");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, QuestCount) == 0x000000, "Member 'QuestsCountIconTabButton_C_Update_Text::QuestCount' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'QuestsCountIconTabButton_C_Update_Text::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_GetCurrentQuestsCategories_Categories) == 0x000028, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_GetCurrentQuestsCategories_Categories' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'QuestsCountIconTabButton_C_Update_Text::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'QuestsCountIconTabButton_C_Update_Text::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Array_Get_Item) == 0x000050, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'QuestsCountIconTabButton_C_Update_Text::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_GetQuestState_ReturnValue) == 0x000070, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, Temp_int_Variable) == 0x000074, "Member 'QuestsCountIconTabButton_C_Update_Text::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Update_Text, CallFunc_Add_IntInt_ReturnValue_2) == 0x000078, "Member 'QuestsCountIconTabButton_C_Update_Text::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.SetTutorialBorderStyle
// 0x0008 (0x0008 - 0x0000)
struct QuestsCountIconTabButton_C_SetTutorialBorderStyle final
{
public:
	class UClass*                                 BorderStyle;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsCountIconTabButton_C_SetTutorialBorderStyle) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_SetTutorialBorderStyle");
static_assert(sizeof(QuestsCountIconTabButton_C_SetTutorialBorderStyle) == 0x000008, "Wrong size on QuestsCountIconTabButton_C_SetTutorialBorderStyle");
static_assert(offsetof(QuestsCountIconTabButton_C_SetTutorialBorderStyle, BorderStyle) == 0x000000, "Member 'QuestsCountIconTabButton_C_SetTutorialBorderStyle::BorderStyle' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.Set Icon
// 0x0088 (0x0088 - 0x0000)
struct QuestsCountIconTabButton_C_Set_Icon final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(QuestsCountIconTabButton_C_Set_Icon) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_Set_Icon");
static_assert(sizeof(QuestsCountIconTabButton_C_Set_Icon) == 0x000088, "Wrong size on QuestsCountIconTabButton_C_Set_Icon");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Icon, Param_IconBrush) == 0x000000, "Member 'QuestsCountIconTabButton_C_Set_Icon::Param_IconBrush' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.Set Text
// 0x0038 (0x0038 - 0x0000)
struct QuestsCountIconTabButton_C_Set_Text final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA1[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA2[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsCountIconTabButton_C_Set_Text) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_Set_Text");
static_assert(sizeof(QuestsCountIconTabButton_C_Set_Text) == 0x000038, "Wrong size on QuestsCountIconTabButton_C_Set_Text");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, Param_ButtonText) == 0x000000, "Member 'QuestsCountIconTabButton_C_Set_Text::Param_ButtonText' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'QuestsCountIconTabButton_C_Set_Text::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'QuestsCountIconTabButton_C_Set_Text::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'QuestsCountIconTabButton_C_Set_Text::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'QuestsCountIconTabButton_C_Set_Text::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_Set_Text, CallFunc_Create_Basic_Tooltip_Output) == 0x000030, "Member 'QuestsCountIconTabButton_C_Set_Text::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestsCountIconTabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestsCountIconTabButton_C_PreConstruct) == 0x000001, "Wrong alignment on QuestsCountIconTabButton_C_PreConstruct");
static_assert(sizeof(QuestsCountIconTabButton_C_PreConstruct) == 0x000001, "Wrong size on QuestsCountIconTabButton_C_PreConstruct");
static_assert(offsetof(QuestsCountIconTabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'QuestsCountIconTabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.SetTabLabelInfo
// 0x00A0 (0x00A0 - 0x0000)
struct QuestsCountIconTabButton_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(QuestsCountIconTabButton_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_SetTabLabelInfo");
static_assert(sizeof(QuestsCountIconTabButton_C_SetTabLabelInfo) == 0x0000A0, "Wrong size on QuestsCountIconTabButton_C_SetTabLabelInfo");
static_assert(offsetof(QuestsCountIconTabButton_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'QuestsCountIconTabButton_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function QuestsCountIconTabButton.QuestsCountIconTabButton_C.ExecuteUbergraph_QuestsCountIconTabButton
// 0x00F0 (0x00F0 - 0x0000)
struct QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0008(0x00A0)(ConstParm)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_4;      // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_5;      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA3[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_6;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA4[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton) == 0x000008, "Wrong alignment on QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton");
static_assert(sizeof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton) == 0x0000F0, "Wrong size on QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, EntryPoint) == 0x000000, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetSelected_ReturnValue) == 0x000004, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetSelected_ReturnValue_1) == 0x000005, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000006, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000007, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, K2Node_Event_TabLabelInfo) == 0x000008, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x0000A8, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x0000A9, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000AA, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_4) == 0x0000AB, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_5) == 0x0000AC, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, K2Node_Event_IsDesignTime) == 0x0000AD, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x0000B0, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_EqualEqual_ClassClass_ReturnValue_6) == 0x0000B8, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_EqualEqual_ClassClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue_1) == 0x0000C0, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetContext_ReturnValue) == 0x0000C8, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_GetQuestManager_ReturnValue) == 0x0000E0, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'QuestsCountIconTabButton_C_ExecuteUbergraph_QuestsCountIconTabButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

