#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestVisual_XPCoin_Hidden

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.ExecuteUbergraph_QuestVisual_XPCoin_Hidden
// 0x06D0 (0x06D0 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85C7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85C8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_Select_Default;                             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85C9[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85CA[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85CB[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00F8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0184(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85CC[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85CD[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_Event_PlayerController;                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingProp*                          K2Node_CustomEvent_HidingProp;                     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_VFXStreaks_Height;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_VFXStreaks_Radius;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AdditionalStreaks;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StreaksScaleMultiplier;         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpawnOffset;                    // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VFXStreaks_Offset;              // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_VFXGlowOffset;                  // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_VFXGlow_Scale;                  // 0x02A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85CE[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02F8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0384(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0410(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85CF[0x3];                                     // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x04BC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0548(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_85D0[0x4];                                     // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x05E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x05EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0628(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x06B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden) == 0x0006D0, "Wrong size on QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, EntryPoint) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, Temp_byte_Variable) == 0x000004, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_GetSocketLocation_ReturnValue) == 0x000024, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_VLerp_ReturnValue) == 0x00003C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000048, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_MakeRotator_ReturnValue) == 0x000054, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_Select_Default) == 0x000080, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Roll) == 0x000098, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Pitch) == 0x00009C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Yaw) == 0x0000A0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000B0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_VLerp_ReturnValue_1) == 0x0000B8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_MakeRotator_ReturnValue_1) == 0x0000C8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000D8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000E0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000E8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000F0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000F4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_SweepResult) == 0x0000F8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000184, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000210, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000220, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherActor) == 0x000228, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherComp) == 0x000230, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000238, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_Event_PlayerController) == 0x000240, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_LinearColorLerp_ReturnValue) == 0x000248, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000258, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_HidingProp) == 0x000268, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_HidingProp' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_VFXStreaks_Height) == 0x000270, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_VFXStreaks_Height' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_VFXStreaks_Radius) == 0x000274, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_VFXStreaks_Radius' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_AdditionalStreaks) == 0x000278, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_AdditionalStreaks' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_StreaksScaleMultiplier) == 0x00027C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_StreaksScaleMultiplier' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_SpawnOffset) == 0x000280, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_SpawnOffset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_VFXStreaks_Offset) == 0x00028C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_VFXStreaks_Offset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_VFXGlowOffset) == 0x000298, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_VFXGlowOffset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, K2Node_CustomEvent_VFXGlow_Scale) == 0x0002A4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::K2Node_CustomEvent_VFXGlow_Scale' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0002AC, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002B8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_IsValid_ReturnValue_1) == 0x0002C0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002C4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_VLerp_ReturnValue_2) == 0x0002C8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_VInterpTo_ReturnValue) == 0x0002D4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Add_VectorVector_ReturnValue) == 0x0002E0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002EC, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002F8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000384, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000410, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Roll_1) == 0x00049C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Pitch_1) == 0x0004A0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_BreakRotator_Yaw_1) == 0x0004A4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_IsValid_ReturnValue_2) == 0x0004A8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0004AC, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_MakeRotator_ReturnValue_2) == 0x0004B0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0004BC, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000548, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0005D8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_GetComponentScale_ReturnValue) == 0x0005E0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0005EC, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0005F8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000604, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000610, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00061C, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000628, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x0006B4, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x0006C0, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0006C8, "Member 'QuestVisual_XPCoin_Hidden_C_ExecuteUbergraph_QuestVisual_XPCoin_Hidden::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.BindHideProp
// 0x0048 (0x0048 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_BindHideProp final
{
public:
	class ABuildingProp*                          Param_HidingProp;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_VFXStreaks_Height;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_VFXStreaks_Radius;                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_AdditionalStreaks;                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_StreaksScaleMultiplier;                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnOffset;                                       // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param_VFXStreaks_Offset;                           // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param_VFXGlowOffset;                               // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_VFXGlow_Scale;                               // 0x003C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_BindHideProp) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_BindHideProp");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_BindHideProp) == 0x000048, "Wrong size on QuestVisual_XPCoin_Hidden_C_BindHideProp");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_HidingProp) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_HidingProp' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_VFXStreaks_Height) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_VFXStreaks_Height' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_VFXStreaks_Radius) == 0x00000C, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_VFXStreaks_Radius' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_AdditionalStreaks) == 0x000010, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_AdditionalStreaks' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_StreaksScaleMultiplier) == 0x000014, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_StreaksScaleMultiplier' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, SpawnOffset) == 0x000018, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::SpawnOffset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_VFXStreaks_Offset) == 0x000024, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_VFXStreaks_Offset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_VFXGlowOffset) == 0x000030, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_VFXGlowOffset' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BindHideProp, Param_VFXGlow_Scale) == 0x00003C, "Member 'QuestVisual_XPCoin_Hidden_C_BindHideProp::Param_VFXGlow_Scale' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.ObjectiveCompleted
// 0x0008 (0x0008 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted) == 0x000008, "Wrong size on QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted, PlayerController) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_ObjectiveCompleted::PlayerController' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85D1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'QuestVisual_XPCoin_Hidden_C_BndEvt__SpinOverlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85D2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_UserConstructionScript");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript) == 0x000018, "Wrong size on QuestVisual_XPCoin_Hidden_C_UserConstructionScript");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_IsMobilePlatform_ReturnValue) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000010, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_UserConstructionScript, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'QuestVisual_XPCoin_Hidden_C_UserConstructionScript::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function QuestVisual_XPCoin_Hidden.QuestVisual_XPCoin_Hidden_C.set Niagara System User Variable (Color)
// 0x0038 (0x0038 - 0x0000)
struct QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_ final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0018(0x0020)()
};
static_assert(alignof(QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_) == 0x000008, "Wrong alignment on QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_");
static_assert(sizeof(QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_) == 0x000038, "Wrong size on QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_, Param_Name) == 0x000000, "Member 'QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_::Param_Name' has a wrong offset!");
static_assert(offsetof(QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_, Value) == 0x000008, "Member 'QuestVisual_XPCoin_Hidden_C_Set_Niagara_System_User_Variable__Color_::Value' has a wrong offset!");
