#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestsCountIconTabButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestsCountIconTabButton.QuestsCountIconTabButton_C
// 0x0100 (0x0C70 - 0x0B70)
class UQuestsCountIconTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNormalBangWrapper_C*                   BangWrapper;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0B98(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0BB0(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F98[0x3];                                     // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x0C3C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x0C4C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x0C5C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x0C6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetTutorialNameID(class FName InTutorialBangID);
	void Update_Bang_State(bool Param_bBangEnabled, int32 Count);
	void Update_Text();
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void ShowText();
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void Set_Text(const class FText& Param_ButtonText);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void BP_OnSelected();
	void BP_OnDeselected();
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Handle_Quest_Count_Updated();
	void BP_OnEnabled();
	void BP_OnDisabled();
	void ExecuteUbergraph_QuestsCountIconTabButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestsCountIconTabButton_C">();
	}
	static class UQuestsCountIconTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestsCountIconTabButton_C>();
	}
};
static_assert(alignof(UQuestsCountIconTabButton_C) == 0x000008, "Wrong alignment on UQuestsCountIconTabButton_C");
static_assert(sizeof(UQuestsCountIconTabButton_C) == 0x000C70, "Wrong size on UQuestsCountIconTabButton_C");
static_assert(offsetof(UQuestsCountIconTabButton_C, UberGraphFrame) == 0x000B70, "Member 'UQuestsCountIconTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, BangWrapper) == 0x000B78, "Member 'UQuestsCountIconTabButton_C::BangWrapper' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, CenterButtonTextWidget) == 0x000B80, "Member 'UQuestsCountIconTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, ContentHB) == 0x000B88, "Member 'UQuestsCountIconTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, LeftSideImage) == 0x000B90, "Member 'UQuestsCountIconTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, ButtonText) == 0x000B98, "Member 'UQuestsCountIconTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, IconBrush) == 0x000BB0, "Member 'UQuestsCountIconTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, UseText) == 0x000C38, "Member 'UQuestsCountIconTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, SelectedIconTint) == 0x000C3C, "Member 'UQuestsCountIconTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, DeselectedIconTint) == 0x000C4C, "Member 'UQuestsCountIconTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, HoveredIconTint) == 0x000C5C, "Member 'UQuestsCountIconTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UQuestsCountIconTabButton_C, bBangEnabled) == 0x000C6C, "Member 'UQuestsCountIconTabButton_C::bBangEnabled' has a wrong offset!");

}

