#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootCardsCollectedWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootCardsCollectedWidget.RebootCardsCollectedWidget_C
// 0x0048 (0x02A8 - 0x0260)
class URebootCardsCollectedWidget_C final : public UFortRebootCardsCollectedWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Updated;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Background;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRebootIcon;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Split3;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Value;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DisplayedValue;                                    // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResurectionEnabled;                                // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateVisibilityForMobileLayoutEditor(bool bInLayoutMode);
	void UpdateValue(int32 NewValue);
	void OnReady_1322D398497ABA072C45A2B029375E2D(class AGameStateBase* GameState);
	void Construct();
	void OnRebootCardsCollectedChanged();
	void ExecuteUbergraph_RebootCardsCollectedWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootCardsCollectedWidget_C">();
	}
	static class URebootCardsCollectedWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootCardsCollectedWidget_C>();
	}
};
static_assert(alignof(URebootCardsCollectedWidget_C) == 0x000008, "Wrong alignment on URebootCardsCollectedWidget_C");
static_assert(sizeof(URebootCardsCollectedWidget_C) == 0x0002A8, "Wrong size on URebootCardsCollectedWidget_C");
static_assert(offsetof(URebootCardsCollectedWidget_C, UberGraphFrame) == 0x000260, "Member 'URebootCardsCollectedWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, Updated) == 0x000268, "Member 'URebootCardsCollectedWidget_C::Updated' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, IntroAnim) == 0x000270, "Member 'URebootCardsCollectedWidget_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, Background) == 0x000278, "Member 'URebootCardsCollectedWidget_C::Background' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, ImageRebootIcon) == 0x000280, "Member 'URebootCardsCollectedWidget_C::ImageRebootIcon' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, SizeBoxContainer) == 0x000288, "Member 'URebootCardsCollectedWidget_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, Split3) == 0x000290, "Member 'URebootCardsCollectedWidget_C::Split3' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, Value) == 0x000298, "Member 'URebootCardsCollectedWidget_C::Value' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, DisplayedValue) == 0x0002A0, "Member 'URebootCardsCollectedWidget_C::DisplayedValue' has a wrong offset!");
static_assert(offsetof(URebootCardsCollectedWidget_C, ResurectionEnabled) == 0x0002A4, "Member 'URebootCardsCollectedWidget_C::ResurectionEnabled' has a wrong offset!");

}

