#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedeemFriendCodeWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RedeemFriendCodeWindow.RedeemFriendCodeWindow_C
// 0x0068 (0x04B8 - 0x0450)
class URedeemFriendCodeWindow_C final : public UFortRedeemCodeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCloseButton_C*                         Button_Cancel;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EntryProgressSwitcher;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EntryVBox;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgressSizeBox;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ProgressText;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RedeemButton;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleRedeemCodeComplete(bool Success, ERedeemCodeFailureReason FailureReason);
	void Close();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_57_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SendButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnRedeemFriendCodeComplete(bool bSuccess, ERedeemCodeFailureReason FailureReason);
	void Construct();
	void BndEvt__FriendCodeEntry_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_RedeemFriendCodeWindow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RedeemFriendCodeWindow_C">();
	}
	static class URedeemFriendCodeWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedeemFriendCodeWindow_C>();
	}
};
static_assert(alignof(URedeemFriendCodeWindow_C) == 0x000008, "Wrong alignment on URedeemFriendCodeWindow_C");
static_assert(sizeof(URedeemFriendCodeWindow_C) == 0x0004B8, "Wrong size on URedeemFriendCodeWindow_C");
static_assert(offsetof(URedeemFriendCodeWindow_C, UberGraphFrame) == 0x000450, "Member 'URedeemFriendCodeWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, Button_Cancel) == 0x000458, "Member 'URedeemFriendCodeWindow_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, CancelButton) == 0x000460, "Member 'URedeemFriendCodeWindow_C::CancelButton' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, EntryProgressSwitcher) == 0x000468, "Member 'URedeemFriendCodeWindow_C::EntryProgressSwitcher' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, EntryVBox) == 0x000470, "Member 'URedeemFriendCodeWindow_C::EntryVBox' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, ErrorText) == 0x000478, "Member 'URedeemFriendCodeWindow_C::ErrorText' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, Image_0) == 0x000480, "Member 'URedeemFriendCodeWindow_C::Image_0' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, Lightbox) == 0x000488, "Member 'URedeemFriendCodeWindow_C::Lightbox' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, ProgressSizeBox) == 0x000490, "Member 'URedeemFriendCodeWindow_C::ProgressSizeBox' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, ProgressText) == 0x000498, "Member 'URedeemFriendCodeWindow_C::ProgressText' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, ProgressVBox) == 0x0004A0, "Member 'URedeemFriendCodeWindow_C::ProgressVBox' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, RedeemButton) == 0x0004A8, "Member 'URedeemFriendCodeWindow_C::RedeemButton' has a wrong offset!");
static_assert(offsetof(URedeemFriendCodeWindow_C, Title) == 0x0004B0, "Member 'URedeemFriendCodeWindow_C::Title' has a wrong offset!");

}

