#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S12BP_MusicController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TimeSynthController_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass S12BP_MusicController.S12BP_MusicController_C
// 0x0020 (0x02B0 - 0x0290)
class AS12BP_MusicController_C final : public ABP_TimeSynthController_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_S12BP_MusicController_C;            // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TimeSynthTrackComponent_C*          BP_TimeSynthTrackComponent;                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTimeSynthClip*                         Clip1;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeSynthClip*                         Clip2;                                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_S12BP_MusicController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"S12BP_MusicController_C">();
	}
	static class AS12BP_MusicController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AS12BP_MusicController_C>();
	}
};
static_assert(alignof(AS12BP_MusicController_C) == 0x000008, "Wrong alignment on AS12BP_MusicController_C");
static_assert(sizeof(AS12BP_MusicController_C) == 0x0002B0, "Wrong size on AS12BP_MusicController_C");
static_assert(offsetof(AS12BP_MusicController_C, UberGraphFrame_S12BP_MusicController_C) == 0x000290, "Member 'AS12BP_MusicController_C::UberGraphFrame_S12BP_MusicController_C' has a wrong offset!");
static_assert(offsetof(AS12BP_MusicController_C, BP_TimeSynthTrackComponent) == 0x000298, "Member 'AS12BP_MusicController_C::BP_TimeSynthTrackComponent' has a wrong offset!");
static_assert(offsetof(AS12BP_MusicController_C, Clip1) == 0x0002A0, "Member 'AS12BP_MusicController_C::Clip1' has a wrong offset!");
static_assert(offsetof(AS12BP_MusicController_C, Clip2) == 0x0002A8, "Member 'AS12BP_MusicController_C::Clip2' has a wrong offset!");

}

