#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: School_Clock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass School_Clock.School_CLock_C
// 0x0020 (0x0BE0 - 0x0BC0)
class ASchool_CLock_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MinuteHandMesh;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HourHandMesh;                                      // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_School_Clock(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"School_CLock_C">();
	}
	static class ASchool_CLock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASchool_CLock_C>();
	}
};
static_assert(alignof(ASchool_CLock_C) == 0x000008, "Wrong alignment on ASchool_CLock_C");
static_assert(sizeof(ASchool_CLock_C) == 0x000BE0, "Wrong size on ASchool_CLock_C");
static_assert(offsetof(ASchool_CLock_C, UberGraphFrame) == 0x000BC0, "Member 'ASchool_CLock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, MinuteHandMesh) == 0x000BC8, "Member 'ASchool_CLock_C::MinuteHandMesh' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, HourHandMesh) == 0x000BD0, "Member 'ASchool_CLock_C::HourHandMesh' has a wrong offset!");
static_assert(offsetof(ASchool_CLock_C, Box1) == 0x000BD8, "Member 'ASchool_CLock_C::Box1' has a wrong offset!");

}

