#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scoreboard_UI_Row

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.WinnerCalloutAnim
// 0x0008 (0x0008 - 0x0000)
struct Scoreboard_UI_Row_C_WinnerCalloutAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_UI_Row_C_WinnerCalloutAnim) == 0x000008, "Wrong alignment on Scoreboard_UI_Row_C_WinnerCalloutAnim");
static_assert(sizeof(Scoreboard_UI_Row_C_WinnerCalloutAnim) == 0x000008, "Wrong size on Scoreboard_UI_Row_C_WinnerCalloutAnim");
static_assert(offsetof(Scoreboard_UI_Row_C_WinnerCalloutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Scoreboard_UI_Row_C_WinnerCalloutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.UpdateMedalStanding
// 0x001C (0x001C - 0x0000)
struct Scoreboard_UI_Row_C_UpdateMedalStanding final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A87[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A88[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_UI_Row_C_UpdateMedalStanding) == 0x000004, "Wrong alignment on Scoreboard_UI_Row_C_UpdateMedalStanding");
static_assert(sizeof(Scoreboard_UI_Row_C_UpdateMedalStanding) == 0x00001C, "Wrong size on Scoreboard_UI_Row_C_UpdateMedalStanding");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, Temp_byte_Variable) == 0x000000, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, Temp_byte_Variable_1) == 0x000001, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, Temp_bool_Variable) == 0x000002, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, Temp_bool_Variable_1) == 0x000003, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, CallFunc_GetNumWidgets_ReturnValue) == 0x000008, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, K2Node_Select_Default) == 0x000010, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000011, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateMedalStanding, K2Node_Select_Default_1) == 0x000018, "Member 'Scoreboard_UI_Row_C_UpdateMedalStanding::K2Node_Select_Default_1' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.UpdateRowVisuals
// 0x0050 (0x0050 - 0x0000)
struct Scoreboard_UI_Row_C_UpdateRowVisuals final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A89[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A8A[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_UI_Row_C_UpdateRowVisuals) == 0x000008, "Wrong alignment on Scoreboard_UI_Row_C_UpdateRowVisuals");
static_assert(sizeof(Scoreboard_UI_Row_C_UpdateRowVisuals) == 0x000050, "Wrong size on Scoreboard_UI_Row_C_UpdateRowVisuals");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_byte_Variable) == 0x000000, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_byte_Variable_1) == 0x000001, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_bool_Variable) == 0x000002, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_byte_Variable_2) == 0x000004, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_byte_Variable_3) == 0x000005, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, Temp_bool_Variable_1) == 0x000028, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, K2Node_Select_Default) == 0x000029, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdateRowVisuals, K2Node_Select_Default_1) == 0x000048, "Member 'Scoreboard_UI_Row_C_UpdateRowVisuals::K2Node_Select_Default_1' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.UpdatePlayerData
// 0x0040 (0x0040 - 0x0000)
struct Scoreboard_UI_Row_C_UpdatePlayerData final
{
public:
	struct FMinigameScoreboardPlayerRow           Param_PlayerBucketData;                            // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Scoreboard_UI_Row_C_UpdatePlayerData) == 0x000008, "Wrong alignment on Scoreboard_UI_Row_C_UpdatePlayerData");
static_assert(sizeof(Scoreboard_UI_Row_C_UpdatePlayerData) == 0x000040, "Wrong size on Scoreboard_UI_Row_C_UpdatePlayerData");
static_assert(offsetof(Scoreboard_UI_Row_C_UpdatePlayerData, Param_PlayerBucketData) == 0x000000, "Member 'Scoreboard_UI_Row_C_UpdatePlayerData::Param_PlayerBucketData' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.FillStatData
// 0x0098 (0x0098 - 0x0000)
struct Scoreboard_UI_Row_C_FillStatData final
{
public:
	TArray<struct FMinigameScoreboardValue>       StatValues;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8B[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8C[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatStat_ReturnValue;                   // 0x0038(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8D[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0058(0x0028)()
	class UTextBlock*                             CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8E[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scoreboard_UI_Row_C_FillStatData) == 0x000008, "Wrong alignment on Scoreboard_UI_Row_C_FillStatData");
static_assert(sizeof(Scoreboard_UI_Row_C_FillStatData) == 0x000098, "Wrong size on Scoreboard_UI_Row_C_FillStatData");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, StatValues) == 0x000000, "Member 'Scoreboard_UI_Row_C_FillStatData::StatValues' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Scoreboard_UI_Row_C_FillStatData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_Get_Item) == 0x000020, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Scoreboard_UI_Row_C_FillStatData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000030, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000031, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_FormatStat_ReturnValue) == 0x000038, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_FormatStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, Temp_bool_Variable) == 0x000051, "Member 'Scoreboard_UI_Row_C_FillStatData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, K2Node_Select_Default) == 0x000058, "Member 'Scoreboard_UI_Row_C_FillStatData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_Array_Length_ReturnValue_2) == 0x000090, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_FillStatData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000094, "Member 'Scoreboard_UI_Row_C_FillStatData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Scoreboard_UI_Row_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scoreboard_UI_Row_C_PreConstruct) == 0x000001, "Wrong alignment on Scoreboard_UI_Row_C_PreConstruct");
static_assert(sizeof(Scoreboard_UI_Row_C_PreConstruct) == 0x000001, "Wrong size on Scoreboard_UI_Row_C_PreConstruct");
static_assert(offsetof(Scoreboard_UI_Row_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Scoreboard_UI_Row_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Scoreboard_UI_Row.Scoreboard_UI_Row_C.ExecuteUbergraph_Scoreboard_UI_Row
// 0x0040 (0x0040 - 0x0000)
struct Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A8F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A90[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USizeBox*>                       K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UHorizontalBox*>                 K2Node_MakeArray_Array_2;                          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row) == 0x000008, "Wrong alignment on Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row");
static_assert(sizeof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row) == 0x000040, "Wrong size on Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row");
static_assert(offsetof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row, EntryPoint) == 0x000000, "Member 'Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row, K2Node_MakeArray_Array) == 0x000008, "Member 'Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row, K2Node_Event_IsDesignTime) == 0x000018, "Member 'Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row, K2Node_MakeArray_Array_1) == 0x000020, "Member 'Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row, K2Node_MakeArray_Array_2) == 0x000030, "Member 'Scoreboard_UI_Row_C_ExecuteUbergraph_Scoreboard_UI_Row::K2Node_MakeArray_Array_2' has a wrong offset!");

}

