#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShoppingCartSK_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.ExecuteUbergraph_ShoppingCartSK_AnimBP
// 0x0014 (0x0014 - 0x0000)
struct ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP) == 0x000004, "Wrong alignment on ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP");
static_assert(sizeof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP) == 0x000014, "Wrong size on ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, EntryPoint) == 0x000000, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000006, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000007, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000009, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x00000C, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000010, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000011, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'ShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ShoppingCartSK_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ShoppingCartSK_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ShoppingCartSK_AnimBP_C_AnimGraph");
static_assert(sizeof(ShoppingCartSK_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on ShoppingCartSK_AnimBP_C_AnimGraph");
static_assert(offsetof(ShoppingCartSK_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ShoppingCartSK_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

