#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownPin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownPin.ShowdownPin_C
// 0x0098 (0x06A8 - 0x0610)
class UShowdownPin_C final : public UFortShowdownPin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_NoPinPts;                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PinPts;                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PinShadow;                                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoPinContent;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinIcon;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NoPinScoreText;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinShadow;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PinContent;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PinIcon;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PinInfoSwitcher;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PinScoreText;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PointValuesProgress;                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPointValues;                            // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bRepresentsTournamentBestPin;                      // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DEVShowPin;                                        // 0x0699(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HidePoints;                                        // 0x069A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51FD[0x1];                                     // 0x069B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DEVPinScore;                                       // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ColorSilhouette;                                   // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideBackplate;                                     // 0x06A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Refresh();
	void RefreshDataBP();
	void PreConstruct(bool IsDesignTime);
	void EventSetTier(int32 Score);
	void EventFixPts(int32 Points);
	void EventColorize();
	void EventRevealAnim();
	void ExecuteUbergraph_ShowdownPin(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownPin_C">();
	}
	static class UShowdownPin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownPin_C>();
	}
};
static_assert(alignof(UShowdownPin_C) == 0x000008, "Wrong alignment on UShowdownPin_C");
static_assert(sizeof(UShowdownPin_C) == 0x0006A8, "Wrong size on UShowdownPin_C");
static_assert(offsetof(UShowdownPin_C, UberGraphFrame) == 0x000610, "Member 'UShowdownPin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Hover) == 0x000618, "Member 'UShowdownPin_C::Hover' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Focus) == 0x000620, "Member 'UShowdownPin_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Reveal) == 0x000628, "Member 'UShowdownPin_C::Reveal' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_NoPinPts) == 0x000630, "Member 'UShowdownPin_C::CommonTextBlock_NoPinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_PinPts) == 0x000638, "Member 'UShowdownPin_C::CommonTextBlock_PinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Image_PinShadow) == 0x000640, "Member 'UShowdownPin_C::Image_PinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinContent) == 0x000648, "Member 'UShowdownPin_C::NoPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinIcon) == 0x000650, "Member 'UShowdownPin_C::NoPinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinScoreText) == 0x000658, "Member 'UShowdownPin_C::NoPinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinShadow) == 0x000660, "Member 'UShowdownPin_C::NoPinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinContent) == 0x000668, "Member 'UShowdownPin_C::PinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinIcon) == 0x000670, "Member 'UShowdownPin_C::PinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinInfoSwitcher) == 0x000678, "Member 'UShowdownPin_C::PinInfoSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinScoreText) == 0x000680, "Member 'UShowdownPin_C::PinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBox_PointValuesProgress) == 0x000688, "Member 'UShowdownPin_C::VerticalBox_PointValuesProgress' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBoxPointValues) == 0x000690, "Member 'UShowdownPin_C::VerticalBoxPointValues' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, bRepresentsTournamentBestPin) == 0x000698, "Member 'UShowdownPin_C::bRepresentsTournamentBestPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVShowPin) == 0x000699, "Member 'UShowdownPin_C::DEVShowPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, HidePoints) == 0x00069A, "Member 'UShowdownPin_C::HidePoints' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVPinScore) == 0x00069C, "Member 'UShowdownPin_C::DEVPinScore' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, ColorSilhouette) == 0x0006A0, "Member 'UShowdownPin_C::ColorSilhouette' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, HideBackplate) == 0x0006A1, "Member 'UShowdownPin_C::HideBackplate' has a wrong offset!");

}

