#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentTile.ShowdownTournamentTile_C
// 0x0030 (0x0BC0 - 0x0B90)
class UShowdownTournamentTile_C final : public UFortShowdownTournamentTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SizeUp;                                            // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeFocus;                                       // 0x0BA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_TileFade;                                    // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PosterSizeBox;                                     // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFaded;                                           // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BP_OnSelected();
	void BP_OnDeselected();
	void EventFade(bool FadeOut);
	void ExecuteUbergraph_ShowdownTournamentTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentTile_C">();
	}
	static class UShowdownTournamentTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentTile_C>();
	}
};
static_assert(alignof(UShowdownTournamentTile_C) == 0x000008, "Wrong alignment on UShowdownTournamentTile_C");
static_assert(sizeof(UShowdownTournamentTile_C) == 0x000BC0, "Wrong size on UShowdownTournamentTile_C");
static_assert(offsetof(UShowdownTournamentTile_C, UberGraphFrame) == 0x000B90, "Member 'UShowdownTournamentTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, SizeUp) == 0x000B98, "Member 'UShowdownTournamentTile_C::SizeUp' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, ChangeFocus) == 0x000BA0, "Member 'UShowdownTournamentTile_C::ChangeFocus' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, Image_TileFade) == 0x000BA8, "Member 'UShowdownTournamentTile_C::Image_TileFade' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, PosterSizeBox) == 0x000BB0, "Member 'UShowdownTournamentTile_C::PosterSizeBox' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, IsFaded) == 0x000BB8, "Member 'UShowdownTournamentTile_C::IsFaded' has a wrong offset!");

}

