#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownEventTileInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownEventTileInfo.ShowdownEventTileInfo_C
// 0x0100 (0x0710 - 0x0610)
class UShowdownEventTileInfo_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusPin;                                          // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideSocketShadow_Past;                             // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideSocketShadow;                                  // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Ended;                                       // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionSize;                                    // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Date;                                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Score;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_pts;                               // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_EventPinState;                // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TimeFormat;                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TimeFormatTitle;              // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content_Score;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DateText;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Socket;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxPin;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ScoreValue;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_EventWindowUnlockState;                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimeDescriptionText;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimeDescriptionTextRelative;                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SetEventState;                                     // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEnded;                                           // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPin;                                             // 0x06D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77AC[0x6];                                     // 0x06DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SetDisplayInfo;                                    // 0x06E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               TextFontMaterial;                                  // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PointFontMaterial;                                 // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             MultiRoundSession;                                 // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void RefreshDataBP();
	void EventAnimFocus(bool In);
	void EventStyleSocket();
	void EventAnimHover(bool In);
	void Construct();
	void EventColorize();
	void ExecuteUbergraph_ShowdownEventTileInfo(int32 EntryPoint);
	void MultiRoundSession__DelegateSignature();
	void SetDisplayInfo__DelegateSignature(const struct FFortTournamentDisplayInfo& DisplayInfo);
	void SetEventState__DelegateSignature(EFortShowdownEventState EventState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownEventTileInfo_C">();
	}
	static class UShowdownEventTileInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownEventTileInfo_C>();
	}
};
static_assert(alignof(UShowdownEventTileInfo_C) == 0x000008, "Wrong alignment on UShowdownEventTileInfo_C");
static_assert(sizeof(UShowdownEventTileInfo_C) == 0x000710, "Wrong size on UShowdownEventTileInfo_C");
static_assert(offsetof(UShowdownEventTileInfo_C, UberGraphFrame) == 0x000610, "Member 'UShowdownEventTileInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, FocusPin) == 0x000618, "Member 'UShowdownEventTileInfo_C::FocusPin' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, HideSocketShadow_Past) == 0x000620, "Member 'UShowdownEventTileInfo_C::HideSocketShadow_Past' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, HideSocketShadow) == 0x000628, "Member 'UShowdownEventTileInfo_C::HideSocketShadow' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Focus) == 0x000630, "Member 'UShowdownEventTileInfo_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Focus_Ended) == 0x000638, "Member 'UShowdownEventTileInfo_C::Focus_Ended' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, TransitionSize) == 0x000640, "Member 'UShowdownEventTileInfo_C::TransitionSize' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonBorder_Date) == 0x000648, "Member 'UShowdownEventTileInfo_C::CommonBorder_Date' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonBorder_Score) == 0x000650, "Member 'UShowdownEventTileInfo_C::CommonBorder_Score' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonTextBlock_pts) == 0x000658, "Member 'UShowdownEventTileInfo_C::CommonTextBlock_pts' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonWidgetSwitcher_EventPinState) == 0x000660, "Member 'UShowdownEventTileInfo_C::CommonWidgetSwitcher_EventPinState' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonWidgetSwitcher_TimeFormat) == 0x000668, "Member 'UShowdownEventTileInfo_C::CommonWidgetSwitcher_TimeFormat' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, CommonWidgetSwitcher_TimeFormatTitle) == 0x000670, "Member 'UShowdownEventTileInfo_C::CommonWidgetSwitcher_TimeFormatTitle' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Content_Score) == 0x000678, "Member 'UShowdownEventTileInfo_C::Content_Score' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, DateText) == 0x000680, "Member 'UShowdownEventTileInfo_C::DateText' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Image_Lock) == 0x000688, "Member 'UShowdownEventTileInfo_C::Image_Lock' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Image_Socket) == 0x000690, "Member 'UShowdownEventTileInfo_C::Image_Socket' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, ScaleBoxPin) == 0x000698, "Member 'UShowdownEventTileInfo_C::ScaleBoxPin' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, ScoreValue) == 0x0006A0, "Member 'UShowdownEventTileInfo_C::ScoreValue' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, ShowdownPin) == 0x0006A8, "Member 'UShowdownEventTileInfo_C::ShowdownPin' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, Switcher_EventWindowUnlockState) == 0x0006B0, "Member 'UShowdownEventTileInfo_C::Switcher_EventWindowUnlockState' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, TimeDescriptionText) == 0x0006B8, "Member 'UShowdownEventTileInfo_C::TimeDescriptionText' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, TimeDescriptionTextRelative) == 0x0006C0, "Member 'UShowdownEventTileInfo_C::TimeDescriptionTextRelative' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, SetEventState) == 0x0006C8, "Member 'UShowdownEventTileInfo_C::SetEventState' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, IsEnded) == 0x0006D8, "Member 'UShowdownEventTileInfo_C::IsEnded' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, IsPin) == 0x0006D9, "Member 'UShowdownEventTileInfo_C::IsPin' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, SetDisplayInfo) == 0x0006E0, "Member 'UShowdownEventTileInfo_C::SetDisplayInfo' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, TextFontMaterial) == 0x0006F0, "Member 'UShowdownEventTileInfo_C::TextFontMaterial' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, PointFontMaterial) == 0x0006F8, "Member 'UShowdownEventTileInfo_C::PointFontMaterial' has a wrong offset!");
static_assert(offsetof(UShowdownEventTileInfo_C, MultiRoundSession) == 0x000700, "Member 'UShowdownEventTileInfo_C::MultiRoundSession' has a wrong offset!");

}

