#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownDivisionLobbyPanel

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.RefreshDivisionData
// 0x0190 (0x0190 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_RefreshDivisionData final
{
public:
	int32                                         TotalHypeForNextDivision;                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalHype;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalNumberDivisions;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DivsionRank;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmountEarnedWithinDivision_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalDivisionPoints_ReturnValue;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7848[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7849[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00E8(0x0018)()
	int32                                         CallFunc_GetNumericalDisplayAmountForNextDivision_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_784A[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalNumberOfDivisions_ReturnValue;    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDivisionRank_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_GetRequiredAmountToAdvanceDivision_ReturnValue; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784B[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0170(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_RefreshDivisionData");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData) == 0x000190, "Wrong size on ShowdownDivisionLobbyPanel_C_RefreshDivisionData");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, TotalHypeForNextDivision) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::TotalHypeForNextDivision' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, TotalHype) == 0x000004, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::TotalHype' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, TotalNumberDivisions) == 0x000008, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::TotalNumberDivisions' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, DivsionRank) == 0x00000C, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::DivsionRank' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetAmountEarnedWithinDivision_ReturnValue) == 0x000010, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetAmountEarnedWithinDivision_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetTotalDivisionPoints_ReturnValue) == 0x000058, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetTotalDivisionPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, K2Node_MakeArray_Array) == 0x0000A0, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B0, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D0, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000E8, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetNumericalDisplayAmountForNextDivision_ReturnValue) == 0x000100, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetNumericalDisplayAmountForNextDivision_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000108, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetTotalNumberOfDivisions_ReturnValue) == 0x00010C, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetTotalNumberOfDivisions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetDivisionRank_ReturnValue) == 0x000114, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetDivisionRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, K2Node_MakeStruct_FormatArgumentData_2) == 0x000118, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, K2Node_MakeArray_Array_1) == 0x000158, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_GetRequiredAmountToAdvanceDivision_ReturnValue) == 0x000168, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_GetRequiredAmountToAdvanceDivision_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Format_ReturnValue_1) == 0x000170, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000188, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_RefreshDivisionData, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00018C, "Member 'ShowdownDivisionLobbyPanel_C_RefreshDivisionData::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_InputTypeChanged final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong alignment on ShowdownDivisionLobbyPanel_C_InputTypeChanged");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong size on ShowdownDivisionLobbyPanel_C_InputTypeChanged");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_InputTypeChanged, IsGamepad) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_InputTypeChanged::IsGamepad' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.Refresh
// 0x0278 (0x0278 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_Refresh final
{
public:
	EFortShowdownEventState                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_784D[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784E[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784F[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLeagueSuffixDisplayName_ReturnValue;   // 0x00B0(0x0018)()
	class FText                                   CallFunc_GetLeaguePrefixDisplayName_ReturnValue;   // 0x00C8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00E0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x00F8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0110(0x0018)()
	bool                                          CallFunc_IsDivisionEvent_ReturnValue;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortShowdownEventState                       CallFunc_GetEventTimeState_ReturnValue;            // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue;      // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue_1;    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7850[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_1;      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7851[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7852[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0148(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0018)()
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_2;      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7853[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01C8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01E0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x01F8(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x021C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7854[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7855[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7856[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_Refresh) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_Refresh");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_Refresh) == 0x000278, "Wrong size on ShowdownDivisionLobbyPanel_C_Refresh");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable) == 0x000008, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable_1) == 0x000020, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable_2) == 0x000038, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable_3) == 0x000050, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable_4) == 0x000068, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_text_Variable_5) == 0x000080, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_bool_Variable) == 0x000098, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_float_Variable) == 0x00009C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_float_Variable_1) == 0x0000A0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_byte_Variable_1) == 0x0000A4, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_Select_Default) == 0x0000A8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetLeagueSuffixDisplayName_ReturnValue) == 0x0000B0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetLeagueSuffixDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetLeaguePrefixDisplayName_ReturnValue) == 0x0000C8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetLeaguePrefixDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_TextToUpper_ReturnValue) == 0x0000E0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_TextToUpper_ReturnValue_1) == 0x0000F8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_MakeLiteralText_ReturnValue) == 0x000110, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_IsDivisionEvent_ReturnValue) == 0x000128, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_IsDivisionEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetEventTimeState_ReturnValue) == 0x000129, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetEventTimeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_DoCalloutMFARequirement_ReturnValue) == 0x00012A, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_DoCalloutMFARequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_DoCalloutMFARequirement_ReturnValue_1) == 0x00012B, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_DoCalloutMFARequirement_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue) == 0x00012C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue) == 0x000134, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue_1) == 0x000138, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_byte_Variable_2) == 0x00013C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000140, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_MakeStruct_FormatArgumentData) == 0x000148, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_MakeArray_Array) == 0x000188, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Format_ReturnValue) == 0x000198, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1) == 0x0001B0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue_2) == 0x0001B4, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001B8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001BC, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x0001BD, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x0001BE, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_bool_Variable_1) == 0x0001BF, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_Select_Default_1) == 0x0001C0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_float_Variable_2) == 0x0001C4, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001C8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001E0, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_Select_Default_2) == 0x0001F8, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000210, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_PauseAnimation_ReturnValue) == 0x000218, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_MakeStruct_Margin) == 0x00021C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetStartTime_ReturnValue) == 0x00022C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000230, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_PauseAnimation_ReturnValue_1) == 0x000234, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetEndTime_ReturnValue) == 0x000238, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Add_FloatFloat_ReturnValue) == 0x00023C, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000240, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_PlayAnimation_ReturnValue) == 0x000248, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, Temp_bool_Variable_2) == 0x000250, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, K2Node_Select_Default_3) == 0x000254, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_PlayAnimation_ReturnValue_1) == 0x000258, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_GetEventId_ReturnValue) == 0x000260, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_Refresh, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000270, "Member 'ShowdownDivisionLobbyPanel_C_Refresh::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.EventSwitchUI
// 0x0001 (0x0001 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_EventSwitchUI final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong alignment on ShowdownDivisionLobbyPanel_C_EventSwitchUI");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong size on ShowdownDivisionLobbyPanel_C_EventSwitchUI");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_EventSwitchUI, bNewInputType) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_EventSwitchUI::bNewInputType' has a wrong offset!");

// Function ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C.ExecuteUbergraph_ShowdownDivisionLobbyPanel
// 0x0140 (0x0140 - 0x0000)
struct ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7857[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7858[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7859[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785B[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785C[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_3;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_785D[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDivisionDetailsScreen_C*               CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_785E[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785F[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel) == 0x000008, "Wrong alignment on ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel");
static_assert(sizeof(ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel) == 0x000140, "Wrong size on ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel, EntryPoint) == 0x000000, "Member 'ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel, Temp_float_Variable) == 0x000004, "Member 'ShowdownDivisionLobbyPanel_C_ExecuteUbergraph_ShowdownDivisionLobbyPanel::Temp_float_Variable' has a wrong offset!");
