#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentPosterBack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentPosterBack.ShowdownTournamentPosterBack_C
// 0x00E0 (0x06F0 - 0x0610)
class UShowdownTournamentPosterBack_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_EventDates;                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_MetaDate;                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_MetaTitle;                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DateText;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FlavorText;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FooterWatermark;                             // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxTournamentTitle;                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Pin;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleLine1;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleLine2;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry;                               // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_0;                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_1;                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_2;                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_3;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_4;                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_5;                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_6;                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_7;                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_8;                           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_9;                           // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_10;                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_11;                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTournamentDateEntry_C*                 TournamentDateEntry_C_12;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_DateGrid;                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DateRowMax;                                        // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetTournamentDateText(class FText* TournamentDate);
	void RefreshDataBP();
	void EventColorize();
	void EventPopulateEventWindowData();
	void Construct();
	void ExecuteUbergraph_ShowdownTournamentPosterBack(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentPosterBack_C">();
	}
	static class UShowdownTournamentPosterBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentPosterBack_C>();
	}
};
static_assert(alignof(UShowdownTournamentPosterBack_C) == 0x000008, "Wrong alignment on UShowdownTournamentPosterBack_C");
static_assert(sizeof(UShowdownTournamentPosterBack_C) == 0x0006F0, "Wrong size on UShowdownTournamentPosterBack_C");
static_assert(offsetof(UShowdownTournamentPosterBack_C, UberGraphFrame) == 0x000610, "Member 'UShowdownTournamentPosterBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, CommonTextBlock_EventDates) == 0x000618, "Member 'UShowdownTournamentPosterBack_C::CommonTextBlock_EventDates' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, CommonTextBlock_MetaDate) == 0x000620, "Member 'UShowdownTournamentPosterBack_C::CommonTextBlock_MetaDate' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, CommonTextBlock_MetaTitle) == 0x000628, "Member 'UShowdownTournamentPosterBack_C::CommonTextBlock_MetaTitle' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, DateText) == 0x000630, "Member 'UShowdownTournamentPosterBack_C::DateText' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, FlavorText) == 0x000638, "Member 'UShowdownTournamentPosterBack_C::FlavorText' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, Image_FooterWatermark) == 0x000640, "Member 'UShowdownTournamentPosterBack_C::Image_FooterWatermark' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, ScaleBoxTournamentTitle) == 0x000648, "Member 'UShowdownTournamentPosterBack_C::ScaleBoxTournamentTitle' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, ShowdownPin) == 0x000650, "Member 'UShowdownTournamentPosterBack_C::ShowdownPin' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, SizeBox_Pin) == 0x000658, "Member 'UShowdownTournamentPosterBack_C::SizeBox_Pin' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TitleLine1) == 0x000660, "Member 'UShowdownTournamentPosterBack_C::TitleLine1' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TitleLine2) == 0x000668, "Member 'UShowdownTournamentPosterBack_C::TitleLine2' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry) == 0x000670, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_0) == 0x000678, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_0' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_1) == 0x000680, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_1' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_2) == 0x000688, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_2' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_3) == 0x000690, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_3' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_4) == 0x000698, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_4' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_5) == 0x0006A0, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_5' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_6) == 0x0006A8, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_6' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_7) == 0x0006B0, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_7' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_8) == 0x0006B8, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_8' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_9) == 0x0006C0, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_9' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_10) == 0x0006C8, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_10' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_11) == 0x0006D0, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_11' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, TournamentDateEntry_C_12) == 0x0006D8, "Member 'UShowdownTournamentPosterBack_C::TournamentDateEntry_C_12' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, UniformGridPanel_DateGrid) == 0x0006E0, "Member 'UShowdownTournamentPosterBack_C::UniformGridPanel_DateGrid' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentPosterBack_C, DateRowMax) == 0x0006E8, "Member 'UShowdownTournamentPosterBack_C::DateRowMax' has a wrong offset!");

}

