#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownDivisionLobbyPanel

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C
// 0x0190 (0x07D0 - 0x0640)
class UShowdownDivisionLobbyPanel_C final : public UFortDivisionLobbyPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EventButtonHover;                                  // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar_DivisionProgress;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTimeRemaining;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CentralContentSwitcher;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_EarnAPin;                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TournamentWarnings;           // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EarnPinContent;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EarnPinMessage;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_DivisionProgress;                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxJustHYpe;                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HypeIcon;                                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsButtonBG;                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBG;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MFA_WarningText;                                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoMessage;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_DetailsText;                              // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CrossplayWarning;                             // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CurrentHype;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DetailsButton;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionProgress;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionRank;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchCapWarning;                              // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Remaining;                                    // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TournamentTitle;                                   // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TournamentTitle2;                                  // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TournamentTitleInfo;                               // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningMessage;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Progress;                           // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PrimaryColor;                                      // 0x0758(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ShadowColor;                                       // 0x0780(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HighlightColor;                                    // 0x07A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void RefreshDivisionData();
	void InputTypeChanged(bool IsGamepad);
	void HandleCrossplayChanged();
	void UpdateColors();
	void Refresh();
	void RefreshDataBP();
	void Construct();
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void EventColorize();
	void EventSwitchUI(ECommonInputType bNewInputType);
	void ExecuteUbergraph_ShowdownDivisionLobbyPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownDivisionLobbyPanel_C">();
	}
	static class UShowdownDivisionLobbyPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownDivisionLobbyPanel_C>();
	}
};
static_assert(alignof(UShowdownDivisionLobbyPanel_C) == 0x000008, "Wrong alignment on UShowdownDivisionLobbyPanel_C");
static_assert(sizeof(UShowdownDivisionLobbyPanel_C) == 0x0007D0, "Wrong size on UShowdownDivisionLobbyPanel_C");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, UberGraphFrame) == 0x000640, "Member 'UShowdownDivisionLobbyPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EventButtonHover) == 0x000648, "Member 'UShowdownDivisionLobbyPanel_C::EventButtonHover' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Intro) == 0x000650, "Member 'UShowdownDivisionLobbyPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Bar_DivisionProgress) == 0x000658, "Member 'UShowdownDivisionLobbyPanel_C::Bar_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, BorderTimeRemaining) == 0x000660, "Member 'UShowdownDivisionLobbyPanel_C::BorderTimeRemaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CentralContentSwitcher) == 0x000668, "Member 'UShowdownDivisionLobbyPanel_C::CentralContentSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_1) == 0x000670, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_EarnAPin) == 0x000678, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_EarnAPin' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonWidgetSwitcher_TournamentWarnings) == 0x000680, "Member 'UShowdownDivisionLobbyPanel_C::CommonWidgetSwitcher_TournamentWarnings' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinContent) == 0x000688, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinMessage) == 0x000690, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBox_DivisionProgress) == 0x000698, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBox_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBoxJustHYpe) == 0x0006A0, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBoxJustHYpe' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HypeIcon) == 0x0006A8, "Member 'UShowdownDivisionLobbyPanel_C::HypeIcon' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_4) == 0x0006B0, "Member 'UShowdownDivisionLobbyPanel_C::Image_4' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_35) == 0x0006B8, "Member 'UShowdownDivisionLobbyPanel_C::Image_35' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_DetailsButtonBG) == 0x0006C0, "Member 'UShowdownDivisionLobbyPanel_C::Image_DetailsButtonBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_ErrorBG) == 0x0006C8, "Member 'UShowdownDivisionLobbyPanel_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBG) == 0x0006D0, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBorder) == 0x0006D8, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, MFA_WarningText) == 0x0006E0, "Member 'UShowdownDivisionLobbyPanel_C::MFA_WarningText' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, NoMessage) == 0x0006E8, "Member 'UShowdownDivisionLobbyPanel_C::NoMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, ScaleBox_DetailsText) == 0x0006F0, "Member 'UShowdownDivisionLobbyPanel_C::ScaleBox_DetailsText' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CrossplayWarning) == 0x0006F8, "Member 'UShowdownDivisionLobbyPanel_C::Text_CrossplayWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CurrentHype) == 0x000700, "Member 'UShowdownDivisionLobbyPanel_C::Text_CurrentHype' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DetailsButton) == 0x000708, "Member 'UShowdownDivisionLobbyPanel_C::Text_DetailsButton' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionProgress) == 0x000710, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionRank) == 0x000718, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionRank' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_MatchCapWarning) == 0x000720, "Member 'UShowdownDivisionLobbyPanel_C::Text_MatchCapWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_Remaining) == 0x000728, "Member 'UShowdownDivisionLobbyPanel_C::Text_Remaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, TournamentTitle) == 0x000730, "Member 'UShowdownDivisionLobbyPanel_C::TournamentTitle' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, TournamentTitle2) == 0x000738, "Member 'UShowdownDivisionLobbyPanel_C::TournamentTitle2' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, TournamentTitleInfo) == 0x000740, "Member 'UShowdownDivisionLobbyPanel_C::TournamentTitleInfo' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WarningMessage) == 0x000748, "Member 'UShowdownDivisionLobbyPanel_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WidgetSwitcher_Progress) == 0x000750, "Member 'UShowdownDivisionLobbyPanel_C::WidgetSwitcher_Progress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, PrimaryColor) == 0x000758, "Member 'UShowdownDivisionLobbyPanel_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, ShadowColor) == 0x000780, "Member 'UShowdownDivisionLobbyPanel_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HighlightColor) == 0x0007A8, "Member 'UShowdownDivisionLobbyPanel_C::HighlightColor' has a wrong offset!");

}

