#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignInWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SignInWidget.SignInWidget_C
// 0x0030 (0x04B0 - 0x0480)
class USignInWidget_C final : public UFortSignInWidget
{
public:
	class UNamedSlot*                             ButtonSlot;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentBox;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmergencyNoticeWidget_C*               EmergencyNoticeWidget;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    LoginInputAction;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SignInWidget_C">();
	}
	static class USignInWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInWidget_C>();
	}
};
static_assert(alignof(USignInWidget_C) == 0x000008, "Wrong alignment on USignInWidget_C");
static_assert(sizeof(USignInWidget_C) == 0x0004B0, "Wrong size on USignInWidget_C");
static_assert(offsetof(USignInWidget_C, ButtonSlot) == 0x000480, "Member 'USignInWidget_C::ButtonSlot' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, CommonLazyImage_0) == 0x000488, "Member 'USignInWidget_C::CommonLazyImage_0' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, ContentBox) == 0x000490, "Member 'USignInWidget_C::ContentBox' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, EmergencyNoticeWidget) == 0x000498, "Member 'USignInWidget_C::EmergencyNoticeWidget' has a wrong offset!");
static_assert(offsetof(USignInWidget_C, LoginInputAction) == 0x0004A0, "Member 'USignInWidget_C::LoginInputAction' has a wrong offset!");

}

