#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleMaterialProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SimpleMaterialProgressBar.SimpleMaterialProgressBar_C
// 0x0070 (0x02A0 - 0x0230)
class USimpleMaterialProgressBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fill;                                              // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bar;                                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB;                                            // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorBackground;                                   // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SegmentsEdge;                                      // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviewPercent;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5034[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             FinishedFillDispatcher;                            // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UseStroke;                                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void FinishedFillDispatcher__DelegateSignature();
	void ExecuteUbergraph_SimpleMaterialProgressBar(int32 EntryPoint);
	void EventFillFinished();
	void AnimateProgress(float StartAmount, float EndAmount, float AnimSpeed);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetProgress(float Value);
	void SetColorA(const struct FLinearColor& Value);
	void SetColorB(const struct FLinearColor& Value);
	void SetColorBackground(const struct FLinearColor& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleMaterialProgressBar_C">();
	}
	static class USimpleMaterialProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleMaterialProgressBar_C>();
	}
};
static_assert(alignof(USimpleMaterialProgressBar_C) == 0x000008, "Wrong alignment on USimpleMaterialProgressBar_C");
static_assert(sizeof(USimpleMaterialProgressBar_C) == 0x0002A0, "Wrong size on USimpleMaterialProgressBar_C");
static_assert(offsetof(USimpleMaterialProgressBar_C, UberGraphFrame) == 0x000230, "Member 'USimpleMaterialProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, Fill) == 0x000238, "Member 'USimpleMaterialProgressBar_C::Fill' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, Bar) == 0x000240, "Member 'USimpleMaterialProgressBar_C::Bar' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, ColorA) == 0x000248, "Member 'USimpleMaterialProgressBar_C::ColorA' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, ColorB) == 0x000258, "Member 'USimpleMaterialProgressBar_C::ColorB' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, ColorBackground) == 0x000268, "Member 'USimpleMaterialProgressBar_C::ColorBackground' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, Segments) == 0x000278, "Member 'USimpleMaterialProgressBar_C::Segments' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, SegmentsEdge) == 0x00027C, "Member 'USimpleMaterialProgressBar_C::SegmentsEdge' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, PreviewPercent) == 0x000280, "Member 'USimpleMaterialProgressBar_C::PreviewPercent' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, FinishedFillDispatcher) == 0x000288, "Member 'USimpleMaterialProgressBar_C::FinishedFillDispatcher' has a wrong offset!");
static_assert(offsetof(USimpleMaterialProgressBar_C, UseStroke) == 0x000298, "Member 'USimpleMaterialProgressBar_C::UseStroke' has a wrong offset!");

}

