#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleMaterialProgressBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.ExecuteUbergraph_SimpleMaterialProgressBar
// 0x0068 (0x0068 - 0x0000)
struct SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5035[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5036[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StartAmount;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EndAmount;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AnimSpeed;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5037[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5038[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar) == 0x000008, "Wrong alignment on SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar");
static_assert(sizeof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar) == 0x000068, "Wrong size on SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, EntryPoint) == 0x000000, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_Event_IsDesignTime) == 0x000014, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_CustomEvent_StartAmount) == 0x000018, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_CustomEvent_StartAmount' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_CustomEvent_EndAmount) == 0x00001C, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_CustomEvent_EndAmount' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_CustomEvent_AnimSpeed) == 0x000020, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_CustomEvent_AnimSpeed' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000028, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, Temp_object_Variable) == 0x000030, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, Temp_object_Variable_1) == 0x000038, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, Temp_bool_Variable) == 0x000040, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_Select_Default) == 0x000050, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'SimpleMaterialProgressBar_C_ExecuteUbergraph_SimpleMaterialProgressBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.AnimateProgress
// 0x000C (0x000C - 0x0000)
struct SimpleMaterialProgressBar_C_AnimateProgress final
{
public:
	float                                         StartAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndAmount;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleMaterialProgressBar_C_AnimateProgress) == 0x000004, "Wrong alignment on SimpleMaterialProgressBar_C_AnimateProgress");
static_assert(sizeof(SimpleMaterialProgressBar_C_AnimateProgress) == 0x00000C, "Wrong size on SimpleMaterialProgressBar_C_AnimateProgress");
static_assert(offsetof(SimpleMaterialProgressBar_C_AnimateProgress, StartAmount) == 0x000000, "Member 'SimpleMaterialProgressBar_C_AnimateProgress::StartAmount' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_AnimateProgress, EndAmount) == 0x000004, "Member 'SimpleMaterialProgressBar_C_AnimateProgress::EndAmount' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_AnimateProgress, AnimSpeed) == 0x000008, "Member 'SimpleMaterialProgressBar_C_AnimateProgress::AnimSpeed' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SimpleMaterialProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleMaterialProgressBar_C_PreConstruct) == 0x000001, "Wrong alignment on SimpleMaterialProgressBar_C_PreConstruct");
static_assert(sizeof(SimpleMaterialProgressBar_C_PreConstruct) == 0x000001, "Wrong size on SimpleMaterialProgressBar_C_PreConstruct");
static_assert(offsetof(SimpleMaterialProgressBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SimpleMaterialProgressBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.SetProgress
// 0x0010 (0x0010 - 0x0000)
struct SimpleMaterialProgressBar_C_SetProgress final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5039[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleMaterialProgressBar_C_SetProgress) == 0x000008, "Wrong alignment on SimpleMaterialProgressBar_C_SetProgress");
static_assert(sizeof(SimpleMaterialProgressBar_C_SetProgress) == 0x000010, "Wrong size on SimpleMaterialProgressBar_C_SetProgress");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetProgress, Value) == 0x000000, "Member 'SimpleMaterialProgressBar_C_SetProgress::Value' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'SimpleMaterialProgressBar_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.SetColorA
// 0x0018 (0x0018 - 0x0000)
struct SimpleMaterialProgressBar_C_SetColorA final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleMaterialProgressBar_C_SetColorA) == 0x000008, "Wrong alignment on SimpleMaterialProgressBar_C_SetColorA");
static_assert(sizeof(SimpleMaterialProgressBar_C_SetColorA) == 0x000018, "Wrong size on SimpleMaterialProgressBar_C_SetColorA");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorA, Value) == 0x000000, "Member 'SimpleMaterialProgressBar_C_SetColorA::Value' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorA, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SimpleMaterialProgressBar_C_SetColorA::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.SetColorB
// 0x0018 (0x0018 - 0x0000)
struct SimpleMaterialProgressBar_C_SetColorB final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleMaterialProgressBar_C_SetColorB) == 0x000008, "Wrong alignment on SimpleMaterialProgressBar_C_SetColorB");
static_assert(sizeof(SimpleMaterialProgressBar_C_SetColorB) == 0x000018, "Wrong size on SimpleMaterialProgressBar_C_SetColorB");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorB, Value) == 0x000000, "Member 'SimpleMaterialProgressBar_C_SetColorB::Value' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorB, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SimpleMaterialProgressBar_C_SetColorB::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function SimpleMaterialProgressBar.SimpleMaterialProgressBar_C.SetColorBackground
// 0x0018 (0x0018 - 0x0000)
struct SimpleMaterialProgressBar_C_SetColorBackground final
{
public:
	struct FLinearColor                           Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleMaterialProgressBar_C_SetColorBackground) == 0x000008, "Wrong alignment on SimpleMaterialProgressBar_C_SetColorBackground");
static_assert(sizeof(SimpleMaterialProgressBar_C_SetColorBackground) == 0x000018, "Wrong size on SimpleMaterialProgressBar_C_SetColorBackground");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorBackground, Value) == 0x000000, "Member 'SimpleMaterialProgressBar_C_SetColorBackground::Value' has a wrong offset!");
static_assert(offsetof(SimpleMaterialProgressBar_C_SetColorBackground, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SimpleMaterialProgressBar_C_SetColorBackground::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

