#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_ChillBronco_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_ChillBronco_AnimBP.SK_ChillBronco_AnimBP_C
// 0x0CB0 (0x0F20 - 0x0270)
class USK_ChillBronco_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_68D8[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0278(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0298(0x0020)()
	uint8                                         Pad_68D9[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x02C0(0x0440)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0700(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0788(0x0030)()
	uint8                                         Pad_68DA[0x8];                                     // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x07C0(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E10(0x0108)()

public:
	void ExecuteUbergraph_SK_ChillBronco_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_ChillBronco_AnimBP_C">();
	}
	static class USK_ChillBronco_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_ChillBronco_AnimBP_C>();
	}
};
static_assert(alignof(USK_ChillBronco_AnimBP_C) == 0x000010, "Wrong alignment on USK_ChillBronco_AnimBP_C");
static_assert(sizeof(USK_ChillBronco_AnimBP_C) == 0x000F20, "Wrong size on USK_ChillBronco_AnimBP_C");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'USK_ChillBronco_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000278, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000298, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0002C0, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_SubInput) == 0x000700, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_Root) == 0x000788, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_RigidBody) == 0x0007C0, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USK_ChillBronco_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000E10, "Member 'USK_ChillBronco_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

