#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Valet_SportsCar_Vehicle_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValetRuntime_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Valet_SportsCar_Vehicle_AnimBP_Base.SK_Valet_SportsCar_Vehicle_AnimBP_Base_C
// 0x0BF0 (0x0FB0 - 0x03C0)
class USK_Valet_SportsCar_Vehicle_AnimBP_Base_C final : public UFortDagwoodVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03F8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0418(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0520(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0628(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0730(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0838(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0940(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0A48(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0B50(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0C58(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0D60(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E68(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0E88(0x0018)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0EA0(0x0108)()

public:
	void ExecuteUbergraph_SK_Valet_SportsCar_Vehicle_AnimBP_Base(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Valet_SportsCar_Vehicle_AnimBP_Base_C">();
	}
	static class USK_Valet_SportsCar_Vehicle_AnimBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Valet_SportsCar_Vehicle_AnimBP_Base_C>();
	}
};
static_assert(alignof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C) == 0x000010, "Wrong alignment on USK_Valet_SportsCar_Vehicle_AnimBP_Base_C");
static_assert(sizeof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C) == 0x000FB0, "Wrong size on USK_Valet_SportsCar_Vehicle_AnimBP_Base_C");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, UberGraphFrame) == 0x0003C0, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_Root) == 0x0003C8, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003F8, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_10) == 0x000418, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_9) == 0x000520, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_8) == 0x000628, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_7) == 0x000730, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_6) == 0x000838, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_5) == 0x000940, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_4) == 0x000A48, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_3) == 0x000B50, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_2) == 0x000C58, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone_1) == 0x000D60, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_LocalToComponentSpace) == 0x000E68, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_LocalRefPose) == 0x000E88, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USK_Valet_SportsCar_Vehicle_AnimBP_Base_C, AnimGraphNode_ModifyBone) == 0x000EA0, "Member 'USK_Valet_SportsCar_Vehicle_AnimBP_Base_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

