#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialBanModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialBanModal.SocialBanModal_C
// 0x0110 (0x0530 - 0x0420)
class USocialBanModal_C final : public UFortSocialBanModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Disclaimer;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Disclaimer_1;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Disclaimer_2;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Severe;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_51;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_Message;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title_1;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_1;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_2;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_3;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Banned;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Warned;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_SeverityImage;                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AckSucceeded;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442C[0x7];                                     // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BanInformation;                                    // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnCloseSucceeded;                                  // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         TryCount;                                          // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWarning;                                        // 0x04CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442D[0x3];                                     // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMcpBanInfo                            McpBanInfo;                                        // 0x04D0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   BanType;                                           // 0x0510(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsCompetitiveBan;                                 // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnCloseSucceeded__DelegateSignature();
	void ExecuteUbergraph_SocialBanModal(int32 EntryPoint);
	void OnDisplayModeSet(bool bIsBanned);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialBanModal_C">();
	}
	static class USocialBanModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialBanModal_C>();
	}
};
static_assert(alignof(USocialBanModal_C) == 0x000008, "Wrong alignment on USocialBanModal_C");
static_assert(sizeof(USocialBanModal_C) == 0x000530, "Wrong size on USocialBanModal_C");
static_assert(offsetof(USocialBanModal_C, UberGraphFrame) == 0x000420, "Member 'USocialBanModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Disclaimer) == 0x000428, "Member 'USocialBanModal_C::Disclaimer' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Disclaimer_1) == 0x000430, "Member 'USocialBanModal_C::Disclaimer_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Disclaimer_2) == 0x000438, "Member 'USocialBanModal_C::Disclaimer_2' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Image_Severe) == 0x000440, "Member 'USocialBanModal_C::Image_Severe' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Lightbox_51) == 0x000448, "Member 'USocialBanModal_C::Lightbox_51' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Switcher_Message) == 0x000450, "Member 'USocialBanModal_C::Switcher_Message' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Title) == 0x000458, "Member 'USocialBanModal_C::Title' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Title_1) == 0x000460, "Member 'USocialBanModal_C::Title_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_1) == 0x000468, "Member 'USocialBanModal_C::Triangles_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_2) == 0x000470, "Member 'USocialBanModal_C::Triangles_2' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_3) == 0x000478, "Member 'USocialBanModal_C::Triangles_3' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, VBox_Banned) == 0x000480, "Member 'USocialBanModal_C::VBox_Banned' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, VBox_Warned) == 0x000488, "Member 'USocialBanModal_C::VBox_Warned' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, WidgetSwitcher_SeverityImage) == 0x000490, "Member 'USocialBanModal_C::WidgetSwitcher_SeverityImage' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, AckSucceeded) == 0x000498, "Member 'USocialBanModal_C::AckSucceeded' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, BanInformation) == 0x0004A0, "Member 'USocialBanModal_C::BanInformation' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, OnCloseSucceeded) == 0x0004B8, "Member 'USocialBanModal_C::OnCloseSucceeded' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, TryCount) == 0x0004C8, "Member 'USocialBanModal_C::TryCount' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, bIsWarning) == 0x0004CC, "Member 'USocialBanModal_C::bIsWarning' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, McpBanInfo) == 0x0004D0, "Member 'USocialBanModal_C::McpBanInfo' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, BanType) == 0x000510, "Member 'USocialBanModal_C::BanType' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, bIsCompetitiveBan) == 0x000528, "Member 'USocialBanModal_C::bIsCompetitiveBan' has a wrong offset!");

}

