#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelView_UserLists

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanelView_UserLists.SocialPanelView_UserLists_C
// 0x00C0 (0x0538 - 0x0478)
class USocialPanelView_UserLists_C final : public UFortSocialPanelView_UserLists
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeGameButtonHovered;                               // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitcherTransition;                                // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoFriendsArrowBounce;                              // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuAnchorItemOpen;                                // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open_0;                                            // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bckgrnd;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircularThrobber_UserSearch;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_97;                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       FortMobileImage_127;                               // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MicDisabled;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon_1;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_MicIcon_2;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MicIcon_3;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_TitleIcon;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_LeavePlatformPartyTitle;                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabled;                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabledHeader;                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_VoiceChatDisabledWarningMessage;          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_0;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialPanel_FriendLinkButton_C*        SocialPanel_FriendLinkButton;                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LowPowerMode;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialPanelView_UserLists(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnSetVoiceChannelButtonText(const class FText& ButtonText);
	void BndEvt__Switcher_UserLists_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanelView_UserLists_C">();
	}
	static class USocialPanelView_UserLists_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanelView_UserLists_C>();
	}
};
static_assert(alignof(USocialPanelView_UserLists_C) == 0x000008, "Wrong alignment on USocialPanelView_UserLists_C");
static_assert(sizeof(USocialPanelView_UserLists_C) == 0x000538, "Wrong size on USocialPanelView_UserLists_C");
static_assert(offsetof(USocialPanelView_UserLists_C, UberGraphFrame) == 0x000478, "Member 'USocialPanelView_UserLists_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, WeGameButtonHovered) == 0x000480, "Member 'USocialPanelView_UserLists_C::WeGameButtonHovered' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SwitcherTransition) == 0x000488, "Member 'USocialPanelView_UserLists_C::SwitcherTransition' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, NoFriendsArrowBounce) == 0x000490, "Member 'USocialPanelView_UserLists_C::NoFriendsArrowBounce' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, MenuAnchorItemOpen) == 0x000498, "Member 'USocialPanelView_UserLists_C::MenuAnchorItemOpen' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open_0) == 0x0004A0, "Member 'USocialPanelView_UserLists_C::Open_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open) == 0x0004A8, "Member 'USocialPanelView_UserLists_C::Open' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, bckgrnd) == 0x0004B0, "Member 'USocialPanelView_UserLists_C::bckgrnd' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, CircularThrobber_UserSearch) == 0x0004B8, "Member 'USocialPanelView_UserLists_C::CircularThrobber_UserSearch' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, CommonRichTextBlock_97) == 0x0004C0, "Member 'USocialPanelView_UserLists_C::CommonRichTextBlock_97' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, FortMobileImage_127) == 0x0004C8, "Member 'USocialPanelView_UserLists_C::FortMobileImage_127' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicDisabled) == 0x0004D0, "Member 'USocialPanelView_UserLists_C::Image_MicDisabled' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon) == 0x0004D8, "Member 'USocialPanelView_UserLists_C::Image_MicIcon' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_1) == 0x0004E0, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_1' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_2) == 0x0004E8, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_2' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_MicIcon_3) == 0x0004F0, "Member 'USocialPanelView_UserLists_C::Image_MicIcon_3' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Image_TitleIcon) == 0x0004F8, "Member 'USocialPanelView_UserLists_C::Image_TitleIcon' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_LeavePlatformPartyTitle) == 0x000500, "Member 'USocialPanelView_UserLists_C::RichText_LeavePlatformPartyTitle' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabled) == 0x000508, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabled' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabledHeader) == 0x000510, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabledHeader' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichText_VoiceChatDisabledWarningMessage) == 0x000518, "Member 'USocialPanelView_UserLists_C::RichText_VoiceChatDisabledWarningMessage' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichTextBlock_0) == 0x000520, "Member 'USocialPanelView_UserLists_C::RichTextBlock_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SocialPanel_FriendLinkButton) == 0x000528, "Member 'USocialPanelView_UserLists_C::SocialPanel_FriendLinkButton' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Text_LowPowerMode) == 0x000530, "Member 'USocialPanelView_UserLists_C::Text_LowPowerMode' has a wrong offset!");

}

