#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SolarisInterop

#include "Basic.hpp"


namespace SDK::Params
{

// Function SolarisInterop.VerseCoroutineLib.Abort
// 0x0010 (0x0010 - 0x0000)
struct VerseCoroutineLib_Abort final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbortCallers;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4947[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VerseCoroutineLib_Abort) == 0x000008, "Wrong alignment on VerseCoroutineLib_Abort");
static_assert(sizeof(VerseCoroutineLib_Abort) == 0x000010, "Wrong size on VerseCoroutineLib_Abort");
static_assert(offsetof(VerseCoroutineLib_Abort, Context) == 0x000000, "Member 'VerseCoroutineLib_Abort::Context' has a wrong offset!");
static_assert(offsetof(VerseCoroutineLib_Abort, bAbortCallers) == 0x000008, "Member 'VerseCoroutineLib_Abort::bAbortCallers' has a wrong offset!");

// Function SolarisInterop.VerseCoroutineLib.Allocate
// 0x0020 (0x0020 - 0x0000)
struct VerseCoroutineLib_Allocate final
{
public:
	class UClass*                                 Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Caller;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallerResumeState;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4948[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseCoroutineLib_Allocate) == 0x000008, "Wrong alignment on VerseCoroutineLib_Allocate");
static_assert(sizeof(VerseCoroutineLib_Allocate) == 0x000020, "Wrong size on VerseCoroutineLib_Allocate");
static_assert(offsetof(VerseCoroutineLib_Allocate, Type) == 0x000000, "Member 'VerseCoroutineLib_Allocate::Type' has a wrong offset!");
static_assert(offsetof(VerseCoroutineLib_Allocate, Caller) == 0x000008, "Member 'VerseCoroutineLib_Allocate::Caller' has a wrong offset!");
static_assert(offsetof(VerseCoroutineLib_Allocate, CallerResumeState) == 0x000010, "Member 'VerseCoroutineLib_Allocate::CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseCoroutineLib_Allocate, ReturnValue) == 0x000018, "Member 'VerseCoroutineLib_Allocate::ReturnValue' has a wrong offset!");

// Function SolarisInterop.VerseCoroutineLib.Deallocate
// 0x0008 (0x0008 - 0x0000)
struct VerseCoroutineLib_Deallocate final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseCoroutineLib_Deallocate) == 0x000008, "Wrong alignment on VerseCoroutineLib_Deallocate");
static_assert(sizeof(VerseCoroutineLib_Deallocate) == 0x000008, "Wrong size on VerseCoroutineLib_Deallocate");
static_assert(offsetof(VerseCoroutineLib_Deallocate, Context) == 0x000000, "Member 'VerseCoroutineLib_Deallocate::Context' has a wrong offset!");

// Function SolarisInterop.VerseCoroutineLib.GetState
// 0x0010 (0x0010 - 0x0000)
struct VerseCoroutineLib_GetState final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4949[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VerseCoroutineLib_GetState) == 0x000008, "Wrong alignment on VerseCoroutineLib_GetState");
static_assert(sizeof(VerseCoroutineLib_GetState) == 0x000010, "Wrong size on VerseCoroutineLib_GetState");
static_assert(offsetof(VerseCoroutineLib_GetState, Context) == 0x000000, "Member 'VerseCoroutineLib_GetState::Context' has a wrong offset!");
static_assert(offsetof(VerseCoroutineLib_GetState, ReturnValue) == 0x000008, "Member 'VerseCoroutineLib_GetState::ReturnValue' has a wrong offset!");

}

