#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton.SoloButton_C
// 0x0070 (0x0BE0 - 0x0B70)
class USoloButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0BA8(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA0[0x3];                                     // 0x0BC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0BC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x0BC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x0BD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDisabled;                                        // 0x0BD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetText(const class FText& Text);
	void HandleSize();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnClicked();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void ExecuteUbergraph_SoloButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_C">();
	}
	static class USoloButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_C>();
	}
};
static_assert(alignof(USoloButton_C) == 0x000008, "Wrong alignment on USoloButton_C");
static_assert(sizeof(USoloButton_C) == 0x000BE0, "Wrong size on USoloButton_C");
static_assert(offsetof(USoloButton_C, UberGraphFrame) == 0x000B70, "Member 'USoloButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Pressed) == 0x000B78, "Member 'USoloButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Hover) == 0x000B80, "Member 'USoloButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Border_Container) == 0x000B88, "Member 'USoloButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USoloButton_C, ButtonBacking) == 0x000B90, "Member 'USoloButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_C, SizeBox_Control) == 0x000B98, "Member 'USoloButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Text_ButtonAction) == 0x000BA0, "Member 'USoloButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Button_Description) == 0x000BA8, "Member 'USoloButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSizeOveride) == 0x000BC0, "Member 'USoloButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSize) == 0x000BC4, "Member 'USoloButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Padding_Overide) == 0x000BC8, "Member 'USoloButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(USoloButton_C, PaddingOveride) == 0x000BD8, "Member 'USoloButton_C::PaddingOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, IsDisabled) == 0x000BD9, "Member 'USoloButton_C::IsDisabled' has a wrong offset!");

}

