#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Space_Wanderer_Head_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Space_Wanderer_Head_AnimBP.Space_Wanderer_Head_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Space_Wanderer_Head_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Space_Wanderer_Head_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Space_Wanderer_Head_AnimBP_C_AnimGraph");
static_assert(sizeof(Space_Wanderer_Head_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Space_Wanderer_Head_AnimBP_C_AnimGraph");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Space_Wanderer_Head_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Space_Wanderer_Head_AnimBP.Space_Wanderer_Head_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Space_Wanderer_Head_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Space_Wanderer_Head_AnimBP.Space_Wanderer_Head_AnimBP_C.ExecuteUbergraph_Space_Wanderer_Head_AnimBP
// 0x0030 (0x0030 - 0x0000)
struct Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54D0[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54D1[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP) == 0x000008, "Wrong alignment on Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP");
static_assert(sizeof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP) == 0x000030, "Wrong size on Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, EntryPoint) == 0x000000, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, K2Node_MakeArray_Array) == 0x000008, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue) == 0x000018, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000020, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue) == 0x000028, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP, K2Node_Event_DeltaTimeX) == 0x00002C, "Member 'Space_Wanderer_Head_AnimBP_C_ExecuteUbergraph_Space_Wanderer_Head_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

