#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpicySakeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SpicySakeRuntime.FortCameraMode_Tethered
// 0x0030 (0x0DD0 - 0x0DA0)
class UFortCameraMode_Tethered final : public UFortCameraMode_ThirdPerson
{
public:
	struct FVector                                OriginOffset;                                      // 0x0D98(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TetherOffsetRangeX;                                // 0x0DA4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TetherDistanceRange;                               // 0x0DAC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TetherJumpOffset;                                  // 0x0DB4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TetherJumpOffsetTime;                              // 0x0DB8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4375[0xC];                                     // 0x0DBC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TetheredBoostFOV;                                  // 0x0DC8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOVInterpSpeed;                                    // 0x0DCC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Tethered">();
	}
	static class UFortCameraMode_Tethered* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Tethered>();
	}
};
static_assert(alignof(UFortCameraMode_Tethered) == 0x000010, "Wrong alignment on UFortCameraMode_Tethered");
static_assert(sizeof(UFortCameraMode_Tethered) == 0x000DD0, "Wrong size on UFortCameraMode_Tethered");
static_assert(offsetof(UFortCameraMode_Tethered, OriginOffset) == 0x000D98, "Member 'UFortCameraMode_Tethered::OriginOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, TetherOffsetRangeX) == 0x000DA4, "Member 'UFortCameraMode_Tethered::TetherOffsetRangeX' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, TetherDistanceRange) == 0x000DAC, "Member 'UFortCameraMode_Tethered::TetherDistanceRange' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, TetherJumpOffset) == 0x000DB4, "Member 'UFortCameraMode_Tethered::TetherJumpOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, TetherJumpOffsetTime) == 0x000DB8, "Member 'UFortCameraMode_Tethered::TetherJumpOffsetTime' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, TetheredBoostFOV) == 0x000DC8, "Member 'UFortCameraMode_Tethered::TetheredBoostFOV' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Tethered, FOVInterpSpeed) == 0x000DCC, "Member 'UFortCameraMode_Tethered::FOVInterpSpeed' has a wrong offset!");

// Class SpicySakeRuntime.FortSpicySakeComponent_Telemetry
// 0x0008 (0x0108 - 0x0100)
class UFortSpicySakeComponent_Telemetry final : public UFortAIComponent_Telemetry
{
public:
	class AAthenaAIController*                    CachedAIController;                                // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSpicySakeComponent_Telemetry">();
	}
	static class UFortSpicySakeComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSpicySakeComponent_Telemetry>();
	}
};
static_assert(alignof(UFortSpicySakeComponent_Telemetry) == 0x000008, "Wrong alignment on UFortSpicySakeComponent_Telemetry");
static_assert(sizeof(UFortSpicySakeComponent_Telemetry) == 0x000108, "Wrong size on UFortSpicySakeComponent_Telemetry");
static_assert(offsetof(UFortSpicySakeComponent_Telemetry, CachedAIController) == 0x000100, "Member 'UFortSpicySakeComponent_Telemetry::CachedAIController' has a wrong offset!");

// Class SpicySakeRuntime.FortSpicySakeGameplayCueNotifyLoop_Alive
// 0x0040 (0x0800 - 0x07C0)
class AFortSpicySakeGameplayCueNotifyLoop_Alive final : public AFortGameplayCueNotify_Loop
{
public:
	class UFXSystemComponent*                     WaterFX_Native;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFXSystemComponent*                     LandFX_Native;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             FortLayerAudio_Native;                             // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAIPawn*                            TargetAIPawn_Native;                               // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bComputeWaterDepth;                                // 0x07E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4379[0x3];                                     // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TetheredVolumeMultiplier;                          // 0x07E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SoundSurfaceTypeCount;                             // 0x07E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityClampingMinimum;                           // 0x07EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityClampingMaximum;                           // 0x07F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_437A[0xC];                                     // 0x07F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSpicySakeGameplayCueNotifyLoop_Alive">();
	}
	static class AFortSpicySakeGameplayCueNotifyLoop_Alive* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSpicySakeGameplayCueNotifyLoop_Alive>();
	}
};
static_assert(alignof(AFortSpicySakeGameplayCueNotifyLoop_Alive) == 0x000008, "Wrong alignment on AFortSpicySakeGameplayCueNotifyLoop_Alive");
static_assert(sizeof(AFortSpicySakeGameplayCueNotifyLoop_Alive) == 0x000800, "Wrong size on AFortSpicySakeGameplayCueNotifyLoop_Alive");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, WaterFX_Native) == 0x0007C0, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::WaterFX_Native' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, LandFX_Native) == 0x0007C8, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::LandFX_Native' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, FortLayerAudio_Native) == 0x0007D0, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::FortLayerAudio_Native' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, TargetAIPawn_Native) == 0x0007D8, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::TargetAIPawn_Native' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, bComputeWaterDepth) == 0x0007E0, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::bComputeWaterDepth' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, TetheredVolumeMultiplier) == 0x0007E4, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::TetheredVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, SoundSurfaceTypeCount) == 0x0007E8, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::SoundSurfaceTypeCount' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, VelocityClampingMinimum) == 0x0007EC, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::VelocityClampingMinimum' has a wrong offset!");
static_assert(offsetof(AFortSpicySakeGameplayCueNotifyLoop_Alive, VelocityClampingMaximum) == 0x0007F0, "Member 'AFortSpicySakeGameplayCueNotifyLoop_Alive::VelocityClampingMaximum' has a wrong offset!");

// Class SpicySakeRuntime.FortSpicySakeOccupantAnimInstanceLayer
// 0x0020 (0x02C0 - 0x02A0)
class UFortSpicySakeOccupantAnimInstanceLayer final : public UFortBaseLayerAnimInstance
{
public:
	float                                         GroundIdleThreshold;                               // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundIdleLowThreshold;                            // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalVelocityYawAngleTurnResetThreshold;           // 0x02A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalVelocityYawAngleTurnTransitionThreshold;      // 0x02AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalVelocityYawAngle;                             // 0x02B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnSpeed2D;                                       // 0x02B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnVelocityZ;                                     // 0x02B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsFemale : 1;                                     // 0x02BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOnGround : 1;                                   // 0x02BC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOnWater : 1;                                    // 0x02BC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLandingPredicted : 1;                             // 0x02BC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_NewFallAditive_NewFallLandAdditive : 1; // 0x02BC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransitionNewJumpLoopAdditiveToNewFallAdditive : 1; // 0x02BC(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldApplyIdleAdditive : 1;                      // 0x02BC(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsTargeting : 1;                                  // 0x02BC(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsPlayerCloseToShark : 1;                         // 0x02BD(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsBoosting : 1;                                   // 0x02BD(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanTurnLeft : 1;                                  // 0x02BD(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanTurnRight : 1;                                 // 0x02BD(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_RideLoop_TurnLeft : 1;                 // 0x02BD(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_RideLoop_TurnRight : 1;                // 0x02BD(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsReloading : 1;                                  // 0x02BD(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsPlayingMeleeAnim : 1;                           // 0x02BD(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsPlayingEmote : 1;                               // 0x02BE(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldPlayOnGroundIdle : 1;                       // 0x02BE(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldPlayOnGroundIdleLow : 1;                    // 0x02BE(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsJumping : 1;                                    // 0x02BE(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanUseTargettingStateMachine : 1;                 // 0x02BE(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_SharRideLoop_To_JumpUp : 1;            // 0x02BE(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_437B[0x1];                                     // 0x02BF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSpicySakeOccupantAnimInstanceLayer">();
	}
	static class UFortSpicySakeOccupantAnimInstanceLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSpicySakeOccupantAnimInstanceLayer>();
	}
};
static_assert(alignof(UFortSpicySakeOccupantAnimInstanceLayer) == 0x000010, "Wrong alignment on UFortSpicySakeOccupantAnimInstanceLayer");
static_assert(sizeof(UFortSpicySakeOccupantAnimInstanceLayer) == 0x0002C0, "Wrong size on UFortSpicySakeOccupantAnimInstanceLayer");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, GroundIdleThreshold) == 0x0002A0, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::GroundIdleThreshold' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, GroundIdleLowThreshold) == 0x0002A4, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::GroundIdleLowThreshold' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, LocalVelocityYawAngleTurnResetThreshold) == 0x0002A8, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::LocalVelocityYawAngleTurnResetThreshold' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, LocalVelocityYawAngleTurnTransitionThreshold) == 0x0002AC, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::LocalVelocityYawAngleTurnTransitionThreshold' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, LocalVelocityYawAngle) == 0x0002B0, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::LocalVelocityYawAngle' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, PawnSpeed2D) == 0x0002B4, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::PawnSpeed2D' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeOccupantAnimInstanceLayer, PawnVelocityZ) == 0x0002B8, "Member 'UFortSpicySakeOccupantAnimInstanceLayer::PawnVelocityZ' has a wrong offset!");

// Class SpicySakeRuntime.FortSpicySakeVehicleAnimInstance
// 0x0020 (0x02C0 - 0x02A0)
class UFortSpicySakeVehicleAnimInstance final : public UFortBaseAnimInstance
{
public:
	struct FRotator                               OnGroundSlopeRotOffset;                            // 0x0298(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LocalVelocityYawAngle;                             // 0x02A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x02A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpSpeed;                                           // 0x02AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothJumpPitch;                                   // 0x02B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothJumpPitchDeltaRate;                          // 0x02B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentBoostRateScale;                             // 0x02B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsJumping : 1;                                    // 0x02BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsSurfaceSwimming : 1;                            // 0x02BC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOnGround : 1;                                   // 0x02BC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsFalling : 1;                                    // 0x02BC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsCharging : 1;                                   // 0x02BC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnGroundNotMoving : 1;                            // 0x02BC(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLanded : 1;                                       // 0x02BC(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsBoosting : 1;                                   // 0x02BC(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStartBoosting : 1;                                // 0x02BD(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_Idle_To_Boost : 1;                     // 0x02BD(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransition_Boost_To_Idle : 1;                     // 0x02BD(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_437C[0x2];                                     // 0x02BE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSpicySakeVehicleAnimInstance">();
	}
	static class UFortSpicySakeVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSpicySakeVehicleAnimInstance>();
	}
};
static_assert(alignof(UFortSpicySakeVehicleAnimInstance) == 0x000010, "Wrong alignment on UFortSpicySakeVehicleAnimInstance");
static_assert(sizeof(UFortSpicySakeVehicleAnimInstance) == 0x0002C0, "Wrong size on UFortSpicySakeVehicleAnimInstance");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, OnGroundSlopeRotOffset) == 0x000298, "Member 'UFortSpicySakeVehicleAnimInstance::OnGroundSlopeRotOffset' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, LocalVelocityYawAngle) == 0x0002A4, "Member 'UFortSpicySakeVehicleAnimInstance::LocalVelocityYawAngle' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, ForwardSpeed) == 0x0002A8, "Member 'UFortSpicySakeVehicleAnimInstance::ForwardSpeed' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, UpSpeed) == 0x0002AC, "Member 'UFortSpicySakeVehicleAnimInstance::UpSpeed' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, SmoothJumpPitch) == 0x0002B0, "Member 'UFortSpicySakeVehicleAnimInstance::SmoothJumpPitch' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, SmoothJumpPitchDeltaRate) == 0x0002B4, "Member 'UFortSpicySakeVehicleAnimInstance::SmoothJumpPitchDeltaRate' has a wrong offset!");
static_assert(offsetof(UFortSpicySakeVehicleAnimInstance, CurrentBoostRateScale) == 0x0002B8, "Member 'UFortSpicySakeVehicleAnimInstance::CurrentBoostRateScale' has a wrong offset!");

}

