#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stage_DJ_Booth_SkiClub

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Stage_DJ_Booth_SkiClub.Stage_DJ_Booth_SkiClub_C.ExecuteUbergraph_Stage_DJ_Booth_SkiClub
// 0x01F0 (0x01F0 - 0x0000)
struct Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x003C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x00D8(0x0018)()
	float                                         K2Node_Event_Damage;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876E[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x00F8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0124(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x01C0(0x0018)()
	class AFortWeaponPickaxeAthena*               K2Node_DynamicCast_AsFort_Weapon_Pickaxe_Athena;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_876F[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub) == 0x000008, "Wrong alignment on Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub");
static_assert(sizeof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub) == 0x0001F0, "Wrong size on Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, EntryPoint) == 0x000000, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::EntryPoint' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_Damage_1) == 0x000008, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_DamageTags_1) == 0x000010, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_Momentum_1) == 0x000030, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_HitInfo_1) == 0x00003C, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_InstigatedBy_1) == 0x0000C8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_DamageCauser_1) == 0x0000D0, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_EffectContext_1) == 0x0000D8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_Damage) == 0x0000F0, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_DamageTags) == 0x0000F8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_Momentum) == 0x000118, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_HitInfo) == 0x000124, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_InstigatedBy) == 0x0001B0, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_DamageCauser) == 0x0001B8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_Event_EffectContext) == 0x0001C0, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_DynamicCast_AsFort_Weapon_Pickaxe_Athena) == 0x0001D8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_DynamicCast_AsFort_Weapon_Pickaxe_Athena' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, CallFunc_Add_IntInt_ReturnValue) == 0x0001E4, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub, CallFunc_Percent_IntInt_ReturnValue) == 0x0001E8, "Member 'Stage_DJ_Booth_SkiClub_C_ExecuteUbergraph_Stage_DJ_Booth_SkiClub::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function Stage_DJ_Booth_SkiClub.Stage_DJ_Booth_SkiClub_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct Stage_DJ_Booth_SkiClub_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8770[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Stage_DJ_Booth_SkiClub_C_OnDamageServer) == 0x000008, "Wrong alignment on Stage_DJ_Booth_SkiClub_C_OnDamageServer");
static_assert(sizeof(Stage_DJ_Booth_SkiClub_C_OnDamageServer) == 0x0000E8, "Wrong size on Stage_DJ_Booth_SkiClub_C_OnDamageServer");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, Damage) == 0x000000, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, DamageTags) == 0x000008, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, Momentum) == 0x000028, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, HitInfo) == 0x000034, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'Stage_DJ_Booth_SkiClub_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function Stage_DJ_Booth_SkiClub.Stage_DJ_Booth_SkiClub_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8771[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects");
static_assert(sizeof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Stage_DJ_Booth_SkiClub_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Stage_DJ_Booth_SkiClub.Stage_DJ_Booth_SkiClub_C.OnRep_TrackIndex
// 0x0008 (0x0008 - 0x0000)
struct Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex final
{
public:
	class USoundBase*                             CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex) == 0x000008, "Wrong alignment on Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex");
static_assert(sizeof(Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex) == 0x000008, "Wrong size on Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex");
static_assert(offsetof(Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex, CallFunc_Array_Get_Item) == 0x000000, "Member 'Stage_DJ_Booth_SkiClub_C_OnRep_TrackIndex::CallFunc_Array_Get_Item' has a wrong offset!");

}

