#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function StatsListWidget.StatsListWidget_C.Trigger Initial Reset
// 0x0028 (0x0028 - 0x0000)
struct StatsListWidget_C_Trigger_Initial_Reset final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7165[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatsListItemWIdget_C*                 K2Node_DynamicCast_AsStats_List_Item_WIdget;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7166[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_Trigger_Initial_Reset) == 0x000008, "Wrong alignment on StatsListWidget_C_Trigger_Initial_Reset");
static_assert(sizeof(StatsListWidget_C_Trigger_Initial_Reset) == 0x000028, "Wrong size on StatsListWidget_C_Trigger_Initial_Reset");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, Temp_int_Variable) == 0x000000, "Member 'StatsListWidget_C_Trigger_Initial_Reset::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'StatsListWidget_C_Trigger_Initial_Reset::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'StatsListWidget_C_Trigger_Initial_Reset::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'StatsListWidget_C_Trigger_Initial_Reset::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, K2Node_DynamicCast_AsStats_List_Item_WIdget) == 0x000018, "Member 'StatsListWidget_C_Trigger_Initial_Reset::K2Node_DynamicCast_AsStats_List_Item_WIdget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'StatsListWidget_C_Trigger_Initial_Reset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'StatsListWidget_C_Trigger_Initial_Reset::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Initial_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'StatsListWidget_C_Trigger_Initial_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.Trigger Update Anim
// 0x0020 (0x0020 - 0x0000)
struct StatsListWidget_C_Trigger_Update_Anim final
{
public:
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7167[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_Trigger_Update_Anim) == 0x000008, "Wrong alignment on StatsListWidget_C_Trigger_Update_Anim");
static_assert(sizeof(StatsListWidget_C_Trigger_Update_Anim) == 0x000020, "Wrong size on StatsListWidget_C_Trigger_Update_Anim");
static_assert(offsetof(StatsListWidget_C_Trigger_Update_Anim, CallFunc_GetScrollOffset_ReturnValue) == 0x000000, "Member 'StatsListWidget_C_Trigger_Update_Anim::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Update_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'StatsListWidget_C_Trigger_Update_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Update_Anim, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'StatsListWidget_C_Trigger_Update_Anim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Trigger_Update_Anim, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'StatsListWidget_C_Trigger_Update_Anim::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.Update
// 0x0038 (0x0038 - 0x0000)
struct StatsListWidget_C_Update final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 K2Node_DynamicCast_AsStats_List_Item_WIdget;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7168[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_Update) == 0x000008, "Wrong alignment on StatsListWidget_C_Update");
static_assert(sizeof(StatsListWidget_C_Update) == 0x000038, "Wrong size on StatsListWidget_C_Update");
static_assert(offsetof(StatsListWidget_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'StatsListWidget_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'StatsListWidget_C_Update::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'StatsListWidget_C_Update::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'StatsListWidget_C_Update::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'StatsListWidget_C_Update::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, K2Node_DynamicCast_AsStats_List_Item_WIdget) == 0x000028, "Member 'StatsListWidget_C_Update::K2Node_DynamicCast_AsStats_List_Item_WIdget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'StatsListWidget_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'StatsListWidget_C_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_Update, Temp_int_Variable) == 0x000034, "Member 'StatsListWidget_C_Update::Temp_int_Variable' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.AdjustClampCount
// 0x00B8 (0x00B8 - 0x0000)
struct StatsListWidget_C_AdjustClampCount final
{
public:
	class UFortAttributeListItem_NUI*             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7169[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute; // 0x0018(0x0088)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716B[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsListWidget_C_AdjustClampCount) == 0x000008, "Wrong alignment on StatsListWidget_C_AdjustClampCount");
static_assert(sizeof(StatsListWidget_C_AdjustClampCount) == 0x0000B8, "Wrong size on StatsListWidget_C_AdjustClampCount");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, Widget) == 0x000000, "Member 'StatsListWidget_C_AdjustClampCount::Widget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, Add) == 0x000008, "Member 'StatsListWidget_C_AdjustClampCount::Add' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, Temp_int_Variable) == 0x00000C, "Member 'StatsListWidget_C_AdjustClampCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute) == 0x000018, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A4, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, Temp_int_Variable_1) == 0x0000AC, "Member 'StatsListWidget_C_AdjustClampCount::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_AdjustClampCount, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000B0, "Member 'StatsListWidget_C_AdjustClampCount::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.ToggleClampedValueMessage
// 0x0005 (0x0005 - 0x0000)
struct StatsListWidget_C_ToggleClampedValueMessage final
{
public:
	bool                                          InShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_ToggleClampedValueMessage) == 0x000001, "Wrong alignment on StatsListWidget_C_ToggleClampedValueMessage");
static_assert(sizeof(StatsListWidget_C_ToggleClampedValueMessage) == 0x000005, "Wrong size on StatsListWidget_C_ToggleClampedValueMessage");
static_assert(offsetof(StatsListWidget_C_ToggleClampedValueMessage, InShow) == 0x000000, "Member 'StatsListWidget_C_ToggleClampedValueMessage::InShow' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ToggleClampedValueMessage, Temp_bool_Variable) == 0x000001, "Member 'StatsListWidget_C_ToggleClampedValueMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ToggleClampedValueMessage, Temp_byte_Variable) == 0x000002, "Member 'StatsListWidget_C_ToggleClampedValueMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ToggleClampedValueMessage, Temp_byte_Variable_1) == 0x000003, "Member 'StatsListWidget_C_ToggleClampedValueMessage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ToggleClampedValueMessage, K2Node_Select_Default) == 0x000004, "Member 'StatsListWidget_C_ToggleClampedValueMessage::K2Node_Select_Default' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.OnAddShownAttributeListItem
// 0x0008 (0x0008 - 0x0000)
struct StatsListWidget_C_OnAddShownAttributeListItem final
{
public:
	class UFortAttributeListItem_NUI*             AttributeListItemWidget;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_OnAddShownAttributeListItem) == 0x000008, "Wrong alignment on StatsListWidget_C_OnAddShownAttributeListItem");
static_assert(sizeof(StatsListWidget_C_OnAddShownAttributeListItem) == 0x000008, "Wrong size on StatsListWidget_C_OnAddShownAttributeListItem");
static_assert(offsetof(StatsListWidget_C_OnAddShownAttributeListItem, AttributeListItemWidget) == 0x000000, "Member 'StatsListWidget_C_OnAddShownAttributeListItem::AttributeListItemWidget' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.OnRemoveShownAttributeListItem
// 0x0010 (0x0010 - 0x0000)
struct StatsListWidget_C_OnRemoveShownAttributeListItem final
{
public:
	class UFortAttributeListItem_NUI*             AttributeListItemWidget;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AtIndex;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListWidget_C_OnRemoveShownAttributeListItem) == 0x000008, "Wrong alignment on StatsListWidget_C_OnRemoveShownAttributeListItem");
static_assert(sizeof(StatsListWidget_C_OnRemoveShownAttributeListItem) == 0x000010, "Wrong size on StatsListWidget_C_OnRemoveShownAttributeListItem");
static_assert(offsetof(StatsListWidget_C_OnRemoveShownAttributeListItem, AttributeListItemWidget) == 0x000000, "Member 'StatsListWidget_C_OnRemoveShownAttributeListItem::AttributeListItemWidget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_OnRemoveShownAttributeListItem, AtIndex) == 0x000008, "Member 'StatsListWidget_C_OnRemoveShownAttributeListItem::AtIndex' has a wrong offset!");

// Function StatsListWidget.StatsListWidget_C.ExecuteUbergraph_StatsListWidget
// 0x0038 (0x0038 - 0x0000)
struct StatsListWidget_C_ExecuteUbergraph_StatsListWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_716C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAttributeListItem_NUI*             K2Node_Event_AttributeListItemWidget_1;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 K2Node_DynamicCast_AsStats_List_Item_WIdget;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAttributeListItem_NUI*             K2Node_Event_AttributeListItemWidget;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AtIndex;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget) == 0x000008, "Wrong alignment on StatsListWidget_C_ExecuteUbergraph_StatsListWidget");
static_assert(sizeof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget) == 0x000038, "Wrong size on StatsListWidget_C_ExecuteUbergraph_StatsListWidget");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, EntryPoint) == 0x000000, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, K2Node_Event_AttributeListItemWidget_1) == 0x000008, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::K2Node_Event_AttributeListItemWidget_1' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000010, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, K2Node_DynamicCast_AsStats_List_Item_WIdget) == 0x000018, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::K2Node_DynamicCast_AsStats_List_Item_WIdget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, K2Node_Event_AttributeListItemWidget) == 0x000028, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::K2Node_Event_AttributeListItemWidget' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, K2Node_Event_AtIndex) == 0x000030, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::K2Node_Event_AtIndex' has a wrong offset!");
static_assert(offsetof(StatsListWidget_C_ExecuteUbergraph_StatsListWidget, CallFunc_RemoveChildAt_ReturnValue) == 0x000034, "Member 'StatsListWidget_C_ExecuteUbergraph_StatsListWidget::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");

}

