#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsModeItemDetailsHostPanel_Store

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StatsModeItemDetailsHostPanel_Store.StatsModeItemDetailsHostPanel_Store_C.ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store
// 0x0008 (0x0008 - 0x0000)
struct StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store) == 0x000004, "Wrong alignment on StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store");
static_assert(sizeof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store) == 0x000008, "Wrong size on StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store");
static_assert(offsetof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store, EntryPoint) == 0x000000, "Member 'StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store, Temp_bool_Variable) == 0x000004, "Member 'StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store, Temp_byte_Variable) == 0x000005, "Member 'StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store, Temp_byte_Variable_1) == 0x000006, "Member 'StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store, K2Node_Select_Default) == 0x000007, "Member 'StatsModeItemDetailsHostPanel_Store_C_ExecuteUbergraph_StatsModeItemDetailsHostPanel_Store::K2Node_Select_Default' has a wrong offset!");

}

