#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsListItemWIdget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function StatsListItemWIdget.StatsListItemWIdget_C.Initial Reset
// 0x0008 (0x0008 - 0x0000)
struct StatsListItemWIdget_C_Initial_Reset final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_Initial_Reset) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_Initial_Reset");
static_assert(sizeof(StatsListItemWIdget_C_Initial_Reset) == 0x000008, "Wrong size on StatsListItemWIdget_C_Initial_Reset");
static_assert(offsetof(StatsListItemWIdget_C_Initial_Reset, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StatsListItemWIdget_C_Initial_Reset::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.Populate-Update
// 0x0008 (0x0008 - 0x0000)
struct StatsListItemWIdget_C_PopulateMinusUpdate final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_PopulateMinusUpdate) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_PopulateMinusUpdate");
static_assert(sizeof(StatsListItemWIdget_C_PopulateMinusUpdate) == 0x000008, "Wrong size on StatsListItemWIdget_C_PopulateMinusUpdate");
static_assert(offsetof(StatsListItemWIdget_C_PopulateMinusUpdate, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StatsListItemWIdget_C_PopulateMinusUpdate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.SetTextAndBorderHighlight
// 0x0018 (0x0018 - 0x0000)
struct StatsListItemWIdget_C_SetTextAndBorderHighlight final
{
public:
	bool                                          bHightlight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_718A[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_SetTextAndBorderHighlight) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_SetTextAndBorderHighlight");
static_assert(sizeof(StatsListItemWIdget_C_SetTextAndBorderHighlight) == 0x000018, "Wrong size on StatsListItemWIdget_C_SetTextAndBorderHighlight");
static_assert(offsetof(StatsListItemWIdget_C_SetTextAndBorderHighlight, bHightlight) == 0x000000, "Member 'StatsListItemWIdget_C_SetTextAndBorderHighlight::bHightlight' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_SetTextAndBorderHighlight, Temp_bool_Variable) == 0x000001, "Member 'StatsListItemWIdget_C_SetTextAndBorderHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_SetTextAndBorderHighlight, Temp_bool_Variable_1) == 0x000002, "Member 'StatsListItemWIdget_C_SetTextAndBorderHighlight::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_SetTextAndBorderHighlight, K2Node_Select_Default) == 0x000008, "Member 'StatsListItemWIdget_C_SetTextAndBorderHighlight::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_SetTextAndBorderHighlight, K2Node_Select_Default_1) == 0x000010, "Member 'StatsListItemWIdget_C_SetTextAndBorderHighlight::K2Node_Select_Default_1' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.GetListItemTooltipWidget
// 0x00B8 (0x00B8 - 0x0000)
struct StatsListItemWIdget_C_GetListItemTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute; // 0x0020(0x0088)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_718C[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_GetListItemTooltipWidget) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_GetListItemTooltipWidget");
static_assert(sizeof(StatsListItemWIdget_C_GetListItemTooltipWidget) == 0x0000B8, "Wrong size on StatsListItemWIdget_C_GetListItemTooltipWidget");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, ReturnValue) == 0x000000, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000018, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute) == 0x000020, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_GetListItemTooltipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x0000B0, "Member 'StatsListItemWIdget_C_GetListItemTooltipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.SetStatIcon
// 0x0088 (0x0088 - 0x0000)
struct StatsListItemWIdget_C_SetStatIcon final
{
public:
	struct FSlateBrush                            NewParam;                                          // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(StatsListItemWIdget_C_SetStatIcon) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_SetStatIcon");
static_assert(sizeof(StatsListItemWIdget_C_SetStatIcon) == 0x000088, "Wrong size on StatsListItemWIdget_C_SetStatIcon");
static_assert(offsetof(StatsListItemWIdget_C_SetStatIcon, NewParam) == 0x000000, "Member 'StatsListItemWIdget_C_SetStatIcon::NewParam' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.UpdateBuffArrows
// 0x0148 (0x0148 - 0x0000)
struct StatsListItemWIdget_C_UpdateBuffArrows final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFortDisplayAttribute                  LocalCurrentAttribute;                             // 0x0088(0x0088)(Edit, BlueprintVisible)
	float                                         Temp_float_Variable;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortClampState                               Temp_byte_Variable;                                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortComparisonType                           Temp_byte_Variable_4;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718D[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortComparisonType                           Temp_byte_Variable_5;                              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718E[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortClampState                               Temp_byte_Variable_10;                             // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718F[0x1];                                     // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_UpdateBuffArrows) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_UpdateBuffArrows");
static_assert(sizeof(StatsListItemWIdget_C_UpdateBuffArrows) == 0x000148, "Wrong size on StatsListItemWIdget_C_UpdateBuffArrows");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::CurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, LocalCurrentAttribute) == 0x000088, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::LocalCurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable) == 0x000110, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_1) == 0x000114, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_2) == 0x000118, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable) == 0x00011C, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_1) == 0x00011D, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_2) == 0x00011E, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_3) == 0x00011F, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_4) == 0x000120, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_3) == 0x000124, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_4) == 0x000128, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_5) == 0x00012C, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_float_Variable_6) == 0x000130, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_5) == 0x000134, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, K2Node_Select_Default) == 0x000138, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_6) == 0x00013C, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_7) == 0x00013D, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_8) == 0x00013E, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_9) == 0x00013F, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, K2Node_Select_Default_1) == 0x000140, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, K2Node_Select_Default_2) == 0x000141, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, Temp_byte_Variable_10) == 0x000142, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBuffArrows, K2Node_Select_Default_3) == 0x000144, "Member 'StatsListItemWIdget_C_UpdateBuffArrows::K2Node_Select_Default_3' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.UpdateBasicPairLabel
// 0x00A8 (0x00A8 - 0x0000)
struct StatsListItemWIdget_C_UpdateBasicPairLabel final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0088(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsListItemWIdget_C_UpdateBasicPairLabel) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_UpdateBasicPairLabel");
static_assert(sizeof(StatsListItemWIdget_C_UpdateBasicPairLabel) == 0x0000A8, "Wrong size on StatsListItemWIdget_C_UpdateBasicPairLabel");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBasicPairLabel, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_UpdateBasicPairLabel::CurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBasicPairLabel, CallFunc_GetEmptyText_ReturnValue) == 0x000088, "Member 'StatsListItemWIdget_C_UpdateBasicPairLabel::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateBasicPairLabel, CallFunc_NotEqual_TextText_ReturnValue) == 0x0000A0, "Member 'StatsListItemWIdget_C_UpdateBasicPairLabel::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.UpdateValueText
// 0x0088 (0x0088 - 0x0000)
struct StatsListItemWIdget_C_UpdateValueText final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(StatsListItemWIdget_C_UpdateValueText) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_UpdateValueText");
static_assert(sizeof(StatsListItemWIdget_C_UpdateValueText) == 0x000088, "Wrong size on StatsListItemWIdget_C_UpdateValueText");
static_assert(offsetof(StatsListItemWIdget_C_UpdateValueText, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_UpdateValueText::CurrentAttribute' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.UpdateType
// 0x0098 (0x0098 - 0x0000)
struct StatsListItemWIdget_C_UpdateType final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortStatValueDisplayType                     Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7190[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_UpdateType) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_UpdateType");
static_assert(sizeof(StatsListItemWIdget_C_UpdateType) == 0x000098, "Wrong size on StatsListItemWIdget_C_UpdateType");
static_assert(offsetof(StatsListItemWIdget_C_UpdateType, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_UpdateType::CurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateType, Temp_byte_Variable) == 0x000088, "Member 'StatsListItemWIdget_C_UpdateType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateType, K2Node_Select_Default) == 0x000090, "Member 'StatsListItemWIdget_C_UpdateType::K2Node_Select_Default' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.UpdateColors
// 0x01C8 (0x01C8 - 0x0000)
struct StatsListItemWIdget_C_UpdateColors final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFortDisplayAttribute                  LocalCurrentAttribute;                             // 0x0088(0x0088)(Edit, BlueprintVisible)
	struct FLinearColor                           BuffColor;                                         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BaseColor;                                         // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuffState                                Temp_byte_Variable;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuffState                                Temp_byte_Variable_1;                              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7191[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Base___Buff_Colors_Base;              // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Base___Buff_Colors_Buff;              // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortComparisonType                           Temp_byte_Variable_2;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7192[0x1];                                     // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7193[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0190(0x0028)()
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_UpdateColors) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_UpdateColors");
static_assert(sizeof(StatsListItemWIdget_C_UpdateColors) == 0x0001C8, "Wrong size on StatsListItemWIdget_C_UpdateColors");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_UpdateColors::CurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, LocalCurrentAttribute) == 0x000088, "Member 'StatsListItemWIdget_C_UpdateColors::LocalCurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, BuffColor) == 0x000110, "Member 'StatsListItemWIdget_C_UpdateColors::BuffColor' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, BaseColor) == 0x000120, "Member 'StatsListItemWIdget_C_UpdateColors::BaseColor' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_class_Variable) == 0x000130, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_class_Variable_1) == 0x000138, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_class_Variable_2) == 0x000140, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_byte_Variable) == 0x000148, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_byte_Variable_1) == 0x000149, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, K2Node_Select_Default) == 0x000150, "Member 'StatsListItemWIdget_C_UpdateColors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, CallFunc_Get_Base___Buff_Colors_Base) == 0x000158, "Member 'StatsListItemWIdget_C_UpdateColors::CallFunc_Get_Base___Buff_Colors_Base' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, CallFunc_Get_Base___Buff_Colors_Buff) == 0x000168, "Member 'StatsListItemWIdget_C_UpdateColors::CallFunc_Get_Base___Buff_Colors_Buff' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, Temp_byte_Variable_2) == 0x000178, "Member 'StatsListItemWIdget_C_UpdateColors::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, K2Node_SwitchEnum_CmpSuccess) == 0x000179, "Member 'StatsListItemWIdget_C_UpdateColors::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, CallFunc_NotEqual_TextText_ReturnValue) == 0x00017A, "Member 'StatsListItemWIdget_C_UpdateColors::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, K2Node_Select_Default_1) == 0x00017C, "Member 'StatsListItemWIdget_C_UpdateColors::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, K2Node_MakeStruct_SlateColor) == 0x000190, "Member 'StatsListItemWIdget_C_UpdateColors::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_UpdateColors, K2Node_Select_Default_2) == 0x0001B8, "Member 'StatsListItemWIdget_C_UpdateColors::K2Node_Select_Default_2' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.Update
// 0x0110 (0x0110 - 0x0000)
struct StatsListItemWIdget_C_Update final
{
public:
	struct FFortDisplayAttribute                  CurrentAttribute;                                  // 0x0000(0x0088)(Edit, BlueprintVisible)
	struct FFortDisplayAttribute                  CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute; // 0x0088(0x0088)()
};
static_assert(alignof(StatsListItemWIdget_C_Update) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_Update");
static_assert(sizeof(StatsListItemWIdget_C_Update) == 0x000110, "Wrong size on StatsListItemWIdget_C_Update");
static_assert(offsetof(StatsListItemWIdget_C_Update, CurrentAttribute) == 0x000000, "Member 'StatsListItemWIdget_C_Update::CurrentAttribute' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_Update, CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute) == 0x000088, "Member 'StatsListItemWIdget_C_Update::CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.ValueChanged
// 0x0004 (0x0004 - 0x0000)
struct StatsListItemWIdget_C_ValueChanged final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_ValueChanged) == 0x000004, "Wrong alignment on StatsListItemWIdget_C_ValueChanged");
static_assert(sizeof(StatsListItemWIdget_C_ValueChanged) == 0x000004, "Wrong size on StatsListItemWIdget_C_ValueChanged");
static_assert(offsetof(StatsListItemWIdget_C_ValueChanged, Delta) == 0x000000, "Member 'StatsListItemWIdget_C_ValueChanged::Delta' has a wrong offset!");

// Function StatsListItemWIdget.StatsListItemWIdget_C.ExecuteUbergraph_StatsListItemWIdget
// 0x0098 (0x0098 - 0x0000)
struct StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7194[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetCurrentAttributeCopy_OutDisplayAttribute; // 0x0008(0x0088)()
	float                                         K2Node_Event_Delta;                                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget) == 0x000008, "Wrong alignment on StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget");
static_assert(sizeof(StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget) == 0x000098, "Wrong size on StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget");
static_assert(offsetof(StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget, EntryPoint) == 0x000000, "Member 'StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'StatsListItemWIdget_C_ExecuteUbergraph_StatsListItemWIdget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
