#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StayTogetherButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StayTogetherButton.StayTogetherButton_C
// 0x0018 (0x0B88 - 0x0B70)
class UStayTogetherButton_C final : public UAthenaPreserveSquadButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SB_Check;                                          // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StayAsATeam;                                  // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StayTogetherButton(int32 EntryPoint);
	void BP_HandlePreserveSquadChanged(bool bPreserveSquad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StayTogetherButton_C">();
	}
	static class UStayTogetherButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStayTogetherButton_C>();
	}
};
static_assert(alignof(UStayTogetherButton_C) == 0x000008, "Wrong alignment on UStayTogetherButton_C");
static_assert(sizeof(UStayTogetherButton_C) == 0x000B88, "Wrong size on UStayTogetherButton_C");
static_assert(offsetof(UStayTogetherButton_C, UberGraphFrame) == 0x000B70, "Member 'UStayTogetherButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStayTogetherButton_C, SB_Check) == 0x000B78, "Member 'UStayTogetherButton_C::SB_Check' has a wrong offset!");
static_assert(offsetof(UStayTogetherButton_C, Text_StayAsATeam) == 0x000B80, "Member 'UStayTogetherButton_C::Text_StayAsATeam' has a wrong offset!");

}

