#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_Root

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_Root.StoreMain_Root_C.GetVisibilityByChildrenPresence
// 0x0010 (0x0010 - 0x0000)
struct StoreMain_Root_C_GetVisibilityByChildrenPresence final
{
public:
	class UPanelWidget*                           Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              NewParam;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_GetVisibilityByChildrenPresence) == 0x000008, "Wrong alignment on StoreMain_Root_C_GetVisibilityByChildrenPresence");
static_assert(sizeof(StoreMain_Root_C_GetVisibilityByChildrenPresence) == 0x000010, "Wrong size on StoreMain_Root_C_GetVisibilityByChildrenPresence");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, Panel) == 0x000000, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::Panel' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, NewParam) == 0x000008, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::NewParam' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, Temp_bool_Variable) == 0x000009, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, CallFunc_HasAnyChildren_ReturnValue) == 0x00000A, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, Temp_byte_Variable) == 0x00000B, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, Temp_byte_Variable_1) == 0x00000C, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_GetVisibilityByChildrenPresence, K2Node_Select_Default) == 0x00000D, "Member 'StoreMain_Root_C_GetVisibilityByChildrenPresence::K2Node_Select_Default' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.HandleAllOffersGenerated
// 0x0003 (0x0003 - 0x0000)
struct StoreMain_Root_C_HandleAllOffersGenerated final
{
public:
	ESlateVisibility                              CallFunc_GetVisibilityByChildrenPresence_NewParam; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibilityByChildrenPresence_NewParam_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_HandleAllOffersGenerated) == 0x000001, "Wrong alignment on StoreMain_Root_C_HandleAllOffersGenerated");
static_assert(sizeof(StoreMain_Root_C_HandleAllOffersGenerated) == 0x000003, "Wrong size on StoreMain_Root_C_HandleAllOffersGenerated");
static_assert(offsetof(StoreMain_Root_C_HandleAllOffersGenerated, CallFunc_GetVisibilityByChildrenPresence_NewParam) == 0x000000, "Member 'StoreMain_Root_C_HandleAllOffersGenerated::CallFunc_GetVisibilityByChildrenPresence_NewParam' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleAllOffersGenerated, CallFunc_GetVisibilityByChildrenPresence_NewParam_1) == 0x000001, "Member 'StoreMain_Root_C_HandleAllOffersGenerated::CallFunc_GetVisibilityByChildrenPresence_NewParam_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleAllOffersGenerated, CallFunc_IsActivated_ReturnValue) == 0x000002, "Member 'StoreMain_Root_C_HandleAllOffersGenerated::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.HandleGenerateOffer
// 0x0050 (0x0050 - 0x0000)
struct StoreMain_Root_C_HandleGenerateOffer final
{
public:
	class UFortStoreFrontOfferInfo*               OfferInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRealMoneyOffer*                    StoreOfferWidget;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetStorefrontName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D6D[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D6E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_MTXOffer_C*                  CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_HandleGenerateOffer) == 0x000008, "Wrong alignment on StoreMain_Root_C_HandleGenerateOffer");
static_assert(sizeof(StoreMain_Root_C_HandleGenerateOffer) == 0x000050, "Wrong size on StoreMain_Root_C_HandleGenerateOffer");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, OfferInfo) == 0x000000, "Member 'StoreMain_Root_C_HandleGenerateOffer::OfferInfo' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, StoreOfferWidget) == 0x000008, "Member 'StoreMain_Root_C_HandleGenerateOffer::StoreOfferWidget' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_GetStorefrontName_ReturnValue) == 0x000010, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_GetStorefrontName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000024, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_AddChildToGrid_ReturnValue) == 0x000030, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000038, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleGenerateOffer, CallFunc_Create_ReturnValue) == 0x000048, "Member 'StoreMain_Root_C_HandleGenerateOffer::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.PlayEquippedLockerMusic
// 0x0028 (0x0028 - 0x0000)
struct StoreMain_Root_C_PlayEquippedLockerMusic final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D6F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D70[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_PlayEquippedLockerMusic) == 0x000008, "Wrong alignment on StoreMain_Root_C_PlayEquippedLockerMusic");
static_assert(sizeof(StoreMain_Root_C_PlayEquippedLockerMusic) == 0x000028, "Wrong size on StoreMain_Root_C_PlayEquippedLockerMusic");
static_assert(offsetof(StoreMain_Root_C_PlayEquippedLockerMusic, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'StoreMain_Root_C_PlayEquippedLockerMusic::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_PlayEquippedLockerMusic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'StoreMain_Root_C_PlayEquippedLockerMusic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_PlayEquippedLockerMusic, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'StoreMain_Root_C_PlayEquippedLockerMusic::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_PlayEquippedLockerMusic, CallFunc_Array_Get_Item) == 0x000020, "Member 'StoreMain_Root_C_PlayEquippedLockerMusic::CallFunc_Array_Get_Item' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_Root_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_HandleBack) == 0x000001, "Wrong alignment on StoreMain_Root_C_HandleBack");
static_assert(sizeof(StoreMain_Root_C_HandleBack) == 0x000001, "Wrong size on StoreMain_Root_C_HandleBack");
static_assert(offsetof(StoreMain_Root_C_HandleBack, PassThrough) == 0x000000, "Member 'StoreMain_Root_C_HandleBack::PassThrough' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.HandleRedeem
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_Root_C_HandleRedeem final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D71[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URedeemFriendCodeWindow_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_HandleRedeem) == 0x000008, "Wrong alignment on StoreMain_Root_C_HandleRedeem");
static_assert(sizeof(StoreMain_Root_C_HandleRedeem) == 0x000018, "Wrong size on StoreMain_Root_C_HandleRedeem");
static_assert(offsetof(StoreMain_Root_C_HandleRedeem, bPassThrough) == 0x000000, "Member 'StoreMain_Root_C_HandleRedeem::bPassThrough' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleRedeem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'StoreMain_Root_C_HandleRedeem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_HandleRedeem, CallFunc_Create_ReturnValue) == 0x000010, "Member 'StoreMain_Root_C_HandleRedeem::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.SetupForCampaignUpsell
// 0x0070 (0x0070 - 0x0000)
struct StoreMain_Root_C_SetupForCampaignUpsell final
{
public:
	class UFortRuntimeOptions*                    NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0020(0x0010)(NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDesktopPlatform_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D72[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0050(0x0010)(NoDestructor)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_SetupForCampaignUpsell) == 0x000008, "Wrong alignment on StoreMain_Root_C_SetupForCampaignUpsell");
static_assert(sizeof(StoreMain_Root_C_SetupForCampaignUpsell) == 0x000070, "Wrong size on StoreMain_Root_C_SetupForCampaignUpsell");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, NewLocalVar_0) == 0x000000, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, K2Node_MakeStruct_DataTableRowHandle) == 0x000020, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, CallFunc_IsDesktopPlatform_ReturnValue) == 0x000048, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::CallFunc_IsDesktopPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000050, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupForCampaignUpsell, K2Node_MakeArray_Array) == 0x000060, "Member 'StoreMain_Root_C_SetupForCampaignUpsell::K2Node_MakeArray_Array' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.SetupFirstFocusableTile
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_Root_C_SetupFirstFocusableTile final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_SetupFirstFocusableTile) == 0x000008, "Wrong alignment on StoreMain_Root_C_SetupFirstFocusableTile");
static_assert(sizeof(StoreMain_Root_C_SetupFirstFocusableTile) == 0x000018, "Wrong size on StoreMain_Root_C_SetupFirstFocusableTile");
static_assert(offsetof(StoreMain_Root_C_SetupFirstFocusableTile, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'StoreMain_Root_C_SetupFirstFocusableTile::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupFirstFocusableTile, CallFunc_GetChildAt_ReturnValue_1) == 0x000008, "Member 'StoreMain_Root_C_SetupFirstFocusableTile::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_SetupFirstFocusableTile, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'StoreMain_Root_C_SetupFirstFocusableTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.LayoutVBuckTiles
// 0x0050 (0x0050 - 0x0000)
struct StoreMain_Root_C_LayoutVBuckTiles final
{
public:
	class UWidget*                                Child;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_MTXOffer_C*                  K2Node_DynamicCast_AsStore_Main_MTXOffer;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D73[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D74[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D75[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_LayoutVBuckTiles) == 0x000008, "Wrong alignment on StoreMain_Root_C_LayoutVBuckTiles");
static_assert(sizeof(StoreMain_Root_C_LayoutVBuckTiles) == 0x000050, "Wrong size on StoreMain_Root_C_LayoutVBuckTiles");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, Child) == 0x000000, "Member 'StoreMain_Root_C_LayoutVBuckTiles::Child' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, Param_Index) == 0x000008, "Member 'StoreMain_Root_C_LayoutVBuckTiles::Param_Index' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, K2Node_DynamicCast_AsStore_Main_MTXOffer) == 0x000010, "Member 'StoreMain_Root_C_LayoutVBuckTiles::K2Node_DynamicCast_AsStore_Main_MTXOffer' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StoreMain_Root_C_LayoutVBuckTiles::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000020, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_GetChildrenCount_ReturnValue) == 0x000034, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000038, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, Temp_int_Variable) == 0x000044, "Member 'StoreMain_Root_C_LayoutVBuckTiles::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_LayoutVBuckTiles, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'StoreMain_Root_C_LayoutVBuckTiles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.Get Main Tab Reference
// 0x0038 (0x0038 - 0x0000)
struct StoreMain_Root_C_Get_Main_Tab_Reference final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D76[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainTabsScreen_C*                      K2Node_DynamicCast_AsMain_Tabs_Screen;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D77[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_Get_Main_Tab_Reference) == 0x000008, "Wrong alignment on StoreMain_Root_C_Get_Main_Tab_Reference");
static_assert(sizeof(StoreMain_Root_C_Get_Main_Tab_Reference) == 0x000038, "Wrong size on StoreMain_Root_C_Get_Main_Tab_Reference");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, ReturnValue) == 0x000000, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, CallFunc_GetCachedWidget_ReturnValue) == 0x000008, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, K2Node_DynamicCast_AsMain_Tabs_Screen) == 0x000010, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::K2Node_DynamicCast_AsMain_Tabs_Screen' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000020, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, CallFunc_GetActiveWidget_ReturnValue) == 0x000028, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Get_Main_Tab_Reference, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'StoreMain_Root_C_Get_Main_Tab_Reference::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.Start Ambient Sound
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_Root_C_Start_Ambient_Sound final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D78[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_Start_Ambient_Sound) == 0x000008, "Wrong alignment on StoreMain_Root_C_Start_Ambient_Sound");
static_assert(sizeof(StoreMain_Root_C_Start_Ambient_Sound) == 0x000018, "Wrong size on StoreMain_Root_C_Start_Ambient_Sound");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, Condition) == 0x000000, "Member 'StoreMain_Root_C_Start_Ambient_Sound::Condition' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_GetSubGame_ReturnValue) == 0x000001, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_CreateSound2D_ReturnValue) == 0x000008, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_Start_Ambient_Sound, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'StoreMain_Root_C_Start_Ambient_Sound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.UpdateCurrencyNotification
// 0x0090 (0x0090 - 0x0000)
struct StoreMain_Root_C_UpdateCurrencyNotification final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D79[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMtxBreakdown                          CallFunc_GetMtxBreakdown_ReturnValue;              // 0x0004(0x0010)(NoDestructor)
	uint8                                         Pad_6D7A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_UpdateCurrencyNotification) == 0x000008, "Wrong alignment on StoreMain_Root_C_UpdateCurrencyNotification");
static_assert(sizeof(StoreMain_Root_C_UpdateCurrencyNotification) == 0x000090, "Wrong size on StoreMain_Root_C_UpdateCurrencyNotification");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, Temp_byte_Variable) == 0x000000, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, Temp_byte_Variable_1) == 0x000001, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, Temp_bool_Variable) == 0x000002, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, CallFunc_GetMtxBreakdown_ReturnValue) == 0x000004, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::CallFunc_GetMtxBreakdown_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, K2Node_MakeArray_Array) == 0x000060, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, CallFunc_Format_ReturnValue) == 0x000070, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_UpdateCurrencyNotification, K2Node_Select_Default) == 0x000088, "Member 'StoreMain_Root_C_UpdateCurrencyNotification::K2Node_Select_Default' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.OnUpdateOtherPlatformMTXMessage
// 0x0020 (0x0020 - 0x0000)
struct StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage final
{
public:
	bool                                          HasOtherPlatformCurrency;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurrencyMessageLocText;                            // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage) == 0x000008, "Wrong alignment on StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage");
static_assert(sizeof(StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage) == 0x000020, "Wrong size on StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage");
static_assert(offsetof(StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage, HasOtherPlatformCurrency) == 0x000000, "Member 'StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage::HasOtherPlatformCurrency' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage, CurrencyMessageLocText) == 0x000008, "Member 'StoreMain_Root_C_OnUpdateOtherPlatformMTXMessage::CurrencyMessageLocText' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.GenerateOfferWidget
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_Root_C_GenerateOfferWidget final
{
public:
	class UFortStoreFrontOfferInfo*               OfferData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on StoreMain_Root_C_GenerateOfferWidget");
static_assert(sizeof(StoreMain_Root_C_GenerateOfferWidget) == 0x000008, "Wrong size on StoreMain_Root_C_GenerateOfferWidget");
static_assert(offsetof(StoreMain_Root_C_GenerateOfferWidget, OfferData) == 0x000000, "Member 'StoreMain_Root_C_GenerateOfferWidget::OfferData' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.ExecuteUbergraph_StoreMain_Root
// 0x0058 (0x0058 - 0x0000)
struct StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7D[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Main_Tab_Reference_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7E[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HasOtherPlatformCurrency;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_CurrencyMessageLocText;               // 0x0030(0x0018)(ConstParm)
	class UFortStoreFrontOfferInfo*               K2Node_Event_OfferData;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root) == 0x000008, "Wrong alignment on StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root");
static_assert(sizeof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root) == 0x000058, "Wrong size on StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, EntryPoint) == 0x000000, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, Temp_bool_Variable) == 0x000004, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, Temp_byte_Variable) == 0x000005, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, Temp_byte_Variable_1) == 0x000006, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_Get_Main_Tab_Reference_ReturnValue) == 0x000010, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_Get_Main_Tab_Reference_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_GetSubGame_ReturnValue) == 0x000011, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_GetContext_ReturnValue_2) == 0x000020, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, K2Node_Event_HasOtherPlatformCurrency) == 0x000028, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::K2Node_Event_HasOtherPlatformCurrency' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, K2Node_Event_CurrencyMessageLocText) == 0x000030, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::K2Node_Event_CurrencyMessageLocText' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, K2Node_Event_OfferData) == 0x000048, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::K2Node_Event_OfferData' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, K2Node_Select_Default) == 0x000050, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root, CallFunc_IsActivated_ReturnValue) == 0x000051, "Member 'StoreMain_Root_C_ExecuteUbergraph_StoreMain_Root::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function StoreMain_Root.StoreMain_Root_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_Root_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_Root_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on StoreMain_Root_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(StoreMain_Root_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on StoreMain_Root_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(StoreMain_Root_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'StoreMain_Root_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

