#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_OfferDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_OfferDetails.StoreMain_OfferDetails_C
// 0x0108 (0x0878 - 0x0770)
class UStoreMain_OfferDetails_C final : public UFortRealMoneyOfferDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseColor;                                         // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BonusMTXArea;                                      // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_CurrencyIcon;                                // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXArea;                                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute1;                  // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute2;                  // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuckHighlight;                                    // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UFortMtxOfferData*>         ABAssetCollection;                                 // 0x0828(0x0050)(Edit, BlueprintVisible)

public:
	void SetupCurrencyImage();
	void UpdatePurchaseButton();
	void InitDetailAttributes();
	void SetPurchaseButtonText(const class FText& ButtonText);
	bool IsGiftingStorefrontOffer();
	void GetCurrencyABAssetFromQuantity(int32 Quantity, class UFortMtxOfferData** DataAsset);
	void InitCurrency();
	void InitStoreTypeVisuals();
	void UnregisterInput();
	void RegisterInput();
	void PopDetails();
	void Init();
	void HandleBack(bool* PassThrough);
	void ResetPurchaseButtonText();
	void OnPurchasingStarted();
	void OnOfferSet();
	void ExecuteUbergraph_StoreMain_OfferDetails(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_OfferDetails_C">();
	}
	static class UStoreMain_OfferDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_OfferDetails_C>();
	}
};
static_assert(alignof(UStoreMain_OfferDetails_C) == 0x000008, "Wrong alignment on UStoreMain_OfferDetails_C");
static_assert(sizeof(UStoreMain_OfferDetails_C) == 0x000878, "Wrong size on UStoreMain_OfferDetails_C");
static_assert(offsetof(UStoreMain_OfferDetails_C, UberGraphFrame) == 0x000770, "Member 'UStoreMain_OfferDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColor) == 0x000778, "Member 'UStoreMain_OfferDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColorDetails) == 0x000780, "Member 'UStoreMain_OfferDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BonusMTXArea) == 0x000788, "Member 'UStoreMain_OfferDetails_C::BonusMTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BorderDisclaimer) == 0x000790, "Member 'UStoreMain_OfferDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BaseQuantity) == 0x000798, "Member 'UStoreMain_OfferDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BonusQuantity) == 0x0007A0, "Member 'UStoreMain_OfferDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, Highlight) == 0x0007A8, "Member 'UStoreMain_OfferDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, Image_CurrencyIcon) == 0x0007B0, "Member 'UStoreMain_OfferDetails_C::Image_CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, KeyArt) == 0x0007B8, "Member 'UStoreMain_OfferDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, MTXArea) == 0x0007C0, "Member 'UStoreMain_OfferDetails_C::MTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, MTXButtonBox) == 0x0007C8, "Member 'UStoreMain_OfferDetails_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradient) == 0x0007D0, "Member 'UStoreMain_OfferDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradientDetails) == 0x0007D8, "Member 'UStoreMain_OfferDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlaySalePrice) == 0x0007E0, "Member 'UStoreMain_OfferDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute1) == 0x0007E8, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute1' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute2) == 0x0007F0, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute2' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextDescription) == 0x0007F8, "Member 'UStoreMain_OfferDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextName) == 0x000800, "Member 'UStoreMain_OfferDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOfferDisplayPrice) == 0x000808, "Member 'UStoreMain_OfferDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOriginalPrice) == 0x000810, "Member 'UStoreMain_OfferDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBoxOfferInfo) == 0x000818, "Member 'UStoreMain_OfferDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBuckHighlight) == 0x000820, "Member 'UStoreMain_OfferDetails_C::VBuckHighlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, ABAssetCollection) == 0x000828, "Member 'UStoreMain_OfferDetails_C::ABAssetCollection' has a wrong offset!");

}

