#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BasketballMinigame_Message

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BasketballMinigame_Message.Struct_BasketballMinigame_Message
// 0x0018 (0x0018 - 0x0000)
struct FStruct_BasketballMinigame_Message final
{
public:
	class AFortPlayerState*                       PlayerWhoShot_21_EF5D780B4020E911AB429D9BA6B977BA; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDistance_13_A600D2A048CB01620B914BB4107A6CD5; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShotScore_16_9FACD4014A6F7FDAAA915396BD79B184;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalScore_15_54415216430C45042AF683A06F9801E1;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         SerialNumber_20_3CC5ECA54DECC5EAE3E06394E71DE575;  // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_BasketballMinigame_Message) == 0x000008, "Wrong alignment on FStruct_BasketballMinigame_Message");
static_assert(sizeof(FStruct_BasketballMinigame_Message) == 0x000018, "Wrong size on FStruct_BasketballMinigame_Message");
static_assert(offsetof(FStruct_BasketballMinigame_Message, PlayerWhoShot_21_EF5D780B4020E911AB429D9BA6B977BA) == 0x000000, "Member 'FStruct_BasketballMinigame_Message::PlayerWhoShot_21_EF5D780B4020E911AB429D9BA6B977BA' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_Message, TotalDistance_13_A600D2A048CB01620B914BB4107A6CD5) == 0x000008, "Member 'FStruct_BasketballMinigame_Message::TotalDistance_13_A600D2A048CB01620B914BB4107A6CD5' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_Message, ShotScore_16_9FACD4014A6F7FDAAA915396BD79B184) == 0x00000C, "Member 'FStruct_BasketballMinigame_Message::ShotScore_16_9FACD4014A6F7FDAAA915396BD79B184' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_Message, TotalScore_15_54415216430C45042AF683A06F9801E1) == 0x000010, "Member 'FStruct_BasketballMinigame_Message::TotalScore_15_54415216430C45042AF683A06F9801E1' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_Message, SerialNumber_20_3CC5ECA54DECC5EAE3E06394E71DE575) == 0x000014, "Member 'FStruct_BasketballMinigame_Message::SerialNumber_20_3CC5ECA54DECC5EAE3E06394E71DE575' has a wrong offset!");

}

