#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BasketballMinigame_State

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BasketballMinigame_State.Struct_BasketballMinigame_State
// 0x0014 (0x0014 - 0x0000)
struct FStruct_BasketballMinigame_State final
{
public:
	int32                                         LastSerialNumber_2_EF5D780B4020E911AB429D9BA6B977BA; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastShotLocation_5_A600D2A048CB01620B914BB4107A6CD5; // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalScore_8_9FACD4014A6F7FDAAA915396BD79B184;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_BasketballMinigame_State) == 0x000004, "Wrong alignment on FStruct_BasketballMinigame_State");
static_assert(sizeof(FStruct_BasketballMinigame_State) == 0x000014, "Wrong size on FStruct_BasketballMinigame_State");
static_assert(offsetof(FStruct_BasketballMinigame_State, LastSerialNumber_2_EF5D780B4020E911AB429D9BA6B977BA) == 0x000000, "Member 'FStruct_BasketballMinigame_State::LastSerialNumber_2_EF5D780B4020E911AB429D9BA6B977BA' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_State, LastShotLocation_5_A600D2A048CB01620B914BB4107A6CD5) == 0x000004, "Member 'FStruct_BasketballMinigame_State::LastShotLocation_5_A600D2A048CB01620B914BB4107A6CD5' has a wrong offset!");
static_assert(offsetof(FStruct_BasketballMinigame_State, TotalScore_8_9FACD4014A6F7FDAAA915396BD79B184) == 0x000010, "Member 'FStruct_BasketballMinigame_State::TotalScore_8_9FACD4014A6F7FDAAA915396BD79B184' has a wrong offset!");

}

