#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Structure_MANG_Spawner_SpawnGroupBuckets

#include "Basic.hpp"

#include "Structure_MANG_Spawner_PatrolsAndBotData_structs.hpp"


namespace SDK
{

// UserDefinedStruct Structure_MANG_Spawner_SpawnGroupBuckets.Structure_MANG_Spawner_SpawnGroupBuckets
// 0x0028 (0x0028 - 0x0000)
struct FStructure_MANG_Spawner_SpawnGroupBuckets final
{
public:
	class FString                                 DevNotes_27_32771C6541F9A6FA32734EA4B7A7B0C3;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          HighPrioritySpawnBucket_19_7806ADCF49F0DED27154D6841B555B51; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8114[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStructure_MANG_Spawner_PatrolsAndBotData> PatrolsandBotData_21_9C74BF3B4A23888319384AA385005675; // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FStructure_MANG_Spawner_SpawnGroupBuckets) == 0x000008, "Wrong alignment on FStructure_MANG_Spawner_SpawnGroupBuckets");
static_assert(sizeof(FStructure_MANG_Spawner_SpawnGroupBuckets) == 0x000028, "Wrong size on FStructure_MANG_Spawner_SpawnGroupBuckets");
static_assert(offsetof(FStructure_MANG_Spawner_SpawnGroupBuckets, DevNotes_27_32771C6541F9A6FA32734EA4B7A7B0C3) == 0x000000, "Member 'FStructure_MANG_Spawner_SpawnGroupBuckets::DevNotes_27_32771C6541F9A6FA32734EA4B7A7B0C3' has a wrong offset!");
static_assert(offsetof(FStructure_MANG_Spawner_SpawnGroupBuckets, HighPrioritySpawnBucket_19_7806ADCF49F0DED27154D6841B555B51) == 0x000010, "Member 'FStructure_MANG_Spawner_SpawnGroupBuckets::HighPrioritySpawnBucket_19_7806ADCF49F0DED27154D6841B555B51' has a wrong offset!");
static_assert(offsetof(FStructure_MANG_Spawner_SpawnGroupBuckets, PatrolsandBotData_21_9C74BF3B4A23888319384AA385005675) == 0x000018, "Member 'FStructure_MANG_Spawner_SpawnGroupBuckets::PatrolsandBotData_21_9C74BF3B4A23888319384AA385005675' has a wrong offset!");

}

