#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_PhantomBooth_Disguise

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_PhantomBooth_Disguise.Struct_PhantomBooth_Disguise
// 0x0028 (0x0028 - 0x0000)
struct FStruct_PhantomBooth_Disguise final
{
public:
	struct FGameplayTag                           FactionTag_4_F514CF9B477D9236E1E981BF23EAE206;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UFortGadgetItemDefinition*              DefaultAGID_6_8D9320774D0782C7508C46BF2A502923;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasVariants_7_F3905D0049726E755A32A890C40E0005;    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83F3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGadgetItemDefinition*>      AGIDVariants_10_76E4D6294E087A93CCC040AE0586588C;  // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_PhantomBooth_Disguise) == 0x000008, "Wrong alignment on FStruct_PhantomBooth_Disguise");
static_assert(sizeof(FStruct_PhantomBooth_Disguise) == 0x000028, "Wrong size on FStruct_PhantomBooth_Disguise");
static_assert(offsetof(FStruct_PhantomBooth_Disguise, FactionTag_4_F514CF9B477D9236E1E981BF23EAE206) == 0x000000, "Member 'FStruct_PhantomBooth_Disguise::FactionTag_4_F514CF9B477D9236E1E981BF23EAE206' has a wrong offset!");
static_assert(offsetof(FStruct_PhantomBooth_Disguise, DefaultAGID_6_8D9320774D0782C7508C46BF2A502923) == 0x000008, "Member 'FStruct_PhantomBooth_Disguise::DefaultAGID_6_8D9320774D0782C7508C46BF2A502923' has a wrong offset!");
static_assert(offsetof(FStruct_PhantomBooth_Disguise, HasVariants_7_F3905D0049726E755A32A890C40E0005) == 0x000010, "Member 'FStruct_PhantomBooth_Disguise::HasVariants_7_F3905D0049726E755A32A890C40E0005' has a wrong offset!");
static_assert(offsetof(FStruct_PhantomBooth_Disguise, AGIDVariants_10_76E4D6294E087A93CCC040AE0586588C) == 0x000018, "Member 'FStruct_PhantomBooth_Disguise::AGIDVariants_10_76E4D6294E087A93CCC040AE0586588C' has a wrong offset!");

}

