#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwimmingAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SwimmingAnimBP.SwimmingAnimBP_C.ExecuteUbergraph_SwimmingAnimBP
// 0x0018 (0x0018 - 0x0000)
struct SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B7[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP) == 0x000004, "Wrong alignment on SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP");
static_assert(sizeof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP) == 0x000018, "Wrong size on SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, EntryPoint) == 0x000000, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, CallFunc_GetRelevantAnimTime_ReturnValue) == 0x000008, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::CallFunc_GetRelevantAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, Temp_bool_Has_Been_Initd_Variable) == 0x00000D, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, CallFunc_GetRelevantAnimTime_ReturnValue_1) == 0x000010, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::CallFunc_GetRelevantAnimTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000015, "Member 'SwimmingAnimBP_C_ExecuteUbergraph_SwimmingAnimBP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SwimmingAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_AnimGraph");
static_assert(sizeof(SwimmingAnimBP_C_AnimGraph) == 0x000010, "Wrong size on SwimmingAnimBP_C_AnimGraph");
static_assert(offsetof(SwimmingAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'SwimmingAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimBP_C_SwimmingLayer final
{
public:
	struct FPoseLink                              MainPlayerAnimBP;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingLayer;                               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingLayer) == 0x000020, "Wrong size on SwimmingAnimBP_C_SwimmingLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLayer, MainPlayerAnimBP) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingLayer::MainPlayerAnimBP' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLayer, Param_SwimmingLayer) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingLayer::Param_SwimmingLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingSprintLayer
// 0x0028 (0x0028 - 0x0000)
struct SwimmingAnimBP_C_SwimmingSprintLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingSprint;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Param_IsHidingInPropLayer;                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Param_SwimmingSprintLayer;                         // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingSprintLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingSprintLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingSprintLayer) == 0x000028, "Wrong size on SwimmingAnimBP_C_SwimmingSprintLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingSprintLayer, PassThroughSwimmingSprint) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingSprintLayer::PassThroughSwimmingSprint' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingSprintLayer, Param_IsHidingInPropLayer) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingSprintLayer::Param_IsHidingInPropLayer' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingSprintLayer, Param_SwimmingSprintLayer) == 0x000018, "Member 'SwimmingAnimBP_C_SwimmingSprintLayer::Param_SwimmingSprintLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingMovementAdditiveLayerPose
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose final
{
public:
	struct FPoseLink                              PassThroughSwimmingMovementAdditive;               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingMovementAdditiveLayerPose;           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose) == 0x000020, "Wrong size on SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose, PassThroughSwimmingMovementAdditive) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose::PassThroughSwimmingMovementAdditive' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose, Param_SwimmingMovementAdditiveLayerPose) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingMovementAdditiveLayerPose::Param_SwimmingMovementAdditiveLayerPose' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingUpperBodyPoseTargetingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingUpperBodyPoseTargeting;         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingUpperBodyPoseTargetingLayer;         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer) == 0x000020, "Wrong size on SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer, PassThroughSwimmingUpperBodyPoseTargeting) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer::PassThroughSwimmingUpperBodyPoseTargeting' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer, Param_SwimmingUpperBodyPoseTargetingLayer) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingUpperBodyPoseTargetingLayer::Param_SwimmingUpperBodyPoseTargetingLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingUpperBodyPoseNonTargetingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingUpperBodyPoseNonTargeting;      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingUpperBodyPoseNonTargetingLayer;      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer) == 0x000020, "Wrong size on SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer, PassThroughSwimmingUpperBodyPoseNonTargeting) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer::PassThroughSwimmingUpperBodyPoseNonTargeting' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer, Param_SwimmingUpperBodyPoseNonTargetingLayer) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingUpperBodyPoseNonTargetingLayer::Param_SwimmingUpperBodyPoseNonTargetingLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingLowerBodyLayer
// 0x0040 (0x0040 - 0x0000)
struct SwimmingAnimBP_C_SwimmingLowerBodyLayer final
{
public:
	struct FPoseLink                              UpperBody_Cache;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PreUpperBodySlot_Cache;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PassThroughSwimmingLowerBody;                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingLowerBodyLayer;                      // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingLowerBodyLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingLowerBodyLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingLowerBodyLayer) == 0x000040, "Wrong size on SwimmingAnimBP_C_SwimmingLowerBodyLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLowerBodyLayer, UpperBody_Cache) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingLowerBodyLayer::UpperBody_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLowerBodyLayer, PreUpperBodySlot_Cache) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingLowerBodyLayer::PreUpperBodySlot_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLowerBodyLayer, PassThroughSwimmingLowerBody) == 0x000020, "Member 'SwimmingAnimBP_C_SwimmingLowerBodyLayer::PassThroughSwimmingLowerBody' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingLowerBodyLayer, Param_SwimmingLowerBodyLayer) == 0x000030, "Member 'SwimmingAnimBP_C_SwimmingLowerBodyLayer::Param_SwimmingLowerBodyLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingAdditiveLayer
// 0x0078 (0x0078 - 0x0000)
struct SwimmingAnimBP_C_SwimmingAdditiveLayer final
{
public:
	struct FPoseLink                              IdleAdditive_Cache;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MovementAdditiveLayerPose_Cache;                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         Param_PlayMeleeAttackAOLayer;                      // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_DisableArmsHeadAdditiveCurveAlphaLayer;      // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_DisableIKRootAdditiveCurveAlphaLayer;        // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_LocomotionAdditiveAlphaLayer;                // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_MainInstanceAdditiveLayerAlpha;              // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B9[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              UpperAndLowerBody_Cache;                           // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SprintingPose_PostMask_Cache;                      // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingAdditiveLayer;                       // 0x0068(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingAdditiveLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingAdditiveLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingAdditiveLayer) == 0x000078, "Wrong size on SwimmingAnimBP_C_SwimmingAdditiveLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, IdleAdditive_Cache) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::IdleAdditive_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, MovementAdditiveLayerPose_Cache) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::MovementAdditiveLayerPose_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, FullBody) == 0x000020, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::FullBody' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_PlayMeleeAttackAOLayer) == 0x000030, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_PlayMeleeAttackAOLayer' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_DisableArmsHeadAdditiveCurveAlphaLayer) == 0x000034, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_DisableArmsHeadAdditiveCurveAlphaLayer' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_DisableIKRootAdditiveCurveAlphaLayer) == 0x000038, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_DisableIKRootAdditiveCurveAlphaLayer' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_LocomotionAdditiveAlphaLayer) == 0x00003C, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_LocomotionAdditiveAlphaLayer' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_MainInstanceAdditiveLayerAlpha) == 0x000040, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_MainInstanceAdditiveLayerAlpha' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, UpperAndLowerBody_Cache) == 0x000048, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::UpperAndLowerBody_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, SprintingPose_PostMask_Cache) == 0x000058, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::SprintingPose_PostMask_Cache' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingAdditiveLayer, Param_SwimmingAdditiveLayer) == 0x000068, "Member 'SwimmingAnimBP_C_SwimmingAdditiveLayer::Param_SwimmingAdditiveLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingFullBodyAdditiveLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer final
{
public:
	struct FPoseLink                              PassThroughFullBodyAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_SwimmingFullBodyAdditiveLayer;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer) == 0x000020, "Wrong size on SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer, PassThroughFullBodyAdditive) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer::PassThroughFullBodyAdditive' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer, Param_SwimmingFullBodyAdditiveLayer) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingFullBodyAdditiveLayer::Param_SwimmingFullBodyAdditiveLayer' has a wrong offset!");

// Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingDiveJumpingLayer
// 0x0030 (0x0030 - 0x0000)
struct SwimmingAnimBP_C_SwimmingDiveJumpingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingDiveJumping;                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Param_IsHidingInPropLayer2;                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55BA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_MainInstanceDiveJumpLayerAlpha;              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlayerAnimBodyType                       Param_AnimBodyTypePassThrough;                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Param_SwimmingDiveJumpingLayer;                    // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer) == 0x000008, "Wrong alignment on SwimmingAnimBP_C_SwimmingDiveJumpingLayer");
static_assert(sizeof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer) == 0x000030, "Wrong size on SwimmingAnimBP_C_SwimmingDiveJumpingLayer");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer, PassThroughSwimmingDiveJumping) == 0x000000, "Member 'SwimmingAnimBP_C_SwimmingDiveJumpingLayer::PassThroughSwimmingDiveJumping' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer, Param_IsHidingInPropLayer2) == 0x000010, "Member 'SwimmingAnimBP_C_SwimmingDiveJumpingLayer::Param_IsHidingInPropLayer2' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer, Param_MainInstanceDiveJumpLayerAlpha) == 0x000014, "Member 'SwimmingAnimBP_C_SwimmingDiveJumpingLayer::Param_MainInstanceDiveJumpLayerAlpha' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer, Param_AnimBodyTypePassThrough) == 0x000018, "Member 'SwimmingAnimBP_C_SwimmingDiveJumpingLayer::Param_AnimBodyTypePassThrough' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP_C_SwimmingDiveJumpingLayer, Param_SwimmingDiveJumpingLayer) == 0x000020, "Member 'SwimmingAnimBP_C_SwimmingDiveJumpingLayer::Param_SwimmingDiveJumpingLayer' has a wrong offset!");

}

