#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabRevealMeassage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TabRevealMeassage.TabRevealMeassage_C.AutoClose
// 0x0010 (0x0010 - 0x0000)
struct TabRevealMeassage_C_AutoClose final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabRevealMeassage_C_AutoClose) == 0x000008, "Wrong alignment on TabRevealMeassage_C_AutoClose");
static_assert(sizeof(TabRevealMeassage_C_AutoClose) == 0x000010, "Wrong size on TabRevealMeassage_C_AutoClose");
static_assert(offsetof(TabRevealMeassage_C_AutoClose, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'TabRevealMeassage_C_AutoClose::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_AutoClose, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'TabRevealMeassage_C_AutoClose::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function TabRevealMeassage.TabRevealMeassage_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct TabRevealMeassage_C_ToggleTimer final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_433F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4340[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabRevealMeassage_C_ToggleTimer) == 0x000008, "Wrong alignment on TabRevealMeassage_C_ToggleTimer");
static_assert(sizeof(TabRevealMeassage_C_ToggleTimer) == 0x000020, "Wrong size on TabRevealMeassage_C_ToggleTimer");
static_assert(offsetof(TabRevealMeassage_C_ToggleTimer, Enabled) == 0x000000, "Member 'TabRevealMeassage_C_ToggleTimer::Enabled' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ToggleTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TabRevealMeassage_C_ToggleTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ToggleTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'TabRevealMeassage_C_ToggleTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function TabRevealMeassage.TabRevealMeassage_C.ExecuteUbergraph_TabRevealMeassage
// 0x0040 (0x0040 - 0x0000)
struct TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4341[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4342[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4343[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage) == 0x000008, "Wrong alignment on TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage");
static_assert(sizeof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage) == 0x000040, "Wrong size on TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, EntryPoint) == 0x000000, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, Temp_bool_Variable) == 0x000004, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, Temp_byte_Variable) == 0x000005, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, Temp_byte_Variable_1) == 0x000006, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000020, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, K2Node_Select_Default) == 0x000021, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'TabRevealMeassage_C_ExecuteUbergraph_TabRevealMeassage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

