#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.OnReadyStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged final
{
public:
	EGameReadiness                                GameReadiness;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged) == 0x000001, "Wrong size on TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged, GameReadiness) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_OnReadyStatusChanged::GameReadiness' has a wrong offset!");

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.BP_OnTeamMemberEstablished
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished final
{
public:
	bool                                          bHasValidMember;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished) == 0x000001, "Wrong alignment on TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished) == 0x000001, "Wrong size on TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished, bHasValidMember) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_BP_OnTeamMemberEstablished::bHasValidMember' has a wrong offset!");

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.OnFrontEndCameraChanged
// 0x0002 (0x0002 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged) == 0x000002, "Wrong size on TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged, NewCamera) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged, OldCamera) == 0x000001, "Member 'TeamMemberPedestal_Nameplate_C_OnFrontEndCameraChanged::OldCamera' has a wrong offset!");

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.OnPlayReadyAudio
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio final
{
public:
	bool                                          bIsReadyForMatchmaking;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio) == 0x000001, "Wrong alignment on TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio) == 0x000001, "Wrong size on TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio, bIsReadyForMatchmaking) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_OnPlayReadyAudio::bIsReadyForMatchmaking' has a wrong offset!");

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.OnCurrentSubGameChanged
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged final
{
public:
	ESubGame                                      NewSubGame;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged) == 0x000001, "Wrong size on TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged, NewSubGame) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_OnCurrentSubGameChanged::NewSubGame' has a wrong offset!");

// Function TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C.ExecuteUbergraph_TeamMemberPedestal_Nameplate
// 0x00A8 (0x00A8 - 0x0000)
struct TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_527C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_527E[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameReadiness                                Temp_byte_Variable_5;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameReadiness                                K2Node_Event_GameReadiness;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_527F[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasValidMember;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsReadyForMatchmaking;               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5280[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
	ESubGame                                      K2Node_Event_NewSubGame;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5281[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_4;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate) == 0x000008, "Wrong alignment on TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate");
static_assert(sizeof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate) == 0x0000A8, "Wrong size on TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, EntryPoint) == 0x000000, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable) == 0x000004, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_bool_Variable) == 0x000010, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_1) == 0x000024, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_2) == 0x000025, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_GetContext_ReturnValue_1) == 0x000028, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_IsUsingGamepad_ReturnValue) == 0x000030, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_bool_Variable_1) == 0x000031, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_3) == 0x000032, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_4) == 0x000033, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_bool_Variable_2) == 0x000034, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_5) == 0x000035, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_bool_Variable_3) == 0x000036, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_6) == 0x000037, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_7) == 0x000038, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Event_GameReadiness) == 0x000039, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Event_GameReadiness' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Event_bHasValidMember) == 0x000048, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Event_bHasValidMember' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_CustomEvent_NewCamera) == 0x000049, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_CustomEvent_OldCamera) == 0x00004A, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004B, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004C, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_byte_Variable_8) == 0x00004D, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_BooleanOR_ReturnValue) == 0x00004E, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_Not_PreBool_ReturnValue) == 0x00004F, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default) == 0x000050, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, Temp_bool_Variable_4) == 0x000052, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default_1) == 0x000053, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default_2) == 0x000054, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Event_bIsReadyForMatchmaking) == 0x000055, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Event_bIsReadyForMatchmaking' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default_3) == 0x000058, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Event_NewSubGame) == 0x000090, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Event_NewSubGame' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default_4) == 0x000098, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000A0, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate, K2Node_Select_Default_5) == 0x0000A1, "Member 'TeamMemberPedestal_Nameplate_C_ExecuteUbergraph_TeamMemberPedestal_Nameplate::K2Node_Select_Default_5' has a wrong offset!");

}

