#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TeamMemberPedestal.TeamMemberPedestal_C.SetSparkleParticlesEnabled
// 0x0002 (0x0002 - 0x0000)
struct TeamMemberPedestal_C_SetSparkleParticlesEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_SetSparkleParticlesEnabled) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_SetSparkleParticlesEnabled");
static_assert(sizeof(TeamMemberPedestal_C_SetSparkleParticlesEnabled) == 0x000002, "Wrong size on TeamMemberPedestal_C_SetSparkleParticlesEnabled");
static_assert(offsetof(TeamMemberPedestal_C_SetSparkleParticlesEnabled, IsEnabled) == 0x000000, "Member 'TeamMemberPedestal_C_SetSparkleParticlesEnabled::IsEnabled' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetSparkleParticlesEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'TeamMemberPedestal_C_SetSparkleParticlesEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.StopLobbyAnimation
// 0x0010 (0x0010 - 0x0000)
struct TeamMemberPedestal_C_StopLobbyAnimation final
{
public:
	bool                                          CallFunc_IsInAthena_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B80[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_StopLobbyAnimation) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_StopLobbyAnimation");
static_assert(sizeof(TeamMemberPedestal_C_StopLobbyAnimation) == 0x000010, "Wrong size on TeamMemberPedestal_C_StopLobbyAnimation");
static_assert(offsetof(TeamMemberPedestal_C_StopLobbyAnimation, CallFunc_IsInAthena_ReturnValue) == 0x000000, "Member 'TeamMemberPedestal_C_StopLobbyAnimation::CallFunc_IsInAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_StopLobbyAnimation, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TeamMemberPedestal_C_StopLobbyAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_StopLobbyAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'TeamMemberPedestal_C_StopLobbyAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_StopLobbyAnimation, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'TeamMemberPedestal_C_StopLobbyAnimation::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.SetFakeBlobShadowVisiblity
// 0x0020 (0x0020 - 0x0000)
struct TeamMemberPedestal_C_SetFakeBlobShadowVisiblity final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B81[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B82[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_SetFakeBlobShadowVisiblity");
static_assert(sizeof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity) == 0x000020, "Wrong size on TeamMemberPedestal_C_SetFakeBlobShadowVisiblity");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, Visible) == 0x000000, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::Visible' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_IsMobilePlatform_ReturnValue) == 0x000001, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_IsErebus_ReturnValue) == 0x000002, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000010, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_BooleanOR_ReturnValue_1) == 0x000015, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_SetFakeBlobShadowVisiblity, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'TeamMemberPedestal_C_SetFakeBlobShadowVisiblity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnPartyDataChanged
// 0x0200 (0x0200 - 0x0000)
struct TeamMemberPedestal_C_OnPartyDataChanged final
{
public:
	struct FFortTeamMemberInfo                    Member_Info;                                       // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_OnPartyDataChanged) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_OnPartyDataChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnPartyDataChanged) == 0x000200, "Wrong size on TeamMemberPedestal_C_OnPartyDataChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnPartyDataChanged, Member_Info) == 0x000000, "Member 'TeamMemberPedestal_C_OnPartyDataChanged::Member_Info' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnTeamMemberStateChanged
// 0x0208 (0x0208 - 0x0000)
struct TeamMemberPedestal_C_OnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    Team_Member_Info;                                  // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnTeamMemberStateChanged) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_OnTeamMemberStateChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnTeamMemberStateChanged) == 0x000208, "Wrong size on TeamMemberPedestal_C_OnTeamMemberStateChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnTeamMemberStateChanged, Team_Member_Info) == 0x000000, "Member 'TeamMemberPedestal_C_OnTeamMemberStateChanged::Team_Member_Info' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnTeamMemberStateChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000200, "Member 'TeamMemberPedestal_C_OnTeamMemberStateChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.PlayLobbyAnimation
// 0x00C8 (0x00C8 - 0x0000)
struct TeamMemberPedestal_C_PlayLobbyAnimation final
{
public:
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0000(0x0048)()
	bool                                          CallFunc_IsInAthena_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B83[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICustomCharacterPartOwnerInterface> K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B84[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICustomCharacterPartOwnerInterface> K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface_1; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B85[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue_1;       // 0x0080(0x0048)()
};
static_assert(alignof(TeamMemberPedestal_C_PlayLobbyAnimation) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_PlayLobbyAnimation");
static_assert(sizeof(TeamMemberPedestal_C_PlayLobbyAnimation) == 0x0000C8, "Wrong size on TeamMemberPedestal_C_PlayLobbyAnimation");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000000, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, CallFunc_IsInAthena_ReturnValue) == 0x000048, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::CallFunc_IsInAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface) == 0x000050, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface_1) == 0x000068, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_PlayLobbyAnimation, CallFunc_MakeGameplayTagQuery_ReturnValue_1) == 0x000080, "Member 'TeamMemberPedestal_C_PlayLobbyAnimation::CallFunc_MakeGameplayTagQuery_ReturnValue_1' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.RefreshWidgets
// 0x0038 (0x0038 - 0x0000)
struct TeamMemberPedestal_C_RefreshWidgets final
{
public:
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidTeamMember_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentMemberLocal_ReturnValue;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInLocalSquadGroup_ReturnValue_1;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidTeamMember_ReturnValue_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B86[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortStoreState                               CallFunc_GetStoreState_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B87[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               CallFunc_GetFrontEndCamera_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_RefreshWidgets) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_RefreshWidgets");
static_assert(sizeof(TeamMemberPedestal_C_RefreshWidgets) == 0x000038, "Wrong size on TeamMemberPedestal_C_RefreshWidgets");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, Temp_bool_Variable) == 0x000008, "Member 'TeamMemberPedestal_C_RefreshWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsInLobby_ReturnValue) == 0x000009, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, Temp_byte_Variable) == 0x00000A, "Member 'TeamMemberPedestal_C_RefreshWidgets::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, Temp_byte_Variable_1) == 0x00000B, "Member 'TeamMemberPedestal_C_RefreshWidgets::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsInLocalSquadGroup_ReturnValue) == 0x00000C, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsInLocalSquadGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsValidTeamMember_ReturnValue) == 0x00000D, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsValidTeamMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsCurrentMemberLocal_ReturnValue) == 0x00000E, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsCurrentMemberLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsInLocalSquadGroup_ReturnValue_1) == 0x00000F, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsInLocalSquadGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_IsValidTeamMember_ReturnValue_1) == 0x000012, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_IsValidTeamMember_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, K2Node_Select_Default) == 0x000014, "Member 'TeamMemberPedestal_C_RefreshWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_GetStoreState_ReturnValue) == 0x000020, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_GetStoreState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_GetContext_ReturnValue_2) == 0x000028, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_GetFrontEndCamera_ReturnValue) == 0x000031, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_GetFrontEndCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_BooleanAND_ReturnValue_2) == 0x000032, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000033, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000034, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_RefreshWidgets, CallFunc_BooleanAND_ReturnValue_3) == 0x000036, "Member 'TeamMemberPedestal_C_RefreshWidgets::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnFrontEndCameraChanged
// 0x0007 (0x0007 - 0x0000)
struct TeamMemberPedestal_C_OnFrontEndCameraChanged final
{
public:
	EFrontEndCamera                               New_Camera;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Old_Camera;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnFrontEndCameraChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_OnFrontEndCameraChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnFrontEndCameraChanged) == 0x000007, "Wrong size on TeamMemberPedestal_C_OnFrontEndCameraChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, New_Camera) == 0x000000, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::New_Camera' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, Old_Camera) == 0x000001, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::Old_Camera' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000005, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnFrontEndCameraChanged, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'TeamMemberPedestal_C_OnFrontEndCameraChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.InitializeContextEvents
// 0x0050 (0x0050 - 0x0000)
struct TeamMemberPedestal_C_InitializeContextEvents final
{
public:
	TDelegate<void(struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_InitializeContextEvents) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_InitializeContextEvents");
static_assert(sizeof(TeamMemberPedestal_C_InitializeContextEvents) == 0x000050, "Wrong size on TeamMemberPedestal_C_InitializeContextEvents");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TeamMemberPedestal_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TeamMemberPedestal_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'TeamMemberPedestal_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue_1) == 0x000028, "Member 'TeamMemberPedestal_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'TeamMemberPedestal_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000040, "Member 'TeamMemberPedestal_C_InitializeContextEvents::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue_2) == 0x000048, "Member 'TeamMemberPedestal_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleHoverInputActions
// 0x000A (0x000A - 0x0000)
struct TeamMemberPedestal_C_HandleHoverInputActions final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_HandleHoverInputActions) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_HandleHoverInputActions");
static_assert(sizeof(TeamMemberPedestal_C_HandleHoverInputActions) == 0x00000A, "Wrong size on TeamMemberPedestal_C_HandleHoverInputActions");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, bIsHovered) == 0x000000, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::bIsHovered' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_bool_Variable) == 0x000001, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable) == 0x000002, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable_1) == 0x000003, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_bool_Variable_1) == 0x000004, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable_2) == 0x000005, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, Temp_byte_Variable_3) == 0x000006, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, K2Node_Select_Default) == 0x000008, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleHoverInputActions, K2Node_Select_Default_1) == 0x000009, "Member 'TeamMemberPedestal_C_HandleHoverInputActions::K2Node_Select_Default_1' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.InitializeInputActionRefs
// 0x0030 (0x0030 - 0x0000)
struct TeamMemberPedestal_C_InitializeInputActionRefs final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTeamMemberPedestal_Nameplate_C*        K2Node_DynamicCast_AsTeam_Member_Pedestal_Nameplate; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B88[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerAddPlayer_C*                K2Node_DynamicCast_AsLobby_Player_Add_Player;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_InitializeInputActionRefs) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_InitializeInputActionRefs");
static_assert(sizeof(TeamMemberPedestal_C_InitializeInputActionRefs) == 0x000030, "Wrong size on TeamMemberPedestal_C_InitializeInputActionRefs");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, K2Node_DynamicCast_AsTeam_Member_Pedestal_Nameplate) == 0x000008, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::K2Node_DynamicCast_AsTeam_Member_Pedestal_Nameplate' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000018, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, K2Node_DynamicCast_AsLobby_Player_Add_Player) == 0x000020, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::K2Node_DynamicCast_AsLobby_Player_Add_Player' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_InitializeInputActionRefs, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'TeamMemberPedestal_C_InitializeInputActionRefs::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct TeamMemberPedestal_C_UserConstructionScript final
{
public:
	struct FLinearColor                           NewLocalVar_2;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NewLocalVar_1;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NewLocalVar_0;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B89[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_UserConstructionScript) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_UserConstructionScript");
static_assert(sizeof(TeamMemberPedestal_C_UserConstructionScript) == 0x000078, "Wrong size on TeamMemberPedestal_C_UserConstructionScript");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, NewLocalVar_2) == 0x000000, "Member 'TeamMemberPedestal_C_UserConstructionScript::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, NewLocalVar_1) == 0x000010, "Member 'TeamMemberPedestal_C_UserConstructionScript::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, NewLocalVar_0) == 0x000020, "Member 'TeamMemberPedestal_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000038, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000040, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000050, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue_1) == 0x000060, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000064, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue_2) == 0x000068, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00006C, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000070, "Member 'TeamMemberPedestal_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9
// 0x0008 (0x0008 - 0x0000)
struct TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9");
static_assert(sizeof(TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9) == 0x000008, "Wrong size on TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9");
static_assert(offsetof(TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9, Loaded) == 0x000000, "Member 'TeamMemberPedestal_C_OnLoaded_D1FFD29E4F2735025D7C19B62CBA97B9::Loaded' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleClientEvent_StoreTabClosed
// 0x0030 (0x0030 - 0x0000)
struct TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed");
static_assert(sizeof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed) == 0x000030, "Wrong size on TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, EventSource) == 0x000000, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, EventFocus) == 0x000008, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed, ClientEvent) == 0x000010, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabClosed::ClientEvent' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.HandleClientEvent_StoreTabSelected
// 0x0030 (0x0030 - 0x0000)
struct TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected");
static_assert(sizeof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected) == 0x000030, "Wrong size on TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, EventSource) == 0x000000, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::EventSource' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, EventFocus) == 0x000008, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::EventFocus' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected, ClientEvent) == 0x000010, "Member 'TeamMemberPedestal_C_HandleClientEvent_StoreTabSelected::ClientEvent' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnIsCurrentlyInMatchChanged
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged final
{
public:
	bool                                          bIsInMatch;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged) == 0x000001, "Wrong size on TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged, bIsInMatch) == 0x000000, "Member 'TeamMemberPedestal_C_OnIsCurrentlyInMatchChanged::bIsInMatch' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnPedestalIsPopulatedChanged
// 0x0002 (0x0002 - 0x0000)
struct TeamMemberPedestal_C_OnPedestalIsPopulatedChanged final
{
public:
	bool                                          bIsPopulated;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOwningSquadContainsLocalPlayer;                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnPedestalIsPopulatedChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_OnPedestalIsPopulatedChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnPedestalIsPopulatedChanged) == 0x000002, "Wrong size on TeamMemberPedestal_C_OnPedestalIsPopulatedChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnPedestalIsPopulatedChanged, bIsPopulated) == 0x000000, "Member 'TeamMemberPedestal_C_OnPedestalIsPopulatedChanged::bIsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnPedestalIsPopulatedChanged, bOwningSquadContainsLocalPlayer) == 0x000001, "Member 'TeamMemberPedestal_C_OnPedestalIsPopulatedChanged::bOwningSquadContainsLocalPlayer' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnGameReadinessChanged
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_C_OnGameReadinessChanged final
{
public:
	EGameReadiness                                GameReadiness;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_OnGameReadinessChanged) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_OnGameReadinessChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnGameReadinessChanged) == 0x000001, "Wrong size on TeamMemberPedestal_C_OnGameReadinessChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnGameReadinessChanged, GameReadiness) == 0x000000, "Member 'TeamMemberPedestal_C_OnGameReadinessChanged::GameReadiness' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnNewSquadEstablished
// 0x0090 (0x0090 - 0x0000)
struct TeamMemberPedestal_C_OnNewSquadEstablished final
{
public:
	bool                                          bMultipleSquadsPopulated;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOwningSquadContainsLocalPlayer;                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B8A[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaTeamDisplayInfo                 OwningSquadStyle;                                  // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TeamMemberPedestal_C_OnNewSquadEstablished) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_OnNewSquadEstablished");
static_assert(sizeof(TeamMemberPedestal_C_OnNewSquadEstablished) == 0x000090, "Wrong size on TeamMemberPedestal_C_OnNewSquadEstablished");
static_assert(offsetof(TeamMemberPedestal_C_OnNewSquadEstablished, bMultipleSquadsPopulated) == 0x000000, "Member 'TeamMemberPedestal_C_OnNewSquadEstablished::bMultipleSquadsPopulated' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnNewSquadEstablished, bOwningSquadContainsLocalPlayer) == 0x000001, "Member 'TeamMemberPedestal_C_OnNewSquadEstablished::bOwningSquadContainsLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnNewSquadEstablished, OwningSquadStyle) == 0x000008, "Member 'TeamMemberPedestal_C_OnNewSquadEstablished::OwningSquadStyle' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnOwningPedestalGroupEstablished
// 0x0008 (0x0008 - 0x0000)
struct TeamMemberPedestal_C_OnOwningPedestalGroupEstablished final
{
public:
	int32                                         SquadIdx;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSquadHasLocalPlayer;                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPopulated;                                      // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnOwningPedestalGroupEstablished) == 0x000004, "Wrong alignment on TeamMemberPedestal_C_OnOwningPedestalGroupEstablished");
static_assert(sizeof(TeamMemberPedestal_C_OnOwningPedestalGroupEstablished) == 0x000008, "Wrong size on TeamMemberPedestal_C_OnOwningPedestalGroupEstablished");
static_assert(offsetof(TeamMemberPedestal_C_OnOwningPedestalGroupEstablished, SquadIdx) == 0x000000, "Member 'TeamMemberPedestal_C_OnOwningPedestalGroupEstablished::SquadIdx' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnOwningPedestalGroupEstablished, bSquadHasLocalPlayer) == 0x000004, "Member 'TeamMemberPedestal_C_OnOwningPedestalGroupEstablished::bSquadHasLocalPlayer' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnOwningPedestalGroupEstablished, bIsPopulated) == 0x000005, "Member 'TeamMemberPedestal_C_OnOwningPedestalGroupEstablished::bIsPopulated' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnTeamMemberSet
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_C_OnTeamMemberSet final
{
public:
	bool                                          bHasValidTeamMember;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamMemberPedestal_C_OnTeamMemberSet) == 0x000001, "Wrong alignment on TeamMemberPedestal_C_OnTeamMemberSet");
static_assert(sizeof(TeamMemberPedestal_C_OnTeamMemberSet) == 0x000001, "Wrong size on TeamMemberPedestal_C_OnTeamMemberSet");
static_assert(offsetof(TeamMemberPedestal_C_OnTeamMemberSet, bHasValidTeamMember) == 0x000000, "Member 'TeamMemberPedestal_C_OnTeamMemberSet::bHasValidTeamMember' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.OnAvatarChanged
// 0x0010 (0x0010 - 0x0000)
struct TeamMemberPedestal_C_OnAvatarChanged final
{
public:
	class UTexture2D*                             AvatarImage;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 AvatarBackground;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HighlightColor;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamMemberPedestal_C_OnAvatarChanged) == 0x000008, "Wrong alignment on TeamMemberPedestal_C_OnAvatarChanged");
static_assert(sizeof(TeamMemberPedestal_C_OnAvatarChanged) == 0x000010, "Wrong size on TeamMemberPedestal_C_OnAvatarChanged");
static_assert(offsetof(TeamMemberPedestal_C_OnAvatarChanged, AvatarImage) == 0x000000, "Member 'TeamMemberPedestal_C_OnAvatarChanged::AvatarImage' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnAvatarChanged, AvatarBackground) == 0x000008, "Member 'TeamMemberPedestal_C_OnAvatarChanged::AvatarBackground' has a wrong offset!");
static_assert(offsetof(TeamMemberPedestal_C_OnAvatarChanged, HighlightColor) == 0x00000C, "Member 'TeamMemberPedestal_C_OnAvatarChanged::HighlightColor' has a wrong offset!");

// Function TeamMemberPedestal.TeamMemberPedestal_C.TransitionToCharacterScreen
// 0x0001 (0x0001 - 0x0000)
struct TeamMemberPedestal_C_TransitionToCharacterScreen final
{
public:
