#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Short_Ammo_3_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Short_Ammo_3_Parent.Tiered_Short_Ammo_3_Parent_C
// 0x0048 (0x0D50 - 0x0D08)
class ATiered_Short_Ammo_3_Parent_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         MobileSelectedTL_LerpInteactoIcon_5447CA7E4548EFFBC71F1B90C12A1B49; // 0x0D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_5447CA7E4548EFFBC71F1B90C12A1B49; // 0x0D14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_5447CA7E4548EFFBC71F1B90C12A1B49; // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_875D[0x7];                                     // 0x0D19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x0D38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0D44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tiered_Short_Ammo_3_Parent(int32 EntryPoint);
	void OnBeginSearch();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void SetVisibleMobileInteractIcon(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Short_Ammo_3_Parent_C">();
	}
	static class ATiered_Short_Ammo_3_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Short_Ammo_3_Parent_C>();
	}
};
static_assert(alignof(ATiered_Short_Ammo_3_Parent_C) == 0x000008, "Wrong alignment on ATiered_Short_Ammo_3_Parent_C");
static_assert(sizeof(ATiered_Short_Ammo_3_Parent_C) == 0x000D50, "Wrong size on ATiered_Short_Ammo_3_Parent_C");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, UberGraphFrame) == 0x000D08, "Member 'ATiered_Short_Ammo_3_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileSelectedTL_LerpInteactoIcon_5447CA7E4548EFFBC71F1B90C12A1B49) == 0x000D10, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileSelectedTL_LerpInteactoIcon_5447CA7E4548EFFBC71F1B90C12A1B49' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileSelectedTL_LerpObject_5447CA7E4548EFFBC71F1B90C12A1B49) == 0x000D14, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileSelectedTL_LerpObject_5447CA7E4548EFFBC71F1B90C12A1B49' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileSelectedTL__Direction_5447CA7E4548EFFBC71F1B90C12A1B49) == 0x000D18, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileSelectedTL__Direction_5447CA7E4548EFFBC71F1B90C12A1B49' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileSelectedTL) == 0x000D20, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileInteractionMaterial) == 0x000D28, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileInteractIcon) == 0x000D30, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileInteractIconLocation) == 0x000D38, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Short_Ammo_3_Parent_C, MobileInteractIconScale) == 0x000D44, "Member 'ATiered_Short_Ammo_3_Parent_C::MobileInteractIconScale' has a wrong offset!");

}

