#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Chest_Athena.Tiered_Chest_Athena_C
// 0x00E0 (0x0DE8 - 0x0D08)
#pragma pack(push, 0x1)
class alignas(0x08) ATiered_Chest_Athena_C : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Loot_Chest_Aura_Athena;                          // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Chest_SmokeSheet;                                // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TreasureLight;                                     // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x0D28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6;  // 0x0D30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6; // 0x0D34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788A[0x3];                                     // 0x0D35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8; // 0x0D48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788B[0x7];                                     // 0x0D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584; // 0x0D58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584; // 0x0D5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788C[0x3];                                     // 0x0D5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpecialChestOpenSound;                             // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         MobileWiggleAmount;                                // 0x0D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x0D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x0DA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0DAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Open_Chest_Sound;                                  // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Loot_Chest_Opened_FX;                            // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_0;                                          // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_1;                                          // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Galileo_Chest_Open_FX;                             // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFX_Rotation;                                   // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tiered_Chest_Athena(int32 EntryPoint);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBeginSearch();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void Mobile_OnDisconnect();
	void Mobile_OnInteract();
	void Mobile_Outline_Off();
	void Mobile_Outline_On();
	void OnSetSearched();
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void OnLoot();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void MobileOnInteractTL__FinishedFunc();
	void UserConstructionScript();
	void SetLightVisibility(bool Visible);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void CreateMobileMIDs();
	void CleanupWiggleMIDs();
	void GetMaxAudibleDistance(float* Max_Distance);
	void SetVisibleMobileInteractIcon(bool Visible);
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Chest_Athena_C">();
	}
	static class ATiered_Chest_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Chest_Athena_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ATiered_Chest_Athena_C) == 0x000008, "Wrong alignment on ATiered_Chest_Athena_C");
static_assert(sizeof(ATiered_Chest_Athena_C) == 0x000DE8, "Wrong size on ATiered_Chest_Athena_C");
static_assert(offsetof(ATiered_Chest_Athena_C, UberGraphFrame) == 0x000D08, "Member 'ATiered_Chest_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, P_Loot_Chest_Aura_Athena) == 0x000D10, "Member 'ATiered_Chest_Athena_C::P_Loot_Chest_Aura_Athena' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, S_Chest_SmokeSheet) == 0x000D18, "Member 'ATiered_Chest_Athena_C::S_Chest_SmokeSheet' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, TreasureLight) == 0x000D20, "Member 'ATiered_Chest_Athena_C::TreasureLight' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Chest_Ambient_Sound) == 0x000D28, "Member 'ATiered_Chest_Athena_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6) == 0x000D30, "Member 'ATiered_Chest_Athena_C::Timeline_0_Time_C3D8BC62418047EE3E783F89FAF8EEB6' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6) == 0x000D34, "Member 'ATiered_Chest_Athena_C::Timeline_0__Direction_C3D8BC62418047EE3E783F89FAF8EEB6' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Timeline_0) == 0x000D38, "Member 'ATiered_Chest_Athena_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D40, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpInteactoIcon_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D44, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL_LerpObject_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8) == 0x000D48, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL__Direction_EEB30EBE433E8977EDA63DB381EAF0C8' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileSelectedTL) == 0x000D50, "Member 'ATiered_Chest_Athena_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584) == 0x000D58, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL_LERP_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584) == 0x000D5C, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL__Direction_9BD788A146DACD005BAF94BEBEDAB584' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileOnInteractTL) == 0x000D60, "Member 'ATiered_Chest_Athena_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Loot_Effect) == 0x000D68, "Member 'ATiered_Chest_Athena_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, SpecialChestOpenSound) == 0x000D70, "Member 'ATiered_Chest_Athena_C::SpecialChestOpenSound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MIDs) == 0x000D78, "Member 'ATiered_Chest_Athena_C::MIDs' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileWiggleAmount) == 0x000D88, "Member 'ATiered_Chest_Athena_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, ChestChimeVisualUpdate) == 0x000D8C, "Member 'ATiered_Chest_Athena_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractionMaterial) == 0x000D90, "Member 'ATiered_Chest_Athena_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIcon) == 0x000D98, "Member 'ATiered_Chest_Athena_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconLocation) == 0x000DA0, "Member 'ATiered_Chest_Athena_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, MobileInteractIconScale) == 0x000DAC, "Member 'ATiered_Chest_Athena_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Open_Chest_Sound) == 0x000DB8, "Member 'ATiered_Chest_Athena_C::Open_Chest_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, P_Loot_Chest_Opened_FX) == 0x000DC0, "Member 'ATiered_Chest_Athena_C::P_Loot_Chest_Opened_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, NewVar_0) == 0x000DC8, "Member 'ATiered_Chest_Athena_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, NewVar_1) == 0x000DD0, "Member 'ATiered_Chest_Athena_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, Galileo_Chest_Open_FX) == 0x000DD8, "Member 'ATiered_Chest_Athena_C::Galileo_Chest_Open_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_C, OpenFX_Rotation) == 0x000DE0, "Member 'ATiered_Chest_Athena_C::OpenFX_Rotation' has a wrong offset!");

}

