#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Ammo_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Ammo_Athena.Tiered_Ammo_Athena_C.ExecuteUbergraph_Tiered_Ammo_Athena
// 0x0150 (0x0150 - 0x0000)
struct Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6184[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6185[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6186[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6187[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6188[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6189[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_618A[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_618B[0x1];                                     // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618C[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena) == 0x000010, "Wrong alignment on Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena");
static_assert(sizeof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena) == 0x000150, "Wrong size on Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, EntryPoint) == 0x000000, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000058, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_VLerp_ReturnValue) == 0x00005C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsMobileGame_ReturnValue) == 0x000068, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_2) == 0x00006A, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_3) == 0x00006B, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00006C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue_1) == 0x000088, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_4) == 0x0000D0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_AddComponent_ReturnValue_1) == 0x0000D8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_5) == 0x0000E0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000E8, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000FC, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Roll_1) == 0x000108, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Pitch_1) == 0x00010C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_BreakRotator_Yaw_1) == 0x000110, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_6) == 0x000114, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Add_FloatFloat_ReturnValue) == 0x000118, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_MakeRotator_ReturnValue_2) == 0x00011C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000128, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_7) == 0x000129, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_IsValid_ReturnValue_8) == 0x00012A, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_Add_VectorVector_ReturnValue) == 0x000138, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000148, "Member 'Tiered_Ammo_Athena_C_ExecuteUbergraph_Tiered_Ammo_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Tiered_Ammo_Athena.Tiered_Ammo_Athena_C.SetVisibleMobileInteractIcon
// 0x0070 (0x0070 - 0x0000)
struct Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_618D[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_618E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_618F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon) == 0x000070, "Wrong size on Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'Tiered_Ammo_Athena_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

