#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_Athena_FactionChest_NoLocks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Chest_Athena_FactionChest_NoLocks.Tiered_Chest_Athena_FactionChest_NoLocks_C
// 0x0160 (0x0E68 - 0x0D08)
class ATiered_Chest_Athena_FactionChest_NoLocks_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      P_NS_Faction_Chest_Idle;                           // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Faction_Crate_Glows;                               // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthena_FactionSelection_AlterEgo_C*    Athena_FactionSelection_AlterEgo;                  // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Open_Sound;                                  // 0x0D28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   TreasureLight;                                     // 0x0D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Chest_Ambient_Sound;                               // 0x0D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Time_D8A1398E4AFA37BBDECCF293383ABE9F;  // 0x0D40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D8A1398E4AFA37BBDECCF293383ABE9F; // 0x0D44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B6[0x3];                                     // 0x0D45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_0AE82E2D4E1FCFD3E2E9F1BE946C1D69; // 0x0D50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_0AE82E2D4E1FCFD3E2E9F1BE946C1D69; // 0x0D54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_0AE82E2D4E1FCFD3E2E9F1BE946C1D69; // 0x0D58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B7[0x7];                                     // 0x0D59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileOnInteractTL_LERP_76E2C73945E36888260E65A4B339A848; // 0x0D68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileOnInteractTL__Direction_76E2C73945E36888260E65A4B339A848; // 0x0D6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B8[0x3];                                     // 0x0D6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileOnInteractTL;                                // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Loot_Effect;                                       // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpecialChestOpenSound;                             // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         MobileWiggleAmount;                                // 0x0D98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChestChimeVisualUpdate;                            // 0x0D9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x0DB0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0DBC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Open_Chest_Sound;                                  // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Loot_Chest_Opened_FX;                            // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_0;                                          // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_1;                                          // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Galileo_Chest_Open_FX;                             // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFX_Rotation;                                   // 0x0DF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Faction;                                         // 0x0DF4(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FName                                   EgoLootTier;                                       // 0x0DFC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AlterLootTier;                                     // 0x0E04(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NeutralLootTier;                                   // 0x0E0C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74B9[0x4];                                     // 0x0E14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Mat_AlterFaction;                                  // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Mat_EgoFaction;                                    // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             MatAlterSearchedOverride;                          // 0x0E28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             MatEgoSearchedOverride;                            // 0x0E38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UNiagaraComponent*                      Loot_Effect_Niagara;                               // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        S_Chest_Smoke_Sheet;                               // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NewVar_2;                                          // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NewVar_3;                                          // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tiered_Chest_Athena_FactionChest_NoLocks(int32 EntryPoint);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void PlayOpeningTimeLine();
	void BndEvt__Athena_FactionSelection_AlterEgo_K2Node_ComponentBoundEvent_0_OnFactionSelected__DelegateSignature(const struct FGameplayTag& FactionTagOut);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBeginSearch();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void Mobile_OnDisconnect();
	void Mobile_OnInteract();
	void Mobile_Outline_Off();
	void Mobile_Outline_On();
	void OnSetSearched();
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void OnLoot();
	void OnReady_0169621A44481EDB77F98E9970DE4ED0(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void MobileOnInteractTL__UpdateFunc();
	void MobileOnInteractTL__FinishedFunc();
	void UserConstructionScript();
	void SetLightVisibility(bool Visible);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void CreateMobileMIDs();
	void CleanupWiggleMIDs();
	void GetMaxAudibleDistance(float* Max_Distance);
	void SetVisibleMobileInteractIcon(bool Visible);
	void OnSetCustomDepthStencilValue(const TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnRep_T_Faction();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Chest_Athena_FactionChest_NoLocks_C">();
	}
	static class ATiered_Chest_Athena_FactionChest_NoLocks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Chest_Athena_FactionChest_NoLocks_C>();
	}
};
static_assert(alignof(ATiered_Chest_Athena_FactionChest_NoLocks_C) == 0x000008, "Wrong alignment on ATiered_Chest_Athena_FactionChest_NoLocks_C");
static_assert(sizeof(ATiered_Chest_Athena_FactionChest_NoLocks_C) == 0x000E68, "Wrong size on ATiered_Chest_Athena_FactionChest_NoLocks_C");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, UberGraphFrame) == 0x000D08, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, P_NS_Faction_Chest_Idle) == 0x000D10, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::P_NS_Faction_Chest_Idle' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Faction_Crate_Glows) == 0x000D18, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Faction_Crate_Glows' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Athena_FactionSelection_AlterEgo) == 0x000D20, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Athena_FactionSelection_AlterEgo' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Chest_Open_Sound) == 0x000D28, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Chest_Open_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, TreasureLight) == 0x000D30, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::TreasureLight' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Chest_Ambient_Sound) == 0x000D38, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Chest_Ambient_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Timeline_0_Time_D8A1398E4AFA37BBDECCF293383ABE9F) == 0x000D40, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Timeline_0_Time_D8A1398E4AFA37BBDECCF293383ABE9F' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Timeline_0__Direction_D8A1398E4AFA37BBDECCF293383ABE9F) == 0x000D44, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Timeline_0__Direction_D8A1398E4AFA37BBDECCF293383ABE9F' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Timeline_0) == 0x000D48, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileSelectedTL_LerpInteactoIcon_0AE82E2D4E1FCFD3E2E9F1BE946C1D69) == 0x000D50, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileSelectedTL_LerpInteactoIcon_0AE82E2D4E1FCFD3E2E9F1BE946C1D69' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileSelectedTL_LerpObject_0AE82E2D4E1FCFD3E2E9F1BE946C1D69) == 0x000D54, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileSelectedTL_LerpObject_0AE82E2D4E1FCFD3E2E9F1BE946C1D69' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileSelectedTL__Direction_0AE82E2D4E1FCFD3E2E9F1BE946C1D69) == 0x000D58, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileSelectedTL__Direction_0AE82E2D4E1FCFD3E2E9F1BE946C1D69' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileSelectedTL) == 0x000D60, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileOnInteractTL_LERP_76E2C73945E36888260E65A4B339A848) == 0x000D68, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileOnInteractTL_LERP_76E2C73945E36888260E65A4B339A848' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileOnInteractTL__Direction_76E2C73945E36888260E65A4B339A848) == 0x000D6C, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileOnInteractTL__Direction_76E2C73945E36888260E65A4B339A848' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileOnInteractTL) == 0x000D70, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileOnInteractTL' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Loot_Effect) == 0x000D78, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Loot_Effect' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, SpecialChestOpenSound) == 0x000D80, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::SpecialChestOpenSound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MIDs) == 0x000D88, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MIDs' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileWiggleAmount) == 0x000D98, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileWiggleAmount' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, ChestChimeVisualUpdate) == 0x000D9C, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::ChestChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileInteractionMaterial) == 0x000DA0, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileInteractIcon) == 0x000DA8, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileInteractIconLocation) == 0x000DB0, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MobileInteractIconScale) == 0x000DBC, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Open_Chest_Sound) == 0x000DC8, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Open_Chest_Sound' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, P_Loot_Chest_Opened_FX) == 0x000DD0, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::P_Loot_Chest_Opened_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, NewVar_0) == 0x000DD8, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, NewVar_1) == 0x000DE0, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Galileo_Chest_Open_FX) == 0x000DE8, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Galileo_Chest_Open_FX' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, OpenFX_Rotation) == 0x000DF0, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::OpenFX_Rotation' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, T_Faction) == 0x000DF4, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::T_Faction' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, EgoLootTier) == 0x000DFC, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::EgoLootTier' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, AlterLootTier) == 0x000E04, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::AlterLootTier' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, NeutralLootTier) == 0x000E0C, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::NeutralLootTier' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Mat_AlterFaction) == 0x000E18, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Mat_AlterFaction' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Mat_EgoFaction) == 0x000E20, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Mat_EgoFaction' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MatAlterSearchedOverride) == 0x000E28, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MatAlterSearchedOverride' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, MatEgoSearchedOverride) == 0x000E38, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::MatEgoSearchedOverride' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, Loot_Effect_Niagara) == 0x000E48, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::Loot_Effect_Niagara' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, S_Chest_Smoke_Sheet) == 0x000E50, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::S_Chest_Smoke_Sheet' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, NewVar_2) == 0x000E58, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(ATiered_Chest_Athena_FactionChest_NoLocks_C, NewVar_3) == 0x000E60, "Member 'ATiered_Chest_Athena_FactionChest_NoLocks_C::NewVar_3' has a wrong offset!");

}

