#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Chest_6_Parent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.ExecuteUbergraph_Tiered_Chest_6_Parent
// 0x02D0 (0x02D0 - 0x0000)
struct Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82B7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82B8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82B9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFortMiniMapComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82BA[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82BB[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82BC[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x00D0(0x0080)()
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82BD[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82BE[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82BF[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C0[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAudibleDistance_Max_Distance;       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C1[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C2[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01C8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01F4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0290(0x0018)()
	bool                                          K2Node_CustomEvent_bShow;                          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C3[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C4[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent) == 0x000010, "Wrong alignment on Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent");
static_assert(sizeof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent) == 0x0002D0, "Wrong size on Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, EntryPoint) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue_1) == 0x00000C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_struct_Variable) == 0x000020, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_object_Variable) == 0x000058, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000068, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Loop_Counter_Variable_1) == 0x000080, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Array_Index_Variable_2) == 0x000088, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00008C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00008D, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00009C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_BreakRotator_Roll) == 0x0000A8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_BreakRotator_Pitch) == 0x0000AC, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_BreakRotator_Yaw) == 0x0000B0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000C8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_BPGetRarityData_ReturnValue) == 0x0000D0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000150, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000158, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000160, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue_2) == 0x00016C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Get_Item) == 0x000170, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x00018D, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Get_Item_2) == 0x000190, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Array_Length_ReturnValue_2) == 0x000198, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Less_IntInt_ReturnValue_1) == 0x00019C, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Lerp_ReturnValue) == 0x0001A0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A4, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_GetMaxAudibleDistance_Max_Distance) == 0x0001B0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_GetMaxAudibleDistance_Max_Distance' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001B8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_Damage) == 0x0001C0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_DamageTags) == 0x0001C8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_Momentum) == 0x0001E8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_HitInfo) == 0x0001F4, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_InstigatedBy) == 0x000280, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_DamageCauser) == 0x000288, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_Event_EffectContext) == 0x000290, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, K2Node_CustomEvent_bShow) == 0x0002A8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_int_Loop_Counter_Variable_2) == 0x0002AC, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002B0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B4, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x0002B8, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, Temp_bool_IsClosed_Variable) == 0x0002C0, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue_3) == 0x0002C1, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue_4) == 0x0002C2, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent, CallFunc_IsValid_ReturnValue_5) == 0x0002C3, "Member 'Tiered_Chest_6_Parent_C_ExecuteUbergraph_Tiered_Chest_6_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.ShowTieredChests
// 0x0001 (0x0001 - 0x0000)
struct Tiered_Chest_6_Parent_C_ShowTieredChests final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_ShowTieredChests) == 0x000001, "Wrong alignment on Tiered_Chest_6_Parent_C_ShowTieredChests");
static_assert(sizeof(Tiered_Chest_6_Parent_C_ShowTieredChests) == 0x000001, "Wrong size on Tiered_Chest_6_Parent_C_ShowTieredChests");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShowTieredChests, bShow) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_ShowTieredChests::bShow' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Tiered_Chest_6_Parent_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_OnDeathPlayEffects");
static_assert(sizeof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Tiered_Chest_6_Parent_C_OnDeathPlayEffects");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Tiered_Chest_6_Parent_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Tiered_Chest_6_Parent_C_UserConstructionScript final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_UserConstructionScript) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_UserConstructionScript");
static_assert(sizeof(Tiered_Chest_6_Parent_C_UserConstructionScript) == 0x000010, "Wrong size on Tiered_Chest_6_Parent_C_UserConstructionScript");
static_assert(offsetof(Tiered_Chest_6_Parent_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_UserConstructionScript, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_UserConstructionScript::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_UserConstructionScript, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'Tiered_Chest_6_Parent_C_UserConstructionScript::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000D, "Member 'Tiered_Chest_6_Parent_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.SetLightVisibility
// 0x0002 (0x0002 - 0x0000)
struct Tiered_Chest_6_Parent_C_SetLightVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_SetLightVisibility) == 0x000001, "Wrong alignment on Tiered_Chest_6_Parent_C_SetLightVisibility");
static_assert(sizeof(Tiered_Chest_6_Parent_C_SetLightVisibility) == 0x000002, "Wrong size on Tiered_Chest_6_Parent_C_SetLightVisibility");
static_assert(offsetof(Tiered_Chest_6_Parent_C_SetLightVisibility, Visible) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_SetLightVisibility::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_SetLightVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Chest_6_Parent_C_SetLightVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.ShouldDie
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_6_Parent_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_ShouldDie) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_ShouldDie");
static_assert(sizeof(Tiered_Chest_6_Parent_C_ShouldDie) == 0x000030, "Wrong size on Tiered_Chest_6_Parent_C_ShouldDie");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, Damage) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, EventInstigator) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, DamageCauser) == 0x000010, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, ReturnValue) == 0x000018, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000020, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_ShouldDie, CallFunc_IsOutpostOwner_ReturnValue) == 0x000029, "Member 'Tiered_Chest_6_Parent_C_ShouldDie::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.CreateMobileMIDs
// 0x0030 (0x0030 - 0x0000)
struct Tiered_Chest_6_Parent_C_CreateMobileMIDs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_CreateMobileMIDs) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_CreateMobileMIDs");
static_assert(sizeof(Tiered_Chest_6_Parent_C_CreateMobileMIDs) == 0x000030, "Wrong size on Tiered_Chest_6_Parent_C_CreateMobileMIDs");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_IsMobileGame_ReturnValue) == 0x000014, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_GetMaterials_ReturnValue) == 0x000018, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CreateMobileMIDs, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Tiered_Chest_6_Parent_C_CreateMobileMIDs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.CleanupWiggleMIDs
// 0x0020 (0x0020 - 0x0000)
struct Tiered_Chest_6_Parent_C_CleanupWiggleMIDs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C9[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_CleanupWiggleMIDs");
static_assert(sizeof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs) == 0x000020, "Wrong size on Tiered_Chest_6_Parent_C_CleanupWiggleMIDs");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, CallFunc_IsMobileGame_ReturnValue) == 0x00000C, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, CallFunc_Array_Get_Item) == 0x000010, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_CleanupWiggleMIDs, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'Tiered_Chest_6_Parent_C_CleanupWiggleMIDs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.GetMaxAudibleDistance
// 0x0008 (0x0008 - 0x0000)
struct Tiered_Chest_6_Parent_C_GetMaxAudibleDistance final
{
public:
	float                                         Max_Distance;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_GetMaxAudibleDistance) == 0x000004, "Wrong alignment on Tiered_Chest_6_Parent_C_GetMaxAudibleDistance");
static_assert(sizeof(Tiered_Chest_6_Parent_C_GetMaxAudibleDistance) == 0x000008, "Wrong size on Tiered_Chest_6_Parent_C_GetMaxAudibleDistance");
static_assert(offsetof(Tiered_Chest_6_Parent_C_GetMaxAudibleDistance, Max_Distance) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_GetMaxAudibleDistance::Max_Distance' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_GetMaxAudibleDistance, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Chest_6_Parent_C_GetMaxAudibleDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.OnSetCustomDepthStencilValue
// 0x0038 (0x0038 - 0x0000)
struct Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue final
{
public:
	TArray<class UPrimitiveComponent*>            PrimComponents;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bUseCustomDepth;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StencilValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutConsume;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CC[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue");
static_assert(sizeof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue) == 0x000038, "Wrong size on Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, PrimComponents) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::PrimComponents' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, bUseCustomDepth) == 0x000010, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::bUseCustomDepth' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, StencilValue) == 0x000014, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::StencilValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, bOutConsume) == 0x000018, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::bOutConsume' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Tiered_Chest_6_Parent_C_OnSetCustomDepthStencilValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Tiered_Chest_6_Parent.Tiered_Chest_6_Parent_C.BlueprintCanInteract
// 0x0028 (0x0028 - 0x0000)
struct Tiered_Chest_6_Parent_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CD[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tiered_Chest_6_Parent_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Tiered_Chest_6_Parent_C_BlueprintCanInteract");
static_assert(sizeof(Tiered_Chest_6_Parent_C_BlueprintCanInteract) == 0x000028, "Wrong size on Tiered_Chest_6_Parent_C_BlueprintCanInteract");
static_assert(offsetof(Tiered_Chest_6_Parent_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'Tiered_Chest_6_Parent_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Tiered_Chest_6_Parent_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Tiered_Chest_6_Parent_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Tiered_Chest_6_Parent_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
