#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Short_Ammo_3_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tiered_Short_Ammo_3_Parent.Tiered_Short_Ammo_3_Parent_C.ExecuteUbergraph_Tiered_Short_Ammo_3_Parent
// 0x00E0 (0x00E0 - 0x0000)
struct Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_875E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_875F[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8760[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8761[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent) == 0x000010, "Wrong alignment on Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent");
static_assert(sizeof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent) == 0x0000E0, "Wrong size on Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, EntryPoint) == 0x000000, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000007, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000009, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_VLerp_ReturnValue) == 0x000058, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000064, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsMobileGame_ReturnValue) == 0x000065, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_4) == 0x000066, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_5) == 0x000067, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_IsValid_ReturnValue_6) == 0x000068, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00006C, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_MakeRotator_ReturnValue_1) == 0x000088, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent, CallFunc_AddComponent_ReturnValue_1) == 0x0000D0, "Member 'Tiered_Short_Ammo_3_Parent_C_ExecuteUbergraph_Tiered_Short_Ammo_3_Parent::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");

// Function Tiered_Short_Ammo_3_Parent.Tiered_Short_Ammo_3_Parent_C.SetVisibleMobileInteractIcon
// 0x0070 (0x0070 - 0x0000)
struct Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8762[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8763[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8764[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon) == 0x000010, "Wrong alignment on Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon");
static_assert(sizeof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon) == 0x000070, "Wrong size on Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, Visible) == 0x000000, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::Visible' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'Tiered_Short_Ammo_3_Parent_C_SetVisibleMobileInteractIcon::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

}

