#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tiered_Ammo_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tiered_Ammo_Athena.Tiered_Ammo_Athena_C
// 0x00C0 (0x0DC8 - 0x0D08)
class ATiered_Ammo_Athena_C final : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Time_5E13C6E9491F8EDA37F94EA9AA8C75B8;  // 0x0D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_5E13C6E9491F8EDA37F94EA9AA8C75B8; // 0x0D14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6181[0x3];                                     // 0x0D15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpInteactoIcon_A5A509274549841DD24AFF8F04042949; // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MobileSelectedTL_LerpObject_A5A509274549841DD24AFF8F04042949; // 0x0D24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MobileSelectedTL__Direction_A5A509274549841DD24AFF8F04042949; // 0x0D28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6182[0x7];                                     // 0x0D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MobileSelectedTL;                                  // 0x0D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MobileInteractionMaterial;                         // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MobileInteractIcon;                                // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconLocation;                        // 0x0D48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MobileInteractIconScale;                           // 0x0D54(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRollForMedBox;                               // 0x0D60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AlwaysMedBox;                                      // 0x0D61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6183[0x6];                                     // 0x0D62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MedBoxChance;                                  // 0x0D68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MedBoxEnabled;                                 // 0x0D88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        FX_Open;                                           // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_OpenPitchOffset;                                // 0x0DB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FX_OpenOffsetLocation;                             // 0x0DB4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Open;                                        // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tiered_Ammo_Athena(int32 EntryPoint);
	void OnLoot();
	void OnBeginSearch();
	void DisableBacchusHighlight();
	void EnableBacchusHighlight();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void MobileSelectedTL__UpdateFunc();
	void MobileSelectedTL__FinishedFunc();
	void SetVisibleMobileInteractIcon(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tiered_Ammo_Athena_C">();
	}
	static class ATiered_Ammo_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATiered_Ammo_Athena_C>();
	}
};
static_assert(alignof(ATiered_Ammo_Athena_C) == 0x000008, "Wrong alignment on ATiered_Ammo_Athena_C");
static_assert(sizeof(ATiered_Ammo_Athena_C) == 0x000DC8, "Wrong size on ATiered_Ammo_Athena_C");
static_assert(offsetof(ATiered_Ammo_Athena_C, UberGraphFrame) == 0x000D08, "Member 'ATiered_Ammo_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Timeline_0_Time_5E13C6E9491F8EDA37F94EA9AA8C75B8) == 0x000D10, "Member 'ATiered_Ammo_Athena_C::Timeline_0_Time_5E13C6E9491F8EDA37F94EA9AA8C75B8' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Timeline_0__Direction_5E13C6E9491F8EDA37F94EA9AA8C75B8) == 0x000D14, "Member 'ATiered_Ammo_Athena_C::Timeline_0__Direction_5E13C6E9491F8EDA37F94EA9AA8C75B8' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Timeline_0) == 0x000D18, "Member 'ATiered_Ammo_Athena_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileSelectedTL_LerpInteactoIcon_A5A509274549841DD24AFF8F04042949) == 0x000D20, "Member 'ATiered_Ammo_Athena_C::MobileSelectedTL_LerpInteactoIcon_A5A509274549841DD24AFF8F04042949' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileSelectedTL_LerpObject_A5A509274549841DD24AFF8F04042949) == 0x000D24, "Member 'ATiered_Ammo_Athena_C::MobileSelectedTL_LerpObject_A5A509274549841DD24AFF8F04042949' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileSelectedTL__Direction_A5A509274549841DD24AFF8F04042949) == 0x000D28, "Member 'ATiered_Ammo_Athena_C::MobileSelectedTL__Direction_A5A509274549841DD24AFF8F04042949' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileSelectedTL) == 0x000D30, "Member 'ATiered_Ammo_Athena_C::MobileSelectedTL' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileInteractionMaterial) == 0x000D38, "Member 'ATiered_Ammo_Athena_C::MobileInteractionMaterial' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileInteractIcon) == 0x000D40, "Member 'ATiered_Ammo_Athena_C::MobileInteractIcon' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileInteractIconLocation) == 0x000D48, "Member 'ATiered_Ammo_Athena_C::MobileInteractIconLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, MobileInteractIconScale) == 0x000D54, "Member 'ATiered_Ammo_Athena_C::MobileInteractIconScale' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, ShouldRollForMedBox) == 0x000D60, "Member 'ATiered_Ammo_Athena_C::ShouldRollForMedBox' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, AlwaysMedBox) == 0x000D61, "Member 'ATiered_Ammo_Athena_C::AlwaysMedBox' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Row_MedBoxChance) == 0x000D68, "Member 'ATiered_Ammo_Athena_C::Row_MedBoxChance' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Row_MedBoxEnabled) == 0x000D88, "Member 'ATiered_Ammo_Athena_C::Row_MedBoxEnabled' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, FX_Open) == 0x000DA8, "Member 'ATiered_Ammo_Athena_C::FX_Open' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, FX_OpenPitchOffset) == 0x000DB0, "Member 'ATiered_Ammo_Athena_C::FX_OpenPitchOffset' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, FX_OpenOffsetLocation) == 0x000DB4, "Member 'ATiered_Ammo_Athena_C::FX_OpenOffsetLocation' has a wrong offset!");
static_assert(offsetof(ATiered_Ammo_Athena_C, Sound_Open) == 0x000DC0, "Member 'ATiered_Ammo_Athena_C::Sound_Open' has a wrong offset!");

}

