#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynth_TrackMixState_Mang

#include "Basic.hpp"

#include "TimeSynth_VolumeGroupState_structs.hpp"
#include "TimeSynth_MANG_MixStates_structs.hpp"


namespace SDK
{

// UserDefinedStruct TimeSynth_TrackMixState_Mang.TimeSynth_TrackMixState_Mang
// 0x0040 (0x0040 - 0x0000)
struct FTimeSynth_TrackMixState_Mang final
{
public:
	ETimeSynth_MANG_MixStates                     MixState_12_DE643ACB4D24E56B4BD5BEB15784E04D;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8110[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTimeSynth_VolumeGroupState>    VolumeGroupStates_3_6471FE684CEE53024935A3BF6175EB13; // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Enabled_14_D6C017694F7873486AE2D2A6AD3B1839;       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8111[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeInTime_20_90A9CE1C4D73A02B7CC1AE988D7CE73A;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutTime_19_363C854D4A1A611604F5DDB9A4CC2823;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8112[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             EnabledStinger_23_C530DE9747C50217ACE176831DD57CD1; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DisabledStinger_25_9F68C0C940D3B9E990EB2F8213EE9AAC; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              EnabledSoundMix_28_690613884A0F1F50A04FA282F8A19D3C; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FTimeSynth_TrackMixState_Mang) == 0x000008, "Wrong alignment on FTimeSynth_TrackMixState_Mang");
static_assert(sizeof(FTimeSynth_TrackMixState_Mang) == 0x000040, "Wrong size on FTimeSynth_TrackMixState_Mang");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, MixState_12_DE643ACB4D24E56B4BD5BEB15784E04D) == 0x000000, "Member 'FTimeSynth_TrackMixState_Mang::MixState_12_DE643ACB4D24E56B4BD5BEB15784E04D' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, VolumeGroupStates_3_6471FE684CEE53024935A3BF6175EB13) == 0x000008, "Member 'FTimeSynth_TrackMixState_Mang::VolumeGroupStates_3_6471FE684CEE53024935A3BF6175EB13' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, Enabled_14_D6C017694F7873486AE2D2A6AD3B1839) == 0x000018, "Member 'FTimeSynth_TrackMixState_Mang::Enabled_14_D6C017694F7873486AE2D2A6AD3B1839' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, FadeInTime_20_90A9CE1C4D73A02B7CC1AE988D7CE73A) == 0x00001C, "Member 'FTimeSynth_TrackMixState_Mang::FadeInTime_20_90A9CE1C4D73A02B7CC1AE988D7CE73A' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, FadeOutTime_19_363C854D4A1A611604F5DDB9A4CC2823) == 0x000020, "Member 'FTimeSynth_TrackMixState_Mang::FadeOutTime_19_363C854D4A1A611604F5DDB9A4CC2823' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, EnabledStinger_23_C530DE9747C50217ACE176831DD57CD1) == 0x000028, "Member 'FTimeSynth_TrackMixState_Mang::EnabledStinger_23_C530DE9747C50217ACE176831DD57CD1' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, DisabledStinger_25_9F68C0C940D3B9E990EB2F8213EE9AAC) == 0x000030, "Member 'FTimeSynth_TrackMixState_Mang::DisabledStinger_25_9F68C0C940D3B9E990EB2F8213EE9AAC' has a wrong offset!");
static_assert(offsetof(FTimeSynth_TrackMixState_Mang, EnabledSoundMix_28_690613884A0F1F50A04FA282F8A19D3C) == 0x000038, "Member 'FTimeSynth_TrackMixState_Mang::EnabledSoundMix_28_690613884A0F1F50A04FA282F8A19D3C' has a wrong offset!");

}

