#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastDisplayArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToastDisplayArea.ToastDisplayArea_C
// 0x0018 (0x02B8 - 0x02A0)
class UToastDisplayArea_C final : public UFortToastDisplayArea
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone_0;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendSubscriptionToastWidget_C*       NewVar_0;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TestFrontendToast();
	void ExecuteUbergraph_ToastDisplayArea(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToastDisplayArea_C">();
	}
	static class UToastDisplayArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToastDisplayArea_C>();
	}
};
static_assert(alignof(UToastDisplayArea_C) == 0x000008, "Wrong alignment on UToastDisplayArea_C");
static_assert(sizeof(UToastDisplayArea_C) == 0x0002B8, "Wrong size on UToastDisplayArea_C");
static_assert(offsetof(UToastDisplayArea_C, UberGraphFrame) == 0x0002A0, "Member 'UToastDisplayArea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToastDisplayArea_C, SafeZone_0) == 0x0002A8, "Member 'UToastDisplayArea_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UToastDisplayArea_C, NewVar_0) == 0x0002B0, "Member 'UToastDisplayArea_C::NewVar_0' has a wrong offset!");

}

