#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopBar.TopBar_C
// 0x0040 (0x0420 - 0x03E0)
class UTopBar_C final : public UAthenaTopBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroTabLabel;                                     // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameFeatureStatus_C*                   GameFeatureStatus_HighResTextureDownload;          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TopContent;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULetoFrontendJoinPrompt_Side_C*         LetoFrontendJoinPrompt_Side;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MobileTabTitle;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_7;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWindowchromebuttons_C*                 Windowchromebuttons;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetTopTabsVisibility(ESlateVisibility NewVisibility);
	void UpdateMTXButton();
	void Construct();
	void OnMobileTabLabelChanged();
	void ExecuteUbergraph_TopBar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopBar_C">();
	}
	static class UTopBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopBar_C>();
	}
};
static_assert(alignof(UTopBar_C) == 0x000008, "Wrong alignment on UTopBar_C");
static_assert(sizeof(UTopBar_C) == 0x000420, "Wrong size on UTopBar_C");
static_assert(offsetof(UTopBar_C, UberGraphFrame) == 0x0003E0, "Member 'UTopBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopBar_C, IntroTabLabel) == 0x0003E8, "Member 'UTopBar_C::IntroTabLabel' has a wrong offset!");
static_assert(offsetof(UTopBar_C, GameFeatureStatus_HighResTextureDownload) == 0x0003F0, "Member 'UTopBar_C::GameFeatureStatus_HighResTextureDownload' has a wrong offset!");
static_assert(offsetof(UTopBar_C, HorizontalBox_TopContent) == 0x0003F8, "Member 'UTopBar_C::HorizontalBox_TopContent' has a wrong offset!");
static_assert(offsetof(UTopBar_C, LetoFrontendJoinPrompt_Side) == 0x000400, "Member 'UTopBar_C::LetoFrontendJoinPrompt_Side' has a wrong offset!");
static_assert(offsetof(UTopBar_C, MobileTabTitle) == 0x000408, "Member 'UTopBar_C::MobileTabTitle' has a wrong offset!");
static_assert(offsetof(UTopBar_C, SafeZone_7) == 0x000410, "Member 'UTopBar_C::SafeZone_7' has a wrong offset!");
static_assert(offsetof(UTopBar_C, Windowchromebuttons) == 0x000418, "Member 'UTopBar_C::Windowchromebuttons' has a wrong offset!");

}

