#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentPayoutModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TournamentPayoutModal.TournamentPayoutModal_C
// 0x00A8 (0x03B0 - 0x0308)
class UTournamentPayoutModal_C final : public UFortTournamentPayoutModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  BackButton;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ContainerBG;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_OptionsBarBG;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           CommonHierarchicalScrollBox_0;                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_476;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content_LeaderboardEntries;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Content_NoLeaderboardEntries;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEventDetails_C*        EventLeaderboardEventDetails;                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardHeader_C*              EventLeaderboardHeaderDetails;                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_TopContainer;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_LeaderboardEntries;                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoLeaderboardEntries;                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CallEventBack;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             NoPayout;                                          // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EmptyFunction(bool* Handled);
	void NotifyNoPayouts();
	void BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Init(const class FString& EventWindowId, const class FString& TournamentId);
	void EventIntro();
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_TournamentPayoutModal(int32 EntryPoint);
	void NoPayout__DelegateSignature();
	void CallEventBack__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TournamentPayoutModal_C">();
	}
	static class UTournamentPayoutModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTournamentPayoutModal_C>();
	}
};
static_assert(alignof(UTournamentPayoutModal_C) == 0x000008, "Wrong alignment on UTournamentPayoutModal_C");
static_assert(sizeof(UTournamentPayoutModal_C) == 0x0003B0, "Wrong size on UTournamentPayoutModal_C");
static_assert(offsetof(UTournamentPayoutModal_C, UberGraphFrame) == 0x000308, "Member 'UTournamentPayoutModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, Intro) == 0x000310, "Member 'UTournamentPayoutModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, BackButton) == 0x000318, "Member 'UTournamentPayoutModal_C::BackButton' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CloseButton) == 0x000320, "Member 'UTournamentPayoutModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CommonBorder_ContainerBG) == 0x000328, "Member 'UTournamentPayoutModal_C::CommonBorder_ContainerBG' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CommonBorder_OptionsBarBG) == 0x000330, "Member 'UTournamentPayoutModal_C::CommonBorder_OptionsBarBG' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CommonHierarchicalScrollBox_0) == 0x000338, "Member 'UTournamentPayoutModal_C::CommonHierarchicalScrollBox_0' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CommonTextBlock_1) == 0x000340, "Member 'UTournamentPayoutModal_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CommonWidgetSwitcher_476) == 0x000348, "Member 'UTournamentPayoutModal_C::CommonWidgetSwitcher_476' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, Content_LeaderboardEntries) == 0x000350, "Member 'UTournamentPayoutModal_C::Content_LeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, Content_NoLeaderboardEntries) == 0x000358, "Member 'UTournamentPayoutModal_C::Content_NoLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, EventLeaderboardEventDetails) == 0x000360, "Member 'UTournamentPayoutModal_C::EventLeaderboardEventDetails' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, EventLeaderboardHeaderDetails) == 0x000368, "Member 'UTournamentPayoutModal_C::EventLeaderboardHeaderDetails' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, SafeZone_1) == 0x000370, "Member 'UTournamentPayoutModal_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, SizeBox_TopContainer) == 0x000378, "Member 'UTournamentPayoutModal_C::SizeBox_TopContainer' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, Switcher_LeaderboardEntries) == 0x000380, "Member 'UTournamentPayoutModal_C::Switcher_LeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, Text_NoLeaderboardEntries) == 0x000388, "Member 'UTournamentPayoutModal_C::Text_NoLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, CallEventBack) == 0x000390, "Member 'UTournamentPayoutModal_C::CallEventBack' has a wrong offset!");
static_assert(offsetof(UTournamentPayoutModal_C, NoPayout) == 0x0003A0, "Member 'UTournamentPayoutModal_C::NoPayout' has a wrong offset!");

}

