#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentEventWindowDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TournamentEventWindowDetails_C_BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TournamentEventWindowDetails.TournamentEventWindowDetails_C.ExecuteUbergraph_TournamentEventWindowDetails
// 0x0968 (0x0968 - 0x0000)
struct TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7759[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortEventWindowEligibility                   Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0068(0x0018)()
	EFortEventWindowEligibility                   Temp_byte_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775B[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D0(0x0018)()
	EFortEventWindowEligibility                   Temp_byte_Variable_2;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775C[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0138(0x0018)()
	EFortEventWindowEligibility                   Temp_byte_Variable_3;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775D[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_12;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x01A0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_775E[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_16;                             // 0x01C0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_775F[0x1];                                     // 0x01DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       Temp_byte_Variable_8;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7760[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_17;                             // 0x0210(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_18;                             // 0x0228(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_19;                             // 0x0240(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_20;                             // 0x0258(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_21;                             // 0x0270(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_22;                             // 0x0288(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_23;                             // 0x02A0(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_24;                             // 0x02B8(0x0018)(ConstParm)
	EFortShowdownEventState                       Temp_byte_Variable_9;                              // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7761[0x5];                                     // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x02D8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7762[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0300(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0318(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownMatchType                        CallFunc_GetTournamentMatchType_ReturnValue;       // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7763[0x1];                                     // 0x0333(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7764[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7765[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue;  // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7766[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortShowdownEventBestResultsSummary   CallFunc_GetEventResultsSummary_ReturnValue;       // 0x0364(0x0018)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x037E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7767[0x1];                                     // 0x037F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0380(0x0028)()
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue;        // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_5;               // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventLeaderboardAvailable_ReturnValue;  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventLeaderboardAvailable_ReturnValue_1; // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7768[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentId_ReturnValue_1;            // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7769[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_4;               // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_776A[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_3;             // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_776B[0x3];                                     // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_4;             // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_2;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_5;             // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_776C[0x3];                                     // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_776D[0x4];                                     // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_776E[0x3];                                     // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEventWindowSessionNumber_ReturnValue;  // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_776F[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0468(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7770[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04C0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x04D8(0x0018)()
	EFortEventWindowEligibility                   CallFunc_GetEventWindowEligibility_ReturnValue;    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7771[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x04F8(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0510(0x0018)()
	bool                                          Temp_bool_Variable_7;                              // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7772[0x7];                                     // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x0530(0x0018)()
	EFortEventWindowEligibility                   CallFunc_GetEventWindowEligibility_ReturnValue_1;  // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7773[0x3];                                     // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_6;                           // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_7;                           // 0x0558(0x0018)()
	float                                         Temp_float_Variable_3;                             // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortShowdownEventBestResultsSummary   CallFunc_GetEventResultsSummary_ReturnValue_1;     // 0x0574(0x0018)(NoDestructor)
	uint8                                         Pad_7774[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetEventBeginTime_ReturnValue;            // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0598(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetEventDateAsText_ReturnValue;           // 0x05D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x05F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7775[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0608(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7776[0x7];                                     // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetEventEndTime_ReturnValue;              // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEventDateAsText_ReturnValue_1;         // 0x0630(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7777[0x7];                                     // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetEventBeginTime_ReturnValue_1;          // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEventTimeAsText_ReturnValue;           // 0x0658(0x0018)()
	struct FDateTime                              CallFunc_GetEventEndTime_ReturnValue_1;            // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0678(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetEventTimeAsText_ReturnValue_1;         // 0x06B8(0x0018)()
	bool                                          Temp_bool_Variable_8;                              // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7778[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x06D8(0x0040)(HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventBeginTime_ReturnValue_2;          // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_9;                           // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7779[0x4];                                     // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEventDateAsText_ReturnValue_2;         // 0x0728(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0748(0x0040)(HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventEndTime_ReturnValue_2;            // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_777A[0x4];                                     // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEventDateAsText_ReturnValue_3;         // 0x0798(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x07B0(0x0040)(HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventTimeState_ReturnValue;            // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_777B[0x7];                                     // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x07F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0808(0x0018)()
	class FText                                   K2Node_Select_Default_10;                          // 0x0820(0x0018)(ConstParm)
	class FText                                   K2Node_Select_Default_11;                          // 0x0838(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0850(0x0040)(HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventPlayerParticipationState_ReturnValue; // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_777C[0x7];                                     // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0898(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x08A8(0x0018)()
	int32                                         K2Node_Select_Default_12;                          // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x08C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventLeaderboardAvailable_ReturnValue_2; // 0x08C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_777D[0x2];                                     // 0x08C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_13;                          // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_777E[0x7];                                     // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEventId_ReturnValue_1;                 // 0x08D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_6;             // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_3;               // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_7;             // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_777F[0x3];                                     // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_8;             // 0x090C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_4;               // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_9;             // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7780[0x3];                                     // 0x0919(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_4;                 // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7781[0x4];                                     // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0930(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7782[0x4];                                     // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0940(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_14;                          // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7783[0x3];                                     // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_15;                          // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7784[0x4];                                     // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_10;             // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails) == 0x000008, "Wrong alignment on TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails");
static_assert(sizeof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails) == 0x000968, "Wrong size on TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, EntryPoint) == 0x000000, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, CallFunc_GetTournamentId_ReturnValue) == 0x000008, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable) == 0x000018, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable) == 0x00001C, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable) == 0x000020, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_1) == 0x000038, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_2) == 0x000050, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_3) == 0x000068, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_1) == 0x000080, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_4) == 0x000088, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_5) == 0x0000A0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_6) == 0x0000B8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_7) == 0x0000D0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_2) == 0x0000E8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_8) == 0x0000F0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_9) == 0x000108, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_10) == 0x000120, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_11) == 0x000138, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_3) == 0x000150, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_12) == 0x000158, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_13) == 0x000170, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_14) == 0x000188, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_15) == 0x0001A0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_bool_Variable) == 0x0001B8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_4) == 0x0001B9, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_5) == 0x0001BA, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_bool_Variable_1) == 0x0001BB, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_16) == 0x0001C0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_bool_Variable_2) == 0x0001D8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_6) == 0x0001D9, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_7) == 0x0001DA, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_1) == 0x0001DC, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_2) == 0x0001E0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_3) == 0x0001E4, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_4) == 0x0001E8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_5) == 0x0001EC, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_6) == 0x0001F0, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_7) == 0x0001F4, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_8) == 0x0001F8, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_9) == 0x0001FC, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_int_Variable_10) == 0x000200, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_float_Variable) == 0x000204, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_byte_Variable_8) == 0x000208, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails, Temp_text_Variable_17) == 0x000210, "Member 'TournamentEventWindowDetails_C_ExecuteUbergraph_TournamentEventWindowDetails::Temp_text_Variable_17' has a wrong offset!");
