#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TournamentDetails.TournamentDetails_C.CreateScoringWidgets
// 0x0098 (0x0098 - 0x0000)
struct TournamentDetails_C_CreateScoringWidgets final
{
public:
	class FString                                 TournamentSeriesId;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TournamentId;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFortShowdownScoringRuleInfo>   CallFunc_FindTournamentScoringRules_ReturnValue;   // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortShowdownScoringRuleInfo           CallFunc_Array_Get_Item;                           // 0x0038(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76D9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76DA[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76DB[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownTournamentDetailsScoringRule_C* CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76DC[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76DD[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_CreateScoringWidgets) == 0x000008, "Wrong alignment on TournamentDetails_C_CreateScoringWidgets");
static_assert(sizeof(TournamentDetails_C_CreateScoringWidgets) == 0x000098, "Wrong size on TournamentDetails_C_CreateScoringWidgets");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, TournamentSeriesId) == 0x000000, "Member 'TournamentDetails_C_CreateScoringWidgets::TournamentSeriesId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, TournamentId) == 0x000010, "Member 'TournamentDetails_C_CreateScoringWidgets::TournamentId' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_FindTournamentScoringRules_ReturnValue) == 0x000020, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_FindTournamentScoringRules_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Array_Index_Variable) == 0x000030, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Get_Item) == 0x000038, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Divide_IntInt_ReturnValue) == 0x000058, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00005C, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_Create_ReturnValue) == 0x000070, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_bool_Variable) == 0x000078, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, K2Node_Select_Default) == 0x00007C, "Member 'TournamentDetails_C_CreateScoringWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000080, "Member 'TournamentDetails_C_CreateScoringWidgets::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Variable) == 0x000088, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_int_Variable_1) == 0x00008C, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, Temp_bool_Variable_1) == 0x000090, "Member 'TournamentDetails_C_CreateScoringWidgets::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_CreateScoringWidgets, K2Node_Select_Default_1) == 0x000094, "Member 'TournamentDetails_C_CreateScoringWidgets::K2Node_Select_Default_1' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.OnHandleBack
// 0x0002 (0x0002 - 0x0000)
struct TournamentDetails_C_OnHandleBack final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Handle_Back_Passthrough;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TournamentDetails_C_OnHandleBack) == 0x000001, "Wrong alignment on TournamentDetails_C_OnHandleBack");
static_assert(sizeof(TournamentDetails_C_OnHandleBack) == 0x000002, "Wrong size on TournamentDetails_C_OnHandleBack");
static_assert(offsetof(TournamentDetails_C_OnHandleBack, bResult) == 0x000000, "Member 'TournamentDetails_C_OnHandleBack::bResult' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_OnHandleBack, CallFunc_Handle_Back_Passthrough) == 0x000001, "Member 'TournamentDetails_C_OnHandleBack::CallFunc_Handle_Back_Passthrough' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.RefreshViolators
// 0x00C0 (0x00C0 - 0x0000)
struct TournamentDetails_C_RefreshViolators final
{
public:
	class UShowdownEventTile_C*                   FocusedEvent;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumEventRounds_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76DE[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWindowRoundDisplayString_ReturnValue;  // 0x0010(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0028(0x0018)()
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNullItem_Is_Null_Item_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76DF[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0068(0x0018)()
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E0[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76E1[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76E2[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile_1;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E3[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue_1;  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TournamentDetails_C_RefreshViolators) == 0x000008, "Wrong alignment on TournamentDetails_C_RefreshViolators");
static_assert(sizeof(TournamentDetails_C_RefreshViolators) == 0x0000C0, "Wrong size on TournamentDetails_C_RefreshViolators");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, FocusedEvent) == 0x000000, "Member 'TournamentDetails_C_RefreshViolators::FocusedEvent' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetNumEventRounds_ReturnValue) == 0x000008, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetNumEventRounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetWindowRoundDisplayString_ReturnValue) == 0x000010, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetWindowRoundDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_TextToUpper_ReturnValue) == 0x000028, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetEventWindowRoundNumber_ReturnValue) == 0x000040, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetEventWindowRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_IsNullItem_Is_Null_Item) == 0x000044, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_IsNullItem_Is_Null_Item' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_IsNullItem_Is_Null_Item_1) == 0x000045, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_IsNullItem_Is_Null_Item_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_BooleanOR_ReturnValue) == 0x000046, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_Not_PreBool_ReturnValue) == 0x000047, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_TextToUpper_ReturnValue_1) == 0x000068, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, K2Node_DynamicCast_AsShowdown_Event_Tile) == 0x000080, "Member 'TournamentDetails_C_RefreshViolators::K2Node_DynamicCast_AsShowdown_Event_Tile' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'TournamentDetails_C_RefreshViolators::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, Temp_int_Variable) == 0x00008C, "Member 'TournamentDetails_C_RefreshViolators::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetChildAt_ReturnValue) == 0x000098, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetChildrenCount_ReturnValue) == 0x0000A0, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, K2Node_DynamicCast_AsShowdown_Event_Tile_1) == 0x0000A8, "Member 'TournamentDetails_C_RefreshViolators::K2Node_DynamicCast_AsShowdown_Event_Tile_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'TournamentDetails_C_RefreshViolators::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000B1, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_GetEventWindowRoundNumber_ReturnValue_1) == 0x0000B4, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_GetEventWindowRoundNumber_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshViolators, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'TournamentDetails_C_RefreshViolators::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.Handle_Back
// 0x000C (0x000C - 0x0000)
struct TournamentDetails_C_Handle_Back final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TournamentDetails_C_Handle_Back) == 0x000004, "Wrong alignment on TournamentDetails_C_Handle_Back");
static_assert(sizeof(TournamentDetails_C_Handle_Back) == 0x00000C, "Wrong size on TournamentDetails_C_Handle_Back");
static_assert(offsetof(TournamentDetails_C_Handle_Back, PassThrough) == 0x000000, "Member 'TournamentDetails_C_Handle_Back::PassThrough' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_Handle_Back, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'TournamentDetails_C_Handle_Back::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_Handle_Back, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'TournamentDetails_C_Handle_Back::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_Handle_Back, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'TournamentDetails_C_Handle_Back::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_Handle_Back, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00000A, "Member 'TournamentDetails_C_Handle_Back::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.RefreshDetailsPanel
// 0x0180 (0x0180 - 0x0000)
struct TournamentDetails_C_RefreshDetailsPanel final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULeaderboardListViewWrapper_C*          K2Node_DynamicCast_AsLeaderboard_List_View_Wrapper; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E5[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEventsSimpleButton_C*>          K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76E6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76E7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76E8[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E9[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76EA[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76EB[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76EC[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
	float                                         CallFunc_BreakColor_R;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_H;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_S;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_V;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RGBToHSV_A;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76ED[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0120(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0148(0x0028)()
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TournamentDetails_C_RefreshDetailsPanel) == 0x000008, "Wrong alignment on TournamentDetails_C_RefreshDetailsPanel");
static_assert(sizeof(TournamentDetails_C_RefreshDetailsPanel) == 0x000180, "Wrong size on TournamentDetails_C_RefreshDetailsPanel");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetEffectMaterial_ReturnValue) == 0x000000, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_DynamicCast_AsLeaderboard_List_View_Wrapper) == 0x000008, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_DynamicCast_AsLeaderboard_List_View_Wrapper' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, Temp_int_Array_Index_Variable) == 0x000014, "Member 'TournamentDetails_C_RefreshDetailsPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_MakeArray_Array) == 0x000018, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Array_Get_Item) == 0x000028, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000038, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, Temp_byte_Variable) == 0x000048, "Member 'TournamentDetails_C_RefreshDetailsPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetEffectMaterial_ReturnValue_1) == 0x000050, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetEffectMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, Temp_byte_Variable_1) == 0x000058, "Member 'TournamentDetails_C_RefreshDetailsPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'TournamentDetails_C_RefreshDetailsPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, Temp_bool_Variable) == 0x000070, "Member 'TournamentDetails_C_RefreshDetailsPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_TextToUpper_ReturnValue) == 0x0000B0, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_Select_Default) == 0x0000C8, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_BreakColor_R) == 0x0000E8, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_BreakColor_G) == 0x0000EC, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_BreakColor_B) == 0x0000F0, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_BreakColor_A) == 0x0000F4, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_MakeColor_ReturnValue) == 0x0000F8, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_RGBToHSV_H) == 0x000108, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_RGBToHSV_H' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_RGBToHSV_S) == 0x00010C, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_RGBToHSV_S' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_RGBToHSV_V) == 0x000110, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_RGBToHSV_V' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_RGBToHSV_A) == 0x000114, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_RGBToHSV_A' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_Less_FloatFloat_ReturnValue) == 0x000118, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_MakeStruct_SlateColor) == 0x000120, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, K2Node_MakeStruct_SlateColor_1) == 0x000148, "Member 'TournamentDetails_C_RefreshDetailsPanel::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshDetailsPanel, CallFunc_GetTournamentId_ReturnValue) == 0x000170, "Member 'TournamentDetails_C_RefreshDetailsPanel::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.RefreshOverviewPanel
// 0x03C0 (0x03C0 - 0x0000)
struct TournamentDetails_C_RefreshOverviewPanel final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76EE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	EFortShowdownMatchType                        Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76EF[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76F0[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x00D8(0x0018)()
	EFortShowdownEventState                       Temp_byte_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76F1[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x01A0(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x01B8(0x0018)()
	EFortShowdownEventState                       CallFunc_GetTournamentTimeState_ReturnValue;       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortShowdownMatchType                        CallFunc_GetTournamentMatchType_ReturnValue;       // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76F2[0x5];                                     // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x01D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01E8(0x0018)()
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0210(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0228(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0240(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0258(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x0270(0x0018)()
	struct FTimespan                              CallFunc_GetTournamentTimeLeft_ReturnValue;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEventTimespanAsText_ReturnValue;       // 0x0290(0x0018)()
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76F3[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76F4[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0308(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76F5[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0320(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0338(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0350(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0368(0x0018)()
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0390(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_3;                // 0x03A8(0x0018)()
};
static_assert(alignof(TournamentDetails_C_RefreshOverviewPanel) == 0x000008, "Wrong alignment on TournamentDetails_C_RefreshOverviewPanel");
static_assert(sizeof(TournamentDetails_C_RefreshOverviewPanel) == 0x0003C0, "Wrong size on TournamentDetails_C_RefreshOverviewPanel");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable) == 0x000000, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_1) == 0x000018, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_bool_Variable) == 0x000030, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_2) == 0x000038, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_3) == 0x000050, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_byte_Variable) == 0x000068, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_4) == 0x000070, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_5) == 0x000088, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_6) == 0x0000A0, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_7) == 0x0000B8, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_bool_Variable_1) == 0x0000D0, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_8) == 0x0000D8, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_byte_Variable_1) == 0x0000F0, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_9) == 0x0000F8, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_10) == 0x000110, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_11) == 0x000128, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_12) == 0x000140, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_13) == 0x000158, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_14) == 0x000170, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_15) == 0x000188, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_16) == 0x0001A0, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_text_Variable_17) == 0x0001B8, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_GetTournamentTimeState_ReturnValue) == 0x0001D0, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_GetTournamentTimeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, Temp_bool_Variable_2) == 0x0001D1, "Member 'TournamentDetails_C_RefreshOverviewPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_GetTournamentMatchType_ReturnValue) == 0x0001D2, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_GetTournamentMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_ParseIntoArray_ReturnValue) == 0x0001D8, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_Select_Default) == 0x0001E8, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_JoinStringArray_ReturnValue) == 0x000200, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_TextToUpper_ReturnValue) == 0x000210, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x000228, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000240, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_TextToUpper_ReturnValue_1) == 0x000258, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_TextToUpper_ReturnValue_2) == 0x000270, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_TextToUpper_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_GetTournamentTimeLeft_ReturnValue) == 0x000288, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_GetTournamentTimeLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_GetEventTimespanAsText_ReturnValue) == 0x000290, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_GetEventTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_BreakTimespan_Days) == 0x0002A8, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_BreakTimespan_Hours) == 0x0002AC, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_BreakTimespan_Minutes) == 0x0002B0, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_BreakTimespan_Seconds) == 0x0002B4, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_BreakTimespan_Milliseconds) == 0x0002B8, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_MakeStruct_FormatArgumentData) == 0x0002C0, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000300, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_MakeArray_Array) == 0x000308, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000318, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_Select_Default_1) == 0x000320, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_Select_Default_2) == 0x000338, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_Select_Default_3) == 0x000350, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, K2Node_Select_Default_4) == 0x000368, "Member 'TournamentDetails_C_RefreshOverviewPanel::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_GetTournamentId_ReturnValue) == 0x000380, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_Format_ReturnValue) == 0x000390, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TournamentDetails_C_RefreshOverviewPanel, CallFunc_TextToUpper_ReturnValue_3) == 0x0003A8, "Member 'TournamentDetails_C_RefreshOverviewPanel::CallFunc_TextToUpper_ReturnValue_3' has a wrong offset!");

// Function TournamentDetails.TournamentDetails_C.RefreshScoringRules
// 0x0020 (0x0020 - 0x0000)
struct TournamentDetails_C_RefreshScoringRules final
{
public:
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
