#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transylvania_FireLight_Master

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Curie_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.ExecuteUbergraph_Transylvania_FireLight_Master
// 0x0368 (0x0368 - 0x0000)
struct Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D6[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0018(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0044(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00E0(0x0018)()
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D7[0x1];                                     // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue_1;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D8[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0108(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D9[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74DA[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0140(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_74DB[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74DC[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74DD[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0210(0x0020)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue;     // 0x0234(0x0004)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74DE[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0250(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74DF[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_ExecuteBeginFireInteract_ReturnValue_1;   // 0x02E0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74E0[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x02F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x02F8(0x0020)(ConstParm)
	bool                                          CallFunc_IsCurieActive_ReturnValue_2;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74E1[0x2];                                     // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value;                           // 0x031C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue;       // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74E2[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0328(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74E3[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractHandle                   CallFunc_Map_Find_Value_1;                         // 0x0348(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteEndFireInteract_ReturnValue_1;     // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74E4[0x2];                                     // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsCurieActive_ReturnValue_3;              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master) == 0x000008, "Wrong alignment on Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master");
static_assert(sizeof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master) == 0x000368, "Wrong size on Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, EntryPoint) == 0x000000, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_Damage) == 0x000014, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_DamageTags) == 0x000018, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_Momentum) == 0x000038, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_HitInfo) == 0x000044, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_InstigatedBy) == 0x0000D0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_DamageCauser) == 0x0000D8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_Event_EffectContext) == 0x0000E0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_IsCurieActive_ReturnValue) == 0x0000F8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Not_PreBool_ReturnValue) == 0x0000F9, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_HasAuthority_ReturnValue_2) == 0x0000FA, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_int_Loop_Counter_Variable_1) == 0x0000FC, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Add_IntInt_ReturnValue_1) == 0x000100, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_IsCurieActive_ReturnValue_1) == 0x000104, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_IsCurieActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000108, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000120, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000128, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000130, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000138, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_bFromSweep) == 0x00013C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_SweepResult) == 0x000140, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001D0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x0001D8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x0001E0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001E8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0001F0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_object_Variable) == 0x0001F8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_object_Variable_1) == 0x000208, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_struct_Variable) == 0x000210, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, Temp_int_Array_Index_Variable_1) == 0x000230, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_ExecuteBeginFireInteract_ReturnValue) == 0x000234, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_ExecuteBeginFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Array_Get_Item) == 0x000238, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000240, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Contains_ReturnValue) == 0x00024C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_MakeHitResult_ReturnValue) == 0x000250, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002DC, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_ExecuteBeginFireInteract_ReturnValue_1) == 0x0002E0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_ExecuteBeginFireInteract_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_CustomEvent_GameState) == 0x0002E8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_CustomEvent_Playlist) == 0x0002F0, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_CustomEvent_PlaylistContextTags) == 0x0002F8, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_IsCurieActive_ReturnValue_2) == 0x000318, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_IsCurieActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Contains_ReturnValue_1) == 0x000319, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Find_Value) == 0x00031C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Find_ReturnValue) == 0x000320, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Not_PreBool_ReturnValue_2) == 0x000321, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_ExecuteEndFireInteract_ReturnValue) == 0x000322, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_ExecuteEndFireInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Remove_ReturnValue) == 0x000323, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Keys_Keys) == 0x000328, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Array_Get_Item_1) == 0x000338, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Array_Length_ReturnValue_1) == 0x000340, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Less_IntInt_ReturnValue_1) == 0x000344, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Find_Value_1) == 0x000348, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_Map_Find_ReturnValue_1) == 0x00034C, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_ExecuteEndFireInteract_ReturnValue_1) == 0x00034D, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_ExecuteEndFireInteract_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000350, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master, CallFunc_IsCurieActive_ReturnValue_3) == 0x000360, "Member 'Transylvania_FireLight_Master_C_ExecuteUbergraph_Transylvania_FireLight_Master::CallFunc_IsCurieActive_ReturnValue_3' has a wrong offset!");

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74E5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Transylvania_FireLight_Master_C_BndEvt__Fire_CollisionVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Transylvania_FireLight_Master_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74E6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Transylvania_FireLight_Master_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Transylvania_FireLight_Master_C_OnDeathPlayEffects");
static_assert(sizeof(Transylvania_FireLight_Master_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Transylvania_FireLight_Master_C_OnDeathPlayEffects");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Transylvania_FireLight_Master_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.OnReady_F28DABB3426DBD6BC5FECD8F7077AF93
// 0x0030 (0x0030 - 0x0000)
struct Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93) == 0x000008, "Wrong alignment on Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93");
static_assert(sizeof(Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93) == 0x000030, "Wrong size on Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, GameState) == 0x000000, "Member 'Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::GameState' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, Playlist) == 0x000008, "Member 'Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::Playlist' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93, PlaylistContextTags) == 0x000010, "Member 'Transylvania_FireLight_Master_C_OnReady_F28DABB3426DBD6BC5FECD8F7077AF93::PlaylistContextTags' has a wrong offset!");

// Function Transylvania_FireLight_Master.Transylvania_FireLight_Master_C.ShouldPlayNativeCurieFX
// 0x001C (0x001C - 0x0000)
struct Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX final
{
public:
	EFortCurieNativeFXType                        FXType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74E7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortNativeCurieFXResponse             OutResponse;                                       // 0x0004(0x000C)(Parm, OutParm, NoDestructor)
	struct FFortNativeCurieFXResponse             K2Node_MakeStruct_FortNativeCurieFXResponse;       // 0x0010(0x000C)(NoDestructor)
};
static_assert(alignof(Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX) == 0x000004, "Wrong alignment on Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX");
static_assert(sizeof(Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX) == 0x00001C, "Wrong size on Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX");
static_assert(offsetof(Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX, FXType) == 0x000000, "Member 'Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX::FXType' has a wrong offset!");
static_assert(offsetof(Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX, OutResponse) == 0x000004, "Member 'Transylvania_FireLight_Master_C_ShouldPlayNativeCurieFX::OutResponse' has a wrong offset!");
