#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Player_Campfire

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.ExecuteUbergraph_Trap_Floor_Player_Campfire
// 0x08B0 (0x08B0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5241[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5242[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0170(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x02F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0370(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5243[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5244[0x4];                                     // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType_1;               // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5245[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters_1;              // 0x0468(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5246[0x6];                                     // 0x0522(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0528(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5247[0x2];                                     // 0x05E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_Event_Pawn;                                 // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5248[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5249[0x4];                                     // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524A[0x3];                                     // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0644(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524B[0x4];                                     // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0678(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x06A4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0740(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0758(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524C[0x4];                                     // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_1;                          // 0x0768(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524D[0x3];                                     // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0780(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x07A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x07AC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0848(0x0018)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0860(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524E[0x4];                                     // 0x086C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0870(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetCampFireTrapInstigator_ReturnValue;    // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x0008B0, "Wrong size on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, EntryPoint) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000A0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000120, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_X) == 0x00012C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Y) == 0x000130, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Z) == 0x000134, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000138, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00013C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue) == 0x000140, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue_1) == 0x00014C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000158, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000164, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_2) == 0x000170, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_5) == 0x0002F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_6) == 0x000370, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeArray_Array) == 0x0003F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_HasAuthority_ReturnValue) == 0x000400, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000404, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000410, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00041C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000428, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000434, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000440, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000448, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000458, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType_1) == 0x000460, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters_1) == 0x000468, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum_CmpSuccess) == 0x000520, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType) == 0x000521, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters) == 0x000528, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum_CmpSuccess_1) == 0x0005E0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue) == 0x0005E1, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0005E4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0005F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0005F8, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, Temp_float_Variable) == 0x000604, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Pawn) == 0x000608, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000610, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue_1) == 0x000611, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue) == 0x000614, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_FTrunc_ReturnValue) == 0x000618, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00061C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000620, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000628, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Lerp_ReturnValue) == 0x000630, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue_2) == 0x000634, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetCameraLocation_ReturnValue) == 0x000638, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_VLerp_ReturnValue) == 0x000644, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000650, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_VSize_ReturnValue) == 0x00065C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000660, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000664, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000668, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00066C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Damage_1) == 0x000670, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageTags_1) == 0x000678, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Momentum_1) == 0x000698, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_HitInfo_1) == 0x0006A4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_InstigatedBy_1) == 0x000730, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageCauser_1) == 0x000738, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_EffectContext_1) == 0x000740, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000758, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeArray_Array_1) == 0x000768, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetActorTeam_ReturnValue) == 0x000778, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Damage) == 0x00077C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageTags) == 0x000780, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Momentum) == 0x0007A0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_HitInfo) == 0x0007AC, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_InstigatedBy) == 0x000838, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageCauser) == 0x000840, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_EffectContext) == 0x000848, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000860, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000870, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetCampFireTrapInstigator_ReturnValue) == 0x0008A0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetCampFireTrapInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x0008A8, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct Trap_Floor_Player_Campfire_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_OnDeathServer) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_OnDeathServer");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_OnDeathServer) == 0x0000E8, "Wrong size on Trap_Floor_Player_Campfire_C_OnDeathServer");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, Damage) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, Momentum) == 0x000028, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, HitInfo) == 0x000034, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Trap_Floor_Player_Campfire_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5250[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_OnDeathPlayEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Trap_Floor_Player_Campfire_C_OnDeathPlayEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.TriggerLaunchEffects
// 0x0008 (0x0008 - 0x0000)
struct Trap_Floor_Player_Campfire_C_TriggerLaunchEffects final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong size on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects, Pawn) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_TriggerLaunchEffects::Pawn' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5251[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5252[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.HealTicks
// 0x0160 (0x0160 - 0x0000)
struct Trap_Floor_Player_Campfire_C_HealTicks final
{
public:
	class AFortPlayerState*                       CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5253[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5254[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	uint8                                         Pad_5255[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5256[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5257[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5258[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5259[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525A[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525B[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue_1;  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525C[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_HealTicks");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000160, "Wrong size on Trap_Floor_Player_Campfire_C_HealTicks");
