#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Athena_Spikes

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.ExecuteUbergraph_Trap_Athena_Spikes
// 0x0850 (0x0850 - 0x0000)
struct Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F58[0xA];                                     // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0160(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F59[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x02F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0370(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5A[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPortableSoftParticles             K2Node_MakeStruct_FortPortableSoftParticles;       // 0x0408(0x0058)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5B[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FParameterNameMapping> K2Node_MakeMap_Map;                                // 0x0468(0x0050)(ConstParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5C[0x5];                                     // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset;               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5D[0x5];                                     // 0x04DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Temp_object_Variable_1;                            // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPortableSoftParticles             K2Node_MakeStruct_FortPortableSoftParticles_1;     // 0x04E8(0x0058)()
	bool                                          Temp_bool_Variable_1;                              // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5E[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset_1;             // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5F[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         K2Node_Select_Default;                             // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F60[0x3];                                     // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F61[0x6];                                     // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPortableSoftParticles             K2Node_Select_Default_1;                           // 0x0580(0x0058)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x05D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FFortPortableSoftParticles             K2Node_SetFieldsInStruct_StructOut;                // 0x05E8(0x0058)()
	bool                                          CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue; // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F62[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_Select_Default_2;                           // 0x0648(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0670(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F63[0x3];                                     // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0694(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x06A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F64[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x06D8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F65[0x3];                                     // 0x0791(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0798(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F66[0x7];                                     // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x07B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F67[0x6];                                     // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              CallFunc_MapParticleInstanceParamNames_ReturnValue; // 0x07C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x07D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x07E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x07F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_1;                          // 0x0800(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1; // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F68[0x2];                                     // 0x0812(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0814(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0820(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_Select_Default_3;                           // 0x0828(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes) == 0x000010, "Wrong alignment on Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes");
static_assert(sizeof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes) == 0x000850, "Wrong size on Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, EntryPoint) == 0x000000, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Option_B___If_false__use_Option_A_Variable) == 0x000004, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Option_B___If_false__use_Option_A_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_BreakVector_X) == 0x000090, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_BreakVector_Y) == 0x000094, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_BreakVector_Z) == 0x000098, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00009C, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_MakeVector_ReturnValue_1) == 0x0000BC, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000D4, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000E0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_2) == 0x000160, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001E0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000260, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_5) == 0x0002F0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_ParticleSysParam_6) == 0x000370, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeArray_Array) == 0x0003F0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Has_Been_Initd_Variable) == 0x000400, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_FortPortableSoftParticles) == 0x000408, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_FortPortableSoftParticles' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000460, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeMap_Map) == 0x000468, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_IsClosed_Variable) == 0x0004B8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValid_ReturnValue) == 0x0004B9, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Not_PreBool_ReturnValue) == 0x0004BA, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_object_Variable) == 0x0004C0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_CustomEvent_Loaded) == 0x0004C8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_DynamicCast_AsFXSystem_Asset) == 0x0004D0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_DynamicCast_AsFXSystem_Asset' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_DynamicCast_bSuccess) == 0x0004D8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Variable) == 0x0004D9, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_MakeLiteralByte_ReturnValue) == 0x0004DA, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_object_Variable_1) == 0x0004E0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeStruct_FortPortableSoftParticles_1) == 0x0004E8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeStruct_FortPortableSoftParticles_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Variable_1) == 0x000540, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000541, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000542, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_BooleanOR_ReturnValue) == 0x000543, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_object_Variable_2) == 0x000548, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_CustomEvent_Loaded_1) == 0x000550, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_DynamicCast_AsFXSystem_Asset_1) == 0x000558, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_DynamicCast_AsFXSystem_Asset_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_DynamicCast_bSuccess_1) == 0x000560, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_Select_Default) == 0x000568, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Variable_2) == 0x000570, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_float_Variable) == 0x000574, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000578, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, Temp_bool_Variable_3) == 0x000579, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_Select_Default_1) == 0x000580, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_CreateDelegate_OutputDelegate) == 0x0005D8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_SetFieldsInStruct_StructOut) == 0x0005E8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue) == 0x000640, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_Select_Default_2) == 0x000648, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000670, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00067C, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000688, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValid_ReturnValue_1) == 0x000690, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_GetCameraLocation_ReturnValue) == 0x000694, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0006A0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0006AC, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0006B8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0006C4, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_GameplayCueEvent_EventType) == 0x0006D0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_GameplayCueEvent_Parameters) == 0x0006D8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_SwitchEnum_CmpSuccess) == 0x000790, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Lerp_ReturnValue) == 0x000794, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_CreateDelegate_OutputDelegate_1) == 0x000798, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Lerp_ReturnValue_1) == 0x0007A8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Lerp_ReturnValue_2) == 0x0007AC, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValid_ReturnValue_2) == 0x0007B0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x0007B8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValid_ReturnValue_3) == 0x0007C0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsValid_ReturnValue_4) == 0x0007C1, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_MapParticleInstanceParamNames_ReturnValue) == 0x0007C8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_MapParticleInstanceParamNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0007D8, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0007E4, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_VSize_ReturnValue) == 0x0007F0, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0007F4, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_MakeArray_Array_1) == 0x000800, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_GetActorTeam_ReturnValue) == 0x000810, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1) == 0x000811, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000814, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000820, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes, K2Node_Select_Default_3) == 0x000828, "Member 'Trap_Athena_Spikes_C_ExecuteUbergraph_Trap_Athena_Spikes::K2Node_Select_Default_3' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F69[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Athena_Spikes_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D
// 0x0008 (0x0008 - 0x0000)
struct Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D) == 0x000008, "Wrong alignment on Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D");
static_assert(sizeof(Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D) == 0x000008, "Wrong size on Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D");
static_assert(offsetof(Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D, Loaded) == 0x000000, "Member 'Trap_Athena_Spikes_C_OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D::Loaded' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1
// 0x0008 (0x0008 - 0x0000)
struct Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1) == 0x000008, "Wrong alignment on Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1");
static_assert(sizeof(Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1) == 0x000008, "Wrong size on Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1");
static_assert(offsetof(Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1, Loaded) == 0x000000, "Member 'Trap_Athena_Spikes_C_OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1::Loaded' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Trap_Athena_Spikes_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_UserConstructionScript) == 0x000008, "Wrong alignment on Trap_Athena_Spikes_C_UserConstructionScript");
static_assert(sizeof(Trap_Athena_Spikes_C_UserConstructionScript) == 0x000008, "Wrong size on Trap_Athena_Spikes_C_UserConstructionScript");
static_assert(offsetof(Trap_Athena_Spikes_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Trap_Athena_Spikes_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.SetSpikePosition
// 0x0010 (0x0010 - 0x0000)
struct Trap_Athena_Spikes_C_SetSpikePosition final
{
public:
	float                                         NewSpikePosition;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_SetSpikePosition) == 0x000004, "Wrong alignment on Trap_Athena_Spikes_C_SetSpikePosition");
static_assert(sizeof(Trap_Athena_Spikes_C_SetSpikePosition) == 0x000010, "Wrong size on Trap_Athena_Spikes_C_SetSpikePosition");
static_assert(offsetof(Trap_Athena_Spikes_C_SetSpikePosition, NewSpikePosition) == 0x000000, "Member 'Trap_Athena_Spikes_C_SetSpikePosition::NewSpikePosition' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_SetSpikePosition, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Trap_Athena_Spikes_C_SetSpikePosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C.MaterialSweepOnSpikes
// 0x0024 (0x0024 - 0x0000)
struct Trap_Athena_Spikes_C_MaterialSweepOnSpikes final
{
public:
	float                                         Param_SweepSpeed;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Param_SweepColor;                                  // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_SweepExponent;                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes) == 0x000004, "Wrong alignment on Trap_Athena_Spikes_C_MaterialSweepOnSpikes");
static_assert(sizeof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes) == 0x000024, "Wrong size on Trap_Athena_Spikes_C_MaterialSweepOnSpikes");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, Param_SweepSpeed) == 0x000000, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::Param_SweepSpeed' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, Param_SweepColor) == 0x000004, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::Param_SweepColor' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, Param_SweepExponent) == 0x000014, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::Param_SweepExponent' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, Temp_float_Variable) == 0x000018, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C_MaterialSweepOnSpikes, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'Trap_Athena_Spikes_C_MaterialSweepOnSpikes::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function Trap_Athena_Spikes.Trap_Athena_Spikes_C. ChangeToFriendlyMaterial
// 0x0030 (0x0030 - 0x0000)
struct Trap_Athena_Spikes_C__ChangeToFriendlyMaterial final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F6A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F6B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Athena_Spikes_C__ChangeToFriendlyMaterial) == 0x000008, "Wrong alignment on Trap_Athena_Spikes_C__ChangeToFriendlyMaterial");
static_assert(sizeof(Trap_Athena_Spikes_C__ChangeToFriendlyMaterial) == 0x000030, "Wrong size on Trap_Athena_Spikes_C__ChangeToFriendlyMaterial");
static_assert(offsetof(Trap_Athena_Spikes_C__ChangeToFriendlyMaterial, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'Trap_Athena_Spikes_C__ChangeToFriendlyMaterial::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Athena_Spikes_C__ChangeToFriendlyMaterial, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000008, "Member 'Trap_Athena_Spikes_C__ChangeToFriendlyMaterial::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
