#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tree_Palm_C

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Tree_Palm_C.Tree_Palm_C_C.ExecuteUbergraph_Tree_Palm_C
// 0x00A8 (0x00A8 - 0x0000)
struct Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0018(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C) == 0x000008, "Wrong alignment on Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C");
static_assert(sizeof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C) == 0x0000A8, "Wrong size on Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C");
static_assert(offsetof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C, EntryPoint) == 0x000000, "Member 'Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000018, "Member 'Tree_Palm_C_C_ExecuteUbergraph_Tree_Palm_C::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");

}

