#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Background_Strings

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Background_Strings.UI_Background_Strings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Background_Strings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Background_Strings_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Background_Strings_C_PreConstruct");
static_assert(sizeof(UI_Background_Strings_C_PreConstruct) == 0x000001, "Wrong size on UI_Background_Strings_C_PreConstruct");
static_assert(offsetof(UI_Background_Strings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Background_Strings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Background_Strings.UI_Background_Strings_C.ExecuteUbergraph_UI_Background_Strings
// 0x001C (0x001C - 0x0000)
struct UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CC9[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings) == 0x000004, "Wrong alignment on UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings");
static_assert(sizeof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings) == 0x00001C, "Wrong size on UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, EntryPoint) == 0x000000, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, Temp_int_Variable) == 0x000004, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, Temp_int_Variable_1) == 0x000008, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, Temp_int_Variable_2) == 0x00000C, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, K2Node_Event_IsDesignTime) == 0x000010, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, Temp_int_Variable_3) == 0x000014, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings, K2Node_Select_Default) == 0x000018, "Member 'UI_Background_Strings_C_ExecuteUbergraph_UI_Background_Strings::K2Node_Select_Default' has a wrong offset!");

}

