#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Background_Strings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Background_Strings.UI_Background_Strings_C
// 0x0038 (0x0268 - 0x0230)
class UUI_Background_Strings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CustomString;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   DefaultString;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TextPropertiesSwitcher;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           StringArray;                                       // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Index_UI_Background_Strings_C;                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_UI_Background_Strings(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Background_Strings_C">();
	}
	static class UUI_Background_Strings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Background_Strings_C>();
	}
};
static_assert(alignof(UUI_Background_Strings_C) == 0x000008, "Wrong alignment on UUI_Background_Strings_C");
static_assert(sizeof(UUI_Background_Strings_C) == 0x000268, "Wrong size on UUI_Background_Strings_C");
static_assert(offsetof(UUI_Background_Strings_C, UberGraphFrame) == 0x000230, "Member 'UUI_Background_Strings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, CustomString) == 0x000238, "Member 'UUI_Background_Strings_C::CustomString' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, DefaultString) == 0x000240, "Member 'UUI_Background_Strings_C::DefaultString' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, TextPropertiesSwitcher) == 0x000248, "Member 'UUI_Background_Strings_C::TextPropertiesSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, StringArray) == 0x000250, "Member 'UUI_Background_Strings_C::StringArray' has a wrong offset!");
static_assert(offsetof(UUI_Background_Strings_C, Index_UI_Background_Strings_C) == 0x000260, "Member 'UUI_Background_Strings_C::Index_UI_Background_Strings_C' has a wrong offset!");

}

