#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ScannerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ScannerScreen.UI_ScannerScreen_C
// 0x0050 (0x0280 - 0x0230)
class UUI_ScannerScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FlashText;                                         // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_States;                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_100;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ScreenBorder;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BGIdle;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Failure;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Misc;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Success;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_ScannerScreen(int32 EntryPoint);
	void EventTargetLost(const class FText& ScreenText);
	void EventScanning();
	void EventSuccess(const class FText& ScreenText);
	void EventFail(const class FText& ScreenText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ScannerScreen_C">();
	}
	static class UUI_ScannerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ScannerScreen_C>();
	}
};
static_assert(alignof(UUI_ScannerScreen_C) == 0x000008, "Wrong alignment on UUI_ScannerScreen_C");
static_assert(sizeof(UUI_ScannerScreen_C) == 0x000280, "Wrong size on UUI_ScannerScreen_C");
static_assert(offsetof(UUI_ScannerScreen_C, UberGraphFrame) == 0x000230, "Member 'UUI_ScannerScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, FlashText) == 0x000238, "Member 'UUI_ScannerScreen_C::FlashText' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, CommonWidgetSwitcher_States) == 0x000240, "Member 'UUI_ScannerScreen_C::CommonWidgetSwitcher_States' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Image) == 0x000248, "Member 'UUI_ScannerScreen_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Image_100) == 0x000250, "Member 'UUI_ScannerScreen_C::Image_100' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Image_ScreenBorder) == 0x000258, "Member 'UUI_ScannerScreen_C::Image_ScreenBorder' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Overlay_BGIdle) == 0x000260, "Member 'UUI_ScannerScreen_C::Overlay_BGIdle' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Text_Failure) == 0x000268, "Member 'UUI_ScannerScreen_C::Text_Failure' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Text_Misc) == 0x000270, "Member 'UUI_ScannerScreen_C::Text_Misc' has a wrong offset!");
static_assert(offsetof(UUI_ScannerScreen_C, Text_Success) == 0x000278, "Member 'UUI_ScannerScreen_C::Text_Success' has a wrong offset!");

}

