#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserListEntry_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserListEntry_XS.UserListEntry_XS_C
// 0x0120 (0x0D00 - 0x0BE0)
class UUserListEntry_XS_C final : public UFortSocialUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0BF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x0C18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x0C28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           bLocked;                                           // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UserNameOnline;                                    // 0x0C58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UserNameOfflineAway;                               // 0x0C80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UserNameBlocked;                                   // 0x0CA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPlatOnlyFriend;                                  // 0x0CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4855[0x3];                                     // 0x0CD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0CD4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0CE4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 NickNameOnline;                                    // 0x0CF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 NickNameOffline;                                   // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UserListEntry_XS(int32 EntryPoint);
	void BP_OnHovered();
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserListEntry_XS_C">();
	}
	static class UUserListEntry_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserListEntry_XS_C>();
	}
};
static_assert(alignof(UUserListEntry_XS_C) == 0x000008, "Wrong alignment on UUserListEntry_XS_C");
static_assert(sizeof(UUserListEntry_XS_C) == 0x000D00, "Wrong size on UUserListEntry_XS_C");
static_assert(offsetof(UUserListEntry_XS_C, UberGraphFrame) == 0x000BE0, "Member 'UUserListEntry_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Selected) == 0x000BE8, "Member 'UUserListEntry_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Hovered) == 0x000BF0, "Member 'UUserListEntry_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Arrow) == 0x000BF8, "Member 'UUserListEntry_XS_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x000C00, "Member 'UUserListEntry_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Text_DisplayName) == 0x000C08, "Member 'UUserListEntry_XS_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, UserActionMenuInputButton) == 0x000C10, "Member 'UUserListEntry_XS_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Online) == 0x000C18, "Member 'UUserListEntry_XS_C::Online' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Offline) == 0x000C28, "Member 'UUserListEntry_XS_C::Offline' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, Away) == 0x000C38, "Member 'UUserListEntry_XS_C::Away' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, bLocked) == 0x000C48, "Member 'UUserListEntry_XS_C::bLocked' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, UserNameOnline) == 0x000C58, "Member 'UUserListEntry_XS_C::UserNameOnline' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, UserNameOfflineAway) == 0x000C80, "Member 'UUserListEntry_XS_C::UserNameOfflineAway' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, UserNameBlocked) == 0x000CA8, "Member 'UUserListEntry_XS_C::UserNameBlocked' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, IsPlatOnlyFriend) == 0x000CD0, "Member 'UUserListEntry_XS_C::IsPlatOnlyFriend' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, EncourageEpicFriend_IdleColor) == 0x000CD4, "Member 'UUserListEntry_XS_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, EncourageEpicFriend_HoveredColor) == 0x000CE4, "Member 'UUserListEntry_XS_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, NickNameOnline) == 0x000CF4, "Member 'UUserListEntry_XS_C::NickNameOnline' has a wrong offset!");
static_assert(offsetof(UUserListEntry_XS_C, NickNameOffline) == 0x000CF8, "Member 'UUserListEntry_XS_C::NickNameOffline' has a wrong offset!");

}

