#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Utility_Lawnmower_Fancy_02

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Utility_Lawnmower_Fancy_02.Utility_Lawnmower_Fancy_02_C
// 0x0030 (0x0BF0 - 0x0BC0)
class AUtility_Lawnmower_Fancy_02_C final : public ABuildingProp
{
public:
	class UStaticMeshComponent*                   MedPipe_03_90;                                     // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_apollo_fac_pipe_s_128;                          // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LivingRoom_CoffeeTable_01_Tire_05;                 // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LivingRoom_CoffeeTable_01_Tire_04;                 // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LivingRoom_CoffeeTable_01_Tire_03;                 // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LivingRoom_CoffeeTable_01_Tire_02;                 // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Utility_Lawnmower_Fancy_02_C">();
	}
	static class AUtility_Lawnmower_Fancy_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUtility_Lawnmower_Fancy_02_C>();
	}
};
static_assert(alignof(AUtility_Lawnmower_Fancy_02_C) == 0x000008, "Wrong alignment on AUtility_Lawnmower_Fancy_02_C");
static_assert(sizeof(AUtility_Lawnmower_Fancy_02_C) == 0x000BF0, "Wrong size on AUtility_Lawnmower_Fancy_02_C");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, MedPipe_03_90) == 0x000BC0, "Member 'AUtility_Lawnmower_Fancy_02_C::MedPipe_03_90' has a wrong offset!");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, Sm_apollo_fac_pipe_s_128) == 0x000BC8, "Member 'AUtility_Lawnmower_Fancy_02_C::Sm_apollo_fac_pipe_s_128' has a wrong offset!");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, LivingRoom_CoffeeTable_01_Tire_05) == 0x000BD0, "Member 'AUtility_Lawnmower_Fancy_02_C::LivingRoom_CoffeeTable_01_Tire_05' has a wrong offset!");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, LivingRoom_CoffeeTable_01_Tire_04) == 0x000BD8, "Member 'AUtility_Lawnmower_Fancy_02_C::LivingRoom_CoffeeTable_01_Tire_04' has a wrong offset!");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, LivingRoom_CoffeeTable_01_Tire_03) == 0x000BE0, "Member 'AUtility_Lawnmower_Fancy_02_C::LivingRoom_CoffeeTable_01_Tire_03' has a wrong offset!");
static_assert(offsetof(AUtility_Lawnmower_Fancy_02_C, LivingRoom_CoffeeTable_01_Tire_02) == 0x000BE8, "Member 'AUtility_Lawnmower_Fancy_02_C::LivingRoom_CoffeeTable_01_Tire_02' has a wrong offset!");

}

