#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_TaxiCab_Vehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Valet_TaxiCab_Vehicle.Valet_TaxiCab_Vehicle_C.ExecuteUbergraph_Valet_TaxiCab_Vehicle
// 0x0010 (0x0010 - 0x0000)
struct Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Fade;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DestroyedActor;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle) == 0x000008, "Wrong alignment on Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle");
static_assert(sizeof(Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle) == 0x000010, "Wrong size on Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle");
static_assert(offsetof(Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle, EntryPoint) == 0x000000, "Member 'Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle, K2Node_Event_Fade) == 0x000004, "Member 'Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle::K2Node_Event_Fade' has a wrong offset!");
static_assert(offsetof(Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle, K2Node_Event_DestroyedActor) == 0x000008, "Member 'Valet_TaxiCab_Vehicle_C_ExecuteUbergraph_Valet_TaxiCab_Vehicle::K2Node_Event_DestroyedActor' has a wrong offset!");

// Function Valet_TaxiCab_Vehicle.Valet_TaxiCab_Vehicle_C.DisolveVehicle
// 0x0004 (0x0004 - 0x0000)
struct Valet_TaxiCab_Vehicle_C_DisolveVehicle final
{
public:
	float                                         Param_Fade;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_TaxiCab_Vehicle_C_DisolveVehicle) == 0x000004, "Wrong alignment on Valet_TaxiCab_Vehicle_C_DisolveVehicle");
static_assert(sizeof(Valet_TaxiCab_Vehicle_C_DisolveVehicle) == 0x000004, "Wrong size on Valet_TaxiCab_Vehicle_C_DisolveVehicle");
static_assert(offsetof(Valet_TaxiCab_Vehicle_C_DisolveVehicle, Param_Fade) == 0x000000, "Member 'Valet_TaxiCab_Vehicle_C_DisolveVehicle::Param_Fade' has a wrong offset!");

// Function Valet_TaxiCab_Vehicle.Valet_TaxiCab_Vehicle_C.ExplodeCosmetics
// 0x0008 (0x0008 - 0x0000)
struct Valet_TaxiCab_Vehicle_C_ExplodeCosmetics final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_TaxiCab_Vehicle_C_ExplodeCosmetics) == 0x000008, "Wrong alignment on Valet_TaxiCab_Vehicle_C_ExplodeCosmetics");
static_assert(sizeof(Valet_TaxiCab_Vehicle_C_ExplodeCosmetics) == 0x000008, "Wrong size on Valet_TaxiCab_Vehicle_C_ExplodeCosmetics");
static_assert(offsetof(Valet_TaxiCab_Vehicle_C_ExplodeCosmetics, DestroyedActor) == 0x000000, "Member 'Valet_TaxiCab_Vehicle_C_ExplodeCosmetics::DestroyedActor' has a wrong offset!");

}

