#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BigRig_Vehicle

#include "Basic.hpp"

#include "Valet_BasicCar_Vehicle_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C
// 0x0090 (0x2460 - 0x23D0)
#pragma pack(push, 0x1)
class alignas(0x10) AValet_BigRig_Vehicle_C : public AValet_BasicCar_Vehicle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Valet_BigRig_Vehicle_C;             // 0x23D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               SmokeLeft_FX;                                      // 0x23D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SmokeRight_FX;                                     // 0x23E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ExhaustSmoke;                                      // 0x23E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         HotfixScalePontoonTickRateFront_0;                 // 0x23F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HotfixScalePontoonTickRateRear_0;                  // 0x2410(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MatIndex;                                          // 0x2430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FD[0x4];                                     // 0x2434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             SK_Mat0_Array_0_0;                                 // 0x2438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             SK_Mat2_Array_0;                                   // 0x2448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Valet_BigRig_Vehicle(int32 EntryPoint);
	void OnEnteredWaterBody(class AFortWaterBodyActor* Param_WaterBody);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Valet_BigRig_Vehicle_C">();
	}
	static class AValet_BigRig_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_BigRig_Vehicle_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AValet_BigRig_Vehicle_C) == 0x000010, "Wrong alignment on AValet_BigRig_Vehicle_C");
static_assert(sizeof(AValet_BigRig_Vehicle_C) == 0x002460, "Wrong size on AValet_BigRig_Vehicle_C");
static_assert(offsetof(AValet_BigRig_Vehicle_C, UberGraphFrame_Valet_BigRig_Vehicle_C) == 0x0023D0, "Member 'AValet_BigRig_Vehicle_C::UberGraphFrame_Valet_BigRig_Vehicle_C' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SmokeLeft_FX) == 0x0023D8, "Member 'AValet_BigRig_Vehicle_C::SmokeLeft_FX' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SmokeRight_FX) == 0x0023E0, "Member 'AValet_BigRig_Vehicle_C::SmokeRight_FX' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, ExhaustSmoke) == 0x0023E8, "Member 'AValet_BigRig_Vehicle_C::ExhaustSmoke' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, HotfixScalePontoonTickRateFront_0) == 0x0023F0, "Member 'AValet_BigRig_Vehicle_C::HotfixScalePontoonTickRateFront_0' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, HotfixScalePontoonTickRateRear_0) == 0x002410, "Member 'AValet_BigRig_Vehicle_C::HotfixScalePontoonTickRateRear_0' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, MatIndex) == 0x002430, "Member 'AValet_BigRig_Vehicle_C::MatIndex' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SK_Mat0_Array_0_0) == 0x002438, "Member 'AValet_BigRig_Vehicle_C::SK_Mat0_Array_0_0' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SK_Mat2_Array_0) == 0x002448, "Member 'AValet_BigRig_Vehicle_C::SK_Mat2_Array_0' has a wrong offset!");

}

