#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_SportsCar_Vehicle

#include "Basic.hpp"

#include "Valet_BasicCar_Vehicle_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Valet_SportsCar_Vehicle.Valet_SportsCar_Vehicle_C
// 0x00E0 (0x24B0 - 0x23D0)
class AValet_SportsCar_Vehicle_C : public AValet_BasicCar_Vehicle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Valet_SportsCar_Vehicle_C;          // 0x23D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimeLineBoostFast_JetFlameHight_C6E4643E43DBB89BF251A9B3E7362010; // 0x23D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLineBoostFast__Direction_C6E4643E43DBB89BF251A9B3E7362010; // 0x23DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A5F[0x3];                                     // 0x23DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLineBoostFast;                                 // 0x23E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLineBoost_JetSparksCounts_7E685A324AC725F8C4CD2DAD12DCD247; // 0x23E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLineBoost_JetFlameHight_7E685A324AC725F8C4CD2DAD12DCD247; // 0x23EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLineBoost__Direction_7E685A324AC725F8C4CD2DAD12DCD247; // 0x23F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A60[0x7];                                     // 0x23F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLineBoost;                                     // 0x23F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_BoostFlames;                                    // 0x2400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_BoostFlame_l_l;                                 // 0x2408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_BoostFlame_l_r;                                 // 0x2410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_BoostFlame_r_l;                                 // 0x2418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_BoostFlame_r_r;                                 // 0x2420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_TireSkid_0;                                     // 0x2428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_TireSkid_Boost_l;                               // 0x2430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_TireSkid_Boost_r;                               // 0x2438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TurboBoost_FX;                                  // 0x2440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         HotfixScalePontoonTickRateRear_0;                  // 0x2448(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HotfixScalePontoonTickRateFront_0;                 // 0x2468(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             SK_Mat1_Array_0;                                   // 0x2488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             SK_Mat2_Array_0;                                   // 0x2498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         MatIndex;                                          // 0x24A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Valet_SportsCar_Vehicle(int32 EntryPoint);
	void ActivateBoost();
	void DeactivateBoost();
	void BP_OnBoostStarted();
	void OnPawnExitVehicle(class AFortPlayerPawn* PlayerPawn, class FName ExitSocketName);
	void BP_OnBoostFinished();
	void TimeLineBoostFast__UpdateFunc();
	void TimeLineBoostFast__FinishedFunc();
	void TimeLineBoost__UpdateFunc();
	void TimeLineBoost__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Valet_SportsCar_Vehicle_C">();
	}
	static class AValet_SportsCar_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_SportsCar_Vehicle_C>();
	}
};
static_assert(alignof(AValet_SportsCar_Vehicle_C) == 0x000010, "Wrong alignment on AValet_SportsCar_Vehicle_C");
static_assert(sizeof(AValet_SportsCar_Vehicle_C) == 0x0024B0, "Wrong size on AValet_SportsCar_Vehicle_C");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, UberGraphFrame_Valet_SportsCar_Vehicle_C) == 0x0023D0, "Member 'AValet_SportsCar_Vehicle_C::UberGraphFrame_Valet_SportsCar_Vehicle_C' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoostFast_JetFlameHight_C6E4643E43DBB89BF251A9B3E7362010) == 0x0023D8, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoostFast_JetFlameHight_C6E4643E43DBB89BF251A9B3E7362010' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoostFast__Direction_C6E4643E43DBB89BF251A9B3E7362010) == 0x0023DC, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoostFast__Direction_C6E4643E43DBB89BF251A9B3E7362010' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoostFast) == 0x0023E0, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoostFast' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoost_JetSparksCounts_7E685A324AC725F8C4CD2DAD12DCD247) == 0x0023E8, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoost_JetSparksCounts_7E685A324AC725F8C4CD2DAD12DCD247' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoost_JetFlameHight_7E685A324AC725F8C4CD2DAD12DCD247) == 0x0023EC, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoost_JetFlameHight_7E685A324AC725F8C4CD2DAD12DCD247' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoost__Direction_7E685A324AC725F8C4CD2DAD12DCD247) == 0x0023F0, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoost__Direction_7E685A324AC725F8C4CD2DAD12DCD247' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, TimeLineBoost) == 0x0023F8, "Member 'AValet_SportsCar_Vehicle_C::TimeLineBoost' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_BoostFlames) == 0x002400, "Member 'AValet_SportsCar_Vehicle_C::FX_BoostFlames' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_BoostFlame_l_l) == 0x002408, "Member 'AValet_SportsCar_Vehicle_C::FX_BoostFlame_l_l' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_BoostFlame_l_r) == 0x002410, "Member 'AValet_SportsCar_Vehicle_C::FX_BoostFlame_l_r' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_BoostFlame_r_l) == 0x002418, "Member 'AValet_SportsCar_Vehicle_C::FX_BoostFlame_r_l' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_BoostFlame_r_r) == 0x002420, "Member 'AValet_SportsCar_Vehicle_C::FX_BoostFlame_r_r' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_TireSkid_0) == 0x002428, "Member 'AValet_SportsCar_Vehicle_C::FX_TireSkid_0' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_TireSkid_Boost_l) == 0x002430, "Member 'AValet_SportsCar_Vehicle_C::FX_TireSkid_Boost_l' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, FX_TireSkid_Boost_r) == 0x002438, "Member 'AValet_SportsCar_Vehicle_C::FX_TireSkid_Boost_r' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, NS_TurboBoost_FX) == 0x002440, "Member 'AValet_SportsCar_Vehicle_C::NS_TurboBoost_FX' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, HotfixScalePontoonTickRateRear_0) == 0x002448, "Member 'AValet_SportsCar_Vehicle_C::HotfixScalePontoonTickRateRear_0' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, HotfixScalePontoonTickRateFront_0) == 0x002468, "Member 'AValet_SportsCar_Vehicle_C::HotfixScalePontoonTickRateFront_0' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, SK_Mat1_Array_0) == 0x002488, "Member 'AValet_SportsCar_Vehicle_C::SK_Mat1_Array_0' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, SK_Mat2_Array_0) == 0x002498, "Member 'AValet_SportsCar_Vehicle_C::SK_Mat2_Array_0' has a wrong offset!");
static_assert(offsetof(AValet_SportsCar_Vehicle_C, MatIndex) == 0x0024A8, "Member 'AValet_SportsCar_Vehicle_C::MatIndex' has a wrong offset!");

}

