#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_SportsCar_Vehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Valet_SportsCar_Vehicle.Valet_SportsCar_Vehicle_C.ExecuteUbergraph_Valet_SportsCar_Vehicle
// 0x0040 (0x0040 - 0x0000)
struct Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A61[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A62[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A63[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ExitSocketName;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A64[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWaterBody_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle) == 0x000008, "Wrong alignment on Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle");
static_assert(sizeof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle) == 0x000040, "Wrong size on Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, EntryPoint) == 0x000000, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_IsValid_ReturnValue_1) == 0x00000C, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_IsValid_ReturnValue_2) == 0x000014, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, K2Node_Event_PlayerPawn) == 0x000018, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::K2Node_Event_PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, K2Node_Event_ExitSocketName) == 0x000020, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::K2Node_Event_ExitSocketName' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000030, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_IsInWaterBody_ReturnValue) == 0x000038, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_IsInWaterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'Valet_SportsCar_Vehicle_C_ExecuteUbergraph_Valet_SportsCar_Vehicle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Valet_SportsCar_Vehicle.Valet_SportsCar_Vehicle_C.OnPawnExitVehicle
// 0x0010 (0x0010 - 0x0000)
struct Valet_SportsCar_Vehicle_C_OnPawnExitVehicle final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ExitSocketName;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_SportsCar_Vehicle_C_OnPawnExitVehicle) == 0x000008, "Wrong alignment on Valet_SportsCar_Vehicle_C_OnPawnExitVehicle");
static_assert(sizeof(Valet_SportsCar_Vehicle_C_OnPawnExitVehicle) == 0x000010, "Wrong size on Valet_SportsCar_Vehicle_C_OnPawnExitVehicle");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_OnPawnExitVehicle, PlayerPawn) == 0x000000, "Member 'Valet_SportsCar_Vehicle_C_OnPawnExitVehicle::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_OnPawnExitVehicle, ExitSocketName) == 0x000008, "Member 'Valet_SportsCar_Vehicle_C_OnPawnExitVehicle::ExitSocketName' has a wrong offset!");

// Function Valet_SportsCar_Vehicle.Valet_SportsCar_Vehicle_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Valet_SportsCar_Vehicle_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_SportsCar_Vehicle_C_UserConstructionScript) == 0x000004, "Wrong alignment on Valet_SportsCar_Vehicle_C_UserConstructionScript");
static_assert(sizeof(Valet_SportsCar_Vehicle_C_UserConstructionScript) == 0x000008, "Wrong size on Valet_SportsCar_Vehicle_C_UserConstructionScript");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'Valet_SportsCar_Vehicle_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_SportsCar_Vehicle_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'Valet_SportsCar_Vehicle_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");

}

