#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetVehiclePassengerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP
// 0x00B0 (0x00B0 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9A[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9D[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA0[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AFortDagwoodVehicle>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0070(0x0028)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAnimInstance*               K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP) == 0x0000B0, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, EntryPoint) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000014, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000018, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000029, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000040, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000048, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetVehicleActor_ReturnValue) == 0x000058, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000060, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000070, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000098, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance) == 0x0000A0, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000AA, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_AnimGraph");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_AnimGraph");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleSplitBodyOverride
// 0x00B0 (0x00B0 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride final
{
public:
	struct FPoseLink                              InPoseSplitBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerBody;                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_TurnInPlace             Param_TurnInPlace;                                 // 0x0020(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPoseLink                              InPoseUpperAndLowerBodyRemoveRoot;                 // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleSplitBodyOverride;                    // 0x00A0(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride) == 0x0000B0, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseSplitBody) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseSplitBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBody) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, Param_TurnInPlace) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::Param_TurnInPlace' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBodyRemoveRoot) == 0x000090, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBodyRemoveRoot' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, Param_VehicleSplitBodyOverride) == 0x0000A0, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::Param_VehicleSplitBodyOverride' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleLowerBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride final
{
public:
	struct FPoseLink                              InPoseLowerBodyDefault;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleLowerBodyOverride;                    // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride) == 0x000030, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, InPoseLowerBodyDefault) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::InPoseLowerBodyDefault' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, InPoseUpperBody) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::InPoseUpperBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, Param_VehicleLowerBodyOverride) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::Param_VehicleLowerBodyOverride' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleFullBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerCachePose;                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_VehicleFullBodyOverride;                     // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride) == 0x000030, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, InPoseFullBody) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::InPoseFullBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, InPoseUpperAndLowerCachePose) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::InPoseUpperAndLowerCachePose' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, Param_VehicleFullBodyOverride) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::Param_VehicleFullBodyOverride' has a wrong offset!");

}

