#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultWeaponPlacementHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VaultWeaponPlacementHelper.VaultWeaponPlacementHelper_C
// 0x0060 (0x0280 - 0x0220)
class AVaultWeaponPlacementHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CUBE;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSparkle;                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl02;                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl01;                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerID;                                          // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2D[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayerSelected;                                 // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2E[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void GetFrontendAnimInstance();
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void Initialize();
	void InitializeContextEvents();
	void ReceiveBeginPlay();
	void ItemRez();
	void ExecuteUbergraph_VaultWeaponPlacementHelper(int32 EntryPoint);
	void NewEventDispatcher_0__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VaultWeaponPlacementHelper_C">();
	}
	static class AVaultWeaponPlacementHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVaultWeaponPlacementHelper_C>();
	}
};
static_assert(alignof(AVaultWeaponPlacementHelper_C) == 0x000008, "Wrong alignment on AVaultWeaponPlacementHelper_C");
static_assert(sizeof(AVaultWeaponPlacementHelper_C) == 0x000280, "Wrong size on AVaultWeaponPlacementHelper_C");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, UberGraphFrame) == 0x000220, "Member 'AVaultWeaponPlacementHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, CUBE) == 0x000228, "Member 'AVaultWeaponPlacementHelper_C::CUBE' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, PSMinusNoPlayerMinusSparkle) == 0x000230, "Member 'AVaultWeaponPlacementHelper_C::PSMinusNoPlayerMinusSparkle' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, PSMinusNoPlayerMinusSwirl02) == 0x000238, "Member 'AVaultWeaponPlacementHelper_C::PSMinusNoPlayerMinusSwirl02' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, PSMinusNoPlayerMinusSwirl01) == 0x000240, "Member 'AVaultWeaponPlacementHelper_C::PSMinusNoPlayerMinusSwirl01' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, CharacterPlacement) == 0x000248, "Member 'AVaultWeaponPlacementHelper_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, Root) == 0x000250, "Member 'AVaultWeaponPlacementHelper_C::Root' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, PlayerID) == 0x000258, "Member 'AVaultWeaponPlacementHelper_C::PlayerID' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, Mesh) == 0x000260, "Member 'AVaultWeaponPlacementHelper_C::Mesh' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, bIsPlayerSelected) == 0x000268, "Member 'AVaultWeaponPlacementHelper_C::bIsPlayerSelected' has a wrong offset!");
static_assert(offsetof(AVaultWeaponPlacementHelper_C, NewEventDispatcher_0) == 0x000270, "Member 'AVaultWeaponPlacementHelper_C::NewEventDispatcher_0' has a wrong offset!");

}

