#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vault_Door

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Vault_Door.Vault_Door_C
// 0x00D0 (0x0880 - 0x07B0)
class AVault_Door_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   S_Prim_Prism;                                      // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UpperBolt;                                         // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LowerBolt;                                         // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UpperBolt2_Door;                                   // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UpperBolt1_Door;                                   // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VaultDoorFX;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    VaultLightInside;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    VaultLightOutside;                                 // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VaultDoor;                                         // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Open_ShaderAnim_Normalized_B888903B464902A65CC3929C6A64E5F6; // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Open_Lerp_B888903B464902A65CC3929C6A64E5F6;        // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Open__Direction_B888903B464902A65CC3929C6A64E5F6;  // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6528[0x7];                                     // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Open;                                              // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DoorSpawnRotation;                                 // 0x0820(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DoorRotationAmount;                                // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_VaultDoor;                                     // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_OpenDoor;                                       // 0x0838(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GreenLight;                                        // 0x0840(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6529[0x3];                                     // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitLockTime;                                      // 0x0844(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BigCShapeLockTime;                                 // 0x0848(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x084C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x0858(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation;                                     // 0x0864(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               EndRotation;                                       // 0x0870(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Vault_Door(int32 EntryPoint);
	void OpeningTimeline();
	void VaultOpen();
	void ReceiveBeginPlay();
	void Open__Trigger_Light__EventFunc();
	void Open__UpdateFunc();
	void Open__FinishedFunc();
	void OnRep_HasBeenOpening();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Vault_Door_C">();
	}
	static class AVault_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVault_Door_C>();
	}
};
static_assert(alignof(AVault_Door_C) == 0x000008, "Wrong alignment on AVault_Door_C");
static_assert(sizeof(AVault_Door_C) == 0x000880, "Wrong size on AVault_Door_C");
static_assert(offsetof(AVault_Door_C, UberGraphFrame) == 0x0007B0, "Member 'AVault_Door_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, S_Prim_Prism) == 0x0007B8, "Member 'AVault_Door_C::S_Prim_Prism' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, UpperBolt) == 0x0007C0, "Member 'AVault_Door_C::UpperBolt' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, LowerBolt) == 0x0007C8, "Member 'AVault_Door_C::LowerBolt' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, UpperBolt2_Door) == 0x0007D0, "Member 'AVault_Door_C::UpperBolt2_Door' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, UpperBolt1_Door) == 0x0007D8, "Member 'AVault_Door_C::UpperBolt1_Door' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, VaultDoorFX) == 0x0007E0, "Member 'AVault_Door_C::VaultDoorFX' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, VaultLightInside) == 0x0007E8, "Member 'AVault_Door_C::VaultLightInside' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, VaultLightOutside) == 0x0007F0, "Member 'AVault_Door_C::VaultLightOutside' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, VaultDoor) == 0x0007F8, "Member 'AVault_Door_C::VaultDoor' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, Frame) == 0x000800, "Member 'AVault_Door_C::Frame' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, Open_ShaderAnim_Normalized_B888903B464902A65CC3929C6A64E5F6) == 0x000808, "Member 'AVault_Door_C::Open_ShaderAnim_Normalized_B888903B464902A65CC3929C6A64E5F6' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, Open_Lerp_B888903B464902A65CC3929C6A64E5F6) == 0x00080C, "Member 'AVault_Door_C::Open_Lerp_B888903B464902A65CC3929C6A64E5F6' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, Open__Direction_B888903B464902A65CC3929C6A64E5F6) == 0x000810, "Member 'AVault_Door_C::Open__Direction_B888903B464902A65CC3929C6A64E5F6' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, Open) == 0x000818, "Member 'AVault_Door_C::Open' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, DoorSpawnRotation) == 0x000820, "Member 'AVault_Door_C::DoorSpawnRotation' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, DoorRotationAmount) == 0x00082C, "Member 'AVault_Door_C::DoorRotationAmount' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, MID_VaultDoor) == 0x000830, "Member 'AVault_Door_C::MID_VaultDoor' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, GC_OpenDoor) == 0x000838, "Member 'AVault_Door_C::GC_OpenDoor' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, GreenLight) == 0x000840, "Member 'AVault_Door_C::GreenLight' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, WaitLockTime) == 0x000844, "Member 'AVault_Door_C::WaitLockTime' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, BigCShapeLockTime) == 0x000848, "Member 'AVault_Door_C::BigCShapeLockTime' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, StartLocation) == 0x00084C, "Member 'AVault_Door_C::StartLocation' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, EndLocation) == 0x000858, "Member 'AVault_Door_C::EndLocation' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, StartRotation) == 0x000864, "Member 'AVault_Door_C::StartRotation' has a wrong offset!");
static_assert(offsetof(AVault_Door_C, EndRotation) == 0x000870, "Member 'AVault_Door_C::EndRotation' has a wrong offset!");

}

