#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehiclePassengerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VehiclePassengerLayerAnimBP.VehiclePassengerLayerAnimBP_C
// 0x0B50 (0x0E90 - 0x0340)
class UVehiclePassengerLayerAnimBP_C final : public UFortVehicleLayerAnimInstance
{
public:
	uint8                                         Pad_8912[0x8];                                     // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0348(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0378(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0400(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0488(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x04B8(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0540(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x05C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05F8(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x0680(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x0808(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0990(0x0188)()
	struct FFortAnimInput_TurnInPlace             TurnInPlace;                                       // 0x0B18(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0B88(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0C10(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0CB0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0D78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0DA0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0DC8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0E50(0x0030)()
	bool                                          IsPassenger;                                       // 0x0E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_VehiclePassengerLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void VehicleSplitBodyOverride(const struct FPoseLink& InPoseSplitBody, const struct FPoseLink& InPoseUpperAndLowerBody, const struct FFortAnimInput_TurnInPlace& Param_TurnInPlace, const struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink* Param_VehicleSplitBodyOverride);
	void VehicleLowerBodyOverride(const struct FPoseLink& InPoseLowerBodyDefault, const struct FPoseLink& InPoseUpperBody, struct FPoseLink* Param_VehicleLowerBodyOverride);
	void VehicleFullBodyOverride(const struct FPoseLink& InPoseFullBody, const struct FPoseLink& InPoseUpperAndLowerCachePose, struct FPoseLink* Param_VehicleFullBodyOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VehiclePassengerLayerAnimBP_C">();
	}
	static class UVehiclePassengerLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehiclePassengerLayerAnimBP_C>();
	}
};
static_assert(alignof(UVehiclePassengerLayerAnimBP_C) == 0x000010, "Wrong alignment on UVehiclePassengerLayerAnimBP_C");
static_assert(sizeof(UVehiclePassengerLayerAnimBP_C) == 0x000E90, "Wrong size on UVehiclePassengerLayerAnimBP_C");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, UberGraphFrame) == 0x000340, "Member 'UVehiclePassengerLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_Root_3) == 0x000348, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x000378, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x000400, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_Root_2) == 0x000488, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x0004B8, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x000540, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_Root_1) == 0x0005C8, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0005F8, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_2) == 0x000680, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_2' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x000808, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000990, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, TurnInPlace) == 0x000B18, "Member 'UVehiclePassengerLayerAnimBP_C::TurnInPlace' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x000B88, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000C10, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000CB0, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000D78, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000DA0, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000DC8, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, AnimGraphNode_Root) == 0x000E50, "Member 'UVehiclePassengerLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UVehiclePassengerLayerAnimBP_C, IsPassenger) == 0x000E80, "Member 'UVehiclePassengerLayerAnimBP_C::IsPassenger' has a wrong offset!");

}

