#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerbosePerkVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VerbosePerkVisual.VerbosePerkVisual_C
// 0x0040 (0x0270 - 0x0230)
class UVerbosePerkVisual_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Divider;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_ItemDetails;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ItemDescription;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ItemLevel;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPassiveItem;                                     // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_66F7[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSpyTechItemDefinition*             SpyTechItemDef;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VerbosePerkVisual(int32 EntryPoint);
	void Set_Spy_Perk_Item_Def(class UFortSpyTechItemDefinition* Spy_Tech_Item_Def);
	void OnLoaded_06E4117B438C3709FCA72CBF3AD7FDF6(class UObject* Loaded);
	void GetItem(class UFortSpyTechItemDefinition** Param_SpyTechItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VerbosePerkVisual_C">();
	}
	static class UVerbosePerkVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerbosePerkVisual_C>();
	}
};
static_assert(alignof(UVerbosePerkVisual_C) == 0x000008, "Wrong alignment on UVerbosePerkVisual_C");
static_assert(sizeof(UVerbosePerkVisual_C) == 0x000270, "Wrong size on UVerbosePerkVisual_C");
static_assert(offsetof(UVerbosePerkVisual_C, UberGraphFrame) == 0x000230, "Member 'UVerbosePerkVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, Image_Divider) == 0x000238, "Member 'UVerbosePerkVisual_C::Image_Divider' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, Image_ItemDetails) == 0x000240, "Member 'UVerbosePerkVisual_C::Image_ItemDetails' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, Text_ItemDescription) == 0x000248, "Member 'UVerbosePerkVisual_C::Text_ItemDescription' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, Text_ItemLevel) == 0x000250, "Member 'UVerbosePerkVisual_C::Text_ItemLevel' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, Text_ItemName) == 0x000258, "Member 'UVerbosePerkVisual_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, IsPassiveItem) == 0x000260, "Member 'UVerbosePerkVisual_C::IsPassiveItem' has a wrong offset!");
static_assert(offsetof(UVerbosePerkVisual_C, SpyTechItemDef) == 0x000268, "Member 'UVerbosePerkVisual_C::SpyTechItemDef' has a wrong offset!");

}

