#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VinderTech_Umbrella_BuildABrella_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VinderTech_Umbrella_BuildABrella_AnimBP.VinderTech_Umbrella_BuildABrella_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph");
static_assert(sizeof(VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function VinderTech_Umbrella_BuildABrella_AnimBP.VinderTech_Umbrella_BuildABrella_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function VinderTech_Umbrella_BuildABrella_AnimBP.VinderTech_Umbrella_BuildABrella_AnimBP_C.ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP
// 0x0040 (0x0040 - 0x0000)
struct VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C3F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C40[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ForwardBack_Value_Interp_New_Value;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP) == 0x000008, "Wrong alignment on VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP");
static_assert(sizeof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP) == 0x000040, "Wrong size on VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, EntryPoint) == 0x000000, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000A, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000C, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x00000E, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x00000F, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000010, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000011, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000012, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000013, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000014, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000015, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x000016, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_Not_PreBool_ReturnValue_6) == 0x000017, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x000018, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint) == 0x000028, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, K2Node_Event_DeltaTimeX) == 0x000034, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP, CallFunc_ForwardBack_Value_Interp_New_Value) == 0x000038, "Member 'VinderTech_Umbrella_BuildABrella_AnimBP_C_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP::CallFunc_ForwardBack_Value_Interp_New_Value' has a wrong offset!");

}

