#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AvailableSparks

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_AvailableSparks.W_AvailableSparks_C.PlayCountdown
// 0x0004 (0x0004 - 0x0000)
struct W_AvailableSparks_C_PlayCountdown final
{
public:
	float                                         StartValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AvailableSparks_C_PlayCountdown) == 0x000004, "Wrong alignment on W_AvailableSparks_C_PlayCountdown");
static_assert(sizeof(W_AvailableSparks_C_PlayCountdown) == 0x000004, "Wrong size on W_AvailableSparks_C_PlayCountdown");
static_assert(offsetof(W_AvailableSparks_C_PlayCountdown, StartValue) == 0x000000, "Member 'W_AvailableSparks_C_PlayCountdown::StartValue' has a wrong offset!");

// Function W_AvailableSparks.W_AvailableSparks_C.PlayEventOver
// 0x0004 (0x0004 - 0x0000)
struct W_AvailableSparks_C_PlayEventOver final
{
public:
	float                                         StartValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AvailableSparks_C_PlayEventOver) == 0x000004, "Wrong alignment on W_AvailableSparks_C_PlayEventOver");
static_assert(sizeof(W_AvailableSparks_C_PlayEventOver) == 0x000004, "Wrong size on W_AvailableSparks_C_PlayEventOver");
static_assert(offsetof(W_AvailableSparks_C_PlayEventOver, StartValue) == 0x000000, "Member 'W_AvailableSparks_C_PlayEventOver::StartValue' has a wrong offset!");

// Function W_AvailableSparks.W_AvailableSparks_C.ExecuteUbergraph_W_AvailableSparks
// 0x0060 (0x0060 - 0x0000)
struct W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartValue_1;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartValue;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7652[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks) == 0x000008, "Wrong alignment on W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks");
static_assert(sizeof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks) == 0x000060, "Wrong size on W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, EntryPoint) == 0x000000, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, K2Node_Event_StartValue_1) == 0x000004, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::K2Node_Event_StartValue_1' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, K2Node_Event_StartValue) == 0x000008, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::K2Node_Event_StartValue' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue_4) == 0x000050, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks, CallFunc_PlayAnimation_ReturnValue_5) == 0x000058, "Member 'W_AvailableSparks_C_ExecuteUbergraph_W_AvailableSparks::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");

}

