#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterHeater01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WaterHeater01.WaterHeater01_C
// 0x0020 (0x0BE0 - 0x0BC0)
class AWaterHeater01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_Electric_ON_Hit;                            // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Zap;                                         // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Damage_Zap;                                 // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WaterHeater01(int32 EntryPoint);
	void BndEvt__Effect_Damage_Zap_K2Node_ComponentBoundEvent_2_ParticleBurstSignature__DelegateSignature(class FName EventName, float EmitterTime, int32 ParticleCount);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaterHeater01_C">();
	}
	static class AWaterHeater01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterHeater01_C>();
	}
};
static_assert(alignof(AWaterHeater01_C) == 0x000008, "Wrong alignment on AWaterHeater01_C");
static_assert(sizeof(AWaterHeater01_C) == 0x000BE0, "Wrong size on AWaterHeater01_C");
static_assert(offsetof(AWaterHeater01_C, UberGraphFrame) == 0x000BC0, "Member 'AWaterHeater01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Effect_Electric_ON_Hit) == 0x000BC8, "Member 'AWaterHeater01_C::Effect_Electric_ON_Hit' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Audio_Zap) == 0x000BD0, "Member 'AWaterHeater01_C::Audio_Zap' has a wrong offset!");
static_assert(offsetof(AWaterHeater01_C, Effect_Damage_Zap) == 0x000BD8, "Member 'AWaterHeater01_C::Effect_Damage_Zap' has a wrong offset!");

}

