#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebLogin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WebLogin.WebLogin_C
// 0x0028 (0x0440 - 0x0418)
class UWebLogin_C final : public UFortWebLoginWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      Throbber;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                WebContent;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void DisplayWidget(class UWidget* WebWidget);
	void DismissWidget();
	void ExecuteUbergraph_WebLogin(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WebLogin_C">();
	}
	static class UWebLogin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebLogin_C>();
	}
};
static_assert(alignof(UWebLogin_C) == 0x000008, "Wrong alignment on UWebLogin_C");
static_assert(sizeof(UWebLogin_C) == 0x000440, "Wrong size on UWebLogin_C");
static_assert(offsetof(UWebLogin_C, UberGraphFrame) == 0x000418, "Member 'UWebLogin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, Throbber) == 0x000420, "Member 'UWebLogin_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, WebContent) == 0x000428, "Member 'UWebLogin_C::WebContent' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, BackAction) == 0x000430, "Member 'UWebLogin_C::BackAction' has a wrong offset!");

}

