#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WesternTiltedPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WesternTiltedPrompt.WesternTiltedPrompt_C
// 0x0060 (0x0308 - 0x02A8)
class UWesternTiltedPrompt_C final : public UFortHUDTagPromptWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft_Bottom;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeLeft_Top;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight_Bottom;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FiligreeRight_Top;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WesternTiltedPrompt(int32 EntryPoint);
	void CloseWidget();
	void OpenWidget(const struct FFortHUDTagPromptData& PrompData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WesternTiltedPrompt_C">();
	}
	static class UWesternTiltedPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWesternTiltedPrompt_C>();
	}
};
static_assert(alignof(UWesternTiltedPrompt_C) == 0x000008, "Wrong alignment on UWesternTiltedPrompt_C");
static_assert(sizeof(UWesternTiltedPrompt_C) == 0x000308, "Wrong size on UWesternTiltedPrompt_C");
static_assert(offsetof(UWesternTiltedPrompt_C, UberGraphFrame) == 0x0002A8, "Member 'UWesternTiltedPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Outro) == 0x0002B0, "Member 'UWesternTiltedPrompt_C::Outro' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Intro) == 0x0002B8, "Member 'UWesternTiltedPrompt_C::Intro' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft) == 0x0002C0, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft_Bottom) == 0x0002C8, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft_Bottom' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeLeft_Top) == 0x0002D0, "Member 'UWesternTiltedPrompt_C::Image_FiligreeLeft_Top' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight) == 0x0002D8, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight_Bottom) == 0x0002E0, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight_Bottom' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_FiligreeRight_Top) == 0x0002E8, "Member 'UWesternTiltedPrompt_C::Image_FiligreeRight_Top' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Image_Shadow) == 0x0002F0, "Member 'UWesternTiltedPrompt_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Text_Description) == 0x0002F8, "Member 'UWesternTiltedPrompt_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWesternTiltedPrompt_C, Text_Title) == 0x000300, "Member 'UWesternTiltedPrompt_C::Text_Title' has a wrong offset!");

}

