#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinnerOverlay_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinnerOverlay_v2.WinnerOverlay_v2_C
// 0x0070 (0x0308 - 0x0298)
class UWinnerOverlay_v2_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Victory_v2_b2;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpinningSpikeball;                                 // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Victory_v2_b;                                      // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Victory_v2;                                        // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaWinnerList_C*                    AthenaWinnerList;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_winanim;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SpecialEndingSocket;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayVictoryText;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Royale;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_RoyaleShadow;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Victory;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_VictoryShadow;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         AnimationDelay;                                    // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEVTestLocSpace;                                   // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WinnerOverlay_v2(int32 EntryPoint);
	void BP_OnActivated_1();
	void PlayVictoryAnim();
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinnerOverlay_v2_C">();
	}
	static class UWinnerOverlay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinnerOverlay_v2_C>();
	}
};
static_assert(alignof(UWinnerOverlay_v2_C) == 0x000008, "Wrong alignment on UWinnerOverlay_v2_C");
static_assert(sizeof(UWinnerOverlay_v2_C) == 0x000308, "Wrong size on UWinnerOverlay_v2_C");
static_assert(offsetof(UWinnerOverlay_v2_C, UberGraphFrame) == 0x000298, "Member 'UWinnerOverlay_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2_b2) == 0x0002A0, "Member 'UWinnerOverlay_v2_C::Victory_v2_b2' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, SpinningSpikeball) == 0x0002A8, "Member 'UWinnerOverlay_v2_C::SpinningSpikeball' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2_b) == 0x0002B0, "Member 'UWinnerOverlay_v2_C::Victory_v2_b' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Victory_v2) == 0x0002B8, "Member 'UWinnerOverlay_v2_C::Victory_v2' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, AthenaWinnerList) == 0x0002C0, "Member 'UWinnerOverlay_v2_C::AthenaWinnerList' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, CommonWidgetSwitcher_winanim) == 0x0002C8, "Member 'UWinnerOverlay_v2_C::CommonWidgetSwitcher_winanim' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, Overlay_SpecialEndingSocket) == 0x0002D0, "Member 'UWinnerOverlay_v2_C::Overlay_SpecialEndingSocket' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, OverlayVictoryText) == 0x0002D8, "Member 'UWinnerOverlay_v2_C::OverlayVictoryText' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_Royale) == 0x0002E0, "Member 'UWinnerOverlay_v2_C::RichTextBlock_Royale' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_RoyaleShadow) == 0x0002E8, "Member 'UWinnerOverlay_v2_C::RichTextBlock_RoyaleShadow' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_Victory) == 0x0002F0, "Member 'UWinnerOverlay_v2_C::RichTextBlock_Victory' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, RichTextBlock_VictoryShadow) == 0x0002F8, "Member 'UWinnerOverlay_v2_C::RichTextBlock_VictoryShadow' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, AnimationDelay) == 0x000300, "Member 'UWinnerOverlay_v2_C::AnimationDelay' has a wrong offset!");
static_assert(offsetof(UWinnerOverlay_v2_C, DEVTestLocSpace) == 0x000304, "Member 'UWinnerOverlay_v2_C::DEVTestLocSpace' has a wrong offset!");

}

