#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Winterfest_CabinLogo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Winterfest_CabinLogo.Winterfest_CabinLogo_C
// 0x0058 (0x0288 - 0x0230)
class UWinterfest_CabinLogo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_0;                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_51;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           PerspectiveSkew;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_01;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_02;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_03;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_04;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_05;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake_06;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void LogoIntro();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_Winterfest_CabinLogo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Winterfest_CabinLogo_C">();
	}
	static class UWinterfest_CabinLogo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterfest_CabinLogo_C>();
	}
};
static_assert(alignof(UWinterfest_CabinLogo_C) == 0x000008, "Wrong alignment on UWinterfest_CabinLogo_C");
static_assert(sizeof(UWinterfest_CabinLogo_C) == 0x000288, "Wrong size on UWinterfest_CabinLogo_C");
static_assert(offsetof(UWinterfest_CabinLogo_C, UberGraphFrame) == 0x000230, "Member 'UWinterfest_CabinLogo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Intro) == 0x000238, "Member 'UWinterfest_CabinLogo_C::Intro' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, CommonRichTextBlock_0) == 0x000240, "Member 'UWinterfest_CabinLogo_C::CommonRichTextBlock_0' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Image_51) == 0x000248, "Member 'UWinterfest_CabinLogo_C::Image_51' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, PerspectiveSkew) == 0x000250, "Member 'UWinterfest_CabinLogo_C::PerspectiveSkew' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_01) == 0x000258, "Member 'UWinterfest_CabinLogo_C::Snowflake_01' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_02) == 0x000260, "Member 'UWinterfest_CabinLogo_C::Snowflake_02' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_03) == 0x000268, "Member 'UWinterfest_CabinLogo_C::Snowflake_03' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_04) == 0x000270, "Member 'UWinterfest_CabinLogo_C::Snowflake_04' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_05) == 0x000278, "Member 'UWinterfest_CabinLogo_C::Snowflake_05' has a wrong offset!");
static_assert(offsetof(UWinterfest_CabinLogo_C, Snowflake_06) == 0x000280, "Member 'UWinterfest_CabinLogo_C::Snowflake_06' has a wrong offset!");

}

