#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Winterfest_CabinLogo

#include "Basic.hpp"


namespace SDK::Params
{

// Function Winterfest_CabinLogo.Winterfest_CabinLogo_C.LogoIntro
// 0x0008 (0x0008 - 0x0000)
struct Winterfest_CabinLogo_C_LogoIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Winterfest_CabinLogo_C_LogoIntro) == 0x000008, "Wrong alignment on Winterfest_CabinLogo_C_LogoIntro");
static_assert(sizeof(Winterfest_CabinLogo_C_LogoIntro) == 0x000008, "Wrong size on Winterfest_CabinLogo_C_LogoIntro");
static_assert(offsetof(Winterfest_CabinLogo_C_LogoIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Winterfest_CabinLogo_C_LogoIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function Winterfest_CabinLogo.Winterfest_CabinLogo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Winterfest_CabinLogo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Winterfest_CabinLogo_C_PreConstruct) == 0x000001, "Wrong alignment on Winterfest_CabinLogo_C_PreConstruct");
static_assert(sizeof(Winterfest_CabinLogo_C_PreConstruct) == 0x000001, "Wrong size on Winterfest_CabinLogo_C_PreConstruct");
static_assert(offsetof(Winterfest_CabinLogo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Winterfest_CabinLogo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Winterfest_CabinLogo.Winterfest_CabinLogo_C.ExecuteUbergraph_Winterfest_CabinLogo
// 0x0008 (0x0008 - 0x0000)
struct Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo) == 0x000004, "Wrong alignment on Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo");
static_assert(sizeof(Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo) == 0x000008, "Wrong size on Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo");
static_assert(offsetof(Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo, EntryPoint) == 0x000000, "Member 'Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo::EntryPoint' has a wrong offset!");
static_assert(offsetof(Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Winterfest_CabinLogo_C_ExecuteUbergraph_Winterfest_CabinLogo::K2Node_Event_IsDesignTime' has a wrong offset!");

}

