#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestPresentTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinterQuestPresentTag.WinterQuestPresentTag_C
// 0x0030 (0x0298 - 0x0268)
class UWinterQuestPresentTag_C final : public UFortWinterQuestPresentTag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ContentHB;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tag;                                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CachedRandomInt;                                   // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7509[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           FromNamesStringArray;                              // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnSetupCharacterNameTag(const struct FLinearColor& CharacterName);
	void ExecuteUbergraph_WinterQuestPresentTag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinterQuestPresentTag_C">();
	}
	static class UWinterQuestPresentTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestPresentTag_C>();
	}
};
static_assert(alignof(UWinterQuestPresentTag_C) == 0x000008, "Wrong alignment on UWinterQuestPresentTag_C");
static_assert(sizeof(UWinterQuestPresentTag_C) == 0x000298, "Wrong size on UWinterQuestPresentTag_C");
static_assert(offsetof(UWinterQuestPresentTag_C, UberGraphFrame) == 0x000268, "Member 'UWinterQuestPresentTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentTag_C, ContentHB) == 0x000270, "Member 'UWinterQuestPresentTag_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentTag_C, Tag) == 0x000278, "Member 'UWinterQuestPresentTag_C::Tag' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentTag_C, CachedRandomInt) == 0x000280, "Member 'UWinterQuestPresentTag_C::CachedRandomInt' has a wrong offset!");
static_assert(offsetof(UWinterQuestPresentTag_C, FromNamesStringArray) == 0x000288, "Member 'UWinterQuestPresentTag_C::FromNamesStringArray' has a wrong offset!");

}

