#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpSubNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function XpSubNotification.XpSubNotification_C.SetXpValue
// 0x0004 (0x0004 - 0x0000)
struct XpSubNotification_C_SetXpValue final
{
public:
	int32                                         XpValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(XpSubNotification_C_SetXpValue) == 0x000004, "Wrong alignment on XpSubNotification_C_SetXpValue");
static_assert(sizeof(XpSubNotification_C_SetXpValue) == 0x000004, "Wrong size on XpSubNotification_C_SetXpValue");
static_assert(offsetof(XpSubNotification_C_SetXpValue, XpValue) == 0x000000, "Member 'XpSubNotification_C_SetXpValue::XpValue' has a wrong offset!");

// Function XpSubNotification.XpSubNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct XpSubNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XpSubNotification_C_PreConstruct) == 0x000001, "Wrong alignment on XpSubNotification_C_PreConstruct");
static_assert(sizeof(XpSubNotification_C_PreConstruct) == 0x000001, "Wrong size on XpSubNotification_C_PreConstruct");
static_assert(offsetof(XpSubNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'XpSubNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function XpSubNotification.XpSubNotification_C.ExecuteUbergraph_XpSubNotification
// 0x00C0 (0x00C0 - 0x0000)
struct XpSubNotification_C_ExecuteUbergraph_XpSubNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_XpValue;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5047[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification) == 0x000008, "Wrong alignment on XpSubNotification_C_ExecuteUbergraph_XpSubNotification");
static_assert(sizeof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification) == 0x0000C0, "Wrong size on XpSubNotification_C_ExecuteUbergraph_XpSubNotification");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, EntryPoint) == 0x000000, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_Event_XpValue) == 0x000004, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_Event_XpValue' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_MakeArray_Array) == 0x000068, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, CallFunc_Format_ReturnValue) == 0x000078, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000A0, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_Event_IsDesignTime) == 0x0000A8, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(XpSubNotification_C_ExecuteUbergraph_XpSubNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000AC, "Member 'XpSubNotification_C_ExecuteUbergraph_XpSubNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

