#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Yacht_Stage_DJ_Booth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MediaUtils_structs.hpp"


namespace SDK::Params
{

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.ExecuteUbergraph_Yacht_Stage_DJ_Booth
// 0x03C0 (0x03C0 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8739[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_873A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x003C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D8(0x0018)()
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewParam_3;                     // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewParam_2;                     // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& FailedUrl)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_NewParam_1;                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NewParam;                       // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_873B[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_873C[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_873D[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_2;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasError_ReturnValue;                     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_873E[0x2];                                     // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_873F[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_AudioUID_1;                     // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ABP_DJBoothMeshTrigger_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x01F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_DJBoothMeshTrigger_C*               CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8740[0x2];                                     // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8741[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlayStartTime;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_AudioUID;                       // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_3;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    K2Node_MakeStruct_MediaPlayerOptions;              // 0x0280(0x0030)(NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8742[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_1;                // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    K2Node_MakeStruct_MediaPlayerOptions_1;            // 0x02D0(0x0030)(NoDestructor)
	struct FMediaPlayerOptions                    K2Node_Select_Default;                             // 0x0300(0x0030)(NoDestructor)
	struct FMediaPlayerOptions                    CallFunc_UpdatePlayerOptions_ReturnValue;          // 0x0330(0x0030)(NoDestructor)
	bool                                          CallFunc_OpenSourceWithOptions_ReturnValue;        // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8743[0x2];                                     // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(float PlayStartTime, const class FString& AudioUID)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth) == 0x0003C0, "Wrong size on Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, EntryPoint) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::EntryPoint' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, Temp_bool_Variable) == 0x000006, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_Damage) == 0x000008, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_DamageTags) == 0x000010, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_Momentum) == 0x000030, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_HitInfo) == 0x00003C, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_InstigatedBy) == 0x0000C8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_DamageCauser) == 0x0000D0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_EffectContext) == 0x0000D8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x0000F0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_NewParam_3) == 0x0000F8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_NewParam_3' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_NewParam_2) == 0x000108, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_2) == 0x000138, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_NewParam_1) == 0x000158, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_NewParam) == 0x000168, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_4) == 0x000178, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Play_ReturnValue) == 0x000188, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000189, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, Temp_int_Variable) == 0x00018C, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Add_IntInt_ReturnValue) == 0x000190, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000198, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x0001A0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001A8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetRuntimeOptions_ReturnValue_2) == 0x0001B0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetRuntimeOptions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Event_EndPlayReason) == 0x0001B8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_HasError_ReturnValue) == 0x0001B9, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_HasError_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001BC, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001CC, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_AudioUID_1) == 0x0001E0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_AudioUID_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001F0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Array_Get_Item) == 0x000200, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000208, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsValid_ReturnValue) == 0x000209, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x00020C, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Conv_FloatToString_ReturnValue) == 0x000210, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Concat_StrStr_ReturnValue) == 0x000220, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000230, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x000234, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000238, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x000248, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000258, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_PlayStartTime) == 0x00025C, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_PlayStartTime' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CustomEvent_AudioUID) == 0x000260, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CustomEvent_AudioUID' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_FromSeconds_ReturnValue) == 0x000270, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_GetRuntimeOptions_ReturnValue_3) == 0x000278, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_GetRuntimeOptions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_MakeStruct_MediaPlayerOptions) == 0x000280, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_MakeStruct_MediaPlayerOptions' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsDedicatedServer_ReturnValue) == 0x0002B0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002B1, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0002B2, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0002B3, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002B4, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_FromSeconds_ReturnValue_1) == 0x0002C8, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_FromSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_MakeStruct_MediaPlayerOptions_1) == 0x0002D0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_MakeStruct_MediaPlayerOptions_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_Select_Default) == 0x000300, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_UpdatePlayerOptions_ReturnValue) == 0x000330, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_UpdatePlayerOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_OpenSourceWithOptions_ReturnValue) == 0x000360, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_OpenSourceWithOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000361, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000364, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000370, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, K2Node_CreateDelegate_OutputDelegate_8) == 0x000380, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000390, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0003A0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0003B0, "Member 'Yacht_Stage_DJ_Booth_C_ExecuteUbergraph_Yacht_Stage_DJ_Booth::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.DJBMeshTriggerReady
// 0x0018 (0x0018 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady final
{
public:
	float                                         PlayStartTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8744[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Param_AudioUID;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady) == 0x000018, "Wrong size on Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady, PlayStartTime) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady::PlayStartTime' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady, Param_AudioUID) == 0x000008, "Member 'Yacht_Stage_DJ_Booth_C_DJBMeshTriggerReady::Param_AudioUID' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.djb_son
// 0x0010 (0x0010 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_Djb_son final
{
public:
	class FString                                 Param_AudioUID;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_Djb_son) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_Djb_son");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_Djb_son) == 0x000010, "Wrong size on Yacht_Stage_DJ_Booth_C_Djb_son");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_Djb_son, Param_AudioUID) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_Djb_son::Param_AudioUID' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Yacht_Stage_DJ_Booth_C_ReceiveEndPlay");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_ReceiveEndPlay) == 0x000001, "Wrong size on Yacht_Stage_DJ_Booth_C_ReceiveEndPlay");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.MediaOpenedFailed
// 0x0010 (0x0010 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_MediaOpenedFailed final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_MediaOpenedFailed) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_MediaOpenedFailed");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_MediaOpenedFailed) == 0x000010, "Wrong size on Yacht_Stage_DJ_Booth_C_MediaOpenedFailed");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_MediaOpenedFailed, NewParam) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_MediaOpenedFailed::NewParam' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.MediaOpened
// 0x0010 (0x0010 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_MediaOpened final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_MediaOpened) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_MediaOpened");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_MediaOpened) == 0x000010, "Wrong size on Yacht_Stage_DJ_Booth_C_MediaOpened");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_MediaOpened, NewParam) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_MediaOpened::NewParam' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.StreamingUrlSucceeded
// 0x0010 (0x0010 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded) == 0x000010, "Wrong size on Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded, NewParam) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_StreamingUrlSucceeded::NewParam' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.StreamingUrlFailed
// 0x0010 (0x0010 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_StreamingUrlFailed final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_StreamingUrlFailed) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_StreamingUrlFailed");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_StreamingUrlFailed) == 0x000010, "Wrong size on Yacht_Stage_DJ_Booth_C_StreamingUrlFailed");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_StreamingUrlFailed, NewParam) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_StreamingUrlFailed::NewParam' has a wrong offset!");

// Function Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8745[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects");
static_assert(sizeof(Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Yacht_Stage_DJ_Booth_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
