#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Yacht_Stage_DJ_Booth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Yacht_Stage_DJ_Booth.Yacht_Stage_DJ_Booth_C
// 0x0090 (0x0C50 - 0x0BC0)
class AYacht_Stage_DJ_Booth_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   StreamingSound;                                    // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Timeline;                                          // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStreamMediaSource*                 MediaSource;                                       // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMediaSubtitlesPlayer*              SubtitlePlayer;                                    // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDownloadLocalizedOverlays*         SubttleOverlay;                                    // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MediaRetryCounter;                                 // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MediaRetryMax;                                     // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenError;                                         // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UrlError;                                          // 0x0C19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RunningError;                                      // 0x0C1A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8737[0x5];                                     // 0x0C1B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DJBoothMeshTrigger_C*               MeshTrigger;                                       // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartPlayTime;                                     // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x0C2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8738[0x3];                                     // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AudioUID;                                          // 0x0C30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 AudioUID_Default;                                  // 0x0C40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Yacht_Stage_DJ_Booth(int32 EntryPoint);
	void DJBSetupMeshTrigger();
	void DJBMeshStopPlayback();
	void DJBMeshTriggerReady(float PlayStartTime, const class FString& Param_AudioUID);
	void Djb_foff();
	void Djb_fon();
	void Djb_soff();
	void Djb_son(const class FString& Param_AudioUID);
	void PlayResumed();
	void UnBindAllEvents();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Start_pip();
	void Media_Retry();
	void LoadFallback();
	void Stop_PIP();
	void MediaEndReached();
	void MediaClosed();
	void MediaOpenedFailed(const class FString& NewParam);
	void MediaOpened(const class FString& NewParam);
	void StreamingUrlSucceeded(const class FString& NewParam);
	void StreamingUrlFailed(const class FString& NewParam);
	void RequestStreamURL();
	void ReceiveBeginPlay();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Yacht_Stage_DJ_Booth_C">();
	}
	static class AYacht_Stage_DJ_Booth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AYacht_Stage_DJ_Booth_C>();
	}
};
static_assert(alignof(AYacht_Stage_DJ_Booth_C) == 0x000008, "Wrong alignment on AYacht_Stage_DJ_Booth_C");
static_assert(sizeof(AYacht_Stage_DJ_Booth_C) == 0x000C50, "Wrong size on AYacht_Stage_DJ_Booth_C");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, UberGraphFrame) == 0x000BC0, "Member 'AYacht_Stage_DJ_Booth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, Box1) == 0x000BC8, "Member 'AYacht_Stage_DJ_Booth_C::Box1' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, StreamingSound) == 0x000BD0, "Member 'AYacht_Stage_DJ_Booth_C::StreamingSound' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, Box) == 0x000BD8, "Member 'AYacht_Stage_DJ_Booth_C::Box' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, Timeline) == 0x000BE0, "Member 'AYacht_Stage_DJ_Booth_C::Timeline' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, Audio) == 0x000BE8, "Member 'AYacht_Stage_DJ_Booth_C::Audio' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, MediaPlayer) == 0x000BF0, "Member 'AYacht_Stage_DJ_Booth_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, MediaSource) == 0x000BF8, "Member 'AYacht_Stage_DJ_Booth_C::MediaSource' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, SubtitlePlayer) == 0x000C00, "Member 'AYacht_Stage_DJ_Booth_C::SubtitlePlayer' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, SubttleOverlay) == 0x000C08, "Member 'AYacht_Stage_DJ_Booth_C::SubttleOverlay' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, MediaRetryCounter) == 0x000C10, "Member 'AYacht_Stage_DJ_Booth_C::MediaRetryCounter' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, MediaRetryMax) == 0x000C14, "Member 'AYacht_Stage_DJ_Booth_C::MediaRetryMax' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, OpenError) == 0x000C18, "Member 'AYacht_Stage_DJ_Booth_C::OpenError' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, UrlError) == 0x000C19, "Member 'AYacht_Stage_DJ_Booth_C::UrlError' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, RunningError) == 0x000C1A, "Member 'AYacht_Stage_DJ_Booth_C::RunningError' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, MeshTrigger) == 0x000C20, "Member 'AYacht_Stage_DJ_Booth_C::MeshTrigger' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, StartPlayTime) == 0x000C28, "Member 'AYacht_Stage_DJ_Booth_C::StartPlayTime' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, IsDestroyed) == 0x000C2C, "Member 'AYacht_Stage_DJ_Booth_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, AudioUID) == 0x000C30, "Member 'AYacht_Stage_DJ_Booth_C::AudioUID' has a wrong offset!");
static_assert(offsetof(AYacht_Stage_DJ_Booth_C, AudioUID_Default) == 0x000C40, "Member 'AYacht_Stage_DJ_Booth_C::AudioUID_Default' has a wrong offset!");

}

